[
	{
		"User": "Bluecarrot2020",
		"Location": "Singapore, Singapore",
		"DateofReview": "Reviewed 1 week ago ",
		"ReviewTitle": "Small, accessible location",
		"Review": "Abreeza Mall is a convenient place to shop and eat when staying at Seda Hotel in JP Laurel, Davao City. It is right across the hotel. There are a number of restaurants to choose from for lunch and dinner- fastfoods, regular dine-in e.g, Japanese (Sumosan), Shakey’s, Jollibee, Yellow Cab, For snacks and coffee, you can go to Starbuck’s , J.Company , Dunkin Donuts or one of the food stalls/carts like Fruits in Ice Cream, etc. Most of the shops are those found in Manila. Foreign brands are present - Mango, Esprit, Gap, Giordano, Charles & Keith, Hush Puppies, H&M, etc. A few interesting local brands are available like Chimes, Cocoon (nice formal wear at reasonable prices), Just G (for tweens and teens), Mendez. There are gadget shops on the upper floor. There is also a Robinson’s Dept Store (poor rating for me) and a Robinson’s Supermarket (good rating for me). If you just want to stroll around, mall is ok but if you want to shop, try other malls. "
	},
	{
		"User": "David T",
		"Location": "Christchurch, New Zealand",
		"DateofReview": "Reviewed 4 weeks ago ",
		"ReviewTitle": "Excellent ",
		"Review": "A great mall with all kinds of products westerners are used to seeing. Very good choice of restaurants and the prices are excellent too."
	},
	{
		"User": "doctorfoxtrot",
		"Location": "Manila Philippines",
		"DateofReview": "Reviewed February 17, 2018 ",
		"ReviewTitle": "Convenient for my weekend vacation ",
		"Review": "This mall has everything. From the medium luxury to basic , you can find it here. Movie theatres , salons , department stores , fast food and restaurants. Security was tight too . Being very near to Seda Hotel , it made my stay convenient and worth it. The Ayala seal of high quality is very evident in this mall . "
	},
	{
		"User": "xheroine1981",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed January 16, 2018 ",
		"ReviewTitle": "World class mall",
		"Review": "- Branded accessories to choose from men's, women's and kids - best cinemas - fantastic restaurants you can choose from seafood, meat, pasta - coffee shops are great - spacious mall"
	},
	{
		"User": "Michelle B",
		"Location": " ",
		"DateofReview": "Reviewed January 11, 2018 ",
		"ReviewTitle": "This mall is a breeze!",
		"Review": "Located in a straight line with 3 other malls. It's conveniently located in the centre of Davao and has shops for everything and everyone! It's a one stop mall with a hotel attached (Seda Hotel)."
	},
	{
		"User": "Mehylander",
		"Location": "Morgantown, West Virginia",
		"DateofReview": "Reviewed January 4, 2018 ",
		"ReviewTitle": "Clean and secure",
		"Review": "A little confusing to get into but it is very secure even for Grab. Security checks the trunk before you arrive at the drop off point. When you are done shopping the many shops, there is a central point where they will help you with your cab or grab ride."
	},
	{
		"User": "Amy A",
		"Location": "Ithaca, New York",
		"DateofReview": "Reviewed January 3, 2018 ",
		"ReviewTitle": "Expanded and improved Ayala Mall in the South",
		"Review": "We enjoyed dining, shopping and having some entertainment in this new expanded and improved Ayala Abreeza Mall in Davao. We saw some shows and some features aside from the usual one does in the mall. Shops and restaurants range from local brands to international chains."
	},
	{
		"User": "Greeg G",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed December 22, 2017 ",
		"ReviewTitle": "Wide Space",
		"Review": "Lots of stores and restaurant to choose from. They always have an activities at the center which make the mall more active. Such as zumba, local product selling and many more."
	},
	{
		"User": "efrenr916",
		"Location": "Taguig City, Philippines",
		"DateofReview": "Reviewed December 11, 2017 ",
		"ReviewTitle": "A travellers ideal go-to Mall",
		"Review": "Ideal location, complete assortment of popular shops and restaurants. Safe, centrally located in business center, accessible, safe, never crowded, nice shop goers, clean toilets. You can find everything. A typical Ayala Mall."
	},
	{
		"User": "Tony_King_Jr",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed November 9, 2017 ",
		"ReviewTitle": "For the brand conscious",
		"Review": "It is a nice mall with a lot of restaurants and stores to choose from, their grocery and department store are not that big but they have a lot of \"branded\" shops/stores. Every month they have mall activities, so you can always expect for something new."
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "Reviewed October 31, 2017 ",
		"ReviewTitle": "Nice big mall",
		"Review": "Lots of stores and restaurants to choose from like samsung,ace hardware and a store called bench which most of the locals seem to like. things at this mall were a little pricey but it's worth a walk around."
	},
	{
		"User": "eh-nd21",
		"Location": "Kuala Lumpur, Malaysia",
		"DateofReview": "Reviewed October 20, 2017 ",
		"ReviewTitle": "Best in davao",
		"Review": "standard wise on par with some mall in other major cities, definitely best in davao in term of size, shop mixture n restaurants"
	},
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "Reviewed October 15, 2017 ",
		"ReviewTitle": "Good Mall",
		"Review": "This mall has a lot of branded shops in it and isn't the cheapest in town. For the \"brand conscious\", this would be a good place to shop. I don't think it's as big as SM Lanang, however, it does cater more for the younger...More"
	},
	{
		"User": "Kimitaka S",
		"Location": " ",
		"DateofReview": "Reviewed September 24, 2017 ",
		"ReviewTitle": "Nice shopping mall",
		"Review": "Abreeza Mall is maybe one of the biggest malls in Davao. From movie theater to restaurants, you can find everything that you need. Since the outside is very hot during daytime, Abreeza Mall is a nice place to stroll."
	},
	{
		"User": "streeteasy55",
		"Location": "New York City, New York",
		"DateofReview": "Reviewed August 7, 2017 ",
		"ReviewTitle": "one stop shop",
		"Review": "one of my favorite shopping malls in Davao city. They have top great brands for fashion/trends as well as great yummy restaurants inside the mall. You can have the taste of the chain brand of food/fast food to mid-scale restaurant. There is a 24/7 fitness...More"
	},
	{
		"User": "Eves Jefferson S",
		"Location": " ",
		"DateofReview": "Reviewed August 4, 2017 ",
		"ReviewTitle": "Nice mall",
		"Review": "Stayed for 2 days in davao and this mall is near where I stayed. I liked it, feels like home. And they have lots of outlets that offers discounts."
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "Reviewed July 15, 2017 ",
		"ReviewTitle": "Complete services and entertainment ",
		"Review": "Abreeza is located between other malls (SM, Gmall, Victoria Mall and Robinson's Cybergate), very accessible. There are plenty of things to do, as with other neighbouring malls, however I enjoyed the ambiance more. The only issue is that it's pretty confusing for first timers as...More"
	},
	{
		"User": "boostedbreakfast",
		"Location": "Mactan Island, Philippines",
		"DateofReview": "Reviewed July 11, 2017 ",
		"ReviewTitle": "Awesome Mall Davao",
		"Review": "I got mall not often, for me Abreeza is wow amazing and big. Aircon keeps me gold and I look at big beautiful shops in mall. Thank you Abreeza Mall ❤️❤️❤️"
	},
	{
		"User": "Ryan I",
		"Location": "Cebu City, Philippines",
		"DateofReview": "Reviewed July 5, 2017 ",
		"ReviewTitle": "Run-of-the-mill",
		"Review": "Bought a good pair of running shoes at this mall and found the place almost empty at lunch time. The mall itself looks like it has been there for a while now and that there's really nothing going on in there except to eat and...More"
	},
	{
		"User": "tessamaete",
		"Location": " ",
		"DateofReview": "Reviewed July 5, 2017 ",
		"ReviewTitle": "Abreeza",
		"Review": "The mall was kinda old already in some wing. But i think they are complete coz u can find anything here from tiangges to branded stores. It was a different vibe from the ayala malls that im used to. I suggest that they renovate it...More"
	},
	{
		"User": "Manoi N",
		"Location": "Cebu City, Philippines",
		"DateofReview": "Reviewed July 5, 2017 ",
		"ReviewTitle": "A place to find anything",
		"Review": "It's a place wherein you can find anything, very similar with Ayala in Cebu. Clean and spacious, cool place to walk around and palipas oras when in davao"
	},
	{
		"User": "deeignacio",
		"Location": " ",
		"DateofReview": "Reviewed July 4, 2017 ",
		"ReviewTitle": "it kinda is the same last time i was here",
		"Review": "been away for couple of years and maybe im just used to at the mall wars happening in cebu right now where they have new spot new places to visit new attraction happening trying to beat other malls this and that. abreeza is the same...More"
	},
	{
		"User": "twistedfoodlover",
		"Location": "Makati, Philippines",
		"DateofReview": "Reviewed July 2, 2017 ",
		"ReviewTitle": "It's a Mall ",
		"Review": "Not too sure what good or bad to say about Abreeza it's just a great big Mall like any other great big mall in the country. If ur looking for someone in a mall this is a great options. Xx"
	},
	{
		"User": "JTMFraginal",
		"Location": "Cainta, Philippines",
		"DateofReview": "Reviewed June 2, 2017 ",
		"ReviewTitle": "Ayala Mall in Davao",
		"Review": "High-end brands are in Abreeza Mall making it a shopper's haven in the Davao Provinces. H & M, Mark and Spencer and other quality brands have branches in Abreeza. A supermarket and restaurants are also in the mall for food lovers. Nice place to hang-out...More"
	},
	{
		"User": "randychoy94",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed May 23, 2017 ",
		"ReviewTitle": "Clean and spacious",
		"Review": "One of the best thing I can say about Abreeza is its beautiful foodcourt overlooking the city. It it very relaxing and would provude comfort while you eating. There are alot of things to do in Abreeza. Shopping, beautification, eating, singing to name a few....More"
	},
	{
		"User": "Luke T",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "Reviewed May 21, 2017 ",
		"ReviewTitle": "Great Mall and good food",
		"Review": "The mall was right across the street from our hotel. It was fun to wander around and window shop, Plus there are some good restaurants up on the 2nd and 3 floor. We enjoyed ourselves and was able to buy a case of water for...More"
	},
	{
		"User": "mike321ph",
		"Location": "Manila",
		"DateofReview": "Reviewed May 9, 2017 ",
		"ReviewTitle": "Your Ayala Mall in Davao",
		"Review": "Your Ayala Mall in Davao, conveniently located along JP Laurel Avenue accessible via jeepney, taxi or grab taxi. It has many of the shops and restaurants you have in most malls around the country including a grocery, drugstore, bookstores and a 24/7 convenience store. This...More"
	},
	{
		"User": "falthaher",
		"Location": "Cebu City, Philippines",
		"DateofReview": "Reviewed May 7, 2017 ",
		"ReviewTitle": "Good place to shop & diner ",
		"Review": "Plant of modern shops, lots of food choices including coffee shops and Starbucks, bread talk, tax stand, cinema, games, overall, clean."
	},
	{
		"User": "Franklin C",
		"Location": "Honolulu, Hawaii",
		"DateofReview": "Reviewed May 3, 2017 ",
		"ReviewTitle": "Your typical mall",
		"Review": "Your standard mall, nothing that stood out from the rest of the malls. You have your usual crowds and the sales people were very helpful."
	},
	{
		"User": "Victorianlad",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Melbourne, Australia",
		"Location": "Melbourne, Australia",
		"DateofReview": "Reviewed February 4, 2017 ",
		"ReviewTitle": "Well run shopping centre with many restaurants",
		"Review": "Abreeza Mall is opposite Seda Hotel and as with almost everything the Ayala Group constructs and operates, it is good quality. While the Robinsons supermarket is smaller than its down the road competitor in SM Lanang Premier, the Robinsons has a reasonable range of dry...More"
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "Reviewed January 18, 2017 ",
		"ReviewTitle": "Nice Mall",
		"Review": "You find everything there you need A huge supermarket, the usual stores. Restaurants of course. Try the Hukad, I love Hukad. They have a Farmer market outside. Everything is clean at Abreeza. They often have events with too much noise."
	},
	{
		"User": "Ajie A",
		"Location": " ",
		"DateofReview": "Reviewed January 16, 2017 ",
		"ReviewTitle": "Best Mall in Davao",
		"Review": "I love this mall because it is not too large but it carries the brands and boutiques that i like. Parking is ample and security is adequate. Shopping here is very conducive because of the relaxed atmosphere. Many eating places to choose from. The last...More"
	},
	{
		"User": "arnolda546",
		"Location": "Cebu City, Philippines",
		"DateofReview": "Reviewed December 29, 2016 ",
		"ReviewTitle": "Nice, chic and cozy mall.",
		"Review": "Small place with chic shoppes and boutiques. Reasonable food establishments and strategically located within Davao."
	},
	{
		"User": "AER84",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed December 20, 2016 ",
		"ReviewTitle": "Small and Cozy",
		"Review": "if you are looking for a Megamall, MOA or Trinoma, this is not it. But Abreeza has its own charm and the place definitely has the most chic in Davao. No Prada here but it does have Debenhams, Lacoste and H&M (very new). Two things...More"
	},
	{
		"User": "Ludgardo Z",
		"Location": "Island of Malta, Malta",
		"DateofReview": "Reviewed November 26, 2016 ",
		"ReviewTitle": "Shopping and eating...",
		"Review": "Large, clean and bustling, the Abreeza Mall is a pleasant visit when in Davao. Present are also several reasonable food establishments."
	},
	{
		"User": "Samy N",
		"Location": " ",
		"DateofReview": "Reviewed November 23, 2016 ",
		"ReviewTitle": "Very nice ",
		"Review": "It's a very nice mall, new, high end, when I was there, they was celebrated some occasion for army award at June 2014"
	},
	{
		"User": "ChenaVi14",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed November 16, 2016 ",
		"ReviewTitle": "Lotsa stores",
		"Review": "I love the fact that Abreeza Mall has a lot of stores that cannot be found in other stores in Davao. Oh and the mall's restrooms are a plus.. Very clean"
	},
	{
		"User": "Cookie O",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed November 15, 2016 ",
		"ReviewTitle": "One of Davao's biggest malls",
		"Review": "The mall was delightfully clean and spacious. There were a lot of toilets and all of them were very modern and clean. The atmosphere overall is pretty good and it's very pleasant to walk around in with all of the stores and decorations, it really...More"
	},
	{
		"User": "Katrina08_23",
		"Location": "Davao City",
		"DateofReview": "Reviewed November 15, 2016 ",
		"ReviewTitle": "NICE!!!",
		"Review": "When your in Davao where there are only several malls, Abreeza mall is one of those that I can recommend if you just wanna hang out. Have some coffee or just do some shopping. It has a great landscape and good resto's to choose from."
	},
	{
		"User": "edikdak",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "SJDM City",
		"Location": "SJDM City",
		"DateofReview": "Reviewed November 2, 2016 ",
		"ReviewTitle": "An Ayalla Mall in Mindanao",
		"Review": "Very spacious, very clean, nice view of the condominium being constructed If you want view the panoramic Davao, choose Abreeza!!!"
	},
	{
		"User": "Cheekie A",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed October 5, 2016 ",
		"ReviewTitle": "Great mall to dine, shop, and relax when in Davao",
		"Review": "Tourists should know that shopping mall culture is big in the Philippines; it's where locals unwind and congregate in their free time. When in Davao, Abreeza Mall is the best place to do this because, not only is it big and with fantastic architecture, it melds greens and open spaces into the space to cloak shoppers in an even more relaxing vibe. Tourists can also shop for locally made food products and goods at the outdoor Asian Fruit Market and at Davao Dwellings at the 3F."
	},
	{
		"User": "Borgyliscious",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "Reviewed October 5, 2016 ",
		"ReviewTitle": "Very Accessable Mall",
		"Review": "Just infront of Redemptorist church.\r Very nice mall, not that spacious compared to manila malls or even with sm lanang premier... But it serves the people well.\r \r Places to eat? They got many... moon cake, grab a crab, etc... Depending on your food trip and budget.\r \r Parking? Average... Did not experience the hassle of finding parking spaces here.\r \r What I do not do here? Groceries... A bit pricey compared to Gmall and VP."
	},
	{
		"User": "Diego D",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "Reviewed September 21, 2016 ",
		"ReviewTitle": "Ayala business indeed.",
		"Review": "This place surely shows how Ayala takes care of it's properties. From the design, quality of business and the location is really superb."
	},
	{
		"User": "C W",
		"Location": "Melbourne, Australia",
		"DateofReview": "Reviewed September 19, 2016 ",
		"ReviewTitle": "Great place to shop",
		"Review": "Loved this shopping mall, it had everything! It is much nicer than the other shopping malls in the city and had all of the major store and food outlets."
	},
	{
		"User": "77Raine27",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "Reviewed September 8, 2016 ",
		"ReviewTitle": "Expected A Lot",
		"Review": "Went to ABREEZA MALL. A bit disappointed. Not the usual Ayala mall that we see in Makati and Alabang. For me, it looks like an ordinary mall. On the 3rd leve; outer part of the mall there are a handful of restos and fastfood area over-looking Davao City. You can feel the cool air breeze. Situated in the ground floor level are the famous fast food chains that we see in Manila"
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed August 31, 2016 ",
		"ReviewTitle": "Cool ambiance and lots of restaurant to dine with",
		"Review": "Abreeza is the place where we shop, eat, watch movies and just doing wibdo shopping. It has a cool and quieter ambiance than the other malls."
	},
	{
		"User": "Leah N",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed August 24, 2016 ",
		"ReviewTitle": "Worth Going To",
		"Review": "Together with my husband and our children on a Sunday, we went to Abreeza to dine and shop. The place is huge filled with differing shops and kiosks selling a variety of items from food to condo units. One can never ran out of stalls to visit, for both the brand conscious and those who are not. There's also a place in the ground floor area where young kids can enjoy playing without having to shell out money. The mall is clean, the area for strolling and its toilets; airconditioning system works; and the mall can easily be accessed in terms of transport."
	},
	{
		"User": "TonyUy",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed August 23, 2016 ",
		"ReviewTitle": "clean and beautiful.",
		"Review": "It's the best mall in Davao City in terms of cleanliness and functionality, and the cinemas are the best specially the reservation of the seat method. High end stores and quality products are here.\r \r The only problem is that whenever there is a function or event the noise is so loud that you can't seem to get away from it, even when you are in the stores around the area and even when its distant from the event vicinity."
	},
	{
		"User": "MANUEL D",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed August 23, 2016 ",
		"ReviewTitle": "A Mall to Behold",
		"Review": "Nothings beats an all in one place. A view of the magnificent landscape. Food places that Davao is known for. And play places for kids. Seat and relax and shop galore."
	},
	{
		"User": "Argdds",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed August 18, 2016 ",
		"ReviewTitle": "Strolling",
		"Review": "Another way to celebrate friendship, We decided to go abreeza to look for stuff and Resto to eat. A lot of option to choose. Ambiance is good. One thing we're excited at is the H&M stall, though its not yet open but we are looking forward to drop by soon. This is not our frst time to visit Abreeza, But this is my 1st time to give feed back. This is Like an Elite type of shopping centre. "
	},
	{
		"User": "Eemgee",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed August 14, 2016 ",
		"ReviewTitle": "The best mall",
		"Review": "Great mall in Davao. Plenty of store to shop from. Easy to navigate. Host many good restaurant. One of my favorite here in Davao."
	},
	{
		"User": "Darryl G",
		"Location": " ",
		"DateofReview": "Reviewed August 10, 2016 ",
		"ReviewTitle": "Lifestyle ",
		"Review": "Lifestyle mall. Good for shopping. H&m is coming soon so more options. Kids playground is a lifesaver for those with kids"
	},
	{
		"User": "joww101",
		"Location": " ",
		"DateofReview": "Reviewed August 5, 2016 ",
		"ReviewTitle": "Good place ",
		"Review": "Well, i love this type of mall. There is so many brands and beauty shops here that other malls don't have. I love cafes here also. Good for walking and a good place to bring someone or your friends to hang out. And the cinema...More"
	},
	{
		"User": "delight_2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed July 28, 2016 ",
		"ReviewTitle": "An Afternoon Abreeza Mall visit and shopping with my g-kids and their Dad",
		"Review": "The place is so cool, spacious and cozy, I like the ambiance.You can see many tourists dining and relaxing , because they know they were safe they were in Durian and Eagle capital of PH being Duterte's place of abode. One can feel so safe...More"
	},
	{
		"User": "Jay S",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed July 26, 2016 ",
		"ReviewTitle": "Best High-End Mall In Davao",
		"Review": "Abreeza mall is the first mall in Davao that focuses on high-end brands. Thus, the people this mall attracts are usually class A and class B. Initially, the mall didn't attract much people due to many vacant spaces. A couple of years after its soft...More"
	},
	{
		"User": "Jill S",
		"Location": "Iloilo City",
		"DateofReview": "Reviewed July 6, 2016 ",
		"ReviewTitle": "High end! Love the shops!",
		"Review": "Abreeza is an interesting place. The shops, the restaurants and more are high end! For brand loving peeps its a good place to shop, some examples are Armani exchange, Tommy Hilfiger, GAP, M&S etc) while the restaurants they have TGIF, hukad and many more if...More"
	},
	{
		"User": "Nancy B",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed June 28, 2016 ",
		"ReviewTitle": "A place to be in downtown davao",
		"Review": "A place to find nice brands (M&S, GAP, Levi's, Mango, Debenhams, Dorothy Perkins, designer Blvd to name a few) & various restaurants like Italianni's, TGI Friday's, shakey's..a hotel just within the compound makes it more practical to go"
	},
	{
		"User": "Bani U",
		"Location": "Puerto Princesa City, Puerto Princesa, Philippines",
		"DateofReview": "Reviewed June 28, 2016 ",
		"ReviewTitle": "A Mall to Mull About!",
		"Review": "The Mall is just across our hotel so we found it very convenient. However, it has more to offer as all the stores we were looking at were there, hence, we found no more need to go to the other malls in Davao. It has...More"
	},
	{
		"User": "Aveeno1991",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed June 21, 2016 ",
		"ReviewTitle": "It's a tasty cookie-cutter Ayala Mall - down South",
		"Review": "It sits along a main street where several other malls are located and it is considered the queen among many. If not for the Davao-borne establishments (Tsuru, for one), any mall rat would swear they are either in Glorietta, Trinoma, Ayala Center in Cebu or...More"
	},
	{
		"User": "nprila",
		"Location": " ",
		"DateofReview": "Reviewed June 19, 2016 ",
		"ReviewTitle": "It's like Gloreitta in Davao",
		"Review": "I feel like I am not away from Manila. :). I is like I just in Manila. Except for some stall are stores here In Davao. :)"
	},
	{
		"User": "Nikolai S",
		"Location": "Oslo, Norway",
		"DateofReview": "Reviewed June 14, 2016 ",
		"ReviewTitle": "Great Mall",
		"Review": "The Abreeza Mall covers a lot of your needs in a calm, air conditioned area. We were enjoying our Frappocinos at Startbucks. Great to either sit out or inside. \r \r The dermatology clinic Belo is a great experience, and accomodated us even if we where late. \r \r They offer many cash withdrawal machines (ATM's), luckily because many of them was out of order or did not serve interantional cards(?) \r \r Even going to the toilet area is a pleasant experience. Clean, well maintained by a great staff!"
	},
	{
		"User": "CaliTo69",
		"Location": "Philippines",
		"DateofReview": "Reviewed June 5, 2016 ",
		"ReviewTitle": "Huge & Tiring",
		"Review": "Being an Ayala mall, the design resembles like Trinoma in Quezon City, the design is huge and somehow circular and rectangular which can make you lost or tired due to distance. Many of the stores in Abreeza are not available in Manila."
	},
	{
		"User": "seeingtheworldtoday",
		"Location": "Perth, Australia",
		"DateofReview": "Reviewed June 2, 2016 ",
		"ReviewTitle": "Very clean and modern",
		"Review": "So many exclusive shops and restaurants. The main road is one of the busiest in all of Davao so do expect delays whilst traveling to and from the mall."
	},
	{
		"User": "T767TUrobertb",
		"Location": "New York City, New York",
		"DateofReview": "Reviewed May 30, 2016 ",
		"ReviewTitle": "Upscale mall in Davao",
		"Review": "This is one of the more upscale malls in Davao City. The overall Abreeza compound is still under construction; they are building condos and residential towers within the vicinity of the mall. Your typical stores that you can find in Manila are here."
	},
	{
		"User": "Maia_0515",
		"Location": "Davao City",
		"DateofReview": "Reviewed May 25, 2016 ",
		"ReviewTitle": "My Favorite address",
		"Review": "Abreeza Mall is my favorite place to be when I am hungry, when I need to check on some stuff, find some books, pass the time, take my favorite cup of chai tea latte from coffeee bean, catch up with friends and so on...."
	},
	{
		"User": "Dennies S",
		"Location": " ",
		"DateofReview": "Reviewed May 21, 2016 ",
		"ReviewTitle": "Abreeza Mall The Upscale Mall in Davao",
		"Review": "Abreeza Mall is part of the Ayala Malls chain nationwide and if you say Ayala Malls you expect upscale high end brands for the local market.\r \r Abreeza Mall did not disappoint the delicate taste of Davaoeños. It provided them a haven for shopping and dining pleasure. Some brands are even ahead in Abreeza than Ayala Center Cebu which is considered the shopping mecca of the south. \r \r When in Davao, its a must to visit Abreeza Mall."
	},
	{
		"User": "Marilou Y",
		"Location": " ",
		"DateofReview": "Reviewed May 20, 2016 ",
		"ReviewTitle": "VALET AT ABREEZA",
		"Review": "Of the many malls in Davao City, I frequent the Abreeza mall. Aside from being accessible from home, I go there to relax, see many free activities, exhibits and shows at the atrium. Going to the movies is very convenient and hustle free because of pre assigned seats which could be bought on line or way ahead of time. Usually , when I have nothing to do after my early grocery shopping at Robinsons Supermarket at the the first floor, I while away my time choosing movies to see, order my popcorn and lemonade at TATERS to be delivered to me inside the cinema. There are also fruits in season sold at the foodcourt right besides Taters. There are many shops selling branded clothing and shoes which where once found only in Manila like Mango, M n S, Debenhaus, Dorothy Perkins, Payless, Aldo, Naturalizer, and rows of restaurants at the first, second, and third floor. My grandchildren enjoys playing at the mall covered playground, driving electric cars and riding the electric train. I have eaten in almost all the restaurants in this mall such as Antonio's, Dong Juan, Chikaan, Hukad,Somosan, Shakey's, Sunburst, Chowking, Mang Inasal, J.Co, Army Navy, The Coffee Bean, Italliannis. TGIF, to name a few. Every thursday night the mall offers free zumba class. Fully Booked and National Book Store, as well as Book on Sales are my sources of magazines and books. Abreeza has almost everything to cater our family needs. Many uniformed guards roam around to help secure the mall. These guards are approachable, polite and helpful. Their visibility around the mall makes me feel secure. In front of Robinson Dept Store is a terminal for registered buses and vans coming and going to nearby cities and towns. \r  There are 4 things in Abreeza that make it stand above the rest of the malls :\r  1. The 2 rocking chairs for the senior citizens called SILYA.\r  2. The use of Family Lounge free to senior citizens. \r  3. The many clean toilets and the free toilet papers that that seem not to run out of supply. This sprawling 3 story mall has at least 3 toilets stations ( male , female, Pwd) with many cubicles in every floor. \r  4. This is the only mall that has a valet service."
	},
	{
		"User": "rasecollidab",
		"Location": "las vegas",
		"DateofReview": "Reviewed May 18, 2016 ",
		"ReviewTitle": "Average Mall",
		"Review": "I felt like I'm transported back in the states with all the familiar shops,it's a nice place to cool down and get away from the heat."
	},
	{
		"User": "Brian Chester L",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed April 22, 2016 ",
		"ReviewTitle": "My Frequented Mall",
		"Review": "I always go here to buy groceries, shop, eat out with friends/family or just relax. IMO, this is the only mall in Davao so far that has almost everything a mall rat, fashionista, tourist or businessman would like. You've got a variety of dining options here for the budget conscious, middle class or a high roller. The shops are also varied enough for every budget. One good thing about this mall is also it's open area at the top level where various restaurants with rightly priced food are located. They also have an area for kids in the atrium."
	},
	{
		"User": "SherwinJoseph",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Luzon, Philippines",
		"Location": "Luzon, Philippines",
		"DateofReview": "Reviewed April 12, 2016 ",
		"ReviewTitle": "Upscale mall; has the Ayala brand",
		"Review": "An Ayala Mall. \r \r The Ayala brand is there. Warm welcome, professional security staff, pleasing and accommodating concierge personnel, and of course the wide and spacious mall. \r \r You can find the best brands here. Ideal place for shopping. Everything you need is here. The mall is accessible via public transportation."
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"DateofReview": "Reviewed February 19, 2016 ",
		"ReviewTitle": "best prices",
		"Review": "you can not get a better price for your tourist buck than here. you an even haggle it down from the all ready lowest price.lots of little shops packed together carrying the same stuff like t-shirt shops but there are even furniture shops here. everybody wants your business here so look around then go back to the shop you like the most if they do not have it they might send somebody to go get it from another family member work on other side."
	},
	{
		"User": "MarzDavao",
		"Location": "Almere, The Netherlands",
		"DateofReview": "Reviewed February 18, 2016 ",
		"ReviewTitle": "Still the best mall in Davao",
		"Review": "With the coming of other malls like SM Lanang the competition is very high...Though smaller in sq meters for me Abreeza is still the nicest mall in Davao...Why? because the shop variety is a good mix of restaurants, clothing,shoes, and gadgets etc etc. Everything you need is in Abreeza. Also the people are more upscale then for example. It is also not that crowded."
	},
	{
		"User": "Ralph S",
		"Location": "San Antonio, Texas",
		"DateofReview": "Reviewed January 14, 2016 ",
		"ReviewTitle": "Another nice mall in Davao!",
		"Review": "This mall is a little bit upscale compared to the others in town. We enjoy the good Korean Restaurant in their outdoor garden rooftop section. They also have an interesting looking tuna restaurant there which we will try next."
	},
	{
		"User": "iamatopmodel",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed January 3, 2016 ",
		"ReviewTitle": "Most malls don't have it all. Abreeza does.",
		"Review": "Abreeza remains to be my go to mall in the city. Highend shops offer great discounts at anytime. You don't always notice them because markdowns aren't conspicuous. You gotta get in and check the price tags yourself."
	},
	{
		"User": "majanu",
		"Location": "New York City, New York",
		"DateofReview": "Reviewed December 27, 2015 ",
		"ReviewTitle": "good small mall",
		"Review": "We went to see the Star wars movie, while we were on visit to davao, only 165 peso for movie ticket and you choose your seats, wow, really liked it. Mall has some good and some local stores, i love the fruit vendors they have on 3rd floor. Due to Christmas as usually shopping crowd. Good thing is you can grab taxi by grabtaxi here."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed December 18, 2015 ",
		"ReviewTitle": "No need to go to Manila!",
		"Review": "We have everything here! A modern shopping mall. On my Mom's visit to Davao she remarked \"it is like being in Greenbelt!\" My mom was worried when I retired to Davao with my husband that I would be a probinsyana! Not when I brought her to Abreeza. So there you have it!"
	},
	{
		"User": "Nicolas R",
		"Location": " ",
		"DateofReview": "Reviewed December 16, 2015 ",
		"ReviewTitle": "Perfect place for shopping and dining",
		"Review": "We just hit the sales. Very nice place. Many food options. Every one seems friendly and relax there. Not overcrowded in the afternoon. Easy to get there using public transportation."
	},
	{
		"User": "DulceSweet D",
		"Location": " ",
		"DateofReview": "Reviewed December 15, 2015 ",
		"ReviewTitle": "Happy place!",
		"Review": "I love it! Here u can shop eat and enjoy.. Lots of things to do.. I find this place my happy place whenever im in Davao.. Never a day we don't go here! Its fun fun fun! Esp. Those foods by the roofdeck! Mango singkamas etc! Yummy!!!"
	},
	{
		"User": "Michael L",
		"Location": "Davao, Davao City, Philippines",
		"DateofReview": "Reviewed December 11, 2015 ",
		"ReviewTitle": "The best in Davao",
		"Review": "Abreeza Mall is one of the two more \"upscale\" malls in Davao and offers, at least from my point of view, the best shopping experience in the city for those interested in brand name merchandise. It's got lots of \"designer\" stores familiar in the west, including Tommy Hilfiger, Armani Exchange, the Gap, Guess, Nine West, and some others that can't be found elsewhere in the city. \r \r The mall was built by Ayala, one of the largest developers in the Makati area of Manila and the design expertise of that group is evident in the overall attractiveness of the mall, which is a bit more interesting than the concrete boxes more typical of the mall genre in Davao. Though it's not nearly as interesting nor as sophisticated as Greenbelt in Makati--perhaps Ayala's best known shopping project--it is the most elegant experience that Davao has to offer, and it does provide a clean, attractive ambience in which to shop. Underground parking is abundant and easily accessible and all floors can be accessed via a glass elevator or escalators. \r \r Though the mall offers a number of restaurants catering to a broad range of tastes, it does not feature any of the higher end, intimate restaurants characteristic of Greenbelt, nor does it have the green, landscaped open areas of the latter. Nonetheless, the mall is a viable, welcome addition to the city."
	},
	{
		"User": "Wayne E",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Canova, South Dakota",
		"Location": "Canova, South Dakota",
		"DateofReview": "Reviewed November 29, 2015 ",
		"ReviewTitle": "A Nice Mall",
		"Review": "If you want to get all your shopping done in one place then this is a nice AC place to do so. Mall prices tend to be slightly higher than elsewhere in the city, but not prohibitively so."
	},
	{
		"User": "Elmo B",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed November 22, 2015 ",
		"ReviewTitle": "Cozy, Accessible Mall In Davao City",
		"Review": "Abreeza mall's ambiance is synonymous to that of Glorietta in Makati, Metro Manila and Marquee Mall in Angeles City, Pampanga. Robinson's Department Store and Robinson's Supermarket mainly serves the shoppers here. The wide main hall also is ideal for events."
	},
	{
		"User": "WorldTravelerBill",
		"Location": "Chicago, Illinois",
		"DateofReview": "Reviewed November 14, 2015 ",
		"ReviewTitle": "Great place to shop",
		"Review": "My fiancé took me to Abreeza. Great mall in Davao city. Everything you could want to buy is eat. TGI Fridays and Bigby's are good places to eat. The prices ardent bad either. So if you feel like shopping then this is the place to...More"
	},
	{
		"User": "Rickf1",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed November 11, 2015 ",
		"ReviewTitle": "Convenient stop for coffee, supermarket and currency exchange",
		"Review": "I liked hanging out at Starbucks to remind me of home, robinsons supermarket for fresh fruits and the currency exchange booth near Dunkin donuts. I ate at island seafood, mandarin garden, chikaan, jollibee, etc. Honestly my favorites were the shawarma stand and Filipino dessert counter...More"
	},
	{
		"User": "PeanutButter930",
		"Location": "Cotabato City, Philippines",
		"DateofReview": "Reviewed October 27, 2015 ",
		"ReviewTitle": "ehhhhh...",
		"Review": "well i'm not a luxurious traveller and i'd still go for SM and Gaisano for Malls. Abreeza holds quite expensive stuffs. But it's one of the most beautiful and cozy malls you can try out while in Davao City. maybe around 75 out of 100...More"
	},
	{
		"User": "Iceman272",
		"Location": "Grafton, NY",
		"DateofReview": "Reviewed October 16, 2015 ",
		"ReviewTitle": "Very nice mall",
		"Review": "This mall has some of the pricey shops you might want to check out. There's good eateries upstairs, too."
	},
	{
		"User": "LoviAlterado",
		"Location": "Pasig, Philippines",
		"DateofReview": "Reviewed October 13, 2015 ",
		"ReviewTitle": "Classy and clean mall.",
		"Review": "Me and my son went for a walk and was looking for an arcade near our hotel in Quirino and was told that this mall have one- Timezone. This mall is visually appealing and have classy environment. It has a lot of fast food and...More"
	},
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed September 22, 2015 ",
		"ReviewTitle": "Classy and yet accessible",
		"Review": "Abreeza, being an Ayala Mall is expected to be classy. Thankfully a standard to follow for the other local malls. Restrooms are cleaner than the other malls. Layout more thought out, but lately so many shops are under renovation or have closed shop? Debenhams, Mango,...More"
	},
	{
		"User": "Vince M",
		"Location": " ",
		"DateofReview": "Reviewed September 20, 2015 ",
		"ReviewTitle": "Arguably classy",
		"Review": "When in Davao City, this place is a must stop if you want to relax and get comfortable of the busy schedules of trips and tours. With arrays of shops for you to enjoy."
	},
	{
		"User": "bulakbol76",
		"Location": "Cebu City, Philippines",
		"DateofReview": "Reviewed September 14, 2015 ",
		"ReviewTitle": "useful stop",
		"Review": "good range of shopping choices, restaurants, cafes, and services. both local and international brands/chains."
	},
	{
		"User": "Lita H",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manchester, United Kingdom",
		"Location": "Manchester, United Kingdom",
		"DateofReview": "Reviewed August 22, 2015 ",
		"ReviewTitle": "This is what I call... a proper shopping mall.",
		"Review": "This shopping mall has got everything that you'll probably need when on holiday...For UK citizens, Debenhams and Marks and Spencer have got outlets (and prices are cheaper than the UK, I hasten to add!). The cinemas are of good standard and the food outlets are...More"
	},
	{
		"User": "Dennis Jr C",
		"Location": "Cebu City, Philippines",
		"DateofReview": "Reviewed August 20, 2015 ",
		"ReviewTitle": "Nice",
		"Review": "Nice and clean mall and people are friendly. Public transport is efficient and safe. A one stop shop haven in Davao. Personnel in the mall are very accomodating and friendly. Good experience for me, keep up the good work. Kudos"
	},
	{
		"User": "colhay11",
		"Location": "Bangkok, Thailand",
		"DateofReview": "Reviewed August 11, 2015 ",
		"ReviewTitle": "Just another mall ",
		"Review": "As others have mentioned it's a generic mall like hundreds of others here. All the usual suspects are here under one roof"
	},
	{
		"User": "Franz M",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed June 27, 2015 ",
		"ReviewTitle": "First Ayala Mall in Mindanao",
		"Review": "The land used to be a bland lot across Redemptorist Church and I remember, it used to be a venue for selling flower and plant pots. Then it transformed to a mixed-use mall with varieties of shops and restaurants that Davao has never offered before...More"
	},
	{
		"User": "daki237",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "Reviewed June 20, 2015 ",
		"ReviewTitle": "\"My Abreezy\"",
		"Review": "Right in the heart of Davao City and our second home (literally, because it's very near to our house). Right next to this mall is Seda Hotel."
	},
	{
		"User": "saf7670",
		"Location": "Peterborough, United Kingdom",
		"DateofReview": "Reviewed June 10, 2015 ",
		"ReviewTitle": "Just another standard mall",
		"Review": "This is just another standard mall, with nothing special in terms of stores and with its somewhat confusing layout, is not the easiest mall to navigate. Overall a reasonable selection of stores and restaurants."
	},
	{
		"User": "Eddie E",
		"Location": " ",
		"DateofReview": "Reviewed June 7, 2015 ",
		"ReviewTitle": "Grab a crab restaurant ",
		"Review": "If you are in Davao Abreeza Mall go to Grab a Crab restaurant on the third floor just outside the movie Theatre. The food and the service is excellent. My favorite part of the mall. And the prices are very reasonable."
	},
	{
		"User": "AmorSabella",
		"Location": "Davao City Philippines",
		"DateofReview": "Reviewed June 5, 2015 ",
		"ReviewTitle": "Premier Mall in Davao",
		"Review": "Want a relaxing day at the Mall... Abreeza is the place to be.. there are a lot of restaurants that you can choose from. From Local (Blu Gre Coffee, go nut Donuts) to International (starbucks, Krispy Creme)... I love how Ayala Malls include nature in...More"
	},
	{
		"User": "billichka",
		"Location": "Brisbane",
		"DateofReview": "Reviewed May 24, 2015 ",
		"ReviewTitle": "So many food options!",
		"Review": "This mall has many many restaurants and food outlets as well as cinemas and international clothing brand boutiques. If in doubt about where to eat in Davao head here and you cannot go wrong. Several taxi ranks are available and many Jeepneys stop here as...More"
	},
	{
		"User": "kalboHastings",
		"Location": "Hastings",
		"DateofReview": "Reviewed May 4, 2015 ",
		"ReviewTitle": "Modern Large Mall",
		"Review": "Spacious & well laid out Modern larger Mall, 4 floors with plenty of variety of shopping & eatery's. Quite easy to get yourself lost but a nice mall in which to relax & shop out of the searing heat of a summers day"
	},
	{
		"User": "Peter S",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Tasmania, Australia",
		"Location": "Tasmania, Australia",
		"DateofReview": "Reviewed May 3, 2015 ",
		"ReviewTitle": "4 levels of shopping",
		"Review": "Great place to visit, if shopping is your thing then this is your place. catering mostly to the upper mid to high range market but spacious and well laid out shopping"
	},
	{
		"User": "Jeff Y",
		"Location": "Makati, Philippines",
		"DateofReview": "Reviewed April 22, 2015 ",
		"ReviewTitle": "Excellent place to unwind",
		"Review": "Conveniently located in the center of Davao City, this medium-sized mall has a slew of outlets and restaurants which makes it easy for visitors to kill time in. We were lucky when we visited Davao that they were having a sale thus my wife ended buying stuff which she needed at good prices. Clean,accessible with a varied range of shops to choose from . Perfect for any visitor to Davao City."
	},
	{
		"User": "islandtravelph",
		"Location": "Taguig City, Philippines",
		"DateofReview": "Reviewed April 18, 2015 ",
		"ReviewTitle": "breezing davao!!!",
		"Review": "ayala center in davao, enticing place to chill and relax in the city of davao :) great people around and clean city."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed April 14, 2015 ",
		"ReviewTitle": "Good place to meet up with friends",
		"Review": "This place is good for friends to meet up, dine and stroll. There are lots of variety of restos, boutiques, etc. The supermarket is also well-organized."
	},
	{
		"User": "Cot U",
		"Location": " ",
		"DateofReview": "Reviewed April 4, 2015 ",
		"ReviewTitle": "Chill & Unwind",
		"Review": "I'm here almost every weekend. It's a great place to chill & unwind. The place is premium & cozy, and their customer lounge.. Yeah, awesome!"
	},
	{
		"User": "tbose",
		"Location": "Kolkata (Calcutta), India",
		"DateofReview": "Reviewed March 31, 2015 ",
		"ReviewTitle": "Premium Mall in Davao City",
		"Review": "The premium mall in the city of Davao.Has a good choice of standalone shops and brands.Food court could have been a little bigger though."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "Reviewed March 25, 2015 ",
		"ReviewTitle": "No ordinary mall",
		"Review": "More than a mall, Abreeza is a lifestyle destination. With stores that displays a mix of local and global brands, the mall is interestingly designed that makes strolling along its sprawling spaces a leisurely pursuit. It also has green spaces that gives visitors literally a breath of fresh air. It is also adjacent to a church, condominiums, schools and residential areas."
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "Reviewed February 28, 2015 ",
		"ReviewTitle": "Manila and the whole in Davao City",
		"Review": "The moment, you enter the Abreeza Mall, you think you visit Manila. For Davao City, this mall is a great additional accomplishment."
	},
	{
		"User": "Samy N",
		"Location": " ",
		"DateofReview": "Reviewed November 8, 2014 ",
		"ReviewTitle": "High class mall",
		"Review": "Once you enter this mall, you'll feel like you're somewhere at makati malls, it really a good to spend time shopping or eating, watching cinema movie or have a cup of coffe."
	},
	{
		"User": "MarJho16",
		"Location": "General Santos City, General Santos, Philippines",
		"DateofReview": "Reviewed October 6, 2014 ",
		"ReviewTitle": "Ordinary Mall",
		"Review": "We came here just to eat and also stroll but the mall was so ordinary that there is no something in there to look for."
	},
	{
		"User": "raymmiconmapper",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Bacolod, Philippines",
		"Location": "Bacolod, Philippines",
		"DateofReview": "Reviewed September 20, 2014 ",
		"ReviewTitle": "Davao's new destination",
		"Review": "new place to dine,shop & unwind in Davao city .Abreeza mall like all Ayala malls are trendy & chic.The atrium offers wide area for family & friends & the playground as well.What I like most here is the cleanliness & security of the mall..they have lots of shops of branded products but also affordable & pocket-friendly stores..there's the adjacent Seda Abreeza hotel..come & discover Ayala Malls, \" love the mall\"."
	},
	{
		"User": "chickmom",
		"Location": "Cebu",
		"DateofReview": "Reviewed September 10, 2014 ",
		"ReviewTitle": "Ayala in Davao",
		"Review": "Ayala mall is known for its friendly design and interiors. This was my first visit to Abreeza though I have frequented SM Davao before.\r \r Famous branded stores are here and the usual Ayala design is obvious. Their department store and grocery is Robinsons. The kids like the activity area where they are free to roam and play around while the adults take their pick in the stores nearby. As a member of VIPinoy, I was able to use their lounge for free.\r \r I am looking forward for the a more eco-friendly mall with gardens and trees to cool off which Ayala is known for. So expect an expansion in the coming years."
	},
	{
		"User": "ชินวุฒ อ",
		"Location": "Bangkok, Thailand",
		"DateofReview": "Reviewed September 2, 2014 ",
		"ReviewTitle": "Cool",
		"Review": "Everything that you need is in this place. What I like about the place is they have some Customer Lounge and Free Charging Station (although some of them are defective). Go up and look for that stalls that are selling very affordable fruits. Hmmmm. Yumm!"
	},
	{
		"User": "Liezel G",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "Reviewed August 8, 2014 ",
		"ReviewTitle": "new place for shopping, attractions and family",
		"Review": "This is one of the newest mall. It is one of spots we visit every Sunday right after the sunday mass at Redemptorist church. The atrium has a playground that my son loves so much. This mall offers quite expensive fashion clothes, the mall is big and not crowd-y. What I like most is they have the first branches of restaurants in the city."
	},
	{
		"User": "McJhoe",
		"Location": "Al Ahsa, Saudi Arabia",
		"DateofReview": "Reviewed August 5, 2014 ",
		"ReviewTitle": "Nice place in davao",
		"Review": "Everything is there if you need especially when you are staying at seda hotel a few steps ahead.It houses high end restaurants and cafes,and expensive signature fashions.They have very nice and beautiful landscapes."
	},
	{
		"User": "Melanie R",
		"Location": " ",
		"DateofReview": "Reviewed July 22, 2014 ",
		"ReviewTitle": "Nice place to hang out",
		"Review": "Nice restaurants (with unique interior as well as exterior) to eat with family and friends. There are several brand name clothing stores to shop from."
	},
	{
		"User": "JEmmanuelLasPinas",
		"Location": "Las Pinas",
		"DateofReview": "Reviewed June 21, 2014 ",
		"ReviewTitle": "Newer Mall in a good location",
		"Review": "This is a newer mall in a very accessible location. Lots of name brand stores, good restaurants, supermarket, banks, cafes to choose from. There is also a really nice hotel right next to it."
	},
	{
		"User": "Ecyor",
		"Location": "Manila",
		"DateofReview": "Reviewed May 2, 2014 ",
		"ReviewTitle": "Confusing mall",
		"Review": "I've been to other Ayala Malls, and this one had a quite confusing layout. Nonetheless, it gave a nice contrast in the hangout places in Davao city. It's very accessible and about midway between the airport and town proper.\r \r Shops are quite typical also. Much of the landscape surrounding it are high-end condominiums."
	},
	{
		"User": "profzulueta",
		"Location": "Bacolod, Philippines",
		"DateofReview": "Reviewed April 12, 2014 ",
		"ReviewTitle": "Taking the mini buses from Abreeza Mall to Tagum City.",
		"Review": "We were travelling from Cagayan de Oro to Tagum City, Davao to participate in the 2014 Prisaa National Games. Upon arrival in Davao City, we were told to go to Abreeza Mall where the Davao Metro Shuttle buses going to Tagum have a terminal. \r \r The first taxicab overheated right in front of the main entrance of the mall and the guard helped us load our belongings to another cab to bring us to the Davao Metro Shuttle bus which was located at the back. From Ecoland bus terminal to Abreeza Mall the meter read 130 pesos and we paid an additional 50 pesos in the new cab that brought us around to the back.\r \r We arrived in Abreeza Mall past five pm, after an eight hour trip from Cagayan de Oro so we decided to rest first inside the mall and eat some snacks before proceeding to Tagum.\r \r We were informed by some travellers that the mall was built by Ayala and the anchor store is Robinsons. We bought some food at the Robinsons Supermart which was huge and went malling. Being an Ayala property, the mall was well constructed and modern looking.\r Amenities included escalators and elevators. Airconditioning was more than ample. ATM machines were all ideally located in the different levels. \r \r There were several high end stores and the usual fast food franchises.\r \r After one hour we decided to proceed to the Davao Metro terminal near the Abreeza/\r Robinsons Supermarket entrance but there was no bus around when we arrived and the lines were already long because office workers going home after work were starting to arrive. \r \r After another hour the mini buses started arriving every 15 minutes. To cut the story short we finally arrived at our destination from Abreeza mall at around 9:00 PM.\r \r Travel notes: Take the buses from Ecoland Terminal when going to Tagum from Davao City. Cost and travel time is almost the same. Less transfer hustles especially if you have luggages to carry. Davao Metro and Bachelor Express have clean and safe buses at Ecoland. You will also save on taxi fare."
	},
	{
		"User": "Fl0ng",
		"Location": "Cebu City, Philippines",
		"DateofReview": "Reviewed March 7, 2014 ",
		"ReviewTitle": "Strolling, Eating and Meeting Close Friends at Abreeza",
		"Review": "Before I left Davao Last year, Abreeza was about to open, everyone was so excited. Now, I promised to myself that when I got home, I have to visit Abreeza and you know what, my experience in Abreeza was unforgettable. First, I met my three closed best friends and dancers, coincidentally. Second,oh my, this mall is to the next level, they got a cool escalator, a very expensive elevator, a free charging station everywhere and washrooms are very clean. And lastly, as a consumer, first time in my life that I went to a mall, a guard opened the cab’s door for me, I was speechless, I thought I was in a five star hotel and when I was cleaning my shoes in the washroom, a janitor approached me, As he handed me his cleaning towel, he smiled and said, “kani gamita sir oh.” I was amazed. I can’t hide my reaction, I was really surprised and proud. This is my hometown and they treated me well. They had truly a very satisfying customer service. Well-Trained."
	},
	{
		"User": "Shamrockbuddy",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Bordentown, New Jersey",
		"Location": "Bordentown, New Jersey",
		"DateofReview": "Reviewed December 29, 2013 ",
		"ReviewTitle": "Like the hustle and bustle ? Shop here.",
		"Review": "Just like any Mall in the US but maybe a little better. One big store and many, many specialty shop all over the place. I liked shopping and just walking through the place. Great service and nice restaurants too. Take a cab, forget about driving. You can change your money at any ATM too."
	},
	{
		"User": "GlobalGoodTimes",
		"Location": "Las Vegas",
		"DateofReview": "Reviewed September 16, 2013 ",
		"ReviewTitle": "Nice new upscale mall!",
		"Review": "Nice modern multi-level mall in the heart of the city. Very easy and ample parking and stores aplenty, many of which you would see in many U.S. malls. It has a nice food court, lots of fast food and dining spots, a very good movie theater, and convenient restroom facilities! Nice addition for the shopping savvy in the city."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "Reviewed May 12, 2013 ",
		"ReviewTitle": "Convenient, ride to the next city- right at the doorstep.",
		"Review": "Convenience is one but other goods are too expensive, Signature items are just at its price. but can go around to look for some inexpensive, only one or two shop(s) that can answer the need.\r \r This is also another Davao City's pride like the other big malls in town."
	},
	{
		"User": "lenie",
		"Location": "almere",
		"DateofReview": "Reviewed July 17, 2012 ",
		"ReviewTitle": "excellent shoppingmall",
		"Review": "specialy on those warm philippine day,s this is one of those places to look around, almost every shop is there, and there always extra things organised on the ground floor, like show,s music and a lot more activities, and when you go to the highest floor there is a special foodcourt, and a lot of restaurants in the open air part you can see the planes landing on davao airport, they are even building a new 4 star hotel to the side of it (ayala opening 2013?) furher are there 3 more big shopping malls within 10 minutes driving with a taxi costing around 40/60 pesos"
	},
	{
		"User": "Jeremy N",
		"Location": "Dover, Delaware",
		"DateofReview": "Reviewed July 8, 2012 ",
		"ReviewTitle": "Beautiful Mall...American Prices",
		"Review": "Great place to visit...its a great mall and very modern and has Starbucks and TGI Fridays if you miss those places from the States :) However the prices there are inline with American prices for food and products. The movie theater is really nice and you get to pick your seat even when you get your tickets which I never saw before but the theater prices are WAY cheaper than in the USA so thats a plus! If your in Davao its a great place to stop!"
	},
	{
		"User": "saint28daisy",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Philippines",
		"Location": "Philippines",
		"DateofReview": "Reviewed May 16, 2012 ",
		"ReviewTitle": "Retail therapy at ABREEZA",
		"Review": "The Abreeza Mall is a new and huge mall in Davao City and a one-stop haven for shoppers like me. Built on a 10-hectare land along Bajada, right across the Redemptorist Church, this Mall is a joint venture between Anflocor and Ayala Land Inc. Another beautiful Ayala Mall that reminds me of the TRINOMA in Quezon City.\r \r I immediately bought me a tall cup of classic Starbucks caffe latte to fuel my whole day of retail therapy in Davao City. Abreeza carries elegance with its name; obviously for the high end branded shops that it houses, and the whole modern, sleek physical structure. It was newly inaugurated in 2011 and has attracted Davaoenos from all walks of life. My friends and I ate a delicious lunch at Bigby’s.I observed that there were a number of interesting restaurants in the complex , modern cinemas, a Robinson’s Department Store and Supermarket. Retail therapy to the max!!!"
	}
]
