[
	{
		"User": "50ftqueen",
		"Location": "Davao City, Philippines",
		"DateofReview": "1 week ago",
		"ReviewTitle": "Best place for South Sea Pearls",
		"Review": "This place is the best place to buy authentic souvenirs from Mindanao. The souvenirs come from almost all tribes in Mindanao, and you can be sure that if you are nice and haggle well enough, you will get a good price for your purchases. Most of the stores here are airconditioned, but wear comfortable clothing that you can easily slip in and out of if you plan to try on clothing.\r \r I go to Aldevinco every chance I get because of their south sea pearls. Some tips:\r \r 1. DO NOT PURCHASE PEARLS FROM THE FIRST STORE YOU VISIT. Take some time to go around to compare prices among the stores as these will vary.\r \r 2. Read up on buying pearl jewelry. Know how to spot fake pearls from real ones, and that freshwater pearls do not have the same lustre as south sea pearls, tend to be smaller and cost less. \r \r 3. Credit cards are accepted at some stores (e.g. for purchases such as pearls), but there is a 3.5-5% additional charge. For small purchases like trinkets etc., it is best to pay in cash.\r \r 4. Be nice. Haggling is an art and your charm and kindness will go far. I've been frequenting a shop for several years and the owner is kind enough to suggest and select better quality pearls for me.\r \r 5. Always remember that you get what you pay for. If you pay less for pearls, expect that you will get pearls that maybe have too many fishbites, have an uneven lustre etc. The good quality pearls have less fishbites, an even color, and are round/even in shape.\r \r 6. If you have access to a jewelry maker, purchase loose pearls instead and have them set in gold. The ready to wear earrings for sale at Aldevinco are glued or mounted on stainless steel. Bigger pearls need a solid post and a large push back to ensure that your earring stays nice and secure when you wear them. \r \r Enjoy shopping!"
	},
	{
		"User": "sabi0james",
		"Location": "Manila, Philippines",
		"DateofReview": "March 7, 2018",
		"ReviewTitle": "A great place to find authentic Davao/Mindanao items",
		"Review": "Imagine a whole complex dedicated to local crafts, that's basically what Aldevinco is. Stall after stall offering local clothing, jewelry, souvenir items. There are also some money changers to help tourists doing some shopping. Located near Ateneo de Davao and Marco Polo hotel, the complex is very accessible. The night market is also located just outside the complex . So day and night this place offers something to visitors and residents as well."
	},
	{
		"User": "pipots",
		"Location": "Imus, Philippines",
		"DateofReview": "January 28, 2018",
		"ReviewTitle": "Must to buy pearls and local goods",
		"Review": "It's my third time at Aldevinco and I still enjoy going. It's a great place to buy pearls which I can use on a daily basis. I love it that most shops have pearl designs that are modern and youthful. I wouldn't say that this place is for everyone but it's nice to visit if you love jewelry and local goods. "
	},
	{
		"User": "redgotsohigh",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "Go to place for your shopping needs",
		"Review": "Definitely the place to be if you're looking to buy pasalubong for your loved ones. Items here ranges from shirts,keychains,sarongs,bags and a whole lot more. They even have money changers in case you run out of PHP money."
	},
	{
		"User": "ymalih",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 16, 2017",
		"ReviewTitle": "Fun place",
		"Review": "As one goes in and out of the stores im Aldevimco, you will see various apparel, trinkets furnitures and accessories both home and office"
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 9, 2017",
		"ReviewTitle": "Nice friendly shops",
		"Review": "We did some shopping after my wife got out of the dentist office there. Most of the shops are full of souvenirs for the tourist looking for something about Davao, they also have some shops selling more traditional type clothing. This one shop had these wooden carved frogs that if you run this stick that comes with it across it's back it sounds like a frog. Some shops are a little pricey if your from america and some are reasonable you just need to look around or in my case my wife is from Davao so its a little harder to charge me more than the locals and my wife lets them know about that kind of stuff."
	},
	{
		"User": "Chris C",
		"Location": "Manila, Manila, Philippines",
		"DateofReview": "November 5, 2017",
		"ReviewTitle": "Aldevinco Shopping Center",
		"Review": "- visited Nov 2017 - opens around 10am - near Pasalubong Center - mostly souvernir items, clothing items - limited choices, you'll be done in around 30 mins to 1 hour - accessible to public transport"
	},
	{
		"User": "Raf O",
		"Location": "Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Souvenirs. ..",
		"Review": "So many type of souvenirs to choose from...price is good. People are friendly and helpful. Quiet shopping center."
	},
	{
		"User": "pastelprism",
		"Location": "Manila, Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Souvenirs Galore",
		"Review": "This is definitely a go-to place when shopping for souvenirs. Tourist shops tend to be expensive so I was having second thoughts visiting the place, but we went anyway. I was pleased to find that the prices here are low that I was able to get stuff for everyone in the family, even to my officemates. When I got to back to Manila, I found same items being sold about 200% higher than the price at Aldevinco. We got bags, shirts, malongs, pouches and wallets and even pearl earrings that we had to buy additional baggage allowance or we'd exceed as the shopping was unexpected. Just make sure you have enough cash because the shops don't accept credit cards (or at least the ones we've been to)."
	},
	{
		"User": "New Zealand",
		"Location": "New Zealand",
		"DateofReview": "October 15, 2017",
		"ReviewTitle": "Beware of the varying prices from one store to another",
		"Review": "This place has quite a few stores that sell souvenir items from Davao. However, it pays to go around and check the prices as they can vary from one store to another - even if it's for the same item! The layout of the stores aren't really appealing to me as they seem to squash everything they sell in tiny spaces, so there really isn't enough room to move around in. What this shopping mall (if you can really call it that) is famous for is a place to go to if you want to exchange your U.S. dollar at black market rate."
	},
	{
		"User": "Edgar Ian T",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 24, 2017",
		"ReviewTitle": "Best Good Souvenirs in Davao",
		"Review": "You can find these at the heart of Davao City, Beside Marco Polo Hotel. There are many souvenirs they offer specially the Malong. try it!"
	},
	{
		"User": "moshemo19",
		"Location": "Pampanga Province, Philippines",
		"DateofReview": "August 26, 2017",
		"ReviewTitle": "Place to find souvenirs",
		"Review": "If you need to find souvenirs of Davao, this is thr place to go. There's just lots of shops. It being near Roxas Avenue, it is convenient to drop by."
	},
	{
		"User": "lemmorcv",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "August 15, 2017",
		"ReviewTitle": "Very Hot",
		"Review": "There are a lot of street seller selling things that is not useful for you. They are very persistent to a point that you can't concentrate on looking around to choose what to buy. Don't come during day time as the building is so hot...More"
	},
	{
		"User": "Althea-CZ",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "July 18, 2017",
		"ReviewTitle": "Batik Souvenirs",
		"Review": "I usually go to Aldevinco for my \"pasalubong\" shopping. It's a shopping paradise for batik and Southern Philippines culture and tradition. I was a bit scared when I entered because many vendors were offering their foreign currency exchange services. It's somewhat a turn-off for tourists...More"
	},
	{
		"User": "Jonathan Christ... B",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 13, 2017",
		"ReviewTitle": "ANYTHING AND EVERYTHING YOU NEED ABOUT DAVAO",
		"Review": "It is a place to antiques, memorabilias about davao, souvenirs erc.....friend people, right price just infornt of MArco polo davao."
	},
	{
		"User": "BennieGS2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 11, 2017",
		"ReviewTitle": "Variety to chose from but...",
		"Review": "Variety to chose different take home goods but the alley is not well suited for shopping style. Thin space for walking and you felt like you are in incubator because the hallway are too small."
	},
	{
		"User": "beachnutts73",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 6, 2017",
		"ReviewTitle": "Cool place to shop souveniers",
		"Review": "Aldevinco is a cluster of similar shops all together in a large shopping center. Great place to find Davao souvenirs and traditional Philippines culture and art. Also, good place to exchange currency as their rates are always better than the banks and malls. Parking is...More"
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"DateofReview": "February 6, 2017",
		"ReviewTitle": "Good foreign exchange rates",
		"Review": "I had been to this large collection of souvenir stalls years ago so this time my focus was on changing Australian dollars. A Filipino - Chinese stallholder provided a very good rate."
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 15, 2017",
		"ReviewTitle": "Same Same",
		"Review": "Printed Fabrics of all kinds. Money changers. China things. Clothes. I don't really see a difference between the stores. Nice to see if you are around anyway."
	},
	{
		"User": "Ajie A",
		"Location": " ",
		"DateofReview": "December 10, 2016",
		"ReviewTitle": "Davao Souvenirs",
		"Review": "If you want to bring home pasalubong - then this is the place! You can shop for small items to antique furniture... be sure to canvass first and haggle. It is cheaper if you buy a dozen or half a dozen. Bought scarves and batik...More"
	},
	{
		"User": "yamvillanueva",
		"Location": "Singapore",
		"DateofReview": "November 29, 2016",
		"ReviewTitle": "Pasalubong! ",
		"Review": "A one stop shop for buying goodies to bring home to family & friends. Reasonable prices and can haggle and ask for discount."
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 10, 2016",
		"ReviewTitle": "looking for Davao and Mindanao souvenirs in a cheap price yet good quality?",
		"Review": "if you travel to Davao and looking for Davao and Mindanao's souvenirs in a cheap price yet good quality, you will never be disappointed in Aldevinco Shopping Center because you can shop as many as you can. you can haggle the price too :)"
	},
	{
		"User": "Christine F",
		"Location": " ",
		"DateofReview": "October 27, 2016",
		"ReviewTitle": "Shopping Spree",
		"Review": "My mom loves to shop and since our hotel was a few blocks away, we always dropped by here during our stay. I bought some stuffs and they love the \"durian\" keychain. I also love the pearl bracelet that i bought for myself. Night market...More"
	},
	{
		"User": "Johnny L",
		"Location": "Davao City",
		"DateofReview": "October 20, 2016",
		"ReviewTitle": "the best",
		"Review": "The quintissential DAVAO shopping place for everything that is PASALUBONG, or the things that you bring to your love ones from a travel. You can find tshirts, jewelries, musical instrument, and even have your foreign currency change."
	},
	{
		"User": "Inday23",
		"Location": "New York City, New York",
		"DateofReview": "October 18, 2016",
		"ReviewTitle": "Excellent shopping place for pearls and native souvenirs",
		"Review": "I love to shop here in Aldevinco, they have good selection of pearls jewelries and the price is good! You can also buy native souvenirs for your love ones."
	},
	{
		"User": "filipin0traveller",
		"Location": "manila",
		"DateofReview": "September 30, 2016",
		"ReviewTitle": "Popular Souvenir Shop",
		"Review": "Many shopping stalls that offer souvenirs.Near Marco Polo Hotel, Ateneo de Davao and the night market. Better haggle before buying."
	},
	{
		"User": "Jon M",
		"Location": " ",
		"DateofReview": "August 26, 2016",
		"ReviewTitle": "Great shopping experience",
		"Review": "From my hotel on Quimbo Street, it was only a P8.00 trip to this shopping center. It was relatively safe at Aldevinco shopping center, it was close to Ateneo de Davao, though lots of street vendors will solicit you, I personally found their persistence impressive,...More"
	},
	{
		"User": "Sol P",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "IT'S A MUST!",
		"Review": "Aldevinco Shopping Center is one of the tourist spot in Davao City. Your visit or vacation is not complete without shopping here, where you can find Davao's novelty items prices very affordable. Enjoy shopping!"
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "lots of souvenir stores, near roxas street(food strip)",
		"Review": "i just did some window shopping. lots of items(pearls, textiles) are being sold, prices are slighty different from one shop to the other so you better check our all store to find the most affordable items. located along roxas street. so you can eat after...More"
	},
	{
		"User": "Darryl G",
		"Location": " ",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "Local souvenirs and some",
		"Review": "Place is known for buying local souvenirs, there are some shops that offer foreign exchange. Easily accessible by jeepney."
	},
	{
		"User": "Werner I",
		"Location": "Karlskoga, Orebro Lan, Sweden",
		"DateofReview": "August 18, 2016",
		"ReviewTitle": "Lot of cheap stores",
		"Review": "If you visit Davao I can recommend a visit here. You can find lot of cheap t-shirt and bags to low price. Buy only if you ca see price label at what you want. In some stores they give you a much higher price if you are tourist. It´s also many money changer here, but rate is not same in all so ask in a few for best rate. You can buy pearls from Samal island, but price is a little high. Better buy them at Samal"
	},
	{
		"User": "DiyosaLife",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 1, 2016",
		"ReviewTitle": "Go to Place for Pasalubong",
		"Review": "If you're looking for cheap, authentic Davao souvenirs, this is definitely the place to go to. You may haggle all day long for assorted key chains, shirts, caftans, bags, and other souvenirs items. Plus, if you want to have your foreign currency changed to pesos, there are multiple money changers here."
	},
	{
		"User": "HelenaGuerra",
		"Location": "Washington DC, District of Columbia",
		"DateofReview": "July 30, 2016",
		"ReviewTitle": "Bunch of stores",
		"Review": "Many vendors selling souvenirs. Pearls are a big thing here. Also handicrafts and textiles. Quality varies a lot so search and bargain hard."
	},
	{
		"User": "Hồng Anh N",
		"Location": " ",
		"DateofReview": "July 22, 2016",
		"ReviewTitle": "Amazing paradise shopping center",
		"Review": "A paradise of souvenir and decorations !! You can find many things with the same quality but very low price. There are various kinds of souvenir, they are all interesting and unique! Don't forget the pearl! You should buy some! My tip is dont buy immediately what you see, just have window shopping first and then decide which store has the best ones! Good luck and Have fun!!!!"
	},
	{
		"User": "cherry052101",
		"Location": "Taguig City, Philippines",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "shopping galore",
		"Review": "the best place to shop for souvenirs and pasalubongs. they offer great choices and discounts depending on the bulk you've bought."
	},
	{
		"User": "Leah E",
		"Location": "Tacloban, Philippines",
		"DateofReview": "June 27, 2016",
		"ReviewTitle": "So Low!!",
		"Review": "You get more than what you pay for. The prices of almost everything is way low than the price of the same items in malls. You get the same comfort they have in malls. Got an item at the mall for 45php and the same item in aldevinco was priced at 15php. Where else will you go? Aldevinco :-)"
	},
	{
		"User": "nprila",
		"Location": " ",
		"DateofReview": "June 19, 2016",
		"ReviewTitle": "Pasalubong!",
		"Review": "If you want to get some pasalubong, visit Aldevinco, it is near Marco Polo and Ateneo de Davao. I got a lot of caftans for the girls. And if you want to get some batiks and pearls, you can get it fro. There too. I woild suggest go around first and compare prices. Some pearls are the same price as of Manila's. Some stores are closed on Sundays as well. "
	},
	{
		"User": "CaliTo69",
		"Location": "Philippines",
		"DateofReview": "June 5, 2016",
		"ReviewTitle": "Haggle...",
		"Review": "the place is famous for souvenirs. and some things you must have here are money to spend, time, patience and talent to HAGGLE. You will need time & patience as there are numerous stalls for you to go in and check on their merchandise. Next is you need to know how to haggle as you can really get a good discount. Pearls are plenty if you love them but price is more expensive than those Badjaos who peddle them along the streets."
	},
	{
		"User": "Jojaze A",
		"Location": " ",
		"DateofReview": "May 29, 2016",
		"ReviewTitle": "Souvenirs of Davao",
		"Review": "After savoring all the beautiful places to visit, dine and do in Davao city, the last stop would be to bring home something. this place offers tons of that, from native items to delightful pearls."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 23, 2016",
		"ReviewTitle": "My guests always ask to be brought to Aldevinco for Shopping",
		"Review": "I go to Shiela's for Batik dusters, Alibaba pants, tie-dyed shirts, beach cover ups and dresses and pants. Also native woven bags and wallets perfect for pasalubong. As well as tinalak cloth and other woven cloth for table or bed covers. For pearls I go to Sam J's both in Aldevinco just across Marco Polo and Ateneo de Davao University. The advantage is that they give me the best price for being loyal. Maybe you can drop my name and get my discounts too! Best though to ask nearby stores for similar garments to get the best price. \r \r My guests never leave Davao without a trip to Aldevinco! "
	},
	{
		"User": "Bloom_donna",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 17, 2016",
		"ReviewTitle": "Cheap yet very unique \"Pasalubong\"",
		"Review": "I always recommend Aldevinco Sopping Center if you want to buy cheap yet unique pasalubong for your friends and family.They had a lot of stuff like Davao Themed Tshirts which normally cost from 2 for 180, unique bags and wallets,beahc outfits, malong and many more.ALso if you buys wholesale stuffs they will give you instant discounts."
	},
	{
		"User": "Dexter M",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 16, 2016",
		"ReviewTitle": "Bring home with you the memorabilias",
		"Review": "This place is a tourist trap and it has been here for many years and already part of the city's heritage. You can also do your money changing here and buy \"batik\" clothes and native artworks. The place is also at the heart of the city and right next to a busy street's night life of food kiosks and all sorts of knick knacks."
	},
	{
		"User": "Jay S",
		"Location": "Luzon, Philippines",
		"DateofReview": "April 14, 2016",
		"ReviewTitle": "Affordable souvenirs, pasalubong",
		"Review": "Visit this place if you're on a budget for 'pasalubong' or souvenirs. \r \r The shopping center is located along CM Recto Ave, just in front of Marco Polo Hotel in Davao. \r \r You can buy candies, pomelo, shirts, batik or malong, bags, and other Davao products. PhP500 to PhP1,500 can go a long way. \r \r Products here are cheaper than those in the airport."
	},
	{
		"User": "calub m",
		"Location": " ",
		"DateofReview": "February 27, 2016",
		"ReviewTitle": "Cheap Souvenirs and Pasalubong",
		"Review": "From scarf to sarong, to batiks and floral ponchos. \r As cheap as 45 pesos per piece (USD 0.94) of scarf. Pack of 10 pieces. Or assorted colors and styles that you are free to choose.\r 350 pesos (USD 7.30) on ponchos (a clear thin piece of silky garment with a slit in the middle for the head, usually worn as top. Over a swimsuit)\r Other items are less than 500 pesos.. You can bargain especially when you will buy in quantity."
	},
	{
		"User": "Christina L",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 25, 2016",
		"ReviewTitle": "Affordable But A Bit Repetitive",
		"Review": "The place has a lot of collectibles as well as Philippine-made products that you can give as gifts or bring to far-away friends. The only drawback is that sometimes the items being displayed would be repetitive for each store making you feel that somehow there is only a few suppliers for all the shops.\r \r If you're not from Davao, I would recommend you stop by this place."
	},
	{
		"User": "AlbertodelaPaz",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "February 24, 2016",
		"ReviewTitle": "Souvenir haven in davao.",
		"Review": "If you are looking for native clothes those which are worn by our ancestors this is the place you shouldnt miss! They offer a variety of souvenirs from clothes, to accessories! We bought abaka bracelets for 15 each and durian magnets for 100/5pcs. They also have tubao and malong! :) keychain and other pasalubong that you want to buy in davao! :) good thing is that it is near the city so you can save time if you are planning to visit this place."
	},
	{
		"User": "Kris_ianne",
		"Location": " ",
		"DateofReview": "January 22, 2016",
		"ReviewTitle": "Good place to get money exchanged",
		"Review": "The Aldevinco Shopping Center is right across the street from the Marco Polo hotel. It is filled with tiny shops offering batik fabrics, purses, blouses, tee shirts, hats, and jewelry. Be careful about buying pearls -- you can tell from one shop to the next that some are fake, but even the costume jewelry in American dollars is a bargain! Don't be afraid to haggle a little with the sellers....you will be tempted to buy something from everyone, because the people are so sweet. I also noticed the money changers there gave MUCH better rates than the hotel. They will give you a higher rate if you exchange large bills. Everything I bought was of good quality, but be sure to try on EVERY TEE SHIRT because the sizes run very small and will vary (I bought two tee shirts from one shop and both of them were listed the same size...but one was a good size and a half smaller than the other). Once everyone at home saw my purchases they begged for me to bring some home to them, so I have to go back and shop again tomorrow!"
	},
	{
		"User": "PauTheCarabao",
		"Location": "Chiang Rai, Thailand",
		"DateofReview": "December 10, 2015",
		"ReviewTitle": "Thai and Chinese products Galore.",
		"Review": "In the past - meaning before the shopping malls like SM, or Gaisano, Felcris, or NCCC took over retailing in Davao City, Aldevinco was practically the only place where you could buy souvenirs from Davao City. There were ethnic crafts like Mansaka beadwork, T'boli Tinalak, wood carvings, antiques, batik cloth from Zamboanga and many other stuff.\r \r Today, the merchandize has been overrun by Thai and Chinese goods. There are lots of pearls being sold there. What the vendors don't tell you is that those are fresh water pearls from China. I have a problem with this because those vendors lie to you. I do NOT like being LIED to.\r \r It is pretty much the same in other shops - including those malls. Therefore, I see no point in going there if you are only going to see the same things in other places.\r \r Davao needs to come up with more and innovative products. They have not changed the kinds of merchandise being sold here. If you have shopped here 30 years ago, little will have changed if you visited now.\r \r Aldevinco is a street-level shop (no second floor). It is not air-conditioned to going there on a hot-humid day will be a test of physical endurance and mental fortitude."
	},
	{
		"User": "Makati, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 26, 2015",
		"ReviewTitle": "Batik's at it's Best",
		"Review": "The Aldevinco Shopping Center has a lot of stores in which they sell Batiks and Pearl products, the area in which it is located is just near from a hotel and city's tourist destination. If you want to buy some known products from Davao, visit The Aldevinco Shopping Center for Gift ideas for your love one's. Happy Shopping :) "
	},
	{
		"User": "Marian B",
		"Location": "Luzon, Philippines",
		"DateofReview": "November 12, 2015",
		"ReviewTitle": "Shopping!!!",
		"Review": "Great place to shop for native Davao's souvenirs like shawls, bags, pearls, shirts, fruits, Durian candies etc."
	},
	{
		"User": "msdawna",
		"Location": " ",
		"DateofReview": "November 4, 2015",
		"ReviewTitle": "Looking for Souvenirs",
		"Review": "This is a great place to find souvenirs for your family and friends, you can find from really cheap handcrafted magnets to a really beatiful southsea pearl."
	},
	{
		"User": "theroyalputri",
		"Location": " ",
		"DateofReview": "October 20, 2015",
		"ReviewTitle": "nice shopping place...",
		"Review": "if you want a lot of davao's souvenir items, this place is certainly a must. from bags to pearl accessories to batik clothes, you will have a wonderful time scouting for them in this center. but if you're planning to go to palawan sometime soon,...More"
	},
	{
		"User": "Felicia C",
		"Location": "Walnut Creek, California",
		"DateofReview": "October 9, 2015",
		"ReviewTitle": "Treasures in corners",
		"Review": "My first time in Davao and this was so convenient across from the Marco Polo Hotel. Great gifts, solid prices and locates some antique metal tobacco boxes tucked away in a shop corner. Definitely stop by when you visit!"
	},
	{
		"User": "jessicasY6091HN",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "September 29, 2015",
		"ReviewTitle": "Aljallilah's Gift Shoppe is the way to go",
		"Review": "Everytime i visit Davao City, i make sure to pass by aldevinco for take home presents for family and friends. it's a great place to buy batik stuff, davao city shirts, pearls and custom jewelry. on one side of the center is the fresh fruit...More"
	},
	{
		"User": "bulakbol76",
		"Location": "Singapore, Singapore",
		"DateofReview": "September 22, 2015",
		"ReviewTitle": "One thing - Bargain!!",
		"Review": "It was nice walking around in Aldevinco to see the many different items being sold. Relatively quiet during the day (it is open between 8am to 7pm) but the shop owners are keen to sell their goods when you are browsing around. Feel free to...More"
	},
	{
		"User": "vince19537",
		"Location": " ",
		"DateofReview": "September 14, 2015",
		"ReviewTitle": "Gifts",
		"Review": "Whenever i go back to Korea Or guests come from Korea I go here to buy some pearl jewelries, T.shirts and more. Good good;)"
	},
	{
		"User": "Loislim",
		"Location": "Cebu City, Philippines",
		"DateofReview": "September 14, 2015",
		"ReviewTitle": "very good for first time visitors",
		"Review": "very good stop for first time visitors to get a flavor of what items are available to purchase as souvenirs and to take back. there are a lot of stores selling batik-style fabrics and apparel, as well as pearls, souvenir t-shirts, and even a few...More"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "September 9, 2015",
		"ReviewTitle": "Nice tasting Davao Made Dried Mangoes",
		"Review": "I bought some dried mangoes and its very delicious. The brand name is \"Philippine Islands\" which is only available in Jasminas and Algems store located at Aldevinco C.M. Recto Avenue Davao City Philippines. Try this product since it is locally made and with an export...More"
	},
	{
		"User": "Ma Cristina M",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "August 27, 2015",
		"ReviewTitle": "Great finds at a low price",
		"Review": "A colleague of mine suggested where I can buy non-food pasalubong at Davao and said to head to Aldevinco Shopping Center. I got to buy pasalubong for the whole family and for the office as well. I even got huge discount hehe! I got to practice my haggling skills ^_^. Shop at Esnaira's House of Batik if you want good quality products and huge discounts when you buy many items. "
	},
	{
		"User": "Mitch A",
		"Location": " ",
		"DateofReview": "August 18, 2015",
		"ReviewTitle": "Got some pesos?",
		"Review": "It's a shoppin center but in reality it thrives because of its money changer business. Has good reputation in changing different currencies because of good deals and rates and pretty honest people."
	},
	{
		"User": "Jacqui C",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 13, 2015",
		"ReviewTitle": "Honest and Polite Vendors",
		"Review": "I use to buy \"malong\" there. I love how the vendors treat the customers. They are very polite and honest. Truly something to be proud of."
	},
	{
		"User": "Go_Bag_Lite",
		"Location": " ",
		"DateofReview": "August 11, 2015",
		"ReviewTitle": "Very Affordable!!! ",
		"Review": "Price ranges from 35-200! if you're looking for souvenirs with good quality but cheap, go here 👍 lots of shops to choose from!"
	},
	{
		"User": "Richthof R",
		"Location": " ",
		"DateofReview": "August 7, 2015",
		"ReviewTitle": "Shopping",
		"Review": "Great place where to shop souvenirs.... Low price souvenirs and you can buy a wholesale.... I will be back to this place."
	},
	{
		"User": "danalelojo",
		"Location": " ",
		"DateofReview": "July 27, 2015",
		"ReviewTitle": "Great place to buy handmade bags",
		"Review": "Go here if you want to buy: Sarong Bags Earing Necklace Antiques Pouches Thirty Skirts Shorts Pajamas"
	},
	{
		"User": "obieoneobie_1",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 26, 2015",
		"ReviewTitle": "Davao's Indigenous Clothing",
		"Review": "A place where Davao's very own culture is showcased in a form of accessories, clothing, fabric and etc. for which all are based on the works of the Mindanao's indigenous community. This place is best for tourist who opt to experience Davao in one place. Stores also offer money changers accessible to visiting tourists. Located fronting Marco Polo Hotel."
	},
	{
		"User": "6452",
		"Location": "Makati, Philippines",
		"DateofReview": "July 15, 2015",
		"ReviewTitle": "Pasalubong Varieties",
		"Review": "To think about this place, this must be the most iconic place where to buy good stuffs / pasalubong for your friends and families. \r \r We had a chance to go here and purchased some of the items we love. \r \r Definitely a must to go when you visit Davao City. :)"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 1, 2015",
		"ReviewTitle": "I always change my $$ ers here ....The banks don't give you a fare exchange!! It's also my first to get gifts for friend",
		"Review": "Aldevinco is a great place to get quality suviniers, and a great place to exchange your foreign money's. Highly recommend Singapore Exchange, it's location is on the back side of this strip mall. Josphine's clothing shop is also a great place for fare prices and some American sizes. I've been going here since 20006!!"
	},
	{
		"User": "ANNann00",
		"Location": "Philippines",
		"DateofReview": "June 21, 2015",
		"ReviewTitle": "Shopping haven",
		"Review": "So many things to buy, so little time. If you're looking for pasalubong, aldevinco has a lot! From keychains to tshirts, shawls to jewellery, they have it! When we were in Davao, we went here twice and can't seem to stop shopping, items are very affordable!"
	},
	{
		"User": "KIKO597",
		"Location": " ",
		"DateofReview": "June 15, 2015",
		"ReviewTitle": "More of malongs/RTW clothing than food souvenirs",
		"Review": "We were expecting to buy all our pasalubong (treats to bring home) from here. However, we found that the stores here sell mostly ethnic fabrics (malongs/wrap arounds), t-shirts, blouses, souvenir wallets, and other indigenous items. Yes, there were also food souvenirs of durian/mangosteen candies, but the choices were very limited. The biggest malongs could be bought for as low as 350 pesos. Make sure to haggle!"
	},
	{
		"User": "Roseann G",
		"Location": "toronto",
		"DateofReview": "May 13, 2015",
		"ReviewTitle": "close and convenient",
		"Review": "you have to really know how to bargain. check out the prices first and ask some locals what the reasonable price shd be. also, BE CAREFUL.... pickpocketers loom around. beware of those who are around you."
	},
	{
		"User": "MsManang",
		"Location": "Manila, Philippines",
		"DateofReview": "April 1, 2015",
		"ReviewTitle": "Already an Institution",
		"Review": "My first experience going to this place was 20 years ago for several times when I'm still working with a company that had business in Davao. Now, every time we visited Davao, it's always a part of our itinerary. \r The stalls are well maintained, and we purchased souvenir t-shirts, dresses, malongs, native woven fabrics for bedsheet and bags. There are also pearls but is much cheaper in Palawan. There are also some wood souvenirs, other accessories, and hard to find objects. .\r Even with the proliferation of malls in Davao, business it seems is still good because of the support of management to maintain it's facilities, competitive pricing / variety of goods, the sopport of locals who told us that it's still the \"in place\" in shopping, and lastly it seems that we're just in \"Greenhills Shopping Center\" together with the muslims.."
	},
	{
		"User": "cjcjcj89",
		"Location": "Calamba, Laguna, Philippines",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Pearls, Malong, Bags ",
		"Review": "If you need to buy pasalubong like pearls,tshirts, foldable bags and fans, malongs, dresses, etc., Aldevinco is the best place to visit. Just be persuasive in haggling. There are lots of shops to visit. If you want food for pasalubongs like durian, marang, mangosteen etc, visit bangkerohan market. "
	},
	{
		"User": "Chrnzke",
		"Location": "Houston, Texas",
		"DateofReview": "February 4, 2015",
		"ReviewTitle": "across the street from the hotel shopping",
		"Review": "the shops are small but has lots of selection; be careful with your purses/wallets but otherwise they are helpful and can carry your stuff to the hotel for small tip"
	},
	{
		"User": "raymmiconmapper",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "January 19, 2015",
		"ReviewTitle": "Aldevinco experience",
		"Review": "This pasalubong center is composed of mini boutiques that sells genuine pearl accessories in not so expensive prices, gong-like necklace and earrings, unique accessories, set of jewelry, clothes such as tshirt and dress, ethnic bags, muslim headdress, wallets, keychains, fan, hat, sleepers, scarf, sarong, malong and variety of crafts. This place offers a wide range of pasalubong items that's why you must reserve a lot of time if you want to explore every stall.\r \r I have visited Aldevinco 2x (2010 and 2014.) I remember that this is a shopping place that was recommended by one of our tour guide during our on-board training."
	},
	{
		"User": "Tee T",
		"Location": "Makati",
		"DateofReview": "December 2, 2014",
		"ReviewTitle": "Pasalubong center",
		"Review": "Place to go if you want to buy pasalubong (excluding foods) from Davao. White shirts cost us P100/pc. Colored shirts cost P150/pc. Ref magnet P35/pc."
	},
	{
		"User": "Anne S",
		"Location": "Pasig, Philippines",
		"DateofReview": "March 23, 2014",
		"ReviewTitle": "One-stop pasalubong shops",
		"Review": "Located right infront of Ateneo de Davao, Aldevinco Shopping Center has all the pasalubong items you need. I bought keychains at just P10 each and nice, expensive-looking scarfs at P40 each. You just have to tell them how much your budget is and they will show you which of their items can be bought at that price."
	},
	{
		"User": "Jie-E",
		"Location": "Alice Springs, Australia",
		"DateofReview": "October 24, 2013",
		"ReviewTitle": "Best Money Changer",
		"Review": "If you want to have the best money changer in Davao, go to Aldevinco and look for \"Singapore\" money changer and see Aida Yuson. Very honest and a lovely lady - always the best rate!!!!"
	},
	{
		"User": "Riza O",
		"Location": "Manila, Philippines",
		"DateofReview": "August 18, 2013",
		"ReviewTitle": "Shop until you develop leg cramps or run out of pocket money",
		"Review": "We stayed at the ALU Hotel Davao at the Central district of this metropolis. Aldevinco shopping center is just three blocks away from our hotel at the corner of Claveria Street and Roxas Boulevard a triangular area with more than a hundred stores.\r \r This shopping center carries a wide variety of merchandise ranging from souvenir items, leather and weaved bags, clothing items or materials, scarf, shirts and T-shirts to carved or plain chest box (baul) to fresh or south-sea pearls.\r \r If you are tagged as a \"tourist\" expect to be quoted 3-4x the regular selling price. This is the place to hone in ones \"haggling\" skills. Interestingly, there are more items that appeals to women shoppers. So if you are accompanying your \"significant partner\", be prepared for a long wait.\r \r Inside the center is Dreambuck coffee shop, an air-conditioned facility where you can \"cool your heels\", read a magazine or order coffee or a light snack while waiting. (Sorry no Wi-Fi). Later carrying shopping bags will be a good exercise for your biceps at anytime of day."
	},
	{
		"User": "MrEdnWilbur",
		"Location": "Luzon, Philippines",
		"DateofReview": "June 10, 2013",
		"ReviewTitle": "The place for \"pasalubong\" shopping.",
		"Review": "I like Aldevinco because the batik, bags, pearls, etc. are cheaper there. Because it's a cluster of stores, the place will give shoppers a wide selection of Davao souvenir items like shirts, fridge magnets, coin purses, etc. Don't leave Davao without checking this place out."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Manila, Philippines",
		"DateofReview": "May 5, 2013",
		"ReviewTitle": "One-stop \"Pasalubong\" Place",
		"Review": "This was probably my third time at Aldevinco. The last time was a number of years ago. I'm not sure but there seem to be more options of stuff one can buy this time. But I was a bit sad to have not been able to find the native jewelry store I once went to. \r The most common items found here are pearls (and pearl jewelry), souvenir shirts, batik, malong, ethnic crafts, souvenir trinkets like magnets and keychains, and other local items ideal for \"pasalubong.\"\r The price is pretty okay considering these are souvenir items. But you might want to haggle first before purchasing something because the first price store salespeople give is usually much higher than the \"real\" or \"lowest\" possible retail price for the item.\r It is also conveniently located near other establishments. There is a market right beside it. You can buy there fruits, candies and other delicacies."
	},
	{
		"User": "totorohead",
		"Location": "Jacksonville, Florida",
		"DateofReview": "January 29, 2013",
		"ReviewTitle": "A Shoppers Paradise",
		"Review": "You name it, you can get everything in this place. Hold on, check that. What I meant to say is you can get batik cloths, jewelry made of pearls and gemstones, copper ware, various types of wood work, ancient swords, shields and other handicrafts. The prices are higher than expected but cheaper compared to the traveler's home country. You are. however, expected to barter and this system could be fun for others while a pain for some :) Additionally, if you run out of the local currency, they have a few money exchangers who offer better rates than banks. In closing, all I have to say is to enjoy and have fun!"
	},
	{
		"User": "saint28daisy",
		"Location": "Amsterdam",
		"DateofReview": "December 6, 2012",
		"ReviewTitle": "Souvenirs? You can find it all here.",
		"Review": "Many stores inside the center. You name it from shirts made out of Batik, necklaces, antiques, woven cloth, bags, other gift items and many more. Also to include money changers and snack bar and restaurant within.\r \r You get in there and come back without buying something is impossible."
	},
	{
		"User": "mzzyap8",
		"Location": "Quezon City, Philippines",
		"DateofReview": "October 27, 2012",
		"ReviewTitle": "Pearls! And batik! And pearls!",
		"Review": "I stayed in Davao for only a couple of days before heading to General Santos with my family, but we made time to stop by Aldevinco for souvenirs. \r \r Aldevinco reminded me of Greenhills and Quiapo, but a quieter, cleaner, and cooler version of the two. Salespeople also aren't as annoyingly persistent as the ones in Manila. Moving on, if you need pasalubong of the non-edible kind, drop by Aldevinco. It's near Ateneo de Davao; along Claro M. Recto Street if I'm not mistaken. \r \r You can get all sorts of stuff here: Aladdin pants from Thailand (we call them \"Prince of Persia pants\"), long printed skirts from India and elsewhere, and stuff native to Mindanao. Prices go from cheap to steep, depending on the material and quality of construction. I got a real batik skirt for Php 800, while my sister-in-law got some Aladdin pants for 1.2k a pop. \r \r I was immediately drawn to one of the many stores selling cultured and natural pearls. My mom is crazy about pearls so I got her a necklace and bracelet set. What would ordinarily go for 1000 or more at SM, I got for 400 pesos (with a little bit of haggling hehe). Apart from pearls, you can also get accessories made from semi-precious stones and polished orange \"coral\" at prices that won't have you clutching at your chest in shock. \r \r Aside from clothes, you can also buy furniture, dried fruit, and bits and bobs to decorate your home with. \r \r After shopping, stop for a durian shake (if you can take the smell) at the restaraunt located in the middle of Aldevinco (forgot the name). This resto is halal, so nom away at the affordably-priced items on their menu: burgers, cake, etc. (Note: the durian shake is actually kind of nice.)\r \r If you like pomelo and can deal with paying 500 pesos for two pieces of fruit, there are pomelo vendors just outside Aldevinco. \r \r Tips:\r \r This place is very wheelchair-friendly.\r \r Even at noon, the place is nice and cool. \r \r If you don't want to buy anything, don't make eye contact!\r \r There's ample parking available."
	},
	{
		"User": "Philippines",
		"Location": "Philippines",
		"DateofReview": "May 16, 2012",
		"ReviewTitle": "Colorful Aldevinco",
		"Review": "The ALDEVINCO Shopping Center is a famous landmark in Davao City, located in a big commercial complex at the junction of Claro M. Recto Avenue and Manuel Roxas Boulevard. In my youth, we called it “ALDEVINCO” and it was our hang-out after school (nearby is the Ateneo U).\r \r After 46 years, ALDEVINCO still is a premiere shopping destination in Downtown, Davao City; where locals, balikbayans, and foreigners shop for “ pasalubongs” (souvenirs) to take home.\r It proudly showcases Mindanao’s heritage and culture, through its antiques and indigenous handicrafts. There are numerous colorful souvenir items that will keep your eyes and mind entertained. I especially love the Batik products (clothes & accessories), and the native Maranao and T’boli handicrafts and jewelries. Of course, the ubiquitous\r “made in China” wares are around….and a handful of Southeast Asian products as well. Note please that all these products are negotiable, especially when buying wholesale. It pays to speak the dialect (Bisayan, Tagalog) but the Filipinos are adept in English, so foreign tourists will not have a difficult time haggling for a good price\r You can also buy fresh fruits and the famous sweet Davao “suha” or pomelos and the exotic looking durian, marang, mangosteen, and rambutan. HAPPY SHOPPING AT ALDEVINCO!!"
	},
	{
		"User": "redhotchili09",
		"Location": "Manila",
		"DateofReview": "November 30, 2011",
		"ReviewTitle": "Davao souvenirs",
		"Review": "What I like about this place is that a lot of its products are local [though not necessarily from just Davao but Mindanao in general]. I love getting my sarongs for use at the beach there. I like the designs because they are unique. Some stalls also sell traditional cloths and clothing although a lot of them already come from neighboring countries such as Indonesia [since Indonesian clothing and those of Muslim Mindanao have similarities]. \r \r They also have small boxes which can be used as jewelry boxes that are inlaid with mother of pearls though these are not from Davao but from neighboring Muslim provinces in Mindanao. \r \r What I don't like about this place, however, is that Indonesian products are often passed off as local ones so you have to be careful about this. \r \r Aldevinco is very accessible and is near Ateneo de Davao and Marco Polo Hotel."
	}
]
