[
	{
		"User": "Jojo S",
		"Location": "Davao City, Philippines",
		"DateofReview": "2 weeks ago",
		"ReviewTitle": "all about davao",
		"Review": "everything you want to buy, name it you have it, known as bagsakan ng bayan, fruits,fish,meats,flowers, etc. a place you can bargain."
	},
	{
		"User": "calorie_dg",
		"Location": " ",
		"DateofReview": "August 19, 2017",
		"ReviewTitle": "A nice market for good eats and fruits",
		"Review": "Known as the bagsakan of the fruits especially durian, marang and mangosteen, Bankerohan Market is also great for dining as they have a certain area where all the barbecue stuff can eaten like pork, chicken and even the isaw. It also has a terminal going...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "June 30, 2017",
		"ReviewTitle": "Looking for fruits and fresh flowers",
		"Review": "We were looking for bunches of flowers and some locals were directing us to go to Bangkerohan Public Market. Since we needed it for chapel decorations we followed the direction at the same time we found out also a lot of fruits in season. The...More"
	},
	{
		"User": "oronzodd",
		"Location": "Italy",
		"DateofReview": "June 26, 2017",
		"ReviewTitle": "fruit and fish",
		"Review": "i have a theory; if you want to understand a people go to see his market. i love bankerouan because of the people, the fruit, the vegetables, the fish, the chaos, the smell, the colors, the prices and a lot of other reasons. as a...More"
	},
	{
		"User": "travelbug47london",
		"Location": "London",
		"DateofReview": "May 10, 2017",
		"ReviewTitle": "A local alternative to the city Malls",
		"Review": "Bankerohan market is both easy to find just off San Pedro Street and a very interesting contrast to the cool and well maintained Malls to be found in every city. Bankerohan is at its busiest in the morning when the vegetable, fruit and meat sections...More"
	},
	{
		"User": "Hamburg, Germany",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 25, 2017",
		"ReviewTitle": "Colorful and great",
		"Review": "Bigger than Agdao market. Every fruit and vegetables I'd there's a season for it somewhere. There's two mosques around that you should visit. Take your time to explore all things there. Or come more than once. Again the interesting phenomen with lots of fruit stands...More"
	}
]
