[
	{
		"User": "Patrice J",
		"Location": " ",
		"DateofReview": "3 weeks ago",
		"ReviewTitle": "Just visit once",
		"Review": "The weather is nice, it never gets hot. They have a mini cafeteria where you can eat snack but basically all you see is a \"farm\" of lettuce and other crops. Its something you can visit ONLY once and take a look around, 5ake a few photos for about 15 minutes. But a cheaper price to buy lettuce."
	},
	{
		"User": "jaquinne",
		"Location": "Davao City",
		"DateofReview": "March 5, 2018",
		"ReviewTitle": "COOL PLACE",
		"Review": "The place is quiet far but very nice. The entrance fee is consumable. Wear rubber shoes or sneakers. For those who want to see strawberry plantation, this is the place to go if you can't go to Baguio City."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "March 4, 2018",
		"ReviewTitle": "Great Farmland and refreshing cooler atmosphere in here",
		"Review": "The talk of the town farm located nearly outside the boundary of Davao City. Beautiful farm field with a lot of fresh vegetables for sale. \r \r While there, a refreshing coolness and mountain freshness is felt. We went there middle of the previous year with the group on a short trip passing this farm field. We bought vegetables and fruits from their store."
	},
	{
		"User": "Valdis A",
		"Location": "Kremenchuk, Ukraine",
		"DateofReview": "January 4, 2018",
		"ReviewTitle": "They started to charge entry fee",
		"Review": "Been here few times and the same nice view and ...nothing else.\r Not to go just there purposely if from Davao.\r Just on the way back from Buda, Viewpoint or just from the road trip out of the city.\r But I was surprised to see that they started to charge entry fee like 250 peso per person... if you 4 in the car, so it's comes like 1K! What about tourist buses? For what guys? Just to see how good you are? Or business not good anymore so need to have at least something? Before lots of people come to the shop to buy jam or vegetables, but for now just pay to enter - straight from the road.\r So... good for one time, but nothing else."
	},
	{
		"User": "Amy A",
		"Location": "Ithaca, New York",
		"DateofReview": "January 2, 2018",
		"ReviewTitle": "Pleasant area with fresh vegetables",
		"Review": "Nice stop during our trip in Highland Davao, we liked the freshly harvested lettuce we bought. There is a small restaurant and a good view of the farm with the plots and growing area,"
	},
	{
		"User": "Fay Fay Y",
		"Location": "Los Angeles, California",
		"DateofReview": "November 12, 2017",
		"ReviewTitle": "Good day-trip outside Davao",
		"Review": "This is a worthwhile destination outside of Davao City. You would definitely need to set aside a good part of the day for this trip due to the length of the drive. There is not much to do at the farm but the view to the farm and views at the farm are solid."
	},
	{
		"User": "MSCRob",
		"Location": "Lipa City, Philippines",
		"DateofReview": "September 23, 2017",
		"ReviewTitle": "Strawberries up close",
		"Review": "It was a great stop over travelling from Davao to Bukidnon..A bit difficult to locate the farm, no signage along the national highway..It was a good strawberry picking experience for a certain amount for the fruits harvested, no entrance fee and one can just stop over and take unlimited photos..such a refreshing area with strawberries, ornamentals, lettuce and a variety of herbs and spices. They also sell strawberry jam. Tourists travelling from Davao to CDO should include this farm in their itinerary!"
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 26, 2017",
		"ReviewTitle": "A place to relax away from the city",
		"Review": "Gong there, you need to bring a car because the place is not just along the road. A nice place to relax, with a cold ambiance and of course you can buy fresh organic lettuce, and if you are luck you pick strawberries too. You don't need to go to Baguio or Benguet for strawberries because we have that in Davao. But"
	},
	{
		"User": "Milany A",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 15, 2017",
		"ReviewTitle": "A W E S O M E !",
		"Review": "Worth every visit, worth the long drive from Davao City, their veggies and fruits worth every penny. I love their lettuce - so fresh and crisp! Too bad it was not the peak season of their Strawberries when we went there - but we're definitely going back! :-)"
	},
	{
		"User": "zylle p",
		"Location": " ",
		"DateofReview": "April 18, 2017",
		"ReviewTitle": "nice weather with a nice view",
		"Review": "We arrive at bemwa farm at around 4:30pm, it was already getting cold. We were welcomed by a red flower (i don't know what kind of flower) but it was very nice. We went to their store to try their strawberry taho but it was already sold out. We just bought their strawberry jam and some of our companions bought some fresh lettuce. The strawberries were not available during our visit. But still. it was a nice place to visit."
	},
	{
		"User": "Aimee T",
		"Location": " ",
		"DateofReview": "April 7, 2017",
		"ReviewTitle": "worth visiting",
		"Review": "worth visiting this place ,❤️ we spent our post christmas party @ Bemwa farm , they also have native roasted pig (for special order basis only)"
	},
	{
		"User": "jedainz",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 6, 2017",
		"ReviewTitle": "be early if you want fresh strawberries!",
		"Review": "There's not an activity you can do here really. It's a farm which supplies vegetables and berries in the city. You can just see the strawberry field and that's about it apart from you can buy strawberries (if you are early enough), jams and vegetables....More"
	},
	{
		"User": "rey m",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 16, 2016",
		"ReviewTitle": "Lovin' the weather",
		"Review": "The place is amazing. Amazing view, cold weather, friendly staff. Cheap veggies (for salad) but the strawberries are still quite pricey."
	},
	{
		"User": "David B",
		"Location": " ",
		"DateofReview": "September 14, 2016",
		"ReviewTitle": "Beautiful and serene simplistic day retreat",
		"Review": "A very simple and Spartan receiving area greets you upon arriving. In between preparing lettuce heads for delivery, the staff will gladly assist you in the most basic of needs and to point you in the right direction. The most important thing is to always...More"
	},
	{
		"User": "Nina C",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "September 6, 2016",
		"ReviewTitle": "something refreshing!!",
		"Review": "i love going to this place!! the cool winds blow and you see green all around you! you may want ro buy fresh produce like lettuce and strawberries. want to pick the strawberries yourself? you will have to come really early because they pick at...More"
	},
	{
		"User": "Lita H",
		"Location": "Manchester, United Kingdom",
		"DateofReview": "August 11, 2016",
		"ReviewTitle": "Impressive Panoramic View",
		"Review": "A lovely place to visit if you fancy looking at rows of vegetables and flowers that seems never-ending. You can buy these fresh from the farm shop at reasonable prices, too, if you arrive early."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "Nice farm visit, but nothing to buy.",
		"Review": "From Bukidnon on the way back to Davao, family made a turn to BEMWA FARMS. It was a long 15 minutes drive from the highway to the farm store. Nice farm views of vegetation and piped irrigation, but when we reached the farm store, there...More"
	}
]
