[
	{
		"User": "delight_2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 5, 2018",
		"ReviewTitle": "Serenade at the Beach resort",
		"Review": "The water Park is good and refreshing for both the children and adults, family members and guests. The white find sand beach, was good for your feet, the sea level for swimming and boating , just right, the view from the beach to the city of Davao and mountain view is very nice . There is music and some presentation for the enjoyment of the children and guests."
	},
	{
		"User": "Valdis A",
		"Location": "Kremenchuk, Ukraine",
		"DateofReview": "January 4, 2018",
		"ReviewTitle": "Place for weekend",
		"Review": "Went there with friends on the boat provided by resort. Clean, not expensive and fun for kids. Great for weekend with family or friends"
	},
	{
		"User": "Spartan B",
		"Location": "Pagadian City, Philippines",
		"DateofReview": "November 16, 2017",
		"ReviewTitle": "Slide It Up",
		"Review": "Perfect for your family and friends who want to take a break from the noisy City. Unlike other resorts, BlueJaz is quite cheaper. It has live band, magic show and face painting all for free. And oh, don't forget to check the resort's crazy slide that your kids will surely enjoy. Lastly, go find the Clown, she has something for your kids. "
	},
	{
		"User": "streeteasy55",
		"Location": "New York City, New York",
		"DateofReview": "August 7, 2017",
		"ReviewTitle": "chillin'",
		"Review": "we went on a weekday and superb. You got the feeling of having your own resort. Just a handful of guests in spite of a rainy day. The staff are very friendly and helpful. The resort is clean. The room needs a little updates but not an issue with us. The resort have their boat to transfer people from the island to the mainland and vise versa. Great for friends. Recommended."
	},
	{
		"User": "Mick B",
		"Location": "Southampton, United Kingdom",
		"DateofReview": "October 6, 2016",
		"ReviewTitle": "Dissapointed",
		"Review": "Looked at the leaflets for Blue Jaz and thought it would be nice to visit. I found the place quite run down and in need of tidying up a bit, it is a great location right on the beach, and the staff were very friendly."
	},
	{
		"User": "PrettyAngel2014",
		"Location": "Doha, Qatar",
		"DateofReview": "September 25, 2016",
		"ReviewTitle": "Family Holiday",
		"Review": "There is nothing compared fun with a Family Holiday. Since all my cousins living abroad came to visit this place was the most affordable place we have visited. Pool, beach karaoke machine slot. It depends on which type of fun you want. Jets ski Banana boat ride and everything."
	},
	{
		"User": "GOFAR71",
		"Location": "Philippines",
		"DateofReview": "August 11, 2016",
		"ReviewTitle": "Needs a bit more to compensate for the beach.",
		"Review": "I've reviewed already the beach facility for this resort and the Water Park should step up a bit to make up for what the beach lacks. The tube slides are ok as they are. Maybe just a few bit more fun things added to keep the guests mind off the beach."
	},
	{
		"User": "Maia_0515",
		"Location": "Davao City",
		"DateofReview": "May 25, 2016",
		"ReviewTitle": "Beach with great facility",
		"Review": "Been here many times and I've seen the development of this resort on my every visit... \r This is one of my favorite beach as this is only around 15minutes away from the city via barge as provided by the resort..\r \r They have huge area to do some activities, slides and etc to let the young ones exhaust their energy.. Except that I have not checked their food as we always visit the place with our own food... \r \r Nevertheless this place is one of the best summer destination in Davao City..."
	},
	{
		"User": "Veness Ehrn G",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 16, 2016",
		"ReviewTitle": "THE IRONY OF PARADISE",
		"Review": "These place is supposed to have one of the best resort facilities in Davao Region. To our disappointment when we had a family outing we find the place in serious state. Slides were terrific but were not able to used it because its either broken or unfinished. Staffs were unaccommodating. Its a disheartening experience."
	},
	{
		"User": "prettymichele",
		"Location": "Singapore, Singapore",
		"DateofReview": "March 30, 2016",
		"ReviewTitle": "Water jazz",
		"Review": "I been here with friends from manila and found its nice and cool place we do boat riding island hopping from vanishing island so many colorful starfish its nice etc,"
	},
	{
		"User": "chollinss",
		"Location": "Long Beach, California",
		"DateofReview": "February 22, 2016",
		"ReviewTitle": "Warning for \"island hopping\"",
		"Review": "Paid 3000 pesos for \"island hopping,\" but all they did was take us to the giant clam sanctuary about 30 min away from the resort via boat ride then take us back!! The clam place was beautiful, but not worth the pricey boat ride! Definitely not island hopping! "
	},
	{
		"User": "Zoya L",
		"Location": " ",
		"DateofReview": "February 11, 2016",
		"ReviewTitle": "Terrible experience!",
		"Review": "I and my husband passed by the place to have lunch and a daytour. Unfortunately, most of the food on their menu were not available as well as most of their watersports activities. There were flies around while we were having lunch. There were no decent shower rooms for day tour customers. We left the place unsatisfied."
	},
	{
		"User": "AlyannaReinhardt",
		"Location": "Frankfurt, Germany",
		"DateofReview": "February 1, 2016",
		"ReviewTitle": "Untidy and lacks attraction",
		"Review": "I didn't like the location, it was dirty! Availability of food is poor, the staff are not very hospitable. The pool is dirty too."
	},
	{
		"User": "TRCleebai",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 10, 2016",
		"ReviewTitle": "Fun!!!",
		"Review": "Went there last February with my boyfriend for a day tour. We had so much fun with their slides!!!\r The food was average, the price was reasonable and the location is great. They have a lot of water activities that's worth the try. \r \r  We'd love to come back again"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 15, 2015",
		"ReviewTitle": "Torn between the old and the new",
		"Review": "I love the OLD BlueJaz.. bigger space, bigger pool etc.. now that they have done some renovations, I'm a bit disappointed because instead of expanding the place (the place gets packed all the time), they cut off more than 1/4 of the land area -- especially on the pool area. \r \r amenity wise, they need to add something new for the people to look forward to.\r PS: the food they serve is yummy."
	},
	{
		"User": "seeingtheworldtoday",
		"Location": "Perth, Australia",
		"DateofReview": "December 5, 2015",
		"ReviewTitle": "Just a bit to pricy",
		"Review": "it is all ok. if it would cost have of the price. espescially the food is not worth the price. there are better places on samal."
	},
	{
		"User": "Mortanah",
		"Location": " ",
		"DateofReview": "November 15, 2015",
		"ReviewTitle": "holiday on Samal",
		"Review": "Hire a some shelter and spend day in the water but the only downside is way to many rocks in the water. The water is crystal clear and warm."
	},
	{
		"User": "audmonamikaela",
		"Location": "Lillestrøm.norway",
		"DateofReview": "September 7, 2015",
		"ReviewTitle": "A little lame",
		"Review": "Being that I have been to some larger water parks, this place was a bit of a let down. When I went there was only two slides that were working. The entry fee was not expensive but after you have gone down a couple times you are done. The beach here was alright for swimming in and they also had a nice pool if you don't enjoy the salt water. You can get food and drinks here or rent a hut and bring your own."
	},
	{
		"User": "CdoLzl",
		"Location": " ",
		"DateofReview": "July 14, 2015",
		"ReviewTitle": "far from my expectations",
		"Review": "the location was ok, but sad to say that i expect much from this resort, but my expectations were not satisfied. the cottages were far from the sea. I was with my family and relatives from Manila when we went here. Sad to say that I did not enjoy their amenities. Their service needs to be improved."
	},
	{
		"User": "CDO",
		"Location": "CDO",
		"DateofReview": "June 24, 2015",
		"ReviewTitle": "BlueJazz",
		"Review": "a good place for kids who love to stay long in the pool...they have a long slide to give you thrill & excitement."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 22, 2015",
		"ReviewTitle": "Island recreation",
		"Review": "The difference between BlueJaz and the other resorts in Samal is that they have an infinity pool, giant slides, and a tropical island-inspired bar. The food and entrance rates are also reasonable, and it is very accessible from mainland Davao :-)"
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "February 13, 2015",
		"ReviewTitle": "Surely better in future",
		"Review": "As many others stated here already: Samal Island has almost 40 different good, very good but also some very poor beach resorts. Blue-Jaz Water Park went through several ups and downs. I am hoping and praying for more then average in future. Present news about...More"
	},
	{
		"User": "gin r",
		"Location": "Minnesota",
		"DateofReview": "February 11, 2015",
		"ReviewTitle": "how far from this place from bus terminal davao? can we ride a bus to get this place?",
		"Review": "just wondering how far this area from bus terminal? anyone knows? I haven't been in this area and my family and I planning to visit this area soon. can anyone tell me how far from this area from Davao terminal bus? what is the best...More"
	},
	{
		"User": "Samy N",
		"Location": " ",
		"DateofReview": "November 22, 2014",
		"ReviewTitle": "Crystal Water & Fancy Life",
		"Review": "It's such an amazing island life, my room was front the beach i used to wake up at 5:30 AM go for swimming at crystal water amazing white sand beach, giant slide is a fun experience for adult and kids, another fancy swimming pool front...More"
	},
	{
		"User": "happysappypappy",
		"Location": "helps",
		"DateofReview": "October 25, 2014",
		"ReviewTitle": "Blue Basura (Garbage)",
		"Review": "My wife had visited this place on numerous occasions so we brought her family there for a day of fun. What we found was a run down dump. My wife could not believe how much it had changed in 4 years since her last visit....More"
	},
	{
		"User": "AnjDeTorres",
		"Location": "Manila, Philippines",
		"DateofReview": "October 15, 2014",
		"ReviewTitle": "Nothing Spectacular",
		"Review": "I was excited for our trip to Davao and was surprised that BlueJaz only looked nice on photos. The beach was okay but not something I expected considering that I heard good reviews about Samal - probably I had booked the wrong place. The food...More"
	},
	{
		"User": "Helen B",
		"Location": "Dubai, Dubai, United Arab Emirates",
		"DateofReview": "October 8, 2014",
		"ReviewTitle": "same old thing",
		"Review": "Been here for the nth times so far not much to complain but the slides for the children needs maintenance as the paint of the slides gets rough, food and drinks should have more choices, the room needs more mops on the floor especially on...More"
	},
	{
		"User": "TangAdrao",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 28, 2014",
		"ReviewTitle": "giant slide... and nothing else to expect...",
		"Review": "We had our unplanned weekend getaway in Samal with my whole family during my break. We ended up with BlueJazz since none of us yet have ever been here. To get things straight the whole resort is average. It's beach is not that big since...More"
	},
	{
		"User": "Yuna Y",
		"Location": "Manila, Manila, Philippines",
		"DateofReview": "August 21, 2014",
		"ReviewTitle": "Blu Jazz rendezvous",
		"Review": "Blu Jazz is a nice resort to go to. The beach is clean and they have swimming pool. It is also a great venue for parties, team building and get together events. They have a restaurant and a bar with reasonable prices. The eternity pool...More"
	},
	{
		"User": "sabi0james",
		"Location": "Manila, Philippines",
		"DateofReview": "June 3, 2014",
		"ReviewTitle": "a good place to unwind",
		"Review": "It's a short boat ride from the city to this Samal island resort. The resort area is huge with many things one can do while staying there. Although i only spent a few hours here, i can see many guests occupying the many resort rooms...More"
	},
	{
		"User": "oyemaria",
		"Location": "Manila, Philippines",
		"DateofReview": "June 3, 2014",
		"ReviewTitle": "don't expect too much",
		"Review": "we stayed here May 2014 for a night. \r \r standard rooms which were originally assigned to us won't give you a feeling that you're in a beach - it was all concrete, basic amenities, clean but not well maintained. So we requested for another room, a bigger one with native architecture called FIJI rooms. it was way too different from the standard rooms. It looked relaxing and tremendously spacious. we loved the bathroom because natural light comes in as you shower, half of the ceiling was only made of something like you use on screen doors. Beware when it rains, you get wet after you finish your bath so you better step out of the shower right away afterwards. There were ants everywhere so don't leave any food outside the fridge. \r \r Employees are all friendly and would always offer a smile to you. but it's just sad that the amenities appear not very well taken care of. \r \r What i don't appreciate in the beach area is they put walls in the water that serve boundaries in between resorts. for security reasons, it's may be good but the view of the entire ocean is blocked by those damn things. \r \r the room we got was a bit pricey. north of Php5k for 3 persons and yet you have to pay for the extra mattress for the third person. not worth it if you ask me."
	},
	{
		"User": "MsJinny123",
		"Location": "New York City, New York",
		"DateofReview": "April 4, 2014",
		"ReviewTitle": "Terrible, terrible, terrible",
		"Review": "I booked on line for this resort in 2011 because of what it presents in the website. Never again I will do this. You have to ask the locals for the best attraction. The swimming pool is murky. You cannot order food because everything is not available and when we asked what was available, the waiter told us to look on the menu. When we looked on the menu and asked the waiter for it--she said it is not available and we cannot bring any food from the outside at all. The only thing is that the water slide is good for my son--aside from that--everything is terrible."
	},
	{
		"User": "harold02366",
		"Location": "Singapore, Singapore",
		"DateofReview": "March 27, 2014",
		"ReviewTitle": "One night is not enough",
		"Review": "Been to this resort for the first time last Mar 21-22 so we're very excited, kids and kids-at-heart most especially. My kids love the beach and the gigantic slide. They also love the fire dancers which normally performs every Fridays and Saturdays. The beachfront is awesome with white sand and very clear water. We also love the food and the Fiji room where we stayed for 1 night. The Fiji Room is very spacious and able to accommodate my entire family with some extra beds. Those are the good points, but unfortunately I find few things that are unacceptable and needs improvement as follows:\r 1. Attending multiple guests at one time, this caused us delays in the check-in which took us about half an hour.\r 2. Ordering a food in the restaurant took a very long waiting time, about 45-60 minutes. This happened not only once but thrice. To be fair, the food is quite good and not pricey.\r 3. Ordering a cocktail drinks at the bar in the evening also took us at least half an hour. Only I found out that the bar tender was also the waiter, fantastic ;)\r 4. The infinity pool was closed when we arrived last Mar 21, 2014. It was opened the next day but the water seems cloudy. I asked the staff why and he said they have not done the water treatment fully as the pump is faulty.\r 5. Gigantic Slide was supposed to be open at 830am but in actual they opened only at 1030am last Mar 22, 2014, and the reason is the same on point 4. My kids seemed unhappy because they're left with a little window coz we'll be checking out at 12pm.\r 6. Pirates Revenge slide was not clean and it's not safe for kids. In fact, my daughter got a small wound due to some rough edges on the pool and slide and she even found a small pin.\r \r We still prefer to be back in Samal soon but maybe in another resort."
	},
	{
		"User": "Dee G",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "October 24, 2013",
		"ReviewTitle": "OK Choice if You Don't Have Anything Else",
		"Review": "Samal island has a lot of beach resorts, and I have to admit that Blue Jazz is one of the more developed ones. For instance, they have clean room available if guests want to stay overnight. They also have a restaurant, a swimming pool, a reception area and running water - something that a lot of other resorts doesn't have. Transportation to the resort is also really easy, as they have boats taking guests from Davao directly to Blue Jazz the whole day. \r \r One of the greatest things about Blue Jazz is that they provide entertainment. Some weekends, they have fire dancers and musical bands to entertain the guests. They also rent out these small paddle boats which kids can use. \r \r However, the place is nothing breathtaking. It's an average beach resort, and it can get really crowded especially in the weekends. The water from the sea also gets shallow during low tide, so much that you can't swim unless you walk a good distance. Because guests can't swim in the water, they all gather in the pool and then it get's too crowded you can hardly breathe. \r \r Overall, a nice resort to spend a lazy afternoon away, but don't expect to be able to enjoy the water as much as other (less crowded) resorts."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "October 18, 2013",
		"ReviewTitle": "Good Swimming Spot",
		"Review": "Entrance fee 90 peso each, cottage approx 300 peso, additional waterside fee 90 peso for day, jet ski 4,500 per hour, banana boat (min 4 , max 5) 300 peso each. \r Lovely spot to unwind and the coffee shop has the best coffee frappes I have had in the Philippines. We hired the jet ski for two hours, it broke down and we only got an hour but no refund! Banana boat is excellent but you do have to wait quite some time for the operators to get organized - they stand around thinking for at least fifteen minutes. Great place for families - just take your own food and drinks as it can be quite expensive."
	},
	{
		"User": "JenAspacio",
		"Location": "Manila, Philippines",
		"DateofReview": "March 29, 2013",
		"ReviewTitle": "Overnight stay was not spectacular",
		"Review": "Cheaper resort as compared to others in Samal. I find the sand too rough for my feet to tread on. I like Paradise Island's more. BlueJaz should try to better maintain their resort."
	},
	{
		"User": "CuriousGeorge45",
		"Location": "Orlando, Florida",
		"DateofReview": "March 9, 2013",
		"ReviewTitle": "Nice place for a relaxing day at the beach",
		"Review": "I recently spent a Saturday here recently and was very satisfied with the experience. I took a taxi to Km 11, took the public ferry over to Babak and hopped a short motorbike ride to the resort. All in all, took about 1 hour from my downtown hotel. \r \r The entrance fee was 90 peso. Staff were friendly and the food service was good relative to some other Filipino establishments I have been in. I just used the beach and pool facilities. The place was not very busy and I did not see anybody using the waterslide. One thing to watch out for is the tide - if it is out the beach area is slightly rocky. Another thing that not many people point out is that you are looking at the Sasa shipping wharf which is about 2000 meters from the beach - not some pristine ocean view."
	},
	{
		"User": "Gerry d",
		"Location": "Macabalan, Cagayan de Oro, Philippines",
		"DateofReview": "February 6, 2013",
		"ReviewTitle": "it has many good amenities, fair price, spacious pools",
		"Review": "you can choose diffrent sizes of swimming pools, its has long,great slides, very good scenisc views,. the more amenities to choose from like there are many huts ariund where you can sit and enjoy,the bar is spacious, lots of food to choose , the area is neat and clean , well maintain"
	},
	{
		"User": "MAricel23",
		"Location": "Bukidnon",
		"DateofReview": "January 30, 2013",
		"ReviewTitle": "nice place",
		"Review": "we were here for an outing and I was amazed because the Staff were really friendly and accommodating since the night we arrived. They helped us a lot through. We enjoyed the fire dancing and it seemed that you are in Boracay. Then your things are safe because lots of security guards are kept on roaming around. Their shower rooms are well good, you can find a lot. The beach is clean and totally a white sand"
	},
	{
		"User": "JohnB710",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 1, 2013",
		"ReviewTitle": "Overrated and Overcharged",
		"Review": "These host try to make this a five star place but the food is not that good and they charge seperate to use the water slides which never run because of this policy........"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "December 6, 2012",
		"ReviewTitle": "Lively and pleasant place to bring friends and family.",
		"Review": "Kids love this place, but be sure adults can be with them as they roam around and enjoy the amenities. The beautiful swimming pool and and the nice sunset to blend with it make a wonderful evening dip. You'll enjoy this place too."
	},
	{
		"User": "getright",
		"Location": "San Diego, California",
		"DateofReview": "July 30, 2012",
		"ReviewTitle": "OK",
		"Review": "Its a little small water park very basic but good day out for fun and somethig to do with the whole family just watch your cost because every thing their adds up in hurry but not bad day of fun"
	},
	{
		"User": "summerlovin_10",
		"Location": "quezon city",
		"DateofReview": "July 21, 2012",
		"ReviewTitle": "Uh. Not much.",
		"Review": "I was excited going back to samal island and when i heard we were going to bluejaz, i cannot sleep. I googled it and found it pretty interesting. When we got there i was pretty disappointed since the pool was crowded and boisterous boys are...More"
	},
	{
		"User": "kdsmithjr",
		"Location": "ithaca, ny",
		"DateofReview": "July 12, 2012",
		"ReviewTitle": "A place to take the kids, but adults might not rave.",
		"Review": "The place is a little on the crowded side and the food is just ok. But if you have kids, they will love the beach and the other rides. Adults may feel a tad nickled and dimed for everything though. There are better amusement type...More"
	},
	{
		"User": "lenie",
		"Location": "almere",
		"DateofReview": "July 8, 2012",
		"ReviewTitle": "when you are not used to anything go here",
		"Review": "the beach is real for children max depth 50 cm, there are a lot of things standing on their list what you can do, but most is not availabel or broken, don,t bring anything with you when you go there , because when you enter...More"
	},
	{
		"User": "Ed I",
		"Location": "Davao",
		"DateofReview": "May 29, 2012",
		"ReviewTitle": "What a waste of time",
		"Review": "Everything was disappoinrting. Water on waterslide was very dirty. The food we ordered was very bad. The room we rented had a/c leakng water over our bed. Only 3 channels on tv. Dirty floor and wne turned on the light at night, huge roaches on...More"
	},
	{
		"User": "Angel A",
		"Location": "Manila, Philippines",
		"DateofReview": "May 14, 2012",
		"ReviewTitle": "The Accommodation and Experience",
		"Review": "The place was unbelievably beautiful. Plus the services was great."
	},
	{
		"User": "travelafeme",
		"Location": "QCPhilippines",
		"DateofReview": "May 4, 2012",
		"ReviewTitle": "Water fun",
		"Review": "The entrance fee is 90 pesos per person. Another 90 pesos for the huge slides. The beach area is quite clean. The infinity pool is clean with a water fountain. We did not bring food so we ate at the restaurant. The food was good...More"
	},
	{
		"User": "Jeremy N",
		"Location": "Dover, Delaware",
		"DateofReview": "March 4, 2012",
		"ReviewTitle": "Very nice place....well maintained and fun.",
		"Review": "Bluejaz is the only place i have been too on Samal Island and I must say its really nice! The pools and the beach are sooooo clear and clean and the food there is very good and reasonably priced. I would suggest going during the...More"
	},
	{
		"User": "Rich0807",
		"Location": "somewhere in the world anywhere",
		"DateofReview": "March 3, 2012",
		"ReviewTitle": "Good for kids (young and old)",
		"Review": "quiet a good resort but like a lot of places here in the Philippines it needs to have attention to detail and finishing service is ok but when busy difficult to get served at your table so you are better off going to the bar...More"
	},
	{
		"User": "Iampinoy",
		"Location": "International",
		"DateofReview": "March 2, 2012",
		"ReviewTitle": "It's a nice day trip excursion",
		"Review": "BlueJaz Resort is just minutes from the ferry. It's really nice. I rode a moto down with the family. The entrance fee is $90 pesos per person. This place is in my opinion the best for those traveling with small children and teenagers. There is a little pool area for them to play and there are slides for them as well as for adults. The food was good. The little beach area is quaint and nice. The place is clean and the bathrooms are better than some would expect. It's truly worth it. Each little stand has a light and electrical outlets so if you have anything from a tablet to a psp you can bring them and plug them in. The cool thing is the 90 php entrance fee also includes a ferry ride back to Davao City but the last boat leaves at 5pm. The little boat is cool and its faster than the ferry."
	},
	{
		"User": "jaquinne",
		"Location": "Davao City",
		"DateofReview": "February 3, 2012",
		"ReviewTitle": "my experience",
		"Review": "the open cottages are so close to each other you can't relax because the place is so crowded, it is best if they will rearrange the open cottages and tables..."
	},
	{
		"User": "Jen L",
		"Location": "Tokyo, Japan",
		"DateofReview": "November 24, 2011",
		"ReviewTitle": "Relatively Fun",
		"Review": "This is a review of the water park areas of Bluejaz Resort in Samal Island, Davao. \r \r For pools, guests can choose from (a) a regular swimming pool with a fountain; (b) a kiddie pool with slides; and (c) a pool with giant slides. The cleanliness of (a) and (b) were dubious, but (c) looked pretty clean and was the best pool of the lot. Guests of the hotel get a certain number of tickets to ride-all-they-can in the giant slide area until 5 PM.\r \r There are three giant slides. One can take an inflatable raft or just slide the classic way. There are two white slides with the requisite scary turns; then there's a third blue giant slide that was very wide but appeared to be closed on the day that we visited.\r \r The staff seemed kind of creepy but they did a good job of making sure we were sliding safely. One weird thing was they made us rent the inflatable raft. There were no signs that we had to rent the raft so I'm not sure if they tricked us into giving them Php 100. It's not like we received a receipt or anything.\r \r For beaches, there are two beach areas protected by a breakwater. Bluejaz doesn't have a long shoreline -- the docks for the boats that take the guests to the resort break up the shoreline so there's no long shoreline to jog on unless you run on the very short docks. One beach is for swimming. It's pretty rocky so bring swim shoes. The other beach is for swimming and water sports. It's murkier but garbage-free. They have a jetski, a boat paddled by hand, a Flyfish and a banana boat. They provide vests to keep guests safe.\r \r We only paid extra for the raft and the banana boat. Swimming was free for guests."
	},
	{
		"User": "darkclouds",
		"Location": "philippines",
		"DateofReview": "July 29, 2011",
		"ReviewTitle": "NIce beach but service is a so-so",
		"Review": "I booked their Fiji room and it was huge! Room is nice and clean, they have a nice private beach but, their customer service kinda sucks.. food arrives late all the time! their staff are nice and friendly, its just that they cant keep up with the guests request because they're under staffed."
	},
	{
		"User": "trondolav",
		"Location": "Finnoy, Norway",
		"DateofReview": "June 29, 2011",
		"ReviewTitle": "nice and quiet",
		"Review": "I've only been on Bluejaz resort on day trips, so I know nothing about the accommodation facility.\r  Bluejaz is the place I go to relax by the pool, eat well drink well.\r  and when you want to get away from the city rush and noise\r  if I'm going to put a finger on anything it is too few sunbeds."
	},
	{
		"User": "David J",
		"Location": "Vancouver, Canada",
		"DateofReview": "May 22, 2011",
		"ReviewTitle": "Nice place but very quiet.",
		"Review": "The BlueJaz resort was empty when i was there on a weekday in March 2011. I was staying next door at Paradise Island Resort ( very, very nice! My 3rd stay at PIR.) There was only one water slide open but we could still ride as many times as we liked with 0 lineups. There's a zip line there also, cost about 90p a ride, worth a shot once. There is an Infinity pool near the beach and a nice bar/restaurant worth having a swim or a drink by. The worlds largest fruit bat cave is about a half hour away (1,800,000 bats, very cool to see!) There always guys at the back exit to the resorts that will give you a m/c ride to the caves. Samal Island is a great place to spent 2 or 3 days relaxing on the beach."
	},
	{
		"User": "Fevan",
		"Location": "Davao City",
		"DateofReview": "April 26, 2011",
		"ReviewTitle": "An Amazing Holy Week Experience",
		"Review": "We had our holy week vacation at bluejaz to make a new experience, my friends keep telling me to visit the beach. I then recommended it to my family to go there. We had so much fun, the beach was almost crystal clear and the sand is pulvorized, the stay was very comfortable."
	},
	{
		"User": "thetravellinghker",
		"Location": "Hong Kong, China",
		"DateofReview": "January 29, 2009",
		"ReviewTitle": "Good View. Bad Facilities",
		"Review": "We went to Bluejaz Resort this morning till afternoon (29 January 2009) with 2 adults and 3 kids.\r Bluejaz Resort is conveniently located on the edge of Samal Island. You can literally just walk to the port about 5-minutes from Nova Tierra Village (Drifters Apartel and British Bar - see Hotels section, where I stayed in Davao) or Hotel Elena. The boat however, was very overpriced compared to what they advertised and other similar route boats. They charged me Php 30 for a one-way trip, much different from what they said on their website quoting \"Boat Transfer (extra Php 15.00 Each way)\". Other boats to Samal Island were just Php 7.5 each way. Maybe they saw we were tourists, thus making the fee much higher. When I tried to bargain, they said \"Sorry sir. Oil price is very high and we make fare higher\". But oil prices have dropped by nearly 3/4. Oh well, it was only a difference of Php 15 anyway.\r At the resort, the beach was just a small 20-40 metre piece of sandy land. The \"exclusive private beach and pearly white sands\"? Another lie. The beach itself was hard with broken shells everywhere and the water was covered mostly in litter or algae of some kind. Nobody went in. \r The waterslides were one of the decent parts of the resort. I just wished they had more, the three waterslides did not quite cater for the tens to hundreds of people there. The few months old waterslide area labeled as 'brand-new' was beginning to tear but were still usable. Water was a bit dirty, not enough drainage holes and purifiers. Also, it's not safe enough, I noticed I got quite a number of bruises and bloody knees after exiting the area.\r Now onto lunch. Lunch there was pretty decent (a little adjusted to local Filipino's tastes - sweet) but quite expensive (compared to local prices) at about Php 210 a dish. Service was slow, had to remind them here and then. However, I don't really know if I ran into luck at my stay but the chefs forgot to tear off the plastic from the beef on my fried rice. I told them to immediately replace it, who knows if there's any harmful effects from heated plastic?! \r Swimming pools had a nice touch to it, but with lots and lots of chlorine (the smell was very strong). The guidelines at the entrance already stated \"The management takes no responsibility for reactions related to chemicals in the pool\". They have one main pool (mainly for adults - some teenagers and kids) and a small one (kids/toddlers) with the main one spilling water to the small one. The pools had a nice view (kind of like Hong Kong's Victoria Harbour) with cargo ships and planes passing by. Changing rooms were too small, only enough room for 3 people at a time, so there were lines outside during peak times. When we went back to the port, we found an ice cream shop, one bar for about Php 25. On my way back to Drifters, I found another shop sold them for only 11. A difference of Php 14. I will never come back to Bluejaz again.\r Overall, if you want a good experience, try Paradise or Pearl Farm instead. It should offer an exeptional experience."
	},
	{
		"User": "StravellerSingapore",
		"Location": "singapore",
		"DateofReview": "November 22, 2008",
		"ReviewTitle": "Fun day out at the waterslides",
		"Review": "This is the newest attraction in Davao/ Samal island. We had a fun time during our stay. My husband and two children spent most of the day on the waterslides. The Waterpark is attached to Bluejaz resort but is open to the public for day visits (90 peso admission, includes free unlimited use of beach, three swimming pools, childrens water play area with water jets. They have have a boat service to the mainland from the island 15 pesos each way, the boat ride takes about 3 minutes. The waterpark has jetski rental water ski-ing, dive instruction, tube rides and childrens battery powered jetskis for rent.\r The park is clean, well constructed and well run. \r I highly recommend this placeto cool off on a hot day. We stayed for 5 days in a Fiji style cottage beside the pool. There is a bar and restaurant at the waterpark."
	}
]
