[
	{
		"User": "Mary Armi M",
		"Location": " ",
		"DateofReview": "March 17, 2018",
		"ReviewTitle": "Small but Interesting",
		"Review": "I have been so afraid of butterflies before but this place has a lot of friendly butterflies. They just come to you. It's so small but interesting."
	},
	{
		"User": "Acid P",
		"Location": "Tagum City, Philippines",
		"DateofReview": "March 16, 2018",
		"ReviewTitle": "Weekend Get-away",
		"Review": "All about butterflies, they have different pictures and also information about butterflies, different species etc. They also have this butterfly garden in which you can see different colors/kinds of butterflies. Great way to educate children and just near Crocodile Park."
	},
	{
		"User": "RheivenRei",
		"Location": " ",
		"DateofReview": "August 26, 2017",
		"ReviewTitle": "Be with a Butterfly",
		"Review": "Awesome tour!! Their personnels are accommodating, they are provide explanation and information about different butterflies. Good for children to learn and be connected to nature."
	},
	{
		"User": "Arnold and Dian... H",
		"Location": "Phnom Penh, Cambodia",
		"DateofReview": "August 24, 2017",
		"ReviewTitle": "Small but beautiful butterflies",
		"Review": "There were lots butterflies to see but only about four different kinds. We had a couple of them land on us too. The entry price was included in the Crocodile Farm and is just a walk down the road from it. You do see that the Butterfly Farm is surrounded by a cock-fighting place. The beauty of the butterflies is worth a look however you won't need to spend more than thirty minutes looking around."
	},
	{
		"User": "Norm H",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "May 10, 2017",
		"ReviewTitle": "Walk among butterflies",
		"Review": "A simple garden, closed off with netting, with lots of butterflies flying around. Spend a few minutes just walking around watching. Can't do this every day..."
	},
	{
		"User": "HanaCarrera",
		"Location": "Pangasinan, Philippines",
		"DateofReview": "April 17, 2017",
		"ReviewTitle": "Seedy little place-- but the pretty butterflies all made up for it!",
		"Review": "The entrance to the Butterfly House (located 300 meters from the Crocodile Park) is included with the ticket to Crocodile Park (Php 250). The place is small and looks old and run-down with uncaring staff. There were posters about the life cycle of the butterfly but no one was employed to explain.\r \r My sister and I both started to feel as if we've been ripped off but that mindset changed when we moved to the Butterfly garden itself. Quiet and serene, with lots of shade and benches, we watched in awe as swarms and swarms of butterflies whizzed past us from all directions. Beautiful!\r \r In summary, you could easily spend 5-10 minutes in this place. Yes, the butterflies are beautiful but I won't go back unless they improve it."
	},
	{
		"User": "jedainz",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 19, 2016",
		"ReviewTitle": "Very few butterflies. Not well kept.",
		"Review": "I didn't see a lot of butterflies. The place needs improvement. Maybe add and educational tour or what? Nothing special."
	},
	{
		"User": "MrAngry50",
		"Location": "Oman",
		"DateofReview": "October 7, 2016",
		"ReviewTitle": "Flutter by any time.",
		"Review": "No real welcome at the door, occupant more interested in sticking his pupae to a string. Very rundown, lacks any sort of clean, or investment. There are exhibits which are fascinating, shame they are incarcerated in such a place, probably better to let them free."
	},
	{
		"User": "meomunbeou",
		"Location": "Ho Chi Minh City, Vietnam",
		"DateofReview": "September 15, 2016",
		"ReviewTitle": "It's a joke",
		"Review": "It's just a joke. A small garden house with some butterflies. The garden looks ugly with some trees and unknown flowers. Just took 5 minutes to discover."
	},
	{
		"User": "New Taipei, Taiwan",
		"Location": "New Taipei, Taiwan",
		"DateofReview": "August 13, 2016",
		"ReviewTitle": "Interesting take on butterflies",
		"Review": "Although the species of butterfly are lesser than what I expected but the guide was very humorous and made mundane stuffs sound interesting. They even helped us take pictures that made us feel like we are \"human butterflies\". Had fun!"
	},
	{
		"User": "Constantin106",
		"Location": "Constanta, Romania",
		"DateofReview": "June 14, 2016",
		"ReviewTitle": "Expecting more!",
		"Review": "Far to be a so called \"butterfly house\"! Few butterflies only in a restricted area, few larvae exposed on a panel, and that's it! No butterflies, no guide, no house!"
	},
	{
		"User": "Eri W",
		"Location": " ",
		"DateofReview": "April 15, 2016",
		"ReviewTitle": "So many butterflies ♥",
		"Review": "In this area, you can observe their actions very close. You can also take photographs so this place is nice for photographers that love to capture little creatures and to those people that are very interested for the life of butterflies."
	},
	{
		"User": "Nwrzx",
		"Location": "Jeddah, Makkah, Saudi Arabia",
		"DateofReview": "March 23, 2016",
		"ReviewTitle": "Part of our tour",
		"Review": "Davao Butterfly House normal park, you may have some information about different butterfly families and it lives. It's good for people who love the neutral life."
	},
	{
		"User": "LanzSister",
		"Location": "Ormoc",
		"DateofReview": "January 28, 2016",
		"ReviewTitle": "Not wild, Not Young But Free",
		"Review": "Visiting the place reconnects your childhood experiences wherein you do chased butterflies and dragonflies. In this attraction you will be free to see them but you don;t have to chase them for they will hop gracefully near you. Added is the mini children park of...More"
	},
	{
		"User": "Flatlander131313",
		"Location": "Belle Fourche, South Dakota",
		"DateofReview": "December 26, 2015",
		"ReviewTitle": "NIce place to visit",
		"Review": "This was a nice place to visit while in Davao. They also have room accommodations if desired. A good place to spend the day."
	},
	{
		"User": "Veness Ehrn G",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 11, 2015",
		"ReviewTitle": "Family Educational Trip",
		"Review": "I was with the whole gang... This place is very good for kids and for adults that are interested with living things. My niece and nephews were very delighted watching the butterflies and were more ecstatic when it rest on their arms, shoulders or heads....More"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 2, 2015",
		"ReviewTitle": "there are only 10 butterfly here",
		"Review": "i love hanging out in this part of the city.. close to the river. having a lunch and taking tourist to this spot. the crocodile park is pretty ok. but this butterfly house is so bad maintained. bah.. we paid a 100 pesos to get...More"
	},
	{
		"User": "Benbaominh",
		"Location": "Brussels, Belgium",
		"DateofReview": "September 16, 2015",
		"ReviewTitle": "If you have time...",
		"Review": "15 min walk from Crocodile park (no organized transport). Interesting because not many things to see in Davao City. One big place where you will see many different butterflies. Some will land on your shoulders. But we were tired after visiting Crocodile Park. After, difficult...More"
	},
	{
		"User": "ColinG1960",
		"Location": "Melbourne, Australia",
		"DateofReview": "September 13, 2015",
		"ReviewTitle": "Amazingly informative and helpful",
		"Review": "It is a small affair but the staff there are very dedicated to their work and love telling you about all the insects they have there - including the Scorpions. Worth a visit."
	},
	{
		"User": "Davao City",
		"Location": "Davao City",
		"DateofReview": "July 15, 2015",
		"ReviewTitle": "Educational",
		"Review": "At the Davao Butterfly House, we learned about how these insects metamorphoses from thorny caterpillars to beautiful creatures of nature. The staff helped us get to know each stage. Live colorful butterflies fly around the garden, making learning more experiential."
	},
	{
		"User": "bam086",
		"Location": "Manila, Philippines",
		"DateofReview": "July 2, 2015",
		"ReviewTitle": "beautiful place",
		"Review": "enjoyed my trip here with my daughter. I love butterfies - unfortunately, y daughter doesn't (she's scared of caterpillars). Very well kept and clean. Would go back"
	},
	{
		"User": "GBAINC",
		"Location": "Kabul, Afghanistan",
		"DateofReview": "June 20, 2015",
		"ReviewTitle": "Disappointing",
		"Review": "While we were going to Crocodile Park, the taxi driver told us about Butterfly House. The staff at Crocodile Park hyped about the Butterfly House. It was easy walking distance from Crocodile Park, so we checked it out. The \"house\" was a tiny botanical garden,...More"
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "June 20, 2015",
		"ReviewTitle": "Disappointing",
		"Review": "Entrance fee to much. Less butterflies .Right now, I have more butterflies in my own garden. It was really disappointing."
	},
	{
		"User": "Murphy-Hagunos",
		"Location": "Kuala Lumpur",
		"DateofReview": "February 23, 2015",
		"ReviewTitle": "Small, But Worth a Look",
		"Review": "My rating was a 3, but that does not mean do not go. Your P200 ticket is good for 3 attractions: 1 Davao Butterfly House; 2 Davao Crocodile Park; 3 Tribu K' Mindanawan Cultural Village. So, definitely go, and take in all three attractions. It...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "January 18, 2015",
		"ReviewTitle": "Was not the best time when we visited",
		"Review": "It was a butterfly house but less butterflies around. Maybe not the best time to make it into adult. Some other butterfly houses were so big and much flying around but not this one. Could be better next time if it is well attended to."
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "Waste of money",
		"Review": "There's scarcity of butterflies already in the garden. The entrance fee is not reasonable for a place they call butterfly garden with only about 10-15 butterflies flying around (or less)."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "November 12, 2014",
		"ReviewTitle": "Not Worth Visiting",
		"Review": "A small butterfly house with not much happening i'm afraid. Think I have been spoilt by the many butterfly houses in Australia, Malaysia and Singapore. There is an old playground outside for the children, but even that needs a lick of paint. Overall disappointing -...More"
	},
	{
		"User": "Christine C",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 3, 2014",
		"ReviewTitle": "LOTS OF FUN FOR THE FAMILY",
		"Review": "This is a house of Butterflies-LOL! Lots of fun for the family seeing thousands of different kinds of butterflies. The younger kids will love it."
	},
	{
		"User": "John M",
		"Location": "London",
		"DateofReview": "September 21, 2014",
		"ReviewTitle": "Nice little visit",
		"Review": "This place is not very big, and is attached to the crocodile park, but it is set out beautifully and you get to see the stages of the butterflies and walk amongst thousands of butterflies as they fly around your head. Not for people who...More"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 12, 2014",
		"ReviewTitle": "Fair",
		"Review": "There's an old playground outside that entertained my son, aside from that nothing spectacular amazed me, I was expecting more than just one single area where they had butterflies I was expecting a sanctuary of butterflies. Smh"
	},
	{
		"User": "Daniel M",
		"Location": "Baguio, Philippines",
		"DateofReview": "June 20, 2014",
		"ReviewTitle": "wooow, its motivates people to exercise potential talents they have",
		"Review": "people, its has got excellent customer care, it boosts youths to gain confidence via exploring new sites..\r people you will tell more of the stories if you pay a visit to this incredible place, i do love butteflies thats why only its blog, attracted me thus why i paid a visit on this site, lets come and support their facilities..\r thanks for your corporation.."
	},
	{
		"User": "lani g",
		"Location": "Surigao",
		"DateofReview": "April 21, 2014",
		"ReviewTitle": "Just butterflies..",
		"Review": "I expected a lot that's why I feel quite disappointed with the place. Though I love to see the butterflies flying around you, but the place isn't so attractive. I thought I will see butterflies around a beautiful garden, but the plants weren't taken care of properly. It's quite dry. It supposedly add to the view. "
	},
	{
		"User": "Quezon City, Philippines",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 6, 2013",
		"ReviewTitle": "Butterfly and nature",
		"Review": "This is just a side trip and normally come free when you go Crocodile park. This is definitely not that enjoyable experience but it should be fun when you are fanciful of butterflies, botany and stuff."
	}
]
