[
	{
		"User": "tolentinomaldex",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "March 4, 2017",
		"ReviewTitle": "Rarest Orchid",
		"Review": "Orchideacea is the scientific name of orchids. At Christina, you can see some rare breed of orchids in this place. Your viait to this place is truly a pleasure as the nature is the theme of this place."
	},
	{
		"User": "Acid P",
		"Location": "Tagum City, Philippines",
		"DateofReview": "October 8, 2016",
		"ReviewTitle": "Needs Improvement",
		"Review": "Located at Los Amigos, Tugbok District. The place is quite far from the downtown area of Davao, you'll travel more than 20 kilometers before reaching the place. Nothing fancy about the place, there's a big pool, playground and a man made lake for rowing a...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "January 12, 2015",
		"ReviewTitle": "What a beautiful orchid garden!",
		"Review": "The garden is impressive. the travel from the city center is a bit far but it is worth a visit. You will be amazed of the totality of the garden and its amenities. the flowers were in full bloom and you can feel the refreshing...More"
	},
	{
		"User": "amor552",
		"Location": "Iloilo City, Iloilo City, Philippines",
		"DateofReview": "June 8, 2013",
		"ReviewTitle": "Not very ideal to visit on a weekday.",
		"Review": "The orchids are not in bloom and its not even possible to enter. Nobody's at the gate so I entered until I found someone at the entrance of the pool. I was told to pay P100 since the moment you enter the gate you are...More"
	},
	{
		"User": "jimcasas",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 17, 2010",
		"ReviewTitle": "The flowers are blooming now and the swimming pools are great!",
		"Review": "It's a nice place to relax and enjoy the sights. There's a riverside walkway where you could appreciate the refreshing scenery. Entrance fee to the pool area is PHP 70 per adult and PHP 60 for kids 6 years and below. Use of the swimming...More"
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"DateofReview": "May 4, 2008",
		"ReviewTitle": "Beautiful orchids and lovely pools",
		"Review": "The gardens and resort are located on the main road from Davao to both the Philippine Eagle Centre and Malagos Garden Resort. A P20 nominal entry fee is payable to look at the numerous beautiful orchids - mostly blue, purple and red hues - and...More"
	}
]
