[
	{
		"User": "Jose Victor M",
		"Location": " ",
		"DateofReview": "June 1, 2017",
		"ReviewTitle": "Definitely worth a snorkeling trip",
		"Review": "Located near a beach on Talicud Island is a colorful orchestra of aquatic life. Definitely worth a snorkeling trip and it's just around 15 to 20 min boat ride from the main island of Samal so make sure to include this in your itinerary."
	},
	{
		"User": "marst70",
		"Location": " ",
		"DateofReview": "July 28, 2016",
		"ReviewTitle": "Snorkeling the Aquarium Experience ",
		"Review": "One of the highlights one must book is the Island Hopping Boat Tour that will bring you to the nearby different coves of Samal Island- Isla Reta, Angel's cove, Liguid Island & Coral Garden. Aptly named for what it really is, the Coral Garden is...More"
	},
	{
		"User": "Anjeline M",
		"Location": " ",
		"DateofReview": "June 20, 2016",
		"ReviewTitle": "Feels like I'm in an aquarium!",
		"Review": "Our 2ND time to scuba. The first was good as we never had anything to compare it to but now I must say it's a so-so. The corals we saw when we first scuba dive was man made (although we appreciate it) Coral Garden, on...More"
	},
	{
		"User": "pawiksprime",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 21, 2016",
		"ReviewTitle": "Breathing view under the sea...",
		"Review": "It you enjoy watching Finding Nemo...you will definitely find Nemo a lot here along with many creatures, the coral garden is simply breath taking..."
	},
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "August 20, 2015",
		"ReviewTitle": "Spectacular snorkelling",
		"Review": "It's well worth taking a boat trip to this spot. The water is very clear and the variety of corals is stunning. Fish life is quite good, too, though I suspect the area is somewhat over-fished. Only irritation is the vendors who try to sell...More"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 28, 2015",
		"ReviewTitle": "Underwater paradise",
		"Review": "A favourite spot for diving and snorkeling. Most island hopping tours make their stopovers here. Please don't take anything from this fragile environment. Just enjoy the spectacular view underwater."
	},
	{
		"User": "kurttravler",
		"Location": "Courtenay, Canada",
		"DateofReview": "June 24, 2015",
		"ReviewTitle": "Wrecked!",
		"Review": "There was Garbage all over. Halve the Corals are very damaged. Like most of the Philippine Reefs over-fished and exploited."
	},
	{
		"User": "JustJyv",
		"Location": "Makati, Philippines",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "Snorkeling Like A Pro",
		"Review": "When we're in Kaputian Beach we visited this Coral Garden as part of our island hopping destination. It was an amazing experience as it is a big area with lots of different corals and it's addicting. You just want to stay a little longer to...More"
	},
	{
		"User": "ronsdy",
		"Location": "philippines",
		"DateofReview": "March 27, 2015",
		"ReviewTitle": "best coral garden i have seen",
		"Review": "I went there on morning that was cloudy with high wind. Sea was a little rough so it was a little difficult to swim around unless you are a confident swimmer. Coral garden is one of the best i have seen. I have been to...More"
	},
	{
		"User": "My26",
		"Location": " ",
		"DateofReview": "September 14, 2013",
		"ReviewTitle": "amazing experience",
		"Review": "Way back 2008 is my first Talicud island hopping trip and experienced my first DSD. T'was superb! Plenty of assorted corals. I hope the government will make some buoys so the boat dont have to throw their anchor.\r \r From Talicud Island, you can ask some locals to bring you to Coral Garden by small boat. Or join the island hopping trip from samal watersports or other boat charter.\r \r Its nice to go during weekdays because not so many outrigger boats around. And dont forget to bring your snorkels :-)"
	},
	{
		"User": "Jrak907",
		"Location": "Sydney, Australia",
		"DateofReview": "June 28, 2013",
		"ReviewTitle": "Breathtaking Wonder of Corals",
		"Review": "I thought i cant dive and witness this spectacular world of corals just because i dnt knw how to swim. But yes, I did it! It was my first time and I can say that it was a great experience. Got a mixed feelings of excitement yet scared at first. But I did it and i was so amazed seeing those wonders underwater. There were few fishes but the vibrant and unique coral formation made it so great.\r \r My group booked an intro-dive package at an affordable price inclusive of diving gear and most specially inclusive of underwater pictures which u can get from their office right after the diving. One professional diver for each of us whose guiding and taking care of us underwater. So I feel a bit secure hehehhe. \r \r Right beside the Sta. Ana Wharf gate (Davao City)u can see office of professional divers who has an intro-dive package at an affordable price. I think they have this every weekends regularly.\r \r I want to do the experience again. I highly recommend this activity when u r in Davao City for those 1st timer like me."
	},
	{
		"User": "Jer V",
		"Location": "Manila, Philippines",
		"DateofReview": "November 9, 2012",
		"ReviewTitle": "thought from an intro diver",
		"Review": "breath-taking! and no, it's not the scuba gear. wonderful and vibrant colors of corals and fishes. just 30 minutes underwater and its a whole new different world.. such an amazing amazing experience"
	},
	{
		"User": "Joseph Thomas B",
		"Location": "Vienna, Austria",
		"DateofReview": "May 18, 2012",
		"ReviewTitle": "The True Garden",
		"Review": "Garden City of Samal is what the call, taken from the coral garden with plenty of assorted coral. just a pity boat are trowing their anchor where ever they like. The government must do something to treasure this assets"
	},
	{
		"User": "sw8tart",
		"Location": "Singapore, Singapore",
		"DateofReview": "January 27, 2012",
		"ReviewTitle": "nice corals, less fish",
		"Review": "I was planning to dive here but when I tried snorkelling with the family, didn't have many fishes but the corals are nice."
	}
]
