[
	{
		"User": "defyeo",
		"Location": "Davao City",
		"DateofReview": "1 week ago",
		"ReviewTitle": "A must visit in Davao",
		"Review": "If you want to experience interactive activities with exotic animals this is is the perfect place for you. \r \r You get to experience feeding the tiger, ostrich, koi and crocodiles. Even as an adult you will really enjoy this place. They also have a thrilling crocodile acrobat show and amusing bird show. \r \r This place is a must visit in Davao. I find this place even more entertaining than zoos in other countries. "
	},
	{
		"User": "Karen N",
		"Location": " ",
		"DateofReview": "1 week ago",
		"ReviewTitle": "Good for children",
		"Review": "Better to go here during weekends so you can watch the Tribu perform at 6pm. There are different shows everyday. There's a petting zoo, fish feeding, ostrich feeding, etc."
	},
	{
		"User": "jaycaviles",
		"Location": " ",
		"DateofReview": "5 weeks ago",
		"ReviewTitle": "Crocs Everywhere!",
		"Review": "When your at Davao. Don't miss the Crocodile Farm. 500 per person is advisable budget. Better go there with their scheduled show. What to Bring: 1. Water 2. Food 3. Camera"
	},
	{
		"User": "kolawaste",
		"Location": "Auckland, New Zealand",
		"DateofReview": "March 9, 2018",
		"ReviewTitle": "Great place to take the kids",
		"Review": "From feeding the swarms of koi to having you photo taken holding a python, to viewing the animals on display this is a great place to tke the kids."
	},
	{
		"User": "Amani C",
		"Location": "Caloocan, Philippines",
		"DateofReview": "March 1, 2018",
		"ReviewTitle": "THE zoo!",
		"Review": "Home of the famous \"Pangil\", a 18ft saltwater crocodile, which is now the biggest crocodile in captivity in the country after Lolong died. Aside from the crocodiles, you can see other rare animals which even I saw them for the first time. They also have feeding spots in some areas where you can interact with the animals. Check the shows before going there so you can watch them for free like the dancing crocodiles show and actual feeding time of Pangil."
	},
	{
		"User": "efrenr916",
		"Location": "Taguig City, Philippines",
		"DateofReview": "February 27, 2018",
		"ReviewTitle": "A Davao Zoo treat for kids",
		"Review": "45 minutes to 1 hour away from the City. A typical zoo but withseveral crodile ponds. Souvenir shop offers many products made of crocodile leather and some food outlets offer Crodile Ice Cream and meat store ha ve readily available choice crocodile meat. There are the usual exotic birds, primates and big cats. A good treat for kids."
	},
	{
		"User": "Fluttershy_0927",
		"Location": "Abu Dhabi, Abu Dhabi, United Arab Emirates",
		"DateofReview": "February 25, 2018",
		"ReviewTitle": "Fun Place for the Kids",
		"Review": "Great Parking. Not crowded place. You need waze or google map to go there as the place is quiet far from the city. Crocodile Park is a little smelly but my daughter enjoyed the experience."
	},
	{
		"User": "Simone S",
		"Location": " ",
		"DateofReview": "February 19, 2018",
		"ReviewTitle": "Sad...",
		"Review": "The place is decadent. There is a giant crocodile in a small pool: I believe the animal even can move itself as the place is almost of its size. The smell is not good around the animals and lots of places are not well maintained (no animals inside, no information about the animals etc).\r I was sad there. Couldn’t enjoy. Poor animals... maybe the authorities should visit there and check if they are respecting the minimum principles to keep the animals there. "
	},
	{
		"User": "Reinier d",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Amsterdam, Noord-Holland, Netherlands",
		"Location": "Amsterdam, Noord-Holland, Netherlands",
		"DateofReview": "February 1, 2018",
		"ReviewTitle": "Not only croco's",
		"Review": "I am from Amsterdam/Netherlands and wat i have seen? A show with birds like eagles, a show with a monkey dresed like a child. The crocodiles have some space, but tigers and other animals are in too small caches. It is time to renovate the animal accomodations. "
	},
	{
		"User": "Tor Erling M",
		"Location": " ",
		"DateofReview": "January 26, 2018",
		"ReviewTitle": "Nice place for the family.",
		"Review": "5pm good time for the crocoodile. Then go around and feedback fish and bird. And see all other birds and animals Then flame dance."
	},
	{
		"User": "Patrick D",
		"Location": " ",
		"DateofReview": "January 21, 2018",
		"ReviewTitle": "Good place to visit",
		"Review": "Cheap, loads of crocs, snakes, tigers and other animals, fish and birds to see. Kids and adults enjoyed it."
	},
	{
		"User": "Daniel B",
		"Location": " ",
		"DateofReview": "January 9, 2018",
		"ReviewTitle": "Great ",
		"Review": "We had a great time observing the crocs and other animals, birds and fish. This is a fine place for adults and families."
	},
	{
		"User": "Bob S",
		"Location": "County Galway, Ireland",
		"DateofReview": "January 1, 2018",
		"ReviewTitle": "Disgusting and cruel",
		"Review": "I brought some of my friends here what a mistake. Animals are in cramped conditions with faeces everywhere. Unbelievable neglect and stench. Biggest crocodile left in a couple of inches of water too small to move around in. Crocodiles piled on top of each other...More"
	},
	{
		"User": "Agnes Grace T",
		"Location": " ",
		"DateofReview": "December 21, 2017",
		"ReviewTitle": "Exotic Zoo that served exotic food, must try!",
		"Review": "When you visit Davao, please do include this in your itinerary. You must try the exotic delicacies like the crocodile adobo, crocodile icecream, etc."
	},
	{
		"User": "minemine05",
		"Location": "Cebu City, Philippines",
		"DateofReview": "December 18, 2017",
		"ReviewTitle": "CROCS EVERYWHERE!",
		"Review": "I can no longer remember when was the last time I went to a zoo and I was amazed to see different kinds of animals with different sizes and shapes. My friends and I was able to feed the ostrich and the crocodiles. It was...More"
	},
	{
		"User": "PaangGala",
		"Location": "Zambia",
		"DateofReview": "December 6, 2017",
		"ReviewTitle": "An alright park",
		"Review": "Interesting to note they have croc icecream. but luckily it was out of stock when we went, so we opted for an Ostrich ice cream instead. They had Bengal tigers as well as Bear cat which i had never seen before."
	},
	{
		"User": "Jim P",
		"Location": " ",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "A Mini Zoo",
		"Review": "If you're a tourist this is worth a look. When I was there in 2001 it was all crocs in cement pools that never moved. Now it's a mini zoo that added a decent restaurant (despite being outside)."
	},
	{
		"User": "Alekzandra P",
		"Location": " ",
		"DateofReview": "November 20, 2017",
		"ReviewTitle": "Great place for all ages!",
		"Review": "It's a place for all types of relationship. It's a great place for all ages! Everything that could happen will be magical to remember. TWO THUMBS UP!"
	},
	{
		"User": "RaffySun61",
		"Location": "Makati, Philippines",
		"DateofReview": "November 12, 2017",
		"ReviewTitle": "Must See For Animal Lovers",
		"Review": "We enjoyed this visit. Lots of crocodiles and you get to feed them. You have to buy the feeds, which are way overpriced but hey they need to make a profit, and you get to feed the crocs. They also have tigers and other wildlife.\r \r I didn't give it an excellent rating cause they really need to clean up a bit and the staff are not that friendly and accommodating. They seemed bored and irritated. Go during the weekends for their show."
	},
	{
		"User": "vmdr90",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "November 11, 2017",
		"ReviewTitle": "More than Crocs",
		"Review": "Nice sidetrip for animal lovers . Though area was not as big as I expected animal shows made up for it. \r \r Take a Cab for Php 100 from city Center. Entrance fee is 300 pesos . There are food places within the area.Research on show schedule and come ahead of schedule since seats can fill up fast especially on week-ends. "
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 3, 2017",
		"ReviewTitle": "Don't miss the fire show and the big crocodiles.",
		"Review": "This is the 2nd time I have been there, and this time I can see they have made alot of improvements. The animal show was good just watch out for the birds flying around, my daughter almost had a sea eagle fly into her. They have them flying back and forth to the trainers during the show also other birds do the same thing. There are many animals to see like lions,tigers which you can get up on the cat walk and watch the trainers feed them, also monkeys,philippine deer, big snakes, and a lot of strange looking birds. You can also hand feed the koi in this big pond they have but don't get to close because they just about come out of the water to get the food and there are hundreds of them. You can hold a croc or a big snake and take your picture if you feel like it. They also have a show with this huge croc, if you go stand up in front of his head because when he was turning back and fourth the people in the back by his tail were getting soaked from his thrashing around. The last thing you must see if you go is the fire show which start around dusk and is really awesome."
	},
	{
		"User": "jgayongorsa",
		"Location": " ",
		"DateofReview": "October 25, 2017",
		"ReviewTitle": "a great wildlife escape",
		"Review": "a great place for anyone who have a good heart for the wild. they have lots of exotic animals and they are being well taken cared of. just be sure to check their daily schedule of shows before going there since every day they have different shows. "
	},
	{
		"User": "Valdis A",
		"Location": "Kremenchuk, Ukraine",
		"DateofReview": "October 16, 2017",
		"ReviewTitle": "Giant Crocodiles",
		"Review": "Amazing attractions for any age guests. I even won a tickets for Zipline! Well trained, well maintained, clean and not hungry animals. Staff are supportive. Great for weekends with family or friends."
	},
	{
		"User": "Ringo T",
		"Location": " ",
		"DateofReview": "October 14, 2017",
		"ReviewTitle": "Oh my Croc!!!",
		"Review": "Amazing crocodile, bird and tiger show. Of them, crocodile show was the most thrilling. They showcase different animal species. Some are already endangered. They also have souvenir shop where you can buy different croc items among others."
	},
	{
		"User": "familyvagary123",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 20, 2017",
		"ReviewTitle": "Amazing Show! Still the best for us!",
		"Review": "This is the best place to learn about animals. Aside from crocodiles, there are numbers of rescued animals here and adopted animals here. The shows are amazing. Bird Show, Crocodile Dancing, Crocodile Feeding, Pangil Encounter, Animal Feeding and Photo Opportunity with the animals. This is the best animal encounter experience so far. The place is cool. Visited this place a lot of times and there is always something new every time..."
	},
	{
		"User": "allan_y1965",
		"Location": "Koronadal, Philippines",
		"DateofReview": "September 1, 2017",
		"ReviewTitle": "feeding opportunities ",
		"Review": "i've been here two years ago and they have more exotic animals than before. more than just crocodiles, they also have boa constrictors, exotic birds, carps, tigers, lions, ostriches, giant turtles and a lot more. you also get to feed some of the animals, have photos taken with them and watch an exciting animal show. great wasy to spend time with kids and adults alike."
	},
	{
		"User": "Mia P",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Mandaluyong, Philippines",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 29, 2017",
		"ReviewTitle": "Unforgettable visit to Croco Park",
		"Review": "My boyfriend and I went here via cab, luckily, cab drivers in Davao doesn't say no! :D The park is inside a huge place, consisting of subdivision, making commute quite a challenge, as sometimes, you have to wait long for cabs to arrive. The park has an entrance fee of 250 PHP per head, (300 PHP when you arrive 2PM onwards) and you can re-enter as many times during your visit. The restaurant is outside (Riverwalk Exotic Grill) and serves good food and has a nice cultural show on weekends. I tasted the crocodile ice cream, which is made out of crocodiles' unhatched eggs and flavorings (Durian or Chocolate). Crocodile meat is also good and is a must-try when you visit the place."
	},
	{
		"User": "Aleksander A",
		"Location": " ",
		"DateofReview": "August 24, 2017",
		"ReviewTitle": "A fun park",
		"Review": "I have been to Crocodile Park several times before, so it's nice to see that the park is developing. They have a whole range of animals in this park, obviously crocodiles, tigers, various types of birds, snakes, monkeys and turtles. They offer feeding of crocodiles (which I tried, I can recommend it), snake massage and other various animal shows. You can get real close to the animals, which is great if you like to take pictures, I even managed to sit right next to a giant turtle. The park is located out of the busy city core, so you need to ride a taxi to get there. There is restaurants and other small shops outside the park, so it's easy to get a descent meal and refreshments. If you're a traveling family I can recommend this park, I am sure your kids will have a great time there. And yes you can have a crocodile burger if that's your thing. "
	},
	{
		"User": "Arnold and Dian... H",
		"Location": "Phnom Penh, Cambodia",
		"DateofReview": "August 24, 2017",
		"ReviewTitle": "Think 3rd World Zoo",
		"Review": "The large predators are in barred enclosures. Orange the orangutan only seems happy during the talent show. The reptile enclosures need cleaning as does most of the zoo. The zoo looks like it is in need of a facelift. The staff are friendly and seem to interact gently with the animals. You can feed chicken bits to tiger from above them. Just remember to think third world."
	},
	{
		"User": "pattayabeach888",
		"Location": "Melbourne, Australia",
		"DateofReview": "August 24, 2017",
		"ReviewTitle": "So so",
		"Review": "Compared to other zoos very average but not bad for kids. Daytime show for the kids and easy to see the crocs."
	},
	{
		"User": "Vanessa D",
		"Location": " ",
		"DateofReview": "August 16, 2017",
		"ReviewTitle": "What an experience",
		"Review": "I went there last may with friends and the experience was awesome. The crocs were scary, some were big, medium sized crocs were there too and small ones!! Just great experience."
	},
	{
		"User": "Matthew C",
		"Location": " ",
		"DateofReview": "August 16, 2017",
		"ReviewTitle": "Must visit!!",
		"Review": "The place has a lot of crocodiles,,, like really a lot!! The place is well kept and maintained. Kids loved the place and just got really scared too hahahah!!"
	},
	{
		"User": "Mon C",
		"Location": " ",
		"DateofReview": "August 10, 2017",
		"ReviewTitle": "City tour",
		"Review": "The bird show starts around 3PM. So better go here earlier to have a better seats. The entrance fee was so so. I enjoyed the bird show more than the crocodiles. Approximately 2 hours of spending here on a off peak days (weekdays) is enough for picture taking and selfies. The crocodile leather goods were soooo expensive! "
	},
	{
		"User": "Ronna V",
		"Location": " ",
		"DateofReview": "August 9, 2017",
		"ReviewTitle": "Side trip in davao ",
		"Review": "Went here as im curious about this crocodile farm...from my hotel till here is about 20 mins trip and about 120 pesos fare in taxi. Entrance is 250 adult 150 kids \r It was such a great day when i came about 10 am..no much people as its just a weekend...diff animals to see.. \r From birds, snakes, crocodiles, bat, turtles, ostrich , tiger, monkey, etc. \r It was a fun filled morning for me..not only kids will enjoy visiting here but even adults. \r They also hve some show in the afternoon but since i will go to eden nature park i skipped that. Nice place to relax esp if ull bring ur kids :) "
	},
	{
		"User": "tianneXtianne",
		"Location": " ",
		"DateofReview": "July 30, 2017",
		"ReviewTitle": "Fun and educational",
		"Review": "This place has lots of animals but i think this park has seen better days. We visited the park on a friday and paid the weekend rate but the tour, although educational, seemed to be rushed. Some advertised animal shows did not happen (like the crocodile wrangler one) so i was kinda disappointed. But i liked the koi feeding and taking pictures with the statue of a giant crocodile.\r Overall i think it's fun to have kids enjoy this educational trip and for all visitors to learn a thing or two about animal and nature conservation."
	},
	{
		"User": "Ideas_6622",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Singapore, Singapore",
		"Location": "Singapore, Singapore",
		"DateofReview": "July 21, 2017",
		"ReviewTitle": "Crocodile Park - Simple Experience",
		"Review": "Reptiles are caged at many places. There are many sizes of them and it is a real experience that you can get so near to them. A little foul smell but you can ignore it if you concentrate on the reptiles rather than the area"
	},
	{
		"User": "Zoe P",
		"Location": " ",
		"DateofReview": "July 19, 2017",
		"ReviewTitle": "Caged!",
		"Review": "I've never liked the idea of caged animals. Well according to their manager they are a croc farm above all. And indeed they had hundreds if not thousands of crocs. All kinds, baby crocs, sea crocs, giant crocs, medium sized crocs, croc skin wallet, a few birds and there that were saved from poachers. It didn't have that zoo vibe to it, if you like feeding tigersand crocs this is the place for you, just not for me. "
	},
	{
		"User": "Rebecca R",
		"Location": " ",
		"DateofReview": "July 19, 2017",
		"ReviewTitle": "Cool",
		"Review": "I was amazing!!! I fed the fish, tigers and crocodiles!!!! It was my first time to see a cobra too. Poor lonely lion, hope they put more in. There were lots of birds and some monkeys,, the show was funny and entertaining as well."
	},
	{
		"User": "NikolasGarcia",
		"Location": "Manila, Philippines",
		"DateofReview": "July 17, 2017",
		"ReviewTitle": "It will bring back the child you",
		"Review": "Learn and enjoy at the same time, the place is full or wonderful creatures that we don't usually see up close. This is definitely a place to go for family outing and even with friends. I live the tigers it is truly a majestic creature"
	},
	{
		"User": "Nash I",
		"Location": " ",
		"DateofReview": "July 17, 2017",
		"ReviewTitle": "HUGE CROC!",
		"Review": "Even though im old enough, going to a park never fails to satisfy me. It will make you go back to being young, you would appreciate every animals or reptile you see that you wont see everyday. A crocodile named \"PANGIL\" he was really huge! It was the most biggest crocs i have ever seen in my life, i was also able to experience to feed the tigers ang fish. It was really an amazing experience and an unforgettable one!"
	},
	{
		"User": "Eves Jefferson S",
		"Location": " ",
		"DateofReview": "July 17, 2017",
		"ReviewTitle": "Very amazing",
		"Review": "I swear ive been to crocolandia in Cebu and this place is more than that. There were so many animals. I was able to witness animals got talent as well. Its so amazing that they were able to train birds to fly, made crocodiles dance and tiger climb up the pole. "
	},
	{
		"User": "Paul G",
		"Location": "Manila, Philippines",
		"DateofReview": "July 17, 2017",
		"ReviewTitle": "Cool",
		"Review": "We stopped in on Sunday before catching a flight home. This place was well worth it. Lots of fun walking around and seeing wild animals and reptiles. You can even feed them. For me the highlight was standing on top of tiger cages, feeding them raw food. This place is a must visit if in davao... "
	},
	{
		"User": "Jojo S",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 16, 2017",
		"ReviewTitle": "by its name",
		"Review": "well you can watch the crocodile in various sizes, they are bred inside the park there are birds snakes etc as other attraction, you can also taste the croc ice cream"
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "July 14, 2017",
		"ReviewTitle": "Great mini adventure within Davao! ",
		"Review": "I suggest going to Croc Park during the weekends and attending the talent show. We spent 1-2 hours there and the highlight would be feeding the animals. We also went during the weekdays and there were barely anyone there so it was easy for us to take photos of the animals without the crowds. \r 250 pesos entrance fee for adults. "
	},
	{
		"User": "jonsapon121",
		"Location": " ",
		"DateofReview": "July 12, 2017",
		"ReviewTitle": "Ok ",
		"Review": "We did see many crocodiles. Really I would call it a mini zoo. We did enjoy seeing all the animals. Having lunch there was the typical food not available on the menu with it being a crocodile zoo and it being on the menu, I thought I'd try it. Then let down not available. The shops in the park should put prices on all products, I felt like we where getting tourist prices. "
	},
	{
		"User": "Anne P",
		"Location": " ",
		"DateofReview": "July 5, 2017",
		"ReviewTitle": "Great place but fee is pricey",
		"Review": "Lesson learned - You have to allot at least half or more of your day to maximize the use of the Php 300 entrance fee. The place also lack of signs on how you will go around the park. We missed the butterfly garden because there is no direction how to go there or information that it is only open until 5PM. The program in the afternoon is entertaining though."
	},
	{
		"User": "twistedfoodlover",
		"Location": "Makati, Philippines",
		"DateofReview": "July 2, 2017",
		"ReviewTitle": "Fantastic Day at the Crocodile Park",
		"Review": "Gotta admit this was way cooler than I thought it was going to be. We had a blast here with young kids and I highly recommend seeing the Crocs and the Animals. You won't regret it. Xx"
	},
	{
		"User": "Princess Salvia G",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "June 26, 2017",
		"ReviewTitle": "Family had a blast",
		"Review": "My in laws and I went here after our trip to Samal Island. If you want to see a lot of animals and interact with some then this place will not disappoint. You can feed tigers, ostriches, and koi here. Lots of opportunities for picture taking. Staff are friendly and accommodating. Premises are cleaned routinely. A must-visit if you are a party with kids. "
	},
	{
		"User": "Don R",
		"Location": " ",
		"DateofReview": "June 22, 2017",
		"ReviewTitle": "Just right",
		"Review": "I guess for security purposes there's Too much net on the cages to prevent visitors from feeding them but you can barely see the details of the animals. A barricade would have been better. Apart from that the place is ideal for group tours. They have tigers, birds, ostrich, turtles, reptiles, snakes, etc... I also like the feeding hours wherein visitors get the chance to experience how is it like to feed crocodiles and see them jump out of the water to grab the food."
	},
	{
		"User": "Pia L",
		"Location": " ",
		"DateofReview": "June 17, 2017",
		"ReviewTitle": "Good for field trips",
		"Review": "Its a bit smelly, but i enjoyed taking lots of pictures.. They also have a mini museum for extinct species.. This is a good place for kids and kids at heart, very educational tour."
	},
	{
		"User": "Ryan T",
		"Location": " ",
		"DateofReview": "June 15, 2017",
		"ReviewTitle": "PANGIL...",
		"Review": "at 250 pesos you can enjoy three tours in one package, first you can enjoy the floral gardens in their Butterfly Garden which is about a-2 blocks away, then enjoy the main attraction in their Crocodile farm where you can see a lot of animals AND Crocodiles of variant sizes including their main attraction \"PANGIL\" the 18-foot croc. you can also see lots of other animals in here, like ostrich, tigers, snakes monkeys and other animals found only in the Philippines, after the tour you can enjoy native dishes from the Kamindanawan restaurant and enjoy some of the tribal music starting at 5:00 pm but only on weekends."
	},
	{
		"User": "Mattro T",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 15, 2017",
		"ReviewTitle": "It's All worth it",
		"Review": "I really enjoyed to be here and I observed that they always make the area clean & friendly! This is good for everyone destination, :)"
	},
	{
		"User": "Gael G",
		"Location": " ",
		"DateofReview": "June 5, 2017",
		"ReviewTitle": "Great for kids! ",
		"Review": "So much for the kids to see and do! If you have tone sign up for the white water rafting, its definitely an amazing adventure!"
	},
	{
		"User": "Dundee M",
		"Location": " ",
		"DateofReview": "May 19, 2017",
		"ReviewTitle": "Not just Crocs...",
		"Review": "Family enjoyed very much, place is a Zoo with various animals, local and imported, huge area, animals are well taken cared of and not malnourished, seen a lot of caretaker in many cages working, feeding and cleaning, plenty of shades also even on a noontime visit. Can take pictures freely, some animals are in the open and not caged, mostly with companions and not a lone caged animal. Foods available inside the zoo, average comform rooms, clean and well maintained. Affordable since price covers 3-areas (zoo, butterfly farm, kamindanawan show) just make sure to check schedule of activities. Recommended place when in Davao!"
	},
	{
		"User": "Luke T",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "May 19, 2017",
		"ReviewTitle": "Crocs and more",
		"Review": "Great place for kids to see nature, crocodiles and more, birds, monkeys, snakes and more. We had a wonderful time and stay for the live show it is worth it. We had so much fun and getting a chance to see and hold some just toped it off.."
	},
	{
		"User": "Gine P",
		"Location": " ",
		"DateofReview": "May 16, 2017",
		"ReviewTitle": "It was Ok. Good for those who have not been to big Zoos ;)",
		"Review": "Went there w my family...you wont expect that you will see other animals too. I thought only crocodiles:/ My mom n daughter enjoyed feeding the fish, it was just pity that the weather was not that nice to us. At the end of the day, they have this show which kids would love it."
	},
	{
		"User": "sadal99",
		"Location": "Minokamo, Japan",
		"DateofReview": "May 14, 2017",
		"ReviewTitle": "Wasting time...",
		"Review": "There are more than just crocodiles here. The show they have here is a lot of fun. The grounds of the tigers are very small, yet because they have several of them, there are snakes, birds, monkeys and even bats ...."
	},
	{
		"User": "Christianne G",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 12, 2017",
		"ReviewTitle": "It was OKAY 👌🏻 ",
		"Review": "The entrance fee was quite expensive. Aside from seeing the crocodiles, there where feeding activities and it's additional fee for every feeding. It was an expensive sight seeing activity"
	},
	{
		"User": "Norm H",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "May 10, 2017",
		"ReviewTitle": "Crocodiles! and more!",
		"Review": "We recently arrived in Davao and are finding our way around, so this morning we decided to check out the Crocodile Park. We were pleasantly surprised to find that this is actually a mini zoo. Of course there are crocs, lots of crocs, pens of different size groupings. But there are also some large pythons, ostriches, sheep, goats, ducks, geese, turkeys, deer, a few hawks and eagles, some monkeys and even a few tigers. \r We even had the opportunity to feed a couple lambs and throw some fish food into a pond full of colorful koi."
	},
	{
		"User": "travelbug47london",
		"Location": "London",
		"DateofReview": "May 10, 2017",
		"ReviewTitle": "A children's outing only",
		"Review": "Unless you need to entertain very young children the trip out to the Crocodile Park is a complete waste of time. There is an array of regional animals in poor conditions with a number of pools full of crocodiles of various sizes. It is designed for the selfie crowd."
	},
	{
		"User": "Eve14_T",
		"Location": "Makati, Philippines",
		"DateofReview": "May 4, 2017",
		"ReviewTitle": "Great Animal Show",
		"Review": "We went to crocodile park late in the afternoon just in time for the Animal Show to which my daughter was very amazed. She really enjoyed watching the different birds and animals on the show. The family also enjoyed the petting zoo where you get to feed the baby sheep with milk, the rabbits with carrots and the ostrich with feeds. My daughter was scared during the tight rope show though. Overall the experience was great except that we went so late in the afternoon. "
	},
	{
		"User": "Franklin C",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Honolulu, Hawaii",
		"Location": "Honolulu, Hawaii",
		"DateofReview": "May 3, 2017",
		"ReviewTitle": "More than just Crocodiles",
		"Review": "The name itself is deceiving. More than just crocodiles here. The show that they have here is pretty entertaining. The only negative thing i would have to say is that the enclosure for the animals are too small. Especially for the tigers and they do have several of them."
	},
	{
		"User": "Jessie G",
		"Location": " ",
		"DateofReview": "April 22, 2017",
		"ReviewTitle": "Huge Crocodiles",
		"Review": "You need to be here before 4pm for the crocodile feeding and animal show. It's a place to visit if you will be touring around Davao. You can take photos with albino snake and crocodile."
	},
	{
		"User": "Sum M",
		"Location": " ",
		"DateofReview": "April 16, 2017",
		"ReviewTitle": "Poor animals!",
		"Review": "I'm not an animal rights person but I have reservations about the well-being of the animals in this place. It seems they are all just there for show with no regard for their health and well-being. I hope they employ well-trained professional staff who love...More"
	},
	{
		"User": "dpalisoc",
		"Location": "Cainta, Philippines",
		"DateofReview": "April 14, 2017",
		"ReviewTitle": "Amazing Crocodile Park!",
		"Review": "This is a Zoo Park in Davao City where a variety of animals can be found. It has tiger, crocodile, snake, monkeys, bearcays, birds, and the likes. It also has an animal show which starts late in the afternoon. Souvenirs are also available inside same...More"
	},
	{
		"User": "reelrodcover",
		"Location": "Montgomery, Texas",
		"DateofReview": "April 12, 2017",
		"ReviewTitle": "Great fun and enjoyed.",
		"Review": "Great place to visit and my second time here . Watch the shows and feel the warmth of the beautiful people of the Philippines"
	},
	{
		"User": "acmevintage",
		"Location": "Digos City, Philippines",
		"DateofReview": "April 3, 2017",
		"ReviewTitle": "Many exotic animals",
		"Review": "The zoo there is nice with a good variety. The feeding of the crocodiles is exciting. It is child friendly."
	},
	{
		"User": "jesseinholland",
		"Location": "Amsterdam, The Netherlands",
		"DateofReview": "April 1, 2017",
		"ReviewTitle": "Amazing day trip",
		"Review": "I was with my husband last March2017 in Crocodile Park.Very clean and friendly staff.Of course,hundreds of crodiles and other animals.It really improves alot since I visited 5yrs ago.Well done and keep it up for good service for every visitors👏😀❤️ Oh,must try for crocodile burger 😜👌"
	},
	{
		"User": "John Alexis Q",
		"Location": "Caloocan, Philippines",
		"DateofReview": "March 31, 2017",
		"ReviewTitle": "Recreational Park for Animal Lovers",
		"Review": "When you go Davao City, this place is one of your lists to visit in the city. The place is like a usual zoo in Metro Manila. But this part has an advocacy to save and rehabilitate the animals in Davao particularly the Philippine crocodiles....More"
	},
	{
		"User": "Sheilzy1972",
		"Location": "Melbourne",
		"DateofReview": "March 27, 2017",
		"ReviewTitle": "a crocodile peak",
		"Review": "fantastic crocodile show too much people though would be good if the show is spaced apart to give you time to watch each one they have crocodile ice cream lots of mosquitoes though so bring insect repellant"
	},
	{
		"User": "torkjell_11",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Bergen, Norway",
		"Location": "Bergen, Norway",
		"DateofReview": "March 25, 2017",
		"ReviewTitle": "Nice place",
		"Review": "If you want to get away from all traffic and noise for a while then this is a great place to visit. They have of course a lots of different crocodiles but also some other animals to see. There is a ok souvenir shop and...More"
	},
	{
		"User": "Andrea C",
		"Location": "Manila, Philippines",
		"DateofReview": "March 21, 2017",
		"ReviewTitle": "not a good crowd",
		"Review": "this place has a lot of attractions. you can feed ostriches, see a really huge croc. wasnt too bad. \r \r but the crowd was not ideal. we attended one of the shows; the host would have been funny but his punch lines were marked with canned laughter and sound effects you hear on the radio stations for jeepney drivers. \r \r would not go back."
	},
	{
		"User": "LuxuryTravelCamel",
		"Location": "Abu Dhabi, United Arab Emirates",
		"DateofReview": "March 21, 2017",
		"ReviewTitle": "Interesting for a brief visit",
		"Review": "We visited the Crocodile Park on a morning outing in Davao. The park is interesting with many species to be seen. The highlight was the chance to feed the crocodiles in one of the enclosures. There are many great photo opportunities around the park, nicely laid out with specific suggestions of the best angles. All in all we enjoyed our brief visit to the crocodile park. Kids will find the park interesting and informative."
	},
	{
		"User": "MoriMike",
		"Location": "Riyadh, Saudi Arabia",
		"DateofReview": "March 19, 2017",
		"ReviewTitle": "Educational Trip even for the Young Once!",
		"Review": "Visited the place with friends. Also good for students on educational trips.\r \r The park is mostly packed out with people in the afternoon. If you don’t want, go there in the morning which we did. But we stayed until later in the afternoon because I was waiting for an animal show inside the park and cultural show located beside the park. But I got tired from walking and wasn’t able to wait for the shows. So we left.\r \r There are some crocodile quarters which are really crowded and some are not. But it’s not only crocodile you can see there. Lots of animals too! You have to buy food for the animals in order for them to move. We bought fish food for the koi’s. We feed them. Really weird the koi’s eating in your hand and exciting too! I really pity the tiger which is housed in a fitted cage. The tiger cannot move comfortably even. \r \r There are souvenir shops and restaurants on the other side which serves crocodile sisig and crocodile lechon (which both aren’t available at that time) so we settled for crocodile ice cream instead. Taste like pistaschio ice cream and you can eat bits of nuts (but it’s not nuts) which I think is the crunchy crocodile. My friend was figuring out his ice cream when he suddenly spit crocodile skin and there are some scales included. Must try… Yummy!"
	},
	{
		"User": "fellaz b",
		"Location": "Cebu",
		"DateofReview": "March 8, 2017",
		"ReviewTitle": "a must visit place in davao",
		"Review": "this is a good place to visit while in davao; you will see variety of animals not just crocodiles. we really had a fantastic experience here"
	},
	{
		"User": "rej26qmd",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "March 8, 2017",
		"ReviewTitle": "A Zoo",
		"Review": "It bears a name where you would have an idea only crocodile would be seen but you'll be sruprised they have other animals there. It's basically a zoo.\r Ticket price was 250 each and that would include entry to the croc park, tribuhan, and butterfly garden.\r The place is very nice, there are a lot of trees so even if you are there in the middle of the day, it is shady. They have animal shows in the afternoon featuring their best trained animals. There is only one place you can buy food. It was situated at the exit."
	},
	{
		"User": "Mulan H",
		"Location": "Wollongong, Australia",
		"DateofReview": "March 7, 2017",
		"ReviewTitle": "A lot better than what i expected",
		"Review": "The show was quite interesting with monkeys, crocodiles and other animals doing tricks. The dinner at the restaurant was delicious, serving crocodile meat. The fire show during dinner and the local Visayan entertainment was enjoyable too."
	},
	{
		"User": "YMCML",
		"Location": "Manila, Philippines",
		"DateofReview": "March 1, 2017",
		"ReviewTitle": "Crocs galore",
		"Review": "As the name implies, the place has lots of crocodiles of all sizes from baby crocs to adults. There's even a life sized replica of Lolong and some tigers in small cages. There's a monkey show on the day of our visit."
	},
	{
		"User": "costelmihaila80",
		"Location": "Vancouver, Canada",
		"DateofReview": "February 28, 2017",
		"ReviewTitle": "Kind of wild that show with crocodiles",
		"Review": "That show too hang a piece of meat and the crocodile \"dances\" is so wild. Every creature if hungry would act as in instinct to eat. Just as a cat tries to catch something that hopes to get in their mouths at the end of the day.Look back at the history and see how other nations took advantage of hungry people in prisoners camp and then think if is fair to laugh when a creature that is captive fighting for its food!\r Second, that fire show is very nice.Good job! \r But the restaurant above just take advantage of the tourist attractions and adds fees and the price is just like talking advanced of your hunger so ad the crocodiles does an effort and \"dances \" then you too must \"dance \" in your wallet.If service would be good and nice smiling faces that asks you if anything is OK, time to time, then...I'll dance , otherwise, no way to get back there."
	},
	{
		"User": "Stuart H",
		"Location": " ",
		"DateofReview": "February 28, 2017",
		"ReviewTitle": "Nice park",
		"Review": "Traveled the park in a day and I had alot of fun. Got to see many things up close and i would recommend this to everyone."
	},
	{
		"User": "doreentheexplorer",
		"Location": "Cebu City, Philippines",
		"DateofReview": "February 24, 2017",
		"ReviewTitle": "Crocs in the House!",
		"Review": "I got goosebumps upon seeing those green eyed monsters! Seeing them that many was overwhelming. You have to see their bird show as they feature animals with amazing talents!"
	},
	{
		"User": "027meps",
		"Location": "Manila, Philippines",
		"DateofReview": "February 22, 2017",
		"ReviewTitle": "Entertaining",
		"Review": "Going to the crocodile park was about 30 minutes from the city central. the entrance fee was 300 pesos which we did not expect when we came because it's not exactly cheap. But when we went in, it definitely was worth it and I think...More"
	},
	{
		"User": "David H",
		"Location": " ",
		"DateofReview": "February 21, 2017",
		"ReviewTitle": "Very fun place for family or friends ",
		"Review": "Gotta visit if you visit! Go on feeding Sunday! They also have a great show before they go for feeding time. I have never seen the size of the gator they have ever!"
	},
	{
		"User": "Jennelyn T",
		"Location": "San Jose del Monte, Philippines",
		"DateofReview": "February 20, 2017",
		"ReviewTitle": "For the animal lovers",
		"Review": "When you visit the Crocodile park you should know in advance the schedule of their shows, as they have enjoyable shows in this park. And you also get to see those gators at their feeding time, as well as there are other species that you...More"
	},
	{
		"User": "kammmo",
		"Location": "Launceston, Australia",
		"DateofReview": "February 20, 2017",
		"ReviewTitle": "Loved it ",
		"Review": "I went with my brother and sisters. We enjoyed a lot there were a lot of crocodiles and other animals like ostrichs and owls which were kept their and we also had snake on our neck it was so scary to see but it was...More"
	},
	{
		"User": "cbgabronino",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "February 19, 2017",
		"ReviewTitle": " Tour with kids",
		"Review": "Kids loved the big cat feeding with the New Tigers in the park. The largest crocodile Pangil had finally shown half his head and we marveled at his hugeness. Our best experience had to be being around free range sheep, ostrich, chickens and ducks and...More"
	},
	{
		"User": "Tinne S",
		"Location": " ",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "Be there in the morning",
		"Review": "We arrived late so most of the activities there were unavailable. But the place was good. However, we had a hard time going home from there cause if there are no available taxi, you have to walk a long way or ride a habal-habal(?). Sana...More"
	},
	{
		"User": "Stuart K",
		"Location": "Kent, United Kingdom",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "day out",
		"Review": "crocodile park is very far away from most things but its worth the time going there ,but try to leave before it gets dark there are not many taxis around ,but they will call a taxi if needed"
	},
	{
		"User": "Ausdamo77",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Singapore, Singapore",
		"Location": "Singapore, Singapore",
		"DateofReview": "February 14, 2017",
		"ReviewTitle": "Great day out ",
		"Review": "Went with my partner, wasn't busy and only $8 taxi from the city, plenty of crocodiles from all sizes and plenty other animals which was pretty interesting"
	},
	{
		"User": "Pilnas",
		"Location": "Vienna, Austria",
		"DateofReview": "February 7, 2017",
		"ReviewTitle": "Was fun",
		"Review": "Their show with parots and monkeys was fun. They have lot of crocodiles of different sizes. The place is definitely good for families with children."
	},
	{
		"User": "tolentinomaldex",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "February 6, 2017",
		"ReviewTitle": "The Park with a Croco",
		"Review": "Visiting this place makes me more excited to eat a croco icecream. With my kids and my mother, they find it more adventurous and exciting. Aside from ciewing the live croco the landscape worth a souvenir shots."
	},
	{
		"User": "AZ A",
		"Location": "Fayetteville, North Carolina",
		"DateofReview": "February 6, 2017",
		"ReviewTitle": "A must see in Davao",
		"Review": "This is a must see park in Davao for all ages including disabled people though park needs to add restrooms accessible to wheelchair bound folks. Must try crocodile meat menu in one of their restaurants"
	},
	{
		"User": "chaosuey",
		"Location": "Luzon, Philippines",
		"DateofReview": "February 5, 2017",
		"ReviewTitle": "Thumbs Up!!!",
		"Review": "first....its a little bit far from the center of the city you should come early so that you can enjoy the place better since some are coming by groups the bird show is really enjoyable theres a souvenir shop.....and an ice cream parlor beside the...More"
	},
	{
		"User": "Milany A",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 4, 2017",
		"ReviewTitle": "Still one of top tourist spots in Davao!",
		"Review": "It was fun seeing crocodiles of many forms and sizes. It felt great watching them dance. It was a spectacular feeling witnessing their battle over food - scary but awesome. The place is great for people of all ages, especially the kids. The bird show...More"
	},
	{
		"User": "Mercy888",
		"Location": "Manila, Philippines",
		"DateofReview": "February 3, 2017",
		"ReviewTitle": "Great for children!",
		"Review": "Clean, organized, friendly staff. There was a bird show when we visit and delighted us esp the kids. The Crocodile Ice Cream is a must-try!!!"
	},
	{
		"User": "Jude B",
		"Location": "Dublin, Ireland",
		"DateofReview": "January 29, 2017",
		"ReviewTitle": "Don't go in the evening.",
		"Review": "The reason I gave this review a lower rating is because when we arrived about 5:30 PM, it's aleady getting dark and of course reptiles are more active during the day.It's not the fault of the park, but they should change their closing time to...More"
	},
	{
		"User": "Enigmausly",
		"Location": "Houston, Texas",
		"DateofReview": "January 29, 2017",
		"ReviewTitle": "River Rafting",
		"Review": "They'll tell you up to class 4, but even with the water up a little I didn't see anything above class 3 (from my prospective), would make a good family adventure ... good over all experience and would definitely recommend the trip if already in...More"
	},
	{
		"User": "564marketing",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Laguna Province, Philippines",
		"Location": "Laguna Province, Philippines",
		"DateofReview": "January 27, 2017",
		"ReviewTitle": "Worth the visit",
		"Review": "One of the beautiful place in Davao, visitors can interact with the animals like photo shoot with snakes, and crocodiles, also feeding the fish and ostrich. Best experience with the kids."
	},
	{
		"User": "TingCO",
		"Location": "Manila, Philippines",
		"DateofReview": "January 21, 2017",
		"ReviewTitle": "It's like a little zoo with mostly crocodiles",
		"Review": "The crocodile park has several pens with crocodiles but I've seen bigger commercial types with many more. You can try the crocodile sisig here. It's strangely tasty. There are also many aviaries with many species represented.\r  The park is famous for their white water adventure, which is something like a theme park ride in actual nature (fun), and their famous fire dancer shows on Friday and Saturday nights (reputedly excellent though I didn't get to see it)."
	},
	{
		"User": "Gavin R",
		"Location": "Timaru, New Zealand",
		"DateofReview": "January 14, 2017",
		"ReviewTitle": "davo croc park",
		"Review": "DAVAO croc park is better than singapore zoo, heaps more interactive with guides etc.. great place to walk round , hawkers near by , nice place ... sept 2014"
	},
	{
		"User": "Mark w",
		"Location": " ",
		"DateofReview": "January 12, 2017",
		"ReviewTitle": "One of the best parks in the Philippines!",
		"Review": "One of the best parks in the Philippines. Worthy of your time. They have their own version of animal show during Friday, Saturday and Sunday. Very educational! They also offer animal feeding-- fish, crocodiles and tiger!"
	},
	{
		"User": "Valdimar2013",
		"Location": "Reykjavik, Iceland",
		"DateofReview": "January 3, 2017",
		"ReviewTitle": "Not worth the money",
		"Review": "Omg there were a lot of crocodiles all over the place but they didn't move them selfs. Just like a lot of dead animals. Yes there are few other species but nothing that catches your eyes or made you feel like there was a life there.\r A big disappointment for us."
	},
	{
		"User": "Sam T",
		"Location": "Philadelphia, Pennsylvania",
		"DateofReview": "January 3, 2017",
		"ReviewTitle": "Thrilling",
		"Review": "The crocodile Park is not only a kids paradise of wonders, but for all ages. It will amaze you.\r You see various local birds, animals like the tiger. And off course you get to see the crocodiles being feed.\r Want to check out your nerves? Try holding a snake while someone tries to take a picture. Word of caution stay calm while the snake moves around your body.\r Ok now you have graduated from this, now the final check. Holding a baby crocodile.\r Now that you have done screaming & kicking cool your throat with crocodile ice cream. They have free WiFi.\r You are so tried & hungry try the crocodile fried rice and sauted crocodile. \r Beware the fried rice is not a small potion it's huge. Have fun!"
	},
	{
		"User": "KimberlyGM",
		"Location": "Makati Philippines",
		"DateofReview": "December 31, 2016",
		"ReviewTitle": "Concrete jungle",
		"Review": "Felt sorry for the animals caged in concrete but it may be a personal preference. Lots of variety of animals not just crocodiles."
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "December 28, 2016",
		"ReviewTitle": "Beautiful ",
		"Review": "But of course the animals have too few space. \r I had ice cream made of crocodile eggs and could hold a lemon colored snake. \r They have shows for the trained animals. They advise the customers to keep the country tidy and not to throw things in the landscape. Good idea, but people that can afford the entrance fee should already have some basic socialization. "
	},
	{
		"User": "icallitjoycism",
		"Location": "Mabalacat, Philippines",
		"DateofReview": "December 28, 2016",
		"ReviewTitle": "An Interesting Visit",
		"Review": "Went here solo as part of a pre-arranged city tour. Entrance is Php 250.00/head. \r \r Not much to see except for... drum rolls... crocodiles. LOL! like hundreds of them. \r \r Don't get me wrong, I enjoyed the place. There was a mini zoo, with animals I have only seen for the first time and names of which I don't even remember (haha, so that may not make this a good review, right? LOL!)\r \r Anyway, there is an area here where you can feed the fish, an ostrich, or a tiger. I fed the fish, haha! \r \r There is a souvenir shop that sells souvenirs from Php 50 (ref magnets, key chains, and the like) up to Php 2,000+ (croc skin thingies). Yes, I got a ref magnet ;)\r \r Just outside the shop, there are food kiosks, so no need to worry about getting starved. I went straight to the Croc Egg Ice Cream Shop. I dd not know what to expect from a 90-peso croc egg ice cream... but I sure don't regret getting one. It's different in that is is more \"malinamnam\" than the regular ice cream. Other than that, nothing different, scary, or gross. :) Thank heavens!"
	},
	{
		"User": "ukre",
		"Location": " ",
		"DateofReview": "December 23, 2016",
		"ReviewTitle": "Furious and adventurous",
		"Review": "I went there to see crocodiles and you know what, when I saw those crocodiles I just got scared of those because those were really scared and I was little bit in fear and more in joy for taking selfies with them hehee... Interior is like adventurous place so adventure lover must try having a trip there.."
	},
	{
		"User": "Claudine_v_S",
		"Location": "Pasig, Philippines",
		"DateofReview": "December 20, 2016",
		"ReviewTitle": "Had a blast with my son!",
		"Review": "The park is well-maintained, very clean and as my son said \"its not stinky here as the other animal parks!\" We enjoyed the crocodiles and seeing the baby crocs are separated from the bigger ones. We didn't get to see a show as there were only few people inside the park but that's ok. The cages of the tigers are very small! Hope they do something about that. Tigers should have a HUGE open space for them. The bats were a bonus for us as we never get to see bats in any animal parks. Love the little shops outside and cafes. My first time to try croc ice cream and croc sisig and surprisingly, it is good!! The meat of a croc is tough so if you don't like chewing a lot before you swallow your food, better not try it."
	},
	{
		"User": "delight_2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 4, 2016",
		"ReviewTitle": "An afternoon with nature and grandkids at Crocodile Park",
		"Review": "The trip is exciting, for me and for the grandkids. We see lots of crocodiles in their own habitats, aside from the exotic birds and other animals. This is a very nice place for the children and for students excursion from elementary to college. And even old folks who have no chance to see these places while young. Welcome to Crocodile Park, where you can see bags and accessories made of crocodiel skin and even taste the menu with croco meat ingredients. Try it ! . "
	},
	{
		"User": "Katikuykuy",
		"Location": "Dasmarinas City, Philippines",
		"DateofReview": "November 30, 2016",
		"ReviewTitle": "Lots of Crocs",
		"Review": "Went here on a Monday in November 2015\r There are usually no shows on a Monday, luckily there is a field trip of preschool students.\r So we also enjoyed the animal show. I do not remember the name of the host but he is great!\r There are a lot of Crocodiles (of course), birds, snakes, and other animals. This is worth our time."
	},
	{
		"User": "PinkMoscato",
		"Location": "TAGUM",
		"DateofReview": "November 24, 2016",
		"ReviewTitle": "Enjoyed it a lot",
		"Review": "I loved the well-organized shows. The place is clean and there are also other animals there, other than crocodiles. They offer free shuttle services to the highway but you can also call a cab to get you from the park to your desired location."
	},
	{
		"User": "Pio S",
		"Location": " ",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "Iconic!",
		"Review": "Growing up in Davao, i always heard about this place and actually got tired of it. But this park just has its way in finding more attractions for guests to enjoy whether local or international tourist. It is in my opinion, a tourism icon of Mindanao."
	},
	{
		"User": "CHOCO1981",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "Simply Enchanting",
		"Review": "I've been to Crocodile Park in Puerto Princesa, Palawan and it had been a learning experience for me and my friends and I was expecting just the same routine with the crocodile park in Davao, but I was amazed with the different experience that we had. \r Though the area is far from PUV terminals the taxi ride is short just beware as we experience the taxi driver got us round out of the way thanks to google map I directed him to take the right route or he will drive us further. \r We bought the ticket for around two hundred pesos (sorry forgot the exact amount) but since my parents are both senior citizens they able to have discounted price same with the kids entrance fee. The ticket is already good for the 3 places around the park (The Crocodile Park, Tribu Kamindanawan & Butterfly farm), there are shows on weekends for tribu and crocodile sad to say we go there Thursday so we did not able to see it. \r My parents enjoyed the crocodile park since not only crocodiles can be seen but there are also some koi fishes, wild animals like wild boar, tigers & phytons, and farm animals such as ox, ostrich and there are also beautiful species of birds."
	},
	{
		"User": "Nerry M",
		"Location": " ",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "Great not only to see crocodiles but also for outdoor sports",
		"Review": "I went to the park to watch a frisbee game. The place is huge with lots of spaces for outdoor games/sports like soccer, volleyball, and frisbee. The crocodile and butterfly farm is a great plus!"
	},
	{
		"User": "Ana Casilda A",
		"Location": " ",
		"DateofReview": "November 13, 2016",
		"ReviewTitle": "A good family experience",
		"Review": "I don't really like seeing caged animals but the entire experience can definitely be recommended for the whole family. Their shows are something to look forward to. Make sure to stay and watch the shows in the afternoon. We were able to watch the Sunday show and it was very entertaining. The staff and animal trainers are also really kind and helpful. "
	},
	{
		"User": "tito u",
		"Location": " ",
		"DateofReview": "November 11, 2016",
		"ReviewTitle": "Ferocious but forlorn looking crocodiles",
		"Review": "I never like crocodiles so expect this review to be completely subjective.\r \r I only went to the crocodile farm in Davao City as part of the itinerary.\r \r These crocodiles are not pets so they expect to be out in the wild rather than being caged in.\r \r They are unhappy so I'm I by merely looking at them without freedom to roam in the wild.\r \r The fire dance show was inappropriate for the place with reptiles. This can be done elsewhere like they do in Boracay.\r \r For educational purposes alright but the space where all the animals are on exhibit should be wider and spacious. Otherwise, the park owners and managers are not being environment-friendly and should be charged for cruelty to animals!"
	},
	{
		"User": "Apple S",
		"Location": " ",
		"DateofReview": "November 8, 2016",
		"ReviewTitle": "We had fun",
		"Review": "Its a nice park and we had a lot of fun. There are exhibits for all ages. The fire show was awesome."
	},
	{
		"User": "Kathrina Mishae... S",
		"Location": " ",
		"DateofReview": "November 7, 2016",
		"ReviewTitle": "Suitable for kids",
		"Review": "Kids who love animals will like the place. Aside from the crocodiles, there are a lot of animals here. It is like a mini zoo. Dont forget to watch the shows. That is what makes this place exciting. However, be prepared to sweat. It is...More"
	},
	{
		"User": "Rommel A",
		"Location": " ",
		"DateofReview": "November 6, 2016",
		"ReviewTitle": "Best Zoocrodile Farm in the Philippines ",
		"Review": "If you are looking for stunt defying, animal engaging, and awesome shows, it is the best place. Although P300 entrance is quite high."
	},
	{
		"User": "Freddie A",
		"Location": " ",
		"DateofReview": "November 6, 2016",
		"ReviewTitle": "Crocodile Park",
		"Review": "One of the best place to visit in davao city w/your family,want to see a real crocs,visit crocodile farm you may also try their crocs menu"
	},
	{
		"User": "Amy S",
		"Location": " ",
		"DateofReview": "November 6, 2016",
		"ReviewTitle": "CROCODILE PARK DELIMMA",
		"Review": "Visited Crocodile Park with family and friends. I noticed that there were many visitors from out of the country. One little boy from Australia asked if the reptiles shown were alligators or crocodiles. The guide of the park didn't know how to answer...lol"
	},
	{
		"User": "Shanseif2468",
		"Location": " ",
		"DateofReview": "November 2, 2016",
		"ReviewTitle": "quick peek",
		"Review": "we had a quick visit before we wrap up the tour in davao. aside from crocodiles, birds and snakes were presents too. though this place already needs some improvements."
	},
	{
		"User": "Angel A",
		"Location": " ",
		"DateofReview": "October 26, 2016",
		"ReviewTitle": "A visit at Croco Park",
		"Review": "Got a chance to see animals that you just usually see on tv or in some books or you never thought existed 😊"
	},
	{
		"User": "J7253IEstephend",
		"Location": "Melbourne, Australia",
		"DateofReview": "October 23, 2016",
		"ReviewTitle": "Crocodile park Davao",
		"Review": "like a small sanctuary with few tigers ostriches snakes and lizards and birds and off course the Crocodiles , there were some entertaining shows with the wildlife and afterwards fire dance show which was entertaining held at dusk"
	},
	{
		"User": "MrAngry50",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Oman",
		"Location": "Oman",
		"DateofReview": "October 7, 2016",
		"ReviewTitle": "Like a small zoo",
		"Review": "Did not give the feel of a 'park' more like a collection of holding pens for dozy animals. Cheap to enter, there are side shows of snakes and other animals, but very run-down and lacking real investment or business zeal."
	},
	{
		"User": "Jamal M",
		"Location": "Bandar Seri Begawan, Brunei Darussalam",
		"DateofReview": "October 3, 2016",
		"ReviewTitle": "Huge Crocodile and Cheap Leather",
		"Review": "The Crocodile Park is very attractive indeed with few beyond imaginable size crocodiles being kept in sanctuary. This park also houses other animals such as snakes, birds and very rare lizards.\r \r Of the most appreciable journey to this park is the availability of the cheap crocodile leathers merchandise. For collectors, this park is definitely a must have itinerary in Davao Del Sur."
	},
	{
		"User": "Katrina08_23",
		"Location": "Davao City",
		"DateofReview": "September 27, 2016",
		"ReviewTitle": "It's getting better!",
		"Review": "So many attractions have been added since i visited last year. The fish and ostrich feeding is quite entertaining, i love the farm village and it's nice that they no longer have an entrance fee when you enter at lolong's (biggest crocodile caught) replica. And oh! the baby ostrich is so adorable :)\r the fire dance is amazing!"
	},
	{
		"User": "Whangs",
		"Location": "Manila, Philippines",
		"DateofReview": "September 19, 2016",
		"ReviewTitle": "Entertaining, but pitifull for the crocs",
		"Review": "This place lets you get up close to varying sizes of crocs and appreciate the texture of their armor. It could get a little stinky in the noontime due to the intense sun. I suggest you visit 3pm onwards"
	},
	{
		"User": "Claire S",
		"Location": "Butuan, Philippines",
		"DateofReview": "September 19, 2016",
		"ReviewTitle": "I love the Animal Show!",
		"Review": "Davao Crocodile park is home of Hundreds of Salt Water Crocodile and other different animal species. It has different species of birds, koi, ostrich and snakes. The crocodile park is clean, huge and enjoyable for adults and children. It has morning and afternoon animal shows that informative and fun. What I love the most is orange-the orangutan. He really thinks and act like a human. and before I forget the park has an entrance fee of 160 pesos. They also sell ostrich eggs which I personally see. I was able to take hold of the snake as well and its human friendly. its my first time. and if you want to have free pictures of the creature you can pay 40 pesos for it. \r \r I will recommend the park for families who want to have interactive learning with the animals. They have snack booth so you won't be hungry. Overall, I love the place. "
	},
	{
		"User": "Rafael V",
		"Location": " ",
		"DateofReview": "September 16, 2016",
		"ReviewTitle": "Amazing!",
		"Review": "Had a great time here. Very amazed with the crocodiles. There are a lot of animals. The ostrich i met was super friendly! Haha. There was an animal show when we were there. We enjoyed the show! So Cool!"
	},
	{
		"User": "meomunbeou",
		"Location": "Ho Chi Minh City, Vietnam",
		"DateofReview": "September 15, 2016",
		"ReviewTitle": "Like a neglected park",
		"Review": "It's a poor park without anything except some crocodiles, eagles, tigers, birds. The park looks very old and boring"
	},
	{
		"User": "nccuaresma",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 11, 2016",
		"ReviewTitle": "To the zooooooo!!",
		"Review": "Great place to see not just crocodiles but tigers, snakes and birds. The animal show is good for the kids and kids at heart."
	},
	{
		"User": "Tom M",
		"Location": "Camden, New South Wales, Australia",
		"DateofReview": "September 11, 2016",
		"ReviewTitle": "Crocs... and more!",
		"Review": "This place is a great place to visit in Davao. When we arrived, we thought it was just crocodiles but we were surprised to see emus and even tigers! Add some monkeys and birds and its a great place to go. They have at least 50 crocodiles on site from babies to massive crocs.\r \r Entrance fee is a bit expensive but its worth the visit."
	},
	{
		"User": "77Raine27",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Cavite Province, Philippines",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "September 9, 2016",
		"ReviewTitle": "Not Worth It",
		"Review": "The entrance fee was at P300. To be honest it is expensive and not worth it. It would start off with a show on the antics made by birds, monkeys and chimpanzee.\r \r They should have elevated seats because we could hardly see some of the tricks that these animals did. \r \r Then the host of the show would announce to go to the crocodile. A huge one at that. Then, the tigers. They would show how they feed hem with several whole dressed chicken. Then there was a pool of orange fish (school of fish). You can also feed the ostrich. Feeding cost P20 of course it includes the fish. There was also a breeding place of crocodiles. We saw baby crocs. Saw 1 sheep and several geese. That's it for P300."
	},
	{
		"User": "Yvonne M",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "September 1, 2016",
		"ReviewTitle": "must be when visiting Davao....",
		"Review": "I'm always excited even just thinking of visiting this great place as we dont have this kind of park in our place..i was happy to see that they have added some new attractions, like the fishpond.. though we were looking for the \"naughty\" orangutan..they have also expanded the food area and we have a great time eating durian ice cream...i just hope that they will integrate the dragon fruits here or in some park since they dont have these anymore in the nearby private butterfly park where the dragon fruits abound the last time we visited...."
	},
	{
		"User": "apriljoyfiel",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 30, 2016",
		"ReviewTitle": "FUN!",
		"Review": "The day I visited here was full of blessings and surprises. From discounted rates to free passes. The place was truly a worth it experience with nature and its dwellers."
	},
	{
		"User": "Gerry S",
		"Location": " ",
		"DateofReview": "August 27, 2016",
		"ReviewTitle": "Well worth a visit",
		"Review": "Excellent experience. Very educational having loads of other wildlife as well which you can feed certain ones if you wish."
	},
	{
		"User": "Jon M",
		"Location": " ",
		"DateofReview": "August 26, 2016",
		"ReviewTitle": "The largest live \"Salties\" I had seen in my life",
		"Review": "This park was a bit of a drive from my hotel on Quimbo street, the taxi cab fare totaled P150 at the time of this posting. There was a bit of a language barrier with the cabbie since I didn't speak Visayan but we managed. The entry fee to the park was P250, a bit steep but worth it in my opinion. The crocodiles are truly impressive, but there is much more to see than the salties, you also have an opportunity to feed some big cats (for a fee) and other exotic creatures. Great attraction."
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "not really a fan of animal parks but went just to see the place.",
		"Review": "lots of tourists are there, they sell souvenirs and crocodile siomai and crocodile burger. they also have a mini convenience store.\r \r lots of crocs from all sizes. the biggest one is Pangil in it's own enclosure. some animals are inside a small cage.\r \r there's a talent show every fri-sun. witnessed one and it was ok . i just hope they dont hurt the animals."
	},
	{
		"User": "Lina Gladys L",
		"Location": "Manila, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "good for kids",
		"Review": "this is recommendable, its not only crocodiles that you get to see there, but other animals as well. there are also animal shows which kids would enjoy."
	},
	{
		"User": "genagno",
		"Location": "London, United Kingdom",
		"DateofReview": "August 16, 2016",
		"ReviewTitle": "Leisure",
		"Review": "Treat out my Dad in Crocodile Park in which he enjoyed watching bird's show, playing with the birds, ostrich, fishes, feeding the crocodile, watching the peacock and the snakes."
	},
	{
		"User": "NewYorker73CostaRica",
		"Location": "Costa Rica",
		"DateofReview": "August 15, 2016",
		"ReviewTitle": "This is a third world zoo focusing on crocodiles.",
		"Review": "I enjoyed the time there, including the weekend 4pm show that centered on kids and education. It was fun. It is third world, but they obviously put effort into making it good. Those expecting the San Diego or Bronx Zoos should stay home. Those wanting fun and allowing it to happen should go. We paid 250P each. My companion, a Filipina, had never before been to a zoo, and watching her enjoyment made it a great day."
	},
	{
		"User": "GOFAR71",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Philippines",
		"Location": "Philippines",
		"DateofReview": "August 11, 2016",
		"ReviewTitle": "Serius Need of an Upgrade !",
		"Review": "Lots of crocs but the water is not so clear and the enclosures are old school and boring. They should keep the water clear so the crocs can be seen. A feeding attraction should be there just like the one in Island Cove crocodile park."
	},
	{
		"User": "Darryl G",
		"Location": " ",
		"DateofReview": "August 2, 2016",
		"ReviewTitle": "Crocs ",
		"Review": "this place has lots of crocodiles, you can expect that. And other zoo stuff.. It's not completely a zoo though.. I hope one day it will be filled with other kinds of animals.. Anyway, this is a fun place especially for those who love crocodiles..."
	},
	{
		"User": "LaiCz",
		"Location": "Paranaque, Philippines",
		"DateofReview": "July 31, 2016",
		"ReviewTitle": "Animals got talent & lots of crocodiles! ",
		"Review": "Best to visit the park on a Friday, Saturday or a Sunday when there's an animal show. Entrance fee is Php 300. We went there on a Saturday so were able to watch the 'Animals got talent' show which starts at 4pm. It may be...More"
	},
	{
		"User": "Werner I",
		"Location": "Karlskoga, Orebro Lan, Sweden",
		"DateofReview": "July 28, 2016",
		"ReviewTitle": "Tourist place",
		"Review": "A tourist place with tourist prices. Yes it´s very beautiful here in this Park, but too much people. I feel this crocodile live under much stress. Because staff do all they can so this crocodile will move. You can buy coffee here from Mount Apo....More"
	},
	{
		"User": "charmaineruizsison",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 27, 2016",
		"ReviewTitle": "Animal park in Davao!",
		"Review": "If you're looking for animals then you should really visit croc park! The place is such a wonderful site to have fun as you get to see different kinds of animlas."
	},
	{
		"User": "Milapablo",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "July 27, 2016",
		"ReviewTitle": "Big Crcodiles",
		"Review": "I saw Pangil, the biggest crocodile now at the center. We had a great time looking at the baby crocodiles and had pictures taken."
	},
	{
		"User": "Rhean A",
		"Location": " ",
		"DateofReview": "July 27, 2016",
		"ReviewTitle": "Crocs",
		"Review": "Me and my fiance enjoyed the visit. It was fun. There are many crocodiles and other animals. The show was great. If you are an animal lover- then u should go here!!!"
	},
	{
		"User": "Mario C",
		"Location": "Singapore, Singapore",
		"DateofReview": "July 27, 2016",
		"ReviewTitle": "Better to meet with a fence in between than to encounter one in the wild!",
		"Review": "That's why if you are in the Davao region and have never seen a Crocodile then that's a must visit! If you have seen already several times a Crocodile but have never seen hundreds of baby, toddler, teenager and grown up Crocodiles - it's a...More"
	},
	{
		"User": "Lawrence A",
		"Location": "Quezon City, Philippines",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "Exceeds expectations",
		"Review": "The Bird show and the wire man thing is a must-watch. Best part for me is Tribu K'Mindanawan's Fire dance!"
	},
	{
		"User": "Burnt_C",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "July 21, 2016",
		"ReviewTitle": "Bunch of crocs",
		"Review": "There were repairs being made when we went and the facility itself is really worn out. If you wanna see crocs, there's lots of it and you won't be disappointed. Except.... the cages and corrals for them are already overcrowded and the build isn't really...More"
	},
	{
		"User": "brummie2015",
		"Location": "Birmingham, United Kingdom",
		"DateofReview": "July 18, 2016",
		"ReviewTitle": "very good",
		"Review": "its very good , loads of crocs , fun for kids , there are also birds and big boa snakes if you like them , take plenty of water as i found it very humid in the park , but overall very good and intresting"
	},
	{
		"User": "drialexie",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 14, 2016",
		"ReviewTitle": "Re-live your love for animals. Very nice park for kids, adults, and anyone! :)",
		"Review": "Crocodile Park is one of the attractions in Davao City. If you love animals, or just want to see them, it is a place to be. You could see birds, eagles, snakes, iguanas, lion, tigers, ostriches, goats, sheep, ducks, etc. During weekends, I guess, they...More"
	},
	{
		"User": "Andreas S",
		"Location": " ",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "A great afternoon! !",
		"Review": "It is the 3rd time to visit in 6 years. The park improved every year. Our 2 boys (9&11) enjoyed the animals. Feeding the ostrich and the fishes. Watching the young Leon and monkey. Going into the cage with big lizard and turtle. Watching the...More"
	},
	{
		"User": "Kirsten Gail D",
		"Location": "Manila, Philippines",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "Very Entertaining",
		"Review": "We had fun watching the animal show as well as the fire dance performed by Tribu K' Mindanawan dance Troupe."
	},
	{
		"User": "havegutwilltravel",
		"Location": "Alor Setar, Malaysia",
		"DateofReview": "July 3, 2016",
		"ReviewTitle": "only decent park to visit in davao",
		"Review": "I like the scenic surrounding.. beautiful landscape..but once you enter the park it was horrible ..the place was not well kept ..most of the animals look aged and unhealthy..I know the management is having financial constraints..the teeth of the crocodile are so expensive ..other than...More"
	},
	{
		"User": "JNMauhay",
		"Location": "Central Valley, CA ",
		"DateofReview": "July 1, 2016",
		"ReviewTitle": "Croc Park",
		"Review": "The facility is well kept and maintained. The animals were takes cared. The staff were courteous and knowledgeable."
	},
	{
		"User": "PhilipinoRabbit",
		"Location": "Oregon",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "Very interesting",
		"Review": "Fun place for family. They have quite the crocodile raising program. Go early to beat the heat though."
	},
	{
		"User": "Remelyn F",
		"Location": " ",
		"DateofReview": "June 26, 2016",
		"ReviewTitle": "Recommended for kids and kids at heart",
		"Review": "We were able to catch the animal show at 4pm. The show was worth it and compensated for the time that we weren't able to tour the farm because of the rainy weather. Kids will enjoy it."
	},
	{
		"User": "Rex A",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 24, 2016",
		"ReviewTitle": "First time, not disappointed",
		"Review": "The place was great... growing up in Davao, i cannot believe i did not visit sooner. My daughter enjoyed the activities (koi and ostrich feeding ). She grew up in a very urban setting so it was a real treat to interact with the animals."
	},
	{
		"User": "MangDanny",
		"Location": "Manila, Philippines",
		"DateofReview": "June 21, 2016",
		"ReviewTitle": "its a zoo!!!",
		"Review": "i love staying on this park, the crocs are supper lazy but i enjoy staying here due to other animals in the zoo. i love playing with ostrich, turtle, lizard and the fishes on the pond."
	},
	{
		"User": "nprila",
		"Location": " ",
		"DateofReview": "June 19, 2016",
		"ReviewTitle": "Loved it!",
		"Review": "I was hesitant at first, I am never a zoo lover. I never was interested to see live animals. BUT thank you to my husband who reminded me to be interested as a good example to our son. In the end, I was happy, I...More"
	},
	{
		"User": "Constantin106",
		"Location": "Constanta, Romania",
		"DateofReview": "June 14, 2016",
		"ReviewTitle": "Crocodile park versus crocodile meal.",
		"Review": "As a world wide traveller, I have seen many similar places like this. This one is really friendly and attractive, even is mostly for kids. Probably a guide will make things better. Otherwise, is well presented and clean. The crocodile food area in the neighbourhood...More"
	},
	{
		"User": "Lorena P",
		"Location": " ",
		"DateofReview": "June 14, 2016",
		"ReviewTitle": "Crocodile visit",
		"Review": "It is quite interesting, but the restaurant there the riverside grill , very bad service, waiters are sarcastic & arrogant."
	},
	{
		"User": "Maria Gracia M",
		"Location": "Cainta Rizal",
		"DateofReview": "June 12, 2016",
		"ReviewTitle": "Like Avilon Zoo! ",
		"Review": "We went here last March with my kids, hubby and a friend. It is a big place with lots of different animals and crocodiles. We enjoyed the place and so the kids. Their favorite part is when they hand fed the fishes. It reminded me...More"
	},
	{
		"User": "aprilsky2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 9, 2016",
		"ReviewTitle": "A visit to the zoo.",
		"Review": "It is a mixture of thrill, fun and excitement. The park showcases crocodiles, snakes, birds, monkeys, ostrich, fish, tiger, peacocks, rabbits and other animals. I am saddened by one of the shows wherein one of the park attendants walked the wire with 80 crocodiles underneath....More"
	},
	{
		"User": "Andrew2016p",
		"Location": "Swansea County, United Kingdom",
		"DateofReview": "June 5, 2016",
		"ReviewTitle": "Crocodile Park Is Interesting",
		"Review": "I took my family for a day out at this park and we really enjoed. there are so many crocs to see and my dad almost touched a big croc before it snapped its mouth closed. I even found a resturant selling crocodile meat outside"
	},
	{
		"User": "mike k",
		"Location": "Dumaguete City, Philippines",
		"DateofReview": "June 2, 2016",
		"ReviewTitle": "Time wasted",
		"Review": "This is another boring attraction to see a crocodile sleep, the short stage show is for kids, don't last long and then you can walk around the jungle if interested,"
	},
	{
		"User": "timballenger",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Dumaguete City, Philippines",
		"Location": "Dumaguete City, Philippines",
		"DateofReview": "June 2, 2016",
		"ReviewTitle": "Davao inspection tour",
		"Review": "This is a very nice place to visit, there are loads of animals to see and the animal show is good for children of all ages. A very nice place to take the kids."
	},
	{
		"User": "Maria Elena F",
		"Location": " ",
		"DateofReview": "May 29, 2016",
		"ReviewTitle": "Nice",
		"Review": "Nice place for family bonding... Nice to have fun with friends too... Love the place even if the employees is not smiling..."
	},
	{
		"User": "Charlene M",
		"Location": "Cainta, Philippines",
		"DateofReview": "May 28, 2016",
		"ReviewTitle": "Clean, safe, and happy animals",
		"Review": "This is by far the most clean, organized, and safe Zoo I've been in within the Philippines. The animals look healthy and they are being taken cared of properly. The entire park is very spacious and clean. All the staff is very nice and helpful....More"
	},
	{
		"User": "sisterJOT",
		"Location": "Brisbane, Australia",
		"DateofReview": "May 27, 2016",
		"ReviewTitle": "If you love animals don't come here",
		"Review": "I am ashamed to say I actually paid money to enter a place that set up such appalling conditions for the beautiful animals that reside there. Simply put there is just not enough space, animals are crammed into spaces that are WAY TOO SMALL. Most...More"
	},
	{
		"User": "Cherry O",
		"Location": " ",
		"DateofReview": "May 26, 2016",
		"ReviewTitle": "Must Visit the Crocs",
		"Review": "It's my first time to went there, first i'm afraid of crocodile but if you visit there some other time. it was a great little Zoo adventure"
	},
	{
		"User": "Naji A",
		"Location": " ",
		"DateofReview": "May 23, 2016",
		"ReviewTitle": "Improved",
		"Review": "It's improved than my last time visit the park become more cleaner and organized and have some activities and programs to entertain"
	},
	{
		"User": "Aphio1925",
		"Location": "United Kingdom",
		"DateofReview": "May 21, 2016",
		"ReviewTitle": "Lots of crocs",
		"Review": "See different species of birds, fowls, monkeys, snakes and all other kinds of animals inside and of course the crocodiles....don't forget to try the famous civet coffee near the entrance."
	},
	{
		"User": "kym216",
		"Location": "Adelaide, Australia",
		"DateofReview": "May 10, 2016",
		"ReviewTitle": "Had a great time here",
		"Review": "Crocodile Park is a must do. Great value for money and fun things to do inside. Make sure you get some food to hand feed the fish :)"
	},
	{
		"User": "G7432CFelizabethh",
		"Location": " ",
		"DateofReview": "April 29, 2016",
		"ReviewTitle": "Seemed a little cruel",
		"Review": "Very barbaric compared to the zoos and wildlife parks I have been to in New Zealand (I haven't been to any, in any other countries) The Tigers were in very small cages, which were hardly the length of the Tigers themselves. A lone lion cub...More"
	},
	{
		"User": "E6495ZWjeanb",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Vesqueville",
		"Location": "Vesqueville",
		"DateofReview": "April 27, 2016",
		"ReviewTitle": "Amazing and interesting",
		"Review": "It's the second time I visit Crocodile's Park. Always the same feeling: marvelous trip, interesting visit, emotions, in a clean place and welcoming people."
	},
	{
		"User": "flxmanuel",
		"Location": "New York City, New York",
		"DateofReview": "April 20, 2016",
		"ReviewTitle": "quite exciting",
		"Review": "Quite exciting to see them protected...great job by making the place more interesting with other animals and attractions. it gets quite hot though, but still worth a visit. Very educational and staff are always helpful."
	},
	{
		"User": "Emil H",
		"Location": "New York City, New York",
		"DateofReview": "April 15, 2016",
		"ReviewTitle": "Day with my son",
		"Review": "My son didn't seem to really like it it's more interested with the heat and getting some place cool. I don't know how I felt about it crocodiles as just crocodile"
	},
	{
		"User": "Youncedl",
		"Location": "Meridian, Mississippi",
		"DateofReview": "April 13, 2016",
		"ReviewTitle": "Great, but....",
		"Review": "Some of the animals, especially the Tigers, appeared to be underfed and kept in very cramped cages. I really felt extremely bad for them."
	},
	{
		"User": "trentvano",
		"Location": "tampa FL",
		"DateofReview": "April 7, 2016",
		"ReviewTitle": "Just kind of a zoo.",
		"Review": "You can go here and see plenty of tigers (5 when I was there, all of which I felt sorry for because of their limited space in tiny cages), alligators of course (including dead ones being roasted over coals whose meat is sold for 70pp...More"
	},
	{
		"User": "Gracia M",
		"Location": "Cyberjaya, Malaysia",
		"DateofReview": "April 2, 2016",
		"ReviewTitle": "Average is good",
		"Review": "It's a small zoo with lots of different animals. Children will definitely enjoy it. We just bought tickets for P250 per head on a weekday just to kill time. The ticket includes the entrance to the nearby Tribu K'Mindanawan and Butterfly park. The trip would...More"
	},
	{
		"User": "Kira Maeshra E",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "March 31, 2016",
		"ReviewTitle": "Enjoyable !",
		"Review": "It was quite entertaining. We saw a different kind of animals tricks. The best was was the K tribu something with their fire dancing."
	},
	{
		"User": "265alastairm",
		"Location": "Durban, South Africa",
		"DateofReview": "March 30, 2016",
		"ReviewTitle": "Crocodile Park Davao City",
		"Review": "What an experience to see such a huge crocodile and the beautiful tigers! There is a show with various birds and animals taking part which must be seen to be appreciated."
	},
	{
		"User": "Nwrzx",
		"Location": "Jeddah, Makkah, Saudi Arabia",
		"DateofReview": "March 23, 2016",
		"ReviewTitle": "Part of our tour",
		"Review": "Crocodile is normal park, it may kids enjoy for spend some times in there. You can also feed the crocodiles with small amount of fee."
	},
	{
		"User": "thenavigator8",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "March 15, 2016",
		"ReviewTitle": "For the love of crocs and other animals",
		"Review": "It was my second time to visit the crocodile park and im happy that there are added attractions there. you can buy souvenirs, dine at resto. watch a very amazing fire dance during friday saturday and sunday. have a tattoo. What I really loved during...More"
	},
	{
		"User": "iPesky",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 13, 2016",
		"ReviewTitle": "Nice!",
		"Review": "Entrance fee of 250 for adult and 150 for kids is very acceptable. This amount gives you entrance for crocodile park, butterfly house and Tribu Kamindanawan. Crocodile park has a show that starts at 4pm. I dont know if this is done everyday or weekends only. I suggest you get your tickets if you arrive around 1pm then go straight to the Butterfly house which is located quite a distance from the park. We arrived around 2:30pm so our time concentrated mostly at crocodile park. \r There are a lot of animals to see and things to do like fish, ostrich and tiger feeding. The show which started at 4 was also fun. the show ended around 5pm which gave you time to look at the shops on your way to TrIbu Kamindanawan. You will be entertained at the venue with firedancing.\r Overall we had a great time at crocodile park. The kids really enjoyed the interaction. A word of advice, bsring extra shirt as you'll never know you might get wet when they introduce to you \"Pangil\" - a very large croc."
	},
	{
		"User": "TravelingKano",
		"Location": "Asuncion, Paraguay",
		"DateofReview": "March 10, 2016",
		"ReviewTitle": "IF Crocs are your thing, they're here",
		"Review": "Philippine Crocodile park is a small zoo built around the hundreds of crocodiles in the park of all shapes and sizes. They also have a large collection of Pythons native to the Philippines and a few non-native critters as well (like the ostriches)"
	},
	{
		"User": "Dominique H",
		"Location": "California",
		"DateofReview": "March 3, 2016",
		"ReviewTitle": "Average",
		"Review": "I recommend going on weekdays since there won't be a lot of people on that time, they have a large amount of crocodiles and they also have different kinds of animals suck as monkeys, snakes, birds, tiger and etc. They also have stores that u can buy food at. I recommend trying they're ice cream near the store."
	},
	{
		"User": "Tins C",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "February 26, 2016",
		"ReviewTitle": "the wild place",
		"Review": "here we found the wild animals like crocodiles, butterflies and birds. there are also many species and variety of one of a kind and rare animals. when you are here try the exotic crocodile dish and ostrich ice cream. the civet coffee and many more"
	},
	{
		"User": "wildlfower777",
		"Location": "Al Ain, United Arab Emirates",
		"DateofReview": "February 25, 2016",
		"ReviewTitle": "A One of A Kind Park & Mini Zoo",
		"Review": "Crocodile Park in Davao City strategically located at Dizon Propery in Diversion Road is a park and mini zoo at the same time. The main attraction is the host of crocodiles being breed in the place by its owners for varied purposes. The crocodiles are provided with concrete habitats adapted to their natural living conditions. Their livings quarters are designed in such a way that they can be viewed by interested tourists at the same time they are comfortable. The main attraction of the park is the Crocodile show where a trained man walks in a tightrope above the crocodile quarters, crossing to the other side with the hungry crocodiles underneath him.... Scary and breath taking!!! "
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"DateofReview": "February 19, 2016",
		"ReviewTitle": "what a croc",
		"Review": "plenty of crocs with little to no movement. i did not try the icecream that i heard about after i went a must do from people that have had it"
	},
	{
		"User": "CindyWorld",
		"Location": "Chatham, Canada",
		"DateofReview": "February 17, 2016",
		"ReviewTitle": "Crocodiles and other Exotic animals",
		"Review": "I enjoyed my trip here. I like what I saw in this park. I even held snake and baby croc. The price to get in was very reasonable. I'll recommend this park for weekend family activities."
	},
	{
		"User": "Jay S",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 15, 2016",
		"ReviewTitle": "Wide variety of animals with entertaining shows! ",
		"Review": "I went here with my family along with some my siblings, nieces and nephews. We went to look at the different animals and I love how the park has a lot of animals in there. \r \r You can feed the lion, the crocodile and some birds. You also can get up close with the ostriches as well as get near the monkeys. The shows are also entertaining. \r \r There is a comfort room always nearby and they sell great food too! I recommend this place if you want a great family time. "
	},
	{
		"User": "Angela Grace C",
		"Location": " ",
		"DateofReview": "February 13, 2016",
		"ReviewTitle": "Fun Field Trip 😊",
		"Review": "We do annual grade level field trip in this place for our students' performance task. They offer discounts for big groups, and very accommodating to our needs ;)"
	},
	{
		"User": "FrogBandit",
		"Location": "London, United Kingdom",
		"DateofReview": "February 11, 2016",
		"ReviewTitle": "I disgusting prison for beautful wildlife. It is poorly managed and the ethos sickens me.",
		"Review": "While I was there I may have looked like a happy tourist but I can assure you I was far from it. I saw wounded crocodiles (though their size impressed me) as they are in a space too small for them all and were clearly fighting. Birds in chains, rainforest animals in enclosures with no stimulation, metal bars and concrete floors, overcrowded tiger enclosure (when a tiger is a naturally solitary creature), no privacy for the animals, and the worst for me watching an orangutan collapsing all over her cage on the hard concrete, still on display, coming around from drugs administered.\r They allow you to hold the reptiles but don't encourage you to disinfect your hands after. They should have a gel. This could potentially lead to salmonella if not careful. I am not sure of the risk, but still a disinfectant should be used.\r They also had a lot of crocodile leather etc for sale. Yet they call themselves conservationists???!!! This place was originally a crocodile farm, but obviously adding more animals (which they continue to buy) made an attraction.\r The fish pond is overstocked with koi carp and the water is filthy.\r The parrots look miserable and are in chains with no privacy.\r \r So yes basically please don't go here and add your voice to enforce positive change on this hell hole or to close it down!"
	},
	{
		"User": "danmbuen",
		"Location": " ",
		"DateofReview": "February 10, 2016",
		"ReviewTitle": "So much crocodiles! =)",
		"Review": "The place is accessible by taxis.\r \r There are so much crocodiles in all sizes. There are other animals found like different birds, ostrich, snakes, tigers, koi, and monkeys. What's nice is they allow interaction between animals. We fed the kois and ostriches. Feeding the ostrich was quite an experience, seeing a huge animal approaching you and feeding on your hand is little frightening at the beginning.\r \r There is an animal show. Too bad the seats are not enough to accommodate everyone. But it was enjoyable and educational.\r \r There is an ice cream store outside the park. We tried a crocodile ice cream and it has crocodile egg; it has similar taste with regular ice cream.\r \r The fire show is also okay. \r \r I recommend this place especially for families and kids."
	},
	{
		"User": "Ellen Laspobres F",
		"Location": " ",
		"DateofReview": "February 5, 2016",
		"ReviewTitle": "good for kids to visit this place",
		"Review": "its more fun to come in this crocodile farm coz you can get closer with selected friendly animals and take photo.... getting to know different kind of breeds animals, not only crocodile also birds and snake. they have also animal show start to 4pm until 6pm.... you must try.... "
	},
	{
		"User": "Dan D",
		"Location": " ",
		"DateofReview": "February 5, 2016",
		"ReviewTitle": "Nice place",
		"Review": "We really enjoyed this place. They have much more than just crocs. We stayed for the fire show witch was great. I'd go here again!"
	},
	{
		"User": "wimmo",
		"Location": "Amsterdam, The Netherlands",
		"DateofReview": "February 3, 2016",
		"ReviewTitle": "A nice little adventure.",
		"Review": "Certainly a place to visit if you want to escape the hassle and noise of the city.\r More like a small zoo than just a crocodile farm. The crocs are the main attraction though.\r  There are however a few other exotic animals. There is even an animal I have never seen before and I have been to a lot zoos. Half monkey - half bear! What a sight. A reason enough to go there."
	},
	{
		"User": "TheBambino03",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 28, 2016",
		"ReviewTitle": "First time at this place, Davao Crocodile Park!",
		"Review": "We decided to bring our nephew to this sanctuary one Sunday morning. When we arrived at the place, I was surprised by the cleanliness and the proper layout of the entire facility. Each crocodile cage were properly labeled and arranged. Arranged according to the size of the crocodiles (i.e. the biggest crocodile was placed near the entrance, etc). Another thing, the natural smell of the animals (crocodiles, tigers, etc.) were not so overpowering, meaning to say, the cages are being maintained and cleaned regularly. Special mentioned is their koi pond, my nephew had a blast feeding these adorable fishes.\r \r But all is not perfect, obviously, they need to make bigger cages for the tigers so that they can freely roam. You know, small cages are stressful for the tigers. Improve their canteen and souvenir shop.\r \r Overall, this is a good place to bring the kids and the whole family for relaxing and learning."
	},
	{
		"User": "reinavender",
		"Location": "Singapore, Singapore",
		"DateofReview": "January 22, 2016",
		"ReviewTitle": "The giant crocodile was the best attraction",
		"Review": "These were crocodiles you only watch on NatGeo or the news. They were there snapping at each other and the sound was mind-numbing. We got there a good ten minutes before closing. The ticket people still charged us full rate without telling us they were closing shortly. We had to hurry our way around the compound to maximise our time."
	},
	{
		"User": "John M",
		"Location": "London",
		"DateofReview": "January 12, 2016",
		"ReviewTitle": "gets better every year",
		"Review": "we visit this park every couple of years and each time we go it improves. this year it was superb, they have added a few more attractions which makes the visit even more pleasurable. you can now hand feed the fish or see the exciting bird and animal show. for a small private owned rescue centre, this place just keeps getting better. a great half day out and at a reasonable price."
	},
	{
		"User": "AlyannaReinhardt",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Frankfurt, Germany",
		"Location": "Frankfurt, Germany",
		"DateofReview": "January 9, 2016",
		"ReviewTitle": "Never Ceases to Amaze Me",
		"Review": "Went there last January 4 of this year together with my boyfriend since he wanted to see a crocodile, I've been there for a total of three times with a great time distances, one from which I was just 4 years old, second time was when I was 14 during our Science Field Trip and this year. I did the same thing from 7 years ago, I held the python and the crocodile, though 7 years ago there were no tigers it was my first time seeing them that close. It was fun but I was a little skeptical about how strong the cages are. It was a cool experience to be seeing those animals. But at the same time I feel sad with those that are in the cages (not the crocs and the snakes)\r Entrance fee cost 250 per head. And their ice cream was so yummy."
	},
	{
		"User": "Laurence H",
		"Location": "San Francisco, CA",
		"DateofReview": "January 6, 2016",
		"ReviewTitle": "An Excellent Way to Kill a Few Hours with the Family",
		"Review": "Kind of a mini-zoo with various opportunities to feed the animals. Great for young kids. It was kind of wild to see a croc being roasted on a spit at the end. But hey, it's exotic. 800 php for 2 parents and 2 kids."
	},
	{
		"User": "Dominick L",
		"Location": "Laguna Province, Philippines",
		"DateofReview": "January 5, 2016",
		"ReviewTitle": "Interesting",
		"Review": "The place defines what a crocodile park should be, however, there are alot of visitors and it is a bit hard to photograph without accidentally taking a picture of another person. There are other animals too and at the end of the park there is...More"
	},
	{
		"User": "gr8wealth",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 1, 2016",
		"ReviewTitle": "A great way to entertain visitors",
		"Review": "I have been to the park 4 times now and always enjoyed myself. We have taken our overseas guests and they have all been truly amazed. Make sure you don't miss the feeding time at 3pm especially the feeding of the tiger."
	},
	{
		"User": "onsadarrab",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "December 31, 2015",
		"ReviewTitle": "Let's help protect nature",
		"Review": "Great place to learn and be inspired in conserving nature. Visiting the place also helps in conserving the animals in there. Kids do enjoy it! I'll give it two thumbs up👍🏼👍🏼"
	},
	{
		"User": "Flatlander131313",
		"Location": "Belle Fourche, South Dakota",
		"DateofReview": "December 26, 2015",
		"ReviewTitle": "Nice experience",
		"Review": "Nice place to visit, but hard to get a taxi after dark. Shows were fun to see, and a great place to take kids."
	},
	{
		"User": "Ken Marius F",
		"Location": " ",
		"DateofReview": "December 26, 2015",
		"ReviewTitle": "Ok for a day",
		"Review": "Crock park's are the same all over the world. But this one has a good show. And you shoumd go on feeding day. But the vest is sved for afterdark. You go to the resturant and have great pinoy meal and ig you like you...More"
	},
	{
		"User": "villeneuve79",
		"Location": "Malmö, Sweden",
		"DateofReview": "December 23, 2015",
		"ReviewTitle": "Small park with many animals",
		"Review": "There are plenty of animals to look at here. But the cages were way too small. It was obvious that some of the animals was stressed with their small confinement. Photo opp with snakes and crocodile was cool though"
	},
	{
		"User": "Paul E",
		"Location": "Cassadaga",
		"DateofReview": "December 23, 2015",
		"ReviewTitle": "Great little park",
		"Review": "Took a quick visit. Very clean nice park. Good shows. Had a good time. Didn't get to spend enough time here. Can't wait to go again. Beautiful place."
	},
	{
		"User": "AniMei1",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Bacolod, Philippines",
		"Location": "Bacolod, Philippines",
		"DateofReview": "December 23, 2015",
		"ReviewTitle": "Like a Zoo!",
		"Review": "Crocs are not just the main attraction here. Land, air and water animals are present, too. We came on a weekday so there weren't many people/visitors around. Most of the animals were either asleep or resting so we didn't really get to \"mingle\" with them...More"
	},
	{
		"User": "Rebecca G",
		"Location": " ",
		"DateofReview": "December 2, 2015",
		"ReviewTitle": "Just ok",
		"Review": "If you like crocodiles then this park is for you! I found it a little boring and repetitive and the smell. Good for younger kids. Had a few different things like ostriches, tigers, birds, tortoises, orangutans."
	},
	{
		"User": "calub m",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "December 1, 2015",
		"ReviewTitle": "Entry point to adventures",
		"Review": "Crocodile park in davao is your gate to try the wild water adventure or wild water rafting. I will review the davao wild water adventure first. There are strong and weak points during our adventure let us start with the strong ones: 1. Locker are...More"
	},
	{
		"User": "ladynaoj",
		"Location": "Salmiyah, Kuwait",
		"DateofReview": "November 28, 2015",
		"ReviewTitle": "Educational place",
		"Review": "It's my nephew first trip to Davao city, so we decided to bring him to the crocodile park, it was indeed an Amazing visit as the place is well maintained. Even me, I'm surprised to see some animals in the place as im expecting to...More"
	},
	{
		"User": "Taildrag",
		"Location": "Clearwater, Florida",
		"DateofReview": "November 25, 2015",
		"ReviewTitle": "Lots of crocodiles and many other animals",
		"Review": "We spent an afternoon here and really enjoyed the place.Of course crocodiles were here but also eagles,monkeys,ostriches,parrots,pythons,turtles,and many others.The admission is very cheap and includes a 1 hour show with eagles,parrots,orangatangs,monkeys,etc.It was quite entertaining.Children will love this place.A wonderful example of nature and animals being...More"
	},
	{
		"User": "TonyUy",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 23, 2015",
		"ReviewTitle": "A big tooth to remember",
		"Review": "Simple one of the best tourist attraction on Davao City! Educational and very organized, Crocodile Park gives their customers the satisfaction that they worthily paid for! Don't miss the shows, from a monkey playing basketball to a tiger climbing a pole for its meal! Yes...More"
	},
	{
		"User": "BRENTON J",
		"Location": "Devonport, Australia",
		"DateofReview": "November 23, 2015",
		"ReviewTitle": "What a Great place to take the family when in Davao",
		"Review": "A fantastic place to spend a day or Afternoon with the family. This place has a large collection of crocodiles ranging from Hatchlings all the way up to a 15 foot monster. There are tiggers and numerous native birds to see. It is not just...More"
	},
	{
		"User": "lanaval",
		"Location": "Manila, Philippines",
		"DateofReview": "November 16, 2015",
		"ReviewTitle": "Mini Zoo",
		"Review": "Aside from seeing the juvenile to the adult crocodiles, there were also some other animals to see like birds, snakes, bearcats, monkeys, ostriches, turtles and a few more. It has an interactive arena where guests can hold and take pictures with a big snake, a...More"
	},
	{
		"User": "Lenore B",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "November 12, 2015",
		"ReviewTitle": "davao crocs",
		"Review": "I thought the place is just like the same crocodile park I have seen in other places before but it thrills me to see crocodiles and the lion feasting on the meat being given by the caretaker. The animal show is amazing and the buwis...More"
	},
	{
		"User": "Tet C",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Metro Manila, Philippines",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "November 12, 2015",
		"ReviewTitle": "Well kept Zoo & Great animal show",
		"Review": "You should time your visit on Fridays to Sunday around 4pm. They have a great animal show. We got our tickets for Php 200 for adults, inclusive on entrance to the Zoo, butterfly park and Tribu K (fire dance show); all of which are walking...More"
	},
	{
		"User": "Rynzel G",
		"Location": "Dagupan, Philippines",
		"DateofReview": "November 7, 2015",
		"ReviewTitle": "A showcase of different kinds of animals!",
		"Review": "I thought, I will only be able to see many crocodiles here but when we got there, I was wrong. They have lots of animals from different kinds of birds to snakes as well as huge lions. \r The entrance fee is 200php but if you wanted to get closer to the cage of the lions you'll add 25php. There are also restaurants and booths inside and near the place when you can have your meal or snack e.g. ice cream, sugar cane juice. \r I can say that It's not pretty amazing but worth the visit. "
	},
	{
		"User": "JayZee007",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "October 31, 2015",
		"ReviewTitle": "I Guess Crocs Don't Need Much to Live On...",
		"Review": "...but the rest of the animals and birds in this park do!\r \r PROS - If you're a city kid/adult, there's probably not a lot of places like this you can go to see a wide range of animals. I mean they have tigers, an orangutang, ostriches, pythons, and loads of crocodiles. The feeding time show is something you really don't see everyday.\r \r CONS - It's really not that well-maintained. The tigers pace in their cramped cages. There's wear and tear everywhere. It would be lovely if the greenery were more lush and healthier. Only the crocs don't care that their water is dirty.\r \r More people should go so they can have more funds to better the upkeep of the park."
	},
	{
		"User": "mindyderro",
		"Location": "North Vancouver, Canada",
		"DateofReview": "October 27, 2015",
		"ReviewTitle": "Crocodile Farm",
		"Review": "Missed the crocodile show. The Phyton was scary although tamed and the mouth closed. There were a lot of out of owners which is good for the tourism."
	},
	{
		"User": "Kn E",
		"Location": " ",
		"DateofReview": "October 21, 2015",
		"ReviewTitle": "The Child in Us",
		"Review": "We arrived in the Park at 8:30 AM on a Sunday, which was just 30 minutes from the time that they opened. As expected, the park is jam packed with students who were on their excursion. The last time that I visited the park was way back in the 90's ( i know. i haven't got enough time to roam around :D ) my 3 year old son enjoyed the show and he got so fascinated with all the crocodiles that he saw ( he just got disappointed when he didn't see any cheetahs . LOL! ). The park opens at 8 AM. Adult entrance fee is 200 pesos and child entrance fee is 100 pesos. There is also a souvenir shop just on the right side when you are about to exit the park. They have strollers for rent for children which could range from 60pesos-100pesos (if i am not mistaken) just right at the entrance. \r We just did not stay that long on the crocs area coz of the stinky smell, so as on the area where the monkeys are. We could not stand it.\r The ice cream that they are selling just right outside, near the exit area is superb. it tastes good that you have to try it, it is 60 pesos for 2 scoops of the ice cream.\r Part of the tour is the butterfly sanctuary(i think that is what it is called). You have to walk a distance though to get there, or it would be better if you bring with you your car for it to be much more easier for you to get there.. there were just a number of butterflies,not like before. There's a little bit of a playground for the kids, trees, benches and tables where you can sit down and rest for a while.\r \r If you want your kids to enjoy and learn, this is a must visit place. "
	},
	{
		"User": "jake162015",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "October 21, 2015",
		"ReviewTitle": "Well maintained zoo",
		"Review": "It was awesome the first time we visited like 3-4 years ago, and again this year. I'm amazed how big this crocodile named Pangil, I believe he was the biggest croc in captivity since Lolong was captured. Better to visit this zoo during weekends because they have a show at 3pm. For me the most entertaining part of the show is how they poke a stick to Pangil to agitate him and you can see him up close and feel his powerful jaw clamp its way to the stick. Amazing! I do hope they know what they're doing, I'm kinda worried because they might stress this wonderful creature. "
	},
	{
		"User": "Kristienne L",
		"Location": " ",
		"DateofReview": "October 17, 2015",
		"ReviewTitle": "Kids were amazed",
		"Review": "Making ur kids experience how does crocodile and other animals looks in real life..my kids really love it here.. It was a very nice experience and for sure we will visit again next time.."
	},
	{
		"User": "Tsuperman74",
		"Location": "Butuan, Philippines",
		"DateofReview": "October 14, 2015",
		"ReviewTitle": "Croc for food!",
		"Review": "Oh my if you have knack for exotic food, this is the place... this is the place for recreation if you have children, your friends, family."
	},
	{
		"User": "Irene F",
		"Location": " ",
		"DateofReview": "October 13, 2015",
		"ReviewTitle": "more of a zoological garden..",
		"Review": "my idea of a park is where you can take a picnic anywhere within the vicinity. sadly, this place is not conducive for that. with a 200 peso entance fee, it's quite exorbitant for a regular local tourist. the place is quite cramped for its growing animal population(or the space is just maximized).but if you're an animal\r lover, the tigers and the crocs are enough to make your experience fun."
	},
	{
		"User": "John Elbert H",
		"Location": " ",
		"DateofReview": "October 10, 2015",
		"ReviewTitle": "Crocs everywhere!",
		"Review": "We had a lot of fun here by watching different kind of shows. And that guy walking on a thin wire amazed everyone by his \"buwis buhay\" performance! lol . We tried the crocodile ice cream and i think there's nothing special with that ice cream. lol"
	},
	{
		"User": "Jim B",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 7, 2015",
		"ReviewTitle": "Short of expectations",
		"Review": "While visiting Davao, my wife and I looked up places to visit and decided on Crocodile Park which seemed to have good reviews. We were both disappointed in the place. There was only one show on schedule and we missed the first half of that. It felt like there were more birds and other animals in cages then actual crocodiles. The entry fee boasted of free trip to Butterfuly farm also and a fire show. However, the Butterfly farm consisted of one pen with one species of butterfies and we were told the fire show was only on weekends. It only took about 45 minutes to view the place and we both left feeling a little jilted. It's ok to visit once especially if you have children, but go on a weekend or you will be wasting your time."
	},
	{
		"User": "jim b",
		"Location": "Melbourne, Australia",
		"DateofReview": "October 4, 2015",
		"ReviewTitle": "Appalling",
		"Review": "If you like seeing animals suffer in confined spaces then this is the place for you. Don't ride you bike to this park as they do not allow bicycles anywhere on the property, not even in the car park."
	},
	{
		"User": "Michael S",
		"Location": " ",
		"DateofReview": "October 1, 2015",
		"ReviewTitle": "croc of crocs",
		"Review": "this was a fairly uninspiring experience. there were a lot of crocodiles, keep in rather run down conditions. there were serveral other animals as well keep in smallish cages. there was li ited opportunity to interact. the crocodiles farms in malaysia are far more interesting"
	},
	{
		"User": "Jameson L",
		"Location": "Antipolo City",
		"DateofReview": "October 1, 2015",
		"ReviewTitle": "Not much fun",
		"Review": "The park is well kept but nothing much to show and the souvenirs on sale are pricy. I had fun with the ostrich though."
	},
	{
		"User": "Nelle258",
		"Location": "Quezon, Philippines",
		"DateofReview": "September 16, 2015",
		"ReviewTitle": "Crocodile Ice Cream",
		"Review": "Not everyone know's that an ice cream made of crocodile exist. I'm not sure if it really is made of crocodile but it tasted like one. (I tried crocodile sisig and it's really good)."
	},
	{
		"User": "jessicasY6091HN",
		"Location": " ",
		"DateofReview": "September 14, 2015",
		"ReviewTitle": "I've visited this place for..",
		"Review": "Maybe not more than but nearly 10times With family members, relatives and friends from other countries and cities. Atleast once, check this place. Good for tourist"
	},
	{
		"User": "robmaghinang",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "September 14, 2015",
		"ReviewTitle": "One of the best zoos in the country.",
		"Review": "The Davao Crocodile Park is a huge complex where souvenir shops, restaurants and tours are offered (such as the Davao Wildwater Adventure). There is a good amount of different animals inside and you can even take of pictures with them for a minimal fee of Php 40 (US$ 0.86). Those animals include a yellow boa constrictor, parrots, Brahiny kite, iguana and, though I haven't seen myself, a baby croc. Here's my other observations:\r \r The upside:\r \r 1. Well-maintained and clean unlike the Crocodile Farm in Puerto Princessa, Palawan.\r 2. Plenty of animals. \r 3. Easily accessible from the city center. Don't be fooled by the distance. Take a jeep from downtown to St. Peter's Parish in Maa (pls confirm this to the locals, I tend to forget things a lot) then a motorcycle to the complex. Total ride wouldn't take more than 30 minutes. \r 4. A few food center are inside but souvenir shops are few and don't offer a lot. \r 5. Animal show is very entertaining and hosted by a great animal enthusiast. \r 6. Countryside and adventure tours are offered inside which may save you time. \r \r The downside:\r \r 1. Entrance fee of Php 200 (US$ 4.28) is a bit more than other zoos in the country but still worth it. \r 2. As far as I am aware of, the animal show (called the Animals Got Talent) is only shown around 4pm and none in the morning. \r 3. Restrooms, though smells disinfected a lot, already seen its prime days.\r \r The Davao Crocodile Park is definitely a must-see for tourists and locals alike. It was well-maintained unlike some of the parks that I have seen myself and was never boring. It is an added plus that I got a complimentary pass after I signed up for the Davao Wildwater Adventure and the Tribu K' Mindanawan and its Kaonanan restaurant."
	},
	{
		"User": "ColinG1960",
		"Location": "Melbourne, Australia",
		"DateofReview": "September 13, 2015",
		"ReviewTitle": "Very Interesting",
		"Review": "You get a chance to see these guys pretty close up. Safety of fences of course. Cost was minimal and is a nice place to stroll around. Other attractions are close by. So you can do three different ones together."
	},
	{
		"User": "Tiggerbug",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Las Vegas, Nevada",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "September 9, 2015",
		"ReviewTitle": "Must see",
		"Review": "Nice palce for locals and tourists to go to. Very informative ... And they sell the civet coffee at their spivenier shop too."
	},
	{
		"User": "Jane A",
		"Location": " ",
		"DateofReview": "August 31, 2015",
		"ReviewTitle": "Must place to visit for Photographers!",
		"Review": "Yes, this place is really interesting since it gives you a close feel to nature and animals you don't often see in Manila. An escape from the usual sight of buildings and crowded busy streets. We had fun taking pictures of the crocs and their usual reactions! ;)"
	},
	{
		"User": "beach-coholics",
		"Location": " ",
		"DateofReview": "August 30, 2015",
		"ReviewTitle": "dirty tourist spot .. not impressed",
		"Review": "this is my second time to visit the place ... not maintained , not cost effective for an entrance fee of 200 --- no tourist guide to assist you , staffs not accomodating ,water full of molds and algaes , foul and. pungent smell, i think as one of the tourist spot in davao they should maintain the good atmosphere and cleanliness in the area"
	},
	{
		"User": "Dinesh_Chamara",
		"Location": "Matara, Sri Lanka",
		"DateofReview": "August 25, 2015",
		"ReviewTitle": "an excellent combination of entertainment shows",
		"Review": "you should visit this place afternoon. the reason is... when you purchase your ticket you'll receive 3 tickets together. one for crocodile park,one for butterfly house(200-300m away from croc park), & one for the unique fire dance show. you can get a photo with a giant python & crocodile. you can see a man do stunt works on a rope over a crocodile cage. i would not recommend the show with tigers as the tigers were caged in a manner not so much secured. i mean the cages.\r butterfly house...hmmmm i'd say 5/10\r you should definitely watch the fire dance. 100% unique. 10/10\r to experience the best you should go there afternoon. otherwise you'll feel its worthless."
	},
	{
		"User": "Kryzz C",
		"Location": " ",
		"DateofReview": "August 19, 2015",
		"ReviewTitle": "Must Visit!!! 1 Day City Tour Itinerary",
		"Review": "I often visit Davao City for business, and when I'm there its just Jacksridge for dinner and Bluejaz at Samal Island for the weekend, and then we decided to go with the whole fam. As part of my 5 day vacation, I allocated a day for city touring, this includes, Lon Wah Temple, San Pedro Cathedral, Osmena Park, Museo Dabawenyo (closed on a Sunday), for Lunch it's Lachis (closed on a Sunday) or Davao Dencia... And spent our whole afternoon at Crocodile Park. This is a must, I must say because it surely is one, if not only park that I've seen where all animals are well taken cared... Not only will you see crocodiles, but other animals too. Entrance is very affordable; and they also have a show, twice a day. This is a good place to visit with kids, a place they would surely enjoy!"
	},
	{
		"User": "Mortanah",
		"Location": " ",
		"DateofReview": "August 14, 2015",
		"ReviewTitle": "Wonderful adventure. ",
		"Review": "For anyone who has never seen a real crocodile up close and personal this is a must!! If you are there during the feeding there is this crazy guy who goes right into the pit and throws meat at them as they follow him around. Insane. Also if you love big snakes you can hold this massive one shows in the photo. There are also numerous other wildlife as well as a couple tigers that are remarkably active for being in captivity. Also make sure you bring your wallet as the gift shop has some real cool items like genuine crocodile leather belts and wallets! Lots of fun!"
	},
	{
		"User": "Than T",
		"Location": "Manila, Philippines",
		"DateofReview": "August 13, 2015",
		"ReviewTitle": "Picnicking in Crocs Park",
		"Review": "Definitely a picnic groove! What set this apart from other crocodile farms is that the park is designed for freestyle walk in the park type of tour. I find it favorable to have no tour guide to tail for (though some may find it unworthy to gain no knowledge of the evolution of crocs, so to speak), that you have unlimited time in the area, that you have plenty of things to do and creatures to see beyond crocs. \r \r But there must at least be some orientation about the crocodile culture."
	},
	{
		"User": "Brisflip",
		"Location": "Brisbane",
		"DateofReview": "August 10, 2015",
		"ReviewTitle": "Not Good",
		"Review": "Visited the Davao Crocodile park last week. To say I was disappointed is an understatement. The animals all were confined to dirty small enclosures or pens. To give an example, the tiger was confined to a cage fifteen feet by ten feet. All he could do was pace up and down. The main attraction being crocodiles, yes there were plenty of all ages but the pens were not well maintained and smelled. The other support animals all looked to be in a fair state. The maintenance of the attraction really let the park down. For the admission price of $200 pesos you would think that everything was included...not. The ostrich attraction is additional pesos and the ostriches look like half plucked chickens.... Not happy. If this was in Australia I would have reported the park to the Animal Protection Society. "
	},
	{
		"User": "tiger_downunder",
		"Location": "Brisbane, Australia",
		"DateofReview": "August 9, 2015",
		"ReviewTitle": "Not really appreciates me most!",
		"Review": "Some animals were poorly maintained. The biggest croc has tiny enclosure. Tiger pen is not maintained and the tiger's pool water is filthy. Poor tiger remained inside the cage just walking around. Birds with no feathers and ostriches looks like dressed chickens. It's the only zoo-like place in Davao for locals to visit with few animals. "
	},
	{
		"User": "RoeBut",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Antwerp, Belgium",
		"Location": "Antwerp, Belgium",
		"DateofReview": "August 6, 2015",
		"ReviewTitle": "Amazing reptiles, beautiful birds",
		"Review": "This was an interesting visit to this \"crocodile farm with benefits\"\r A thing not to miss is surely the bid show, where people are pointed to the necesarity of environmental protection and how to achieve it yourself. The other shows we sadly missed because of a severe tropical rain shower.\r This park sets in in a nice environment. They have apart from crocodiles in all sizes and weights a nice collection of birds, some orang-utans, a lot of the same and some different snakes...\r The only downside are the cages, they could use some serious renovation and modernisation...\r All by all this was an nice and interesting visit."
	},
	{
		"User": "Dioneli S",
		"Location": "Iloilo City, Iloilo City, Philippines",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "Worth the visit!",
		"Review": "About 10 to 15mims drive from city proper, it's a fun place to visit.\r \r Entrance fee is Php200 including admission to the Crocodile Park, Tribu K'Mindanawan, and Butterfly Garden. From the outside, the park looks small but there are lots of places to explore inside. Allot half day if you only want to visit the croc park only, and whole day if you want to visit the whole park and watch the Fire Dance (Fridays and Weekends only).\r \r Aside from the crocs, they also have turtles, dragon lizard, tiger, ostrich, deer, and birds inside. The birds are not in cages so you can take pictures with them and interact up close.. though they are shy and tend to hide inside their pigeon holes/bird house.\r \r They have restaurants inside as well as an ice cream shop that serves exotic ice cream flavor (Ex. Ostrich Vanilla, Croco Coffee, Croco Durian, etc.). They also serve civet cat (poop) coffee.\r \r We didnt get to check their butterfly garden though.\r \r The place is clean and well-maintained. No WIFI available. Lots of parking space."
	},
	{
		"User": "loislaneNy/nj",
		"Location": "ny/nj",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "I felt bad for the animals I do not think they are being cared for properly",
		"Review": "It is so hot in the Phillipines and barely any of the animals had water in their cages, they looked like they were suffering in the heat.!\r  the birds with ropes on their legs on outside perchs to me is pitiful, they look so sad.\r I walked away depressed"
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 29, 2015",
		"ReviewTitle": "Davao Crocodile Park is not only about Crocodiles",
		"Review": "A touristy destination which the children would love! There are animals other than crocodiles! And if there are children with you, do watch their bird show. Rather entertaining. Although I have qualms about teaching animals tricks that are unnatural, like the monkey playing basketball or riding a scooter. But hey, the children love it."
	},
	{
		"User": "Go_Bag_Lite",
		"Location": " ",
		"DateofReview": "July 27, 2015",
		"ReviewTitle": "Go see Pangil while he is being fed",
		"Review": "The main park is OK but I like the crocodile delicacies. Crocodile ice cream! Go here at around 4:30 pm so it is not so hot and the animals have rested well.also there is a fire dance at around 5:20pm."
	},
	{
		"User": "gladysfuentesando",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 25, 2015",
		"ReviewTitle": "\"Kids' first Davao City visit\"",
		"Review": "A very nice and interesting place to visit when you're in Davao City....my kids and me had a great time during our visit last summer, April of this year 2015...my kids with their cousins had a great bonding moments in this place...watching crocodiles...birds...eagles..butterflies...rabbits...tigers...snakes...the kids even had a try holding a baby crocodile...we are looking forward to visit here again come next summer vacation."
	},
	{
		"User": "April M",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 24, 2015",
		"ReviewTitle": "\"So Great\"",
		"Review": "As i have enter, i was so amazed because i have seen such crocodile for the first time and it made me so happy. I love the environment. So fresh and clean."
	},
	{
		"User": "Joyce C",
		"Location": "Iloilo Province, Philippines",
		"DateofReview": "July 23, 2015",
		"ReviewTitle": "...a typical zoo.",
		"Review": "You literally have to take a ride if you went there during lunch time. The place has lots of animals in there, but nothing really bizarre. I like the display of animal bones, and the fascinating eagles! I think the first thing in your bucketlist when going there is to try out the crocodile meat dishes."
	},
	{
		"User": "John W",
		"Location": " ",
		"DateofReview": "July 17, 2015",
		"ReviewTitle": "Well worth a visit",
		"Review": "This is a chance to see some of the most dangerous animals up close, and learn something about them in the process.\r Although we got lost trying to find the park due to a lack of signposts, it was worth it in the end!\r From photo opportunities with snakes and baby crocs to an educational bird show, features for children and adults have been carefully designed.\r The tightrope walk and watching the massive estuary crocodile reacting to bait are highlights of the day. \r As sun sets visitors are treated to a fire dance, which impressed the whole audience despite a slow start which seemed to concentrate on the operation of fire extinguishers for about 15 minutes! Small grumble for an entertaining show.\r All round, it's a very enjoyable way for a family to spend the afternoon and early evening.\r Arrive for around 3.30 as the shows start at 4pm, and it's beginning to cool by then."
	},
	{
		"User": "thepreciousgems",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Busuanga Island, Philippines",
		"Location": "Busuanga Island, Philippines",
		"DateofReview": "July 14, 2015",
		"ReviewTitle": "Animalistic",
		"Review": "Crocodiles are actually adorable creature,if they're still babies. That's got my attention when I first saw a bunch of them in this place..I think it is one of the main attraction why this place is tourist-attractive.Of course there are other \"star\" animals showcased to entertain guests. Be sure to visit, especially if your an animal lover."
	},
	{
		"User": "David B",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 14, 2015",
		"ReviewTitle": "Crocodile Park",
		"Review": "The crocodile show where a member of the team is on a tightrope above the gaping jaws of several large crocodiles is a bit corny but well played out. Beware it is very difficult to get a taxi home from here, so make sure you have your travel arrangements taken cared of."
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 10, 2015",
		"ReviewTitle": "Still the same...",
		"Review": "Visited the park once again. Still the same from the last time I visited. No other improvement on the park. A zoo that needs more improvement. Resting benches I suppose should be added especially for old folks."
	},
	{
		"User": "adianau",
		"Location": "Philippines",
		"DateofReview": "July 9, 2015",
		"ReviewTitle": "Gator Tour",
		"Review": "This place is where you can see, learn and experience what are the different kinds of Crocodiles the Philippines has aside from Palawan."
	},
	{
		"User": "Jane C",
		"Location": "New York City, New York",
		"DateofReview": "July 8, 2015",
		"ReviewTitle": "chilled",
		"Review": "The place is amazing. I think its the biggest crocodile that I've seen in my whole life. We were really caught by surprise coz we thought that the crocodile was just a sculpture then it suddenly move... wow if we were just captured by a camera i dont know what we looked like hahaha...The bird show was also entertaining. The birds are just so smart."
	},
	{
		"User": "Sheena F",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "July 6, 2015",
		"ReviewTitle": "Fire Dance and Crocodile Ice cream!",
		"Review": "We arrived there mid Saturday afternoon. Entrance fee was 200pesos which allows you to enter the Crocodile Farm, Tribu K Mindanawan and Butterfly Sanctuary.\r \r The place was not the huge but it does have an array of animals in it. From Aerial, Water and land animals. The place have a lot of crocodiles, hence the name says so. There are tigers, monkeys, turtles and birds. \r \r At around 4pm, their show begins. They had birds doing all sorts of stunts, Pangil (biggest croc in the park), crocodile feeding, tiger feeding and a man walking on a rope and below was a bunch of crocodiles. breath taking but very entertaining! \r \r We also tried their ice cream. Guess what, it was crocodile ice cream. It sounded so off, I know. But it really tastes good. At least the crocodile coffee ice cream was. And hey, the coffee was made from Civet coffee aka poop coffee haha.\r \r The last show was Tribu K'Mindanawan. I'd say its one of the best fire dancing shows I have ever seen in my entire life. It was crazy and they were crazily good! So many stunts and props that added to the awesome performance. This is the best part of the day!\r \r We didnt get to see their ButterflySanctuary cause it was already closed when we decided to go there (closes at 5pm).\r \r I'd recommend going there at around 2.30pm. thatll give you enough time to go around before the shows start at 4pm."
	},
	{
		"User": "cmsyambao",
		"Location": "Angeles City, Philippines",
		"DateofReview": "July 2, 2015",
		"ReviewTitle": "Great Learning Experience",
		"Review": "I visited here with my family and I must say this is a recommended site to visit. Entrance Fee was P200 for Adult and P100 for Kids. We had fun during the interaction with the tigers."
	},
	{
		"User": "bam086",
		"Location": "Manila, Philippines",
		"DateofReview": "July 2, 2015",
		"ReviewTitle": "clean and interesting",
		"Review": "despite the animals - place was clean. Animals were well fed. Crocodiles looked lethargic - but that's better than them looking ravenous : ). Enjoyed and will go back again"
	},
	{
		"User": "Karololivar",
		"Location": " ",
		"DateofReview": "June 30, 2015",
		"ReviewTitle": "Pangil the crocodile.....",
		"Review": "When it happen that youre in davao city dont forget to write crocodile park in the list of place you need to visit.... thdm place is awesome together with their different animals....you sure will enjoy it!"
	},
	{
		"User": "Jrak907",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Sydney, Australia",
		"Location": "Sydney, Australia",
		"DateofReview": "June 26, 2015",
		"ReviewTitle": "one of the best places to go",
		"Review": "I like the animal encounter especially for the kids and the cultural presentation or fire dance at the tribu k'mindaoan. exotic foods are a must try. Best to go during weekends for their cultural presentation at tribu k'mindanaoan. If you are on a budget, I suggest to better bring your own food and water as it is expensive buying there.\r \r I dnt like the butterfly sanctuary, well u cant see lots of them there. the long walk towards it is not worth but if u got car and u got plenty of time then better check as well coz it is part of the package u paid.\r \r All in all, it s great to visit crocodile park."
	},
	{
		"User": "AndreiSabang",
		"Location": "Cebu City, Cebu City, Philippines",
		"DateofReview": "June 17, 2015",
		"ReviewTitle": "Lots of things to see",
		"Review": "Me and my friends went there at around 4PM and we just came in time to watch the daily show. After the show, one could get a up close photo session with some of their docile animals. The ticket lets you enjoy three areas. The butterfly area closes at 4PM though so we had not checked that out. There was also a fire dance at around 5:30 which we skipped. Lots of food there that were a first for me like the croc burger and durian ice cream."
	},
	{
		"User": "redgoglac",
		"Location": "Welshpool, United Kingdom",
		"DateofReview": "June 15, 2015",
		"ReviewTitle": "A Great Afternoon in Davao",
		"Review": "This was a welcome surprise. Plenty of crocodiles and we stayed for feeding time which is well worth waiting for. There are other animals there such as tigers, orangutangs, snakes, lizards, turtles and more.\r The cafe is fine and everything is very affordable. For a better view of everything, here's a video.\r \r https://www.youtube.com/watch?v=9efSst3NfNQ"
	},
	{
		"User": "Jan B",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 12, 2015",
		"ReviewTitle": "good place to unwind",
		"Review": "its a 15km travel from ecoland terminal to this place.\r \r you motsly spend 200 - 270 just for the taxi fare.\r \r you have to pay 200 pesos for the entrance (per person)\r then they will let you use their inhouse payong (umbrella) for sun and rain protection :D"
	},
	{
		"User": "Zendel1234",
		"Location": "Manila, Philippines",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "Nice place to see",
		"Review": "This place is suited for children and people who are interested of crocodiles. The place is not that big you may roam around for an hour. Nice to have pictures w/ birds, albino snake & baby crocodile. The entrance fee for adult is 250 pesos while for senior & child (12 below) is 125 pesos."
	},
	{
		"User": "Jhexs",
		"Location": "Kalibo, Philippines",
		"DateofReview": "June 1, 2015",
		"ReviewTitle": "Closed encounter With Crocs",
		"Review": "Crocodile Park is a perfect place to visit for those Pet/animal lovers, and place good for family Bonding, and recreation. A place that must not be miss to visit when your at Davao City."
	},
	{
		"User": "Hilary B",
		"Location": "Cagayan de Oro, Cagayan de Oro, Philippines",
		"DateofReview": "May 29, 2015",
		"ReviewTitle": "Davao Crocodile Park Experience",
		"Review": "My experience in Davao Crocodile Park was really amazing since it was my first time. I think the entrance fee cost around maybe 250php, not sure. But it's actually worth it. There were other animals too, like deer, ostrich, tigers, and different kinds of birds. The guide introduces the animals and while they're at it, you can actually roam around the place. After the Crocodile Park, you can proceed at the fire dance show beside the park. The fire dance will start at 6PM."
	},
	{
		"User": "MMLO",
		"Location": "Manila, Philippines",
		"DateofReview": "May 27, 2015",
		"ReviewTitle": "It's okay",
		"Review": "I hope they will maintain and take care of the animals better. There are a lot to see and appreciate but you can see some animals are not in a good shape. I hope they can maintain the park properly and they should provide a map so that people would know where are the other site and animals that they are looking. Would appreciate if they have a tour guide so that visitors can have fun and appreciate what they offer. "
	},
	{
		"User": "flaboes",
		"Location": "The netherlands",
		"DateofReview": "May 26, 2015",
		"ReviewTitle": "Crocodiles",
		"Review": "i was there with my Philippine wife . you can walk on a kind of bridge over the croc,s , there is not much action , until you pay a little money to give them food . it,s a kind of funny , most of them are lazy , but they tell you a lot about the animals . but 1 time visit is enough"
	},
	{
		"User": "Alexis Ian Lom... F",
		"Location": " ",
		"DateofReview": "May 21, 2015",
		"ReviewTitle": "Wow Crocodile Farm",
		"Review": "We visited this place more then once bu still seeing a crocodile is still interesting they have also other animals such as tigers. Lamas. birds. and monkeys in the afternoon they conduct a show the most hair raising was when thy guy jumping in to the water were there are crocodiles dont worry he usually catches the line"
	},
	{
		"User": "JustJyv",
		"Location": "Makati, Philippines",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "Close Encounters",
		"Review": "We went to Crocodile Park last year with friends who visited Davao for the first time.\r \r They have an entrance fee, of course, to be able to maintain the place. They also have different packages for the tour/shows inside the crocodile park vicinity. \r \r Our package includes a tour to the butterfly farm which is a long walk from the crocodile park, and to be honest it's a bit disappointing there as they only have 3-6 types of butterflies which are small.\r \r Butterfly tour aside, we have enjoyed our time in the crocodile park as it doesnt only hold crocodiles but you'll see other animals as well like different type of birds, snakes, monkeys, turtles, wild pigs, deers and Tigers! :)\r \r I like that you can get very close to the Lions (they are in their cages though) and they're very photogenic. I have also seen the Lions being fed and it's a fascinating experience."
	},
	{
		"User": "michael59102",
		"Location": "michael",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "Fun time with the crocs and butterflys",
		"Review": "Get the package deal walk thru at your own time lots to see loved the butterfly house, has a tribal area and learn a little history of Mindanao. Watch the people feed the crocs, interact with the snakes, petting zoo. Feeding time is 2 to 3:00. You can spend a whole day here if you like. Food and souvenir shop is available. In tribal area there is a lunch special buffet around 12 to 1:00. The whole park is Very affordable and well worth the time, around 200 pesos per person to get into the park, located on the outside of Davao but well advertised. Also available is a water rafting Package that sounded like so much fun but you got to be there at 7: am to get it. "
	},
	{
		"User": "Jhourn",
		"Location": "Tondo, Manila, Philippines",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "Crocs ",
		"Review": "The park was best for the people who loves the zoo and crocodile farm.. If you want to go here just visit it during weekends bcoz they have aviary show for the visitors.. me and my friends enjoyed this park!"
	},
	{
		"User": "kinnikinik",
		"Location": "Seattle, Washington",
		"DateofReview": "May 17, 2015",
		"ReviewTitle": "Big Crocs and lots of them",
		"Review": "good place to spend an afternoon./ morning. also home to Davao's river rafting adventures company. Damn that one Croc is BIG!!"
	},
	{
		"User": "Christopher M",
		"Location": "Tampa, Florida",
		"DateofReview": "May 10, 2015",
		"ReviewTitle": "Crockodile Park Dont Miss IT !",
		"Review": "Its a really nice park and safe ! There are some very nice animals to see and you can tell they treat the animals with respect. I loved the Phil Eagle ! Great way to spend a day ! Butterflies too !"
	},
	{
		"User": "wenlong3788",
		"Location": "Bacolod, Philippines",
		"DateofReview": "May 10, 2015",
		"ReviewTitle": "so so",
		"Review": "We allotted 2 hours for the whole park complex only to be bored to death. The crocodile park can be finished in 30-40 minutes. The shows were ordinary and didn't have much to show. The butterfly farm didn't have butterflies."
	},
	{
		"User": "nheesa",
		"Location": " ",
		"DateofReview": "May 1, 2015",
		"ReviewTitle": "Best for kids",
		"Review": "I didn't really enjoy the trip but if you have your kids with you then, they will surely enjoy this. You can almost tour the site within 30-45minutes. \r But its a plus that the place is clean.\r If this is your first time in Davao you should at least see Crocodile Park just so you can feel the \"Davao-vibe\". All in all, its not a bad place its just that kids would enjoy this more. "
	},
	{
		"User": "KatzT",
		"Location": "Manila, Philippines",
		"DateofReview": "April 28, 2015",
		"ReviewTitle": "Fun way to learn",
		"Review": "The best animal park I've been to here in Davao. The place is very clean and no bad smell. The animals are well taken cared of\r staff. On Fridays and Saturdays they have educational shows that feature some of their animal ambassadors like in the bird show. Adults and kids would surely love the exciting rope show inside the crocodile fence. An additional fire dance by the park's exquisite dancers is surely not to be missed. They also have restaurants and convenience stores inside so you don't have to bring food."
	},
	{
		"User": "MrDestiny",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Sydney, Australia",
		"Location": "Sydney, Australia",
		"DateofReview": "April 14, 2015",
		"ReviewTitle": "Conservation idea gets thumbs up, \"shows\" are cheesy.",
		"Review": "We were there on a weekend which I wouldn't recommend, due to the crowds. As a result it was hard to see the tiger and crocodiles being fed. Kids will probably enjoy it."
	},
	{
		"User": "Marie M",
		"Location": " ",
		"DateofReview": "April 6, 2015",
		"ReviewTitle": "not worth the trip",
		"Review": "When we entered the area I knew it wasn't worth it but for the sake of the first timers in the group, I just have to bear with them. You can tour the area in less than 30 minutes and then you're done. \r \r The place is for kids though."
	},
	{
		"User": "Ohman1972",
		"Location": "Iwakuni, Japan",
		"DateofReview": "April 2, 2015",
		"ReviewTitle": "Exciting!",
		"Review": "Had a good time walking around the park. They have several areas of crocodiles, of many ages. They also have other animals to view. There is an area to get a picture take with a large snake over your shoulders."
	},
	{
		"User": "arbsnoble",
		"Location": "Makati, Philippines",
		"DateofReview": "March 30, 2015",
		"ReviewTitle": "crocs everywhere",
		"Review": "this is where you can see live crocs being bred and kept. you can also see other animals like birds and mammals. its like a mini zoo but mostly it houses crocs."
	},
	{
		"User": "Charis K",
		"Location": " ",
		"DateofReview": "March 29, 2015",
		"ReviewTitle": "Something new for me",
		"Review": "Don't miss it if you visit Davao. Don't forget to feed crocodiles and take photos with snakes. After your round in the park you can taste crocodile meat at the restaurants alongside the river."
	},
	{
		"User": "Henna H",
		"Location": " ",
		"DateofReview": "March 27, 2015",
		"ReviewTitle": "Ok place to visit in Davao",
		"Review": "I always visit zoos on my travels but since this was my first zoo experience in Asia I was not comfortable with some of the conditions of the animals. Cage size, noise, proximity to visitors etc. Nevertheless, I think the park is worth a visit while in Davao. If you're up to it and lucky, you might get to be a part of the shows with wild animals. Different performances going on throughout the day. You have the opportunity to try crocodile ice cream and the meat itself. "
	},
	{
		"User": "Clive J",
		"Location": " ",
		"DateofReview": "March 27, 2015",
		"ReviewTitle": "Rather depressing!",
		"Review": "Taken there by friends, I was a reluctant visitor. Wild animals on show for the amusement of tourists is only acceptable 'entertainment' or education if the creatures have maximum freedom possible and access to their natural habitat. This is far from the case here. \r The crocodils oare in very shallow and far from clean 'ponds', the snakes are in concrete enclosures, and exotic birds are tethered with chains on their legs.\r \r Best avoided!"
	},
	{
		"User": "Robert M",
		"Location": "Glendale, United States",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Talented Birds and Beautiful Bengal Tigers",
		"Review": "Quite a variety of tropical birds. Bird talent show and yellow snake were quite a show. Tigers were being fed and that was something to see!"
	},
	{
		"User": "Stefano_Talassi",
		"Location": "Trento, Italia",
		"DateofReview": "March 18, 2015",
		"ReviewTitle": "3 attractions in one place",
		"Review": "Nice place to visit. The are: one zoo, one park of butterflies and an ethnical museum. It is interesting to see and to taste crocodile (if you want to eat it). The location is quite, very organised and with some restaurant too. Around there are fields, with farms and big places for sport too."
	},
	{
		"User": "jen_x7280",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "San Mateo, Rizal, Philippines",
		"Location": "San Mateo, Rizal, Philippines",
		"DateofReview": "March 17, 2015",
		"ReviewTitle": "Big Park",
		"Review": "lots of reptiles, you can take a picture of a yellow snake for souvenir. Its a long walk for you to see the different reptiles and birds."
	},
	{
		"User": "Ernest D",
		"Location": " ",
		"DateofReview": "March 3, 2015",
		"ReviewTitle": "Nice day Outdoors and WOW what crocodiles !",
		"Review": "I loved the park the admission was fair and it was a real joy to walk throughout the park. The staff let you enjoy your time with your loved one and were not overly trying to get you to do things -- nice peaceful place and day outside. Very nice place to visit --if your in Davao don't miss it ! Plus I got to see a live Philippine Eagle WAY COOL !"
	},
	{
		"User": "Murphy-Hagunos",
		"Location": "Kuala Lumpur",
		"DateofReview": "February 22, 2015",
		"ReviewTitle": "Much More than Just Crocodiles",
		"Review": "If you simply do not like zoos, then you won't like this park. A small potion of it is very zoo-like, with tigers and snakes in small enclosures. But that is only a tiny portion of this park, and even those enclosures look clean and well cared for. \r  Other areas of the park allow lots of room for the animals to roam. And many animals there are. The reptilian creatures here include fresh- & salt-water crocks, turtles, iguanas, and snakes (mostly pythons). There is also a wide variety of other creatures -- mostly birds -- and Butterfly House, and Tribu K' Mindanawan Cultural Village are right next door. In fact, your P200 ticket is good for all three locations. \r  There are several decent eateries on the grounds, including a restaurant right in the Cultural Village. The washrooms are clean, as are the grounds in general, and the staff are friendly and helpful. There are the expected souvenir shops, and some nice stalls outside selling a number of ethnic items. \r  There are many different shows running throughout the day, but it would be wise to check the showtimes online BEFORE you go. We went from about 10 until 1:00 p.m.; however, two of the shows we'd like to have seen were on at 4 and 5:00 o'clock. \r  The crocs are easy to view from a raised walkway; so, you don't have to look through the cage, and you can snap some nice photos. The same kind of thing is true of the other shows too. You can take unobstructed photos of the performing animals. For P40 you can have your picture taken with an iguana or a colourful bird in your arms. \r  The butterfly area is smaller than others that I have been to, and there is not a huge variety. But you can get right up close for interesting and colourful photos. Walking from the Croc park to the Butterfly house, you walk by a number of very social ostriches, very shaggy sheep of some sort, and a huge number of game-birds. \r  The outing was definitely worth the time spent at the 3 attractions, both for children and adults. And although it was not spectacular, we will go back for another visit to take in a couple of those shows that we missed."
	},
	{
		"User": "wimmo",
		"Location": "Amsterdam, The Netherlands",
		"DateofReview": "February 20, 2015",
		"ReviewTitle": "A leisurely walk away from the bustle of Davao",
		"Review": "Love this place. It is just a small crocodile farm with a small zoo attached. We were just having a nice walk thru this park and in between, you get to see some shows with indigenous animals of Davao/Mindanao. The biggest attraction in this park is of course the humungous sea crocs and they are indeed HUGEEE.\r This park is not so easy to find though. From the highway, you actually enter a gated community-subdivision and the end of confusing streets.... you will eventually find it.... h ehehe he. Part of the adventure."
	},
	{
		"User": "parttimefilo",
		"Location": "Coventry, United Kingdom",
		"DateofReview": "February 19, 2015",
		"ReviewTitle": "fun",
		"Review": "small comprehensive zoo shame orang-outangs missing fun way to spend a few hours plus butterflies and villages makes a fun day"
	},
	{
		"User": "adangoyjr",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "February 12, 2015",
		"ReviewTitle": "A Must Visit in Davao City",
		"Review": "Dp not leave Davao if you have not visited this place. They also have a restaurant that offers food recipes using crocodile meat. Haven't tried ice cream made of crocodile eggs? They have it!"
	},
	{
		"User": "Alex B",
		"Location": " ",
		"DateofReview": "February 11, 2015",
		"ReviewTitle": "A visit with a blast!",
		"Review": "We visited the park last year with my two young children. It's not just crocodiles around but also a variety of birds, snakes, monkeys and other animals you can think of. Brilliant place to go to with children who love animals. My kids were able to hold a tortoise and a snake as well as a tiny crocodile. \r \r We tried the crocodile burger, a bit tough but tasty! Worth a visit for young families. "
	},
	{
		"User": "ride_and_dive_1965",
		"Location": "Philippines",
		"DateofReview": "January 26, 2015",
		"ReviewTitle": "Good attraction in Davao",
		"Review": "The park is generally good but if you are concern about animals in cage then better not to visit there... The crocodile pools are interesting and the 4pm feeding time is really impressive. However the other animals don't look very happy, snakes, monkeys, birds..."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "January 11, 2015",
		"ReviewTitle": "Just for a look..",
		"Review": "A place far from any merchandise. Not really nice but tho those who have not seen crocodiles and their activities it is a place to go. A revenue earner for the management and the city."
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "For those who haven't seen crocs yet",
		"Review": "If you are a fun of animals, if you haven't seen a croc yet, if you love crocs, if you want to have an ice cream with croc or ostrich, if you like dishes of croc and ostrich (so!!! Ironic)... This is a place for you... \r \r It's a good hang-out place. \r \r There's a football field, there are several restaurants that serve exotic food, or you can just park your car anywhere, pitch a tent, have a picnic and tale pictures. \r \r This place is huge, I had my driving lesson here (twice). :)"
	},
	{
		"User": "guestourist",
		"Location": "Manila, Philippines",
		"DateofReview": "December 31, 2014",
		"ReviewTitle": "Got worse ",
		"Review": "Our last visit prior to last Tuesday was two years ago. What's changed:\r \r Lolong is gone.\r No more snake feeding mice activity.\r Pay to see the tigers. On top of the entrance fee.\r More crocodile products for sale (e.g. skin, oil, meat).\r \r Disappointed and it will be my last visit since there's nothing new and exciting to see."
	},
	{
		"User": "Cookie O",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 30, 2014",
		"ReviewTitle": "High heat",
		"Review": "Went to this place on February 2013 with my boyfriend. The park is ok and there's not much to be excited about. There are some interesting animals and they sell poop coffee at high prices. It was really hot during that time and there was not enough shaded areas to rest in. They offer crocodile steaks and other food at semi-reasonable prices. \r \r There's no crowd and almost no customers besides us but that's a good thing if you like having the area for yourself. Great for intimate dates or family outings, I guess.\r \r Overall the experience was ok but I can't really see myself recommending this to anyone."
	},
	{
		"User": "Emjae V",
		"Location": "Makati, Philippines",
		"DateofReview": "December 17, 2014",
		"ReviewTitle": "Boring and everything has to be paid for",
		"Review": "Aside from the entrance fee, you need to pay separately if you want to go to the tiger area. ostrich area and there even was a part where you have to pay when you want to have your photo taken. Terrible."
	},
	{
		"User": "syed h",
		"Location": " ",
		"DateofReview": "December 15, 2014",
		"ReviewTitle": "nearly abandoned park",
		"Review": "I like the park. Situated at the outskirt of davao city. The park are poorly maintained but some animal like ostrisch.I reconmended this place for those who prefer quite and serenade park."
	},
	{
		"User": "Denver P",
		"Location": " ",
		"DateofReview": "December 14, 2014",
		"ReviewTitle": "So enjoy!!!",
		"Review": "Im so enjoy...since my first time I went in that placeshhdhdhhdxnznzkmzkxnxnxjxnxnxnxmxnxnjx xjx xjxlskowudbxidpsmxbisksmsizksmsozmsnxixnnxixmx"
	},
	{
		"User": "virmen",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "December 10, 2014",
		"ReviewTitle": "good enough",
		"Review": "This place is good enough for those pèrsin who didnt go yet in palawan... nice place thou.. but please put some more animals inside ehhheheh"
	},
	{
		"User": "Janice L",
		"Location": "Kuala lumpur",
		"DateofReview": "December 6, 2014",
		"ReviewTitle": "Crocky feeling?",
		"Review": "I find the entrance a little bit costly. But if you like crocs, this is the place to go. I have heard they supply LV for croc leathers. Also, they serve croc pizza!"
	},
	{
		"User": "Chrnzke",
		"Location": "Makati",
		"DateofReview": "December 2, 2014",
		"ReviewTitle": "Zoo",
		"Review": "Typical zoo. It was our first time to try crocodile egg ice cream. They have crocodile and ostrich egg. You can see LOTS of crocodile including Pangil, the biggest one. We were lucky there was an animal show when we visited the place."
	},
	{
		"User": "Dave A",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "General Santos City, General Santos, Philippines",
		"Location": "General Santos City, General Santos, Philippines",
		"DateofReview": "December 1, 2014",
		"ReviewTitle": "Bonding",
		"Review": "the first time i went here i was with my daughter. we enjoyed a lot since its our first time to hold exotic animals. good for family picnics."
	},
	{
		"User": "Enrique_3333",
		"Location": "Toronto, Canada",
		"DateofReview": "November 25, 2014",
		"ReviewTitle": "Came for the rafting",
		"Review": "The white water rafting operator is located in Crocodile Park! After the white water adventure, I was able to walk around. The park is nicely laid out. They have some MASSIVE crocodiles in this park which is nice to see. Well secured for customer safety."
	},
	{
		"User": "Peter S",
		"Location": "Tasmania, Australia",
		"DateofReview": "November 20, 2014",
		"ReviewTitle": "Not bad but still could be better",
		"Review": "Staff were friendly the bird show was great....animals did not look too happy though an older style animal park that probably needs to update its facilities more so for the animals"
	},
	{
		"User": "Eric E",
		"Location": "Philippines",
		"DateofReview": "November 17, 2014",
		"ReviewTitle": "Crocs. Period.",
		"Review": "The sight of a group of crocs resting in an enclosed area is already fascinating. Just what you would expect from a croc farm. But yeah, I just hope there were some crew who would talk to us from time to time rather than settle...More"
	},
	{
		"User": "AppleVManila",
		"Location": "Manila",
		"DateofReview": "November 14, 2014",
		"ReviewTitle": "croc park",
		"Review": "It was ok. typical crocodile farm. Palawan is better. I wish they have a tour guide to educate smaller groups. I believe they have guide for bigger groups."
	},
	{
		"User": "Edwin T",
		"Location": "Kuala Lumpur, Malaysia",
		"DateofReview": "November 11, 2014",
		"ReviewTitle": "Just a normal park",
		"Review": "Its just a normal crocodile farm and it also houses some tigers, apes, snakes and birds. It was raining at that time so we didn't really spend much time there."
	},
	{
		"User": "fuschangel",
		"Location": "Singapore",
		"DateofReview": "November 5, 2014",
		"ReviewTitle": "A day with zoo animals, a day with nature!",
		"Review": "We have visisted the place as part of our Nature Tour package in Davao. Since the place is called Crocodile park, we are expecting that mostly its about crocodiles but then we were surprised that it was like a mini-zoo. Although during our time of...More"
	},
	{
		"User": "darlynn1925",
		"Location": "Jackson, Tennessee",
		"DateofReview": "October 24, 2014",
		"ReviewTitle": "Need better maintainance",
		"Review": "The crocodiles and the other animals looked sad, the place is depressing. I hope the owners will provide more maintainance for this park. It has so much potentials to be a good park, but sad to say it looks old and poorly maintained"
	},
	{
		"User": "MElena89",
		"Location": "Nijmegen, The Netherlands",
		"DateofReview": "October 23, 2014",
		"ReviewTitle": "Especially nice for kids!",
		"Review": "We went there as a adult couple. The park itself is not so big. It's especially nice for kids. They have cool animals though, not only crocodiles, but also lizards and turtles you can see in a free walking zone. There are also ostriches and...More"
	},
	{
		"User": "Christine C",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 3, 2014",
		"ReviewTitle": "LOTS OF FUN FOR THE WHOLE FAMILY",
		"Review": "A bit of a trip from the city the crocodile park is great fun for the family, especially the kids. They have shows with birds, tigers and don't forget the many crocodiles. It can get hot and sunny during the day so don't forget the...More"
	},
	{
		"User": "Brunohits",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "September 23, 2014",
		"ReviewTitle": "Crocodiles!",
		"Review": "Great place to see crocodiles of different age and size! go around 3:00pm to see them feed the animals. Great place to visit if you are into local wildlife.."
	},
	{
		"User": "John M",
		"Location": "London",
		"DateofReview": "September 21, 2014",
		"ReviewTitle": "Nice day out",
		"Review": "They have constantly continued to upgrade this place every year. This was the 3rd time if visited in 6 years and it gets better every year. Don't expect the place to be on a par with some of the major zoos, this is a nice...More"
	},
	{
		"User": "MommyQueenElizabeth",
		"Location": "Philippines",
		"DateofReview": "September 19, 2014",
		"ReviewTitle": "Educational Trip, Nerve-wracking Crocodile Shows",
		"Review": "We enjoyed this place so much especially the show! The crocodile frenzy was scary. The dancing crocodiles was awesome. and the tightrope walking was a nerve-wracking eperience! There are also other attarctions nearby, like the Butterfly Garden, a walk away from the park and the...More"
	},
	{
		"User": "Jelleinne J",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "September 16, 2014",
		"ReviewTitle": "Try the civet coffee and croc ice cream!",
		"Review": "The animals look healthy and the place is well maintained. This is also where you can try a cup of the rare civet coffee for only 150php."
	},
	{
		"User": "richard k",
		"Location": " ",
		"DateofReview": "September 16, 2014",
		"ReviewTitle": "Embarrassed Tourist",
		"Review": "I am from New Zealand and I took my Filipina GF and her daughter to The Crocodile Park in the hope of having a nice and interesting 1/2 day out. I have to be honest and felt the experience was a big let down and...More"
	},
	{
		"User": "Darryn G",
		"Location": "Lower Hutt, New Zealand",
		"DateofReview": "September 16, 2014",
		"ReviewTitle": "Interesting and little scary!",
		"Review": "We took the extended family here for a visit. While we were disappointed with the crocodile aspect of the farm, we enjoyed getting up very close with the tigers, bats and birds. We also went into the \"dragon\" area where we had a closer encounter...More"
	},
	{
		"User": "chickmom",
		"Location": "Cebu",
		"DateofReview": "September 10, 2014",
		"ReviewTitle": "More time to appreciate",
		"Review": "We were here for just a short while with the kids just after lunch. They have affordable entrance fee. They also have shows which we did not avail since it will still be late in the afternoon. We took photos with the albino python, enjoyed...More"
	},
	{
		"User": "Rolly M",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "September 9, 2014",
		"ReviewTitle": "The Real Jurassic Park!",
		"Review": "The park is well-maintained. The comfort rooms are not spotless but fortunately, it doesn't stink. There are plenty of things to see in the park and you don't need a lot of time to explore it. There are also other animals like birds and other...More"
	},
	{
		"User": "gabbyxiu",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Surabaya, Jawa Timur, Indonesia",
		"Location": "Surabaya, Jawa Timur, Indonesia",
		"DateofReview": "September 6, 2014",
		"ReviewTitle": "Have a Crocodile Egg's Ice Cream",
		"Review": "I interested with this place because have a crocodile's egg ice cream taste durian. A lot of animals in here (not only crocodile) . have also bird, turtle, snake etc. have a food court inside. Crocodile park is near Davao Zorb Park, Butterfly Garden. You...More"
	},
	{
		"User": "Stephen M",
		"Location": "Tulsa, Oklahoma",
		"DateofReview": "September 5, 2014",
		"ReviewTitle": "Somewhat depressing",
		"Review": "Remember that this is the Philippines and not America, so they don't have the funds to build a nice, fancy zoo. That said, they have done what they could with the resources they have. Unfortunately, it was sad to see how many of the animals were kept. For young children wanting to learn about snakes & crocodiles it can be educational. And they have a few exotic birds. But overall, it was depressing to see and I'm sure the animals are not very happy."
	},
	{
		"User": "terry_pagunsan",
		"Location": " ",
		"DateofReview": "September 3, 2014",
		"ReviewTitle": "Live Crocodiles at Davao Crocodile Farm",
		"Review": "The short visit to the crocodile farm was amusing. There was an hour show about birds first before we are allowed to see the crocodile in there created habitat. There were many small, big, and large crocodile around. Some are active while others are just sleeping. Dressed chicken was the food given to them by the caretakers.\r \r We saw Live Ostrich also in the other side of the farm. I saw an Ostrich laid egg, so big that it can fill a large bowl. It's an amazing animal. Considered a bird but so tall that it cannot fly.\r \r by the night, a Tribu K' Mindanawan Dance Troup had a Fire Dance Show... Beautiful and what an experience. "
	},
	{
		"User": "Ma S",
		"Location": " ",
		"DateofReview": "September 3, 2014",
		"ReviewTitle": "Great place!",
		"Review": "Brought the kids here for a day out and spent about 8 hours here! Lots to see and do. The kids were in Gatorland in Florida and this place in Davao is comparable and not expensive. \r Overall, a great place for a family with lots to see and do."
	},
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "August 29, 2014",
		"ReviewTitle": "Great place to take the children.",
		"Review": "We liked the afternoon shows - the birds, the monkeys, etc. The feeding of the crocodiles and tigers of course are the highlights."
	},
	{
		"User": "R0dent",
		"Location": "Austin, Texas",
		"DateofReview": "August 27, 2014",
		"ReviewTitle": "Only for those with a crocodile fetish",
		"Review": "If you don't have much time in Davao, I'd give this park a miss unless you have a crocodile obsession or want to see how your expensive leather handbag looked when it was still alive. It's a small park that isn't well maintained. The crocodile habitat seemed fine. But the condition of the cages for most of the other animals seem too small or too neglected. I also felt sad seeing birds chained to a perch.\r \r I went on a Wednesday afternoon and there weren't much people there. That means, getting out can involve a long wait for a taxi. I had to wait about 30 minutes. There aren't even guys on motobikes for hire.\r \r It seems this area will eventually develop into some sort of tourism complex where many attractions can be found in one place. In addition to the crocodile park, there’s an area for a boating adventure and a butterfly park. There's plenty of empty acres for more attractions. So once this area gets more built-up with other things to do, it may be worth a visit to come out to this park.\r \r The most interesting part of my visit did not involve the park. It was when I left the park on taxi and drove south on the main highway through Ma-a. The area felt provincial and yet, the standard of living seem much higher compared to rest of provincial Philippines. There were nice schools, churches and businesses lining the highway. It made me want to stop and take some photos."
	},
	{
		"User": "Lynard M",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "August 24, 2014",
		"ReviewTitle": "nicer than manila zoo",
		"Review": "since i love animals, i have no issues at all. you better see it for yourself, appreciation is something to consider"
	},
	{
		"User": "MayaLauren",
		"Location": "QC, Phils",
		"DateofReview": "August 22, 2014",
		"ReviewTitle": "Well-kept croc zoo",
		"Review": "Well-kept grounds. You can see crocs in diff stages (small ones from the time they are hatched and full-grown ones). We tried the croc burger, per my husband's prodding. So you might as well try too in case you decide to drop by."
	},
	{
		"User": "Tony P",
		"Location": "Cairns, Australia",
		"DateofReview": "August 15, 2014",
		"ReviewTitle": "Fun for All the Family",
		"Review": "Great mix of attractions from our young child, to us and to mama also. Fun interactive shows, and a good variety of animals and reptiles. Well priced happy family fun"
	},
	{
		"User": "shellyespinelli",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "August 12, 2014",
		"ReviewTitle": "Okay place",
		"Review": "The place was ok but i think the animals can use more care. The cages looked like it needs maintenance The souvenir shop though is great. Loved the coffee they sell there."
	},
	{
		"User": "Rouella Grace L",
		"Location": "Cebu city",
		"DateofReview": "July 11, 2014",
		"ReviewTitle": "The fun and excitement",
		"Review": "It was my first time to go Davao, and by exploring the place It makes me really amazed by how the city keep its nature wild life last. It was great to visit the place and though I experience eating the first time ever crocodile strawberry ice-cream. It taste good as well :)"
	},
	{
		"User": "HappycamperCebuCity",
		"Location": "Cebu City",
		"DateofReview": "July 8, 2014",
		"ReviewTitle": "You can fed the crocs by yourself",
		"Review": "It was a nice experience to have a fed a crocodile. A nice place to relax and it is clean, too. The staff are friendly."
	},
	{
		"User": "trustingod",
		"Location": "Syracuse, New York",
		"DateofReview": "July 1, 2014",
		"ReviewTitle": "Relaxing place to visit.",
		"Review": "About the olny down side to this place is much of the cages are just to small for the animals. Other than that it is a very nice place to visit. It is clean (by Philippine standards) and you get to feed a few of the animals and even hold a giant boa constrictor. They have a small but nice gift shop and when I was there you could also get something to eat and drink."
	},
	{
		"User": "Noel S",
		"Location": "Blackburn, Australia",
		"DateofReview": "June 12, 2014",
		"ReviewTitle": "dont bother going there, poor",
		"Review": "The crocodiles are not able to be free to roam, locked up with 100s in a small cage. The orangutan cage made me cry, did not take any photos"
	},
	{
		"User": "AprilCamias",
		"Location": "San Pedro, Philippines",
		"DateofReview": "June 11, 2014",
		"ReviewTitle": "Enjoy the shows",
		"Review": "The place was just like the typical zoos in Manila or Crocodile Park in Palawan, but what most tourists are attracted was the shows conducted by their so-called \"Ambassadors of Nature\" Me and my friends enjoy the show given by these ambassadors of the nature. We're like kids who are clapping and really laugh with the acts that these animals made."
	},
	{
		"User": "oyemaria",
		"Location": "Manila, Philippines",
		"DateofReview": "June 3, 2014",
		"ReviewTitle": "they serve roasted crocodiles here!",
		"Review": "we visited here May 2014. \r \r against my will, i gave it a try to visit the place to kill time. I am against animal captivity but my friend was insisting so we dropped by. \r \r before we could even park the car, i couldn't believe what i saw. they are roasting crocodiles and serve it to guests who want to try it. it blew my mind! and by the way, they also have crocodile flavored ice cream and they sell crocodile meat too. \r \r they keep the surroundings clean but i really pity animals in captivity. those birds that are kept in chains, i can almost hear them say \"what should i do with these wings?\" \r \r There's a huge crocodile in the pool. alone, maybe dying of boredom too! \r \r well if you want to give it a try, entrance is at Php200 when we were there. just a small park actually."
	},
	{
		"User": "GraceSanJuan",
		"Location": "San Juan",
		"DateofReview": "May 15, 2014",
		"ReviewTitle": "Go early",
		"Review": "Taxi driver assured us it was still open (7:30p.m.) When we arrived it was closed, had to return back to resort (waste of money), they close at 5p.m...Dont believe taxi cab drivers- not all are honest."
	},
	{
		"User": "JuliaJav",
		"Location": "Bacolod, Philippines",
		"DateofReview": "May 11, 2014",
		"ReviewTitle": "Great Place for kids",
		"Review": "Entrance fee is 200 pesos per person and you get to see 3 attractions: Crocodile Park, Tribu Kamindanawan and Butterfly House. The Park was quite fun for the kids since they got to see other animals aside from crocodiles. There were ostriches, birds, peacocks, snakes, eagles, monkeys etc. They even got to touch the birds & snakes and feed the crocodiles. The place is quite hot when we got there at around 10:30am. Nothing much to see though at the other 2 attractions. We skipped going to the Butterfly House since it was far and small anyway."
	},
	{
		"User": "zenizen111",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Quezon City, Philippines",
		"Location": "Quezon City, Philippines",
		"DateofReview": "May 9, 2014",
		"ReviewTitle": "Its a nice animal park",
		"Review": "The crocodile park is actually an animal park. Aside from the crocodiles, other animals are on display on cages such as birds, ostrich,,snakes and monkeys. There are also stuffed animals on display. The crocodiles are still the stars of the park. There are young and adult crocodiles, small and big crocodiles. There are burger kiosk and souvenir store at the entrance. bringing an umbrella is a must for the visit as protection for the sun or the rain. There are no trees or shady areas in between cages. The park staff are friendly and helpful. Souvenir items are also affordable. This is an recommended for educational trip and for those who love nature."
	},
	{
		"User": "Tj L",
		"Location": "Manila",
		"DateofReview": "May 2, 2014",
		"ReviewTitle": "Park is OK; Butterfly House is a waste of time",
		"Review": "We got here on a really hot Sunday afternoon just before 3 o'clock because info from blogs and websites say the first show starts at 3:15 pm and we were hoping not to miss any. But it was 3:30 pm and still no show has started, and we already toured the whole place, had a picture with the yellow snake and the little croc. Thirsty and hungry, we went back to the area near the entrance because there was a burger kiosk there selling croc meat and ostrich meat burger. But they conveniently ran out of croc meat and no bun so no ostrich burger, either. So we ventured in towards area with pasalubong stores but failed to obtain crocodile ice cream and civet coffee (no stock). \r \r It was nearing 4pm and still no show, so we decided to go to the Butterfly House. The staff we asked for directions told us it was \"walking distance lang, mam.\" He must have been with Moses during the Exodus, because the distance from the main park to the Butterfly House was walking distance of biblical proportions. And when we got there, well, let me say that the Butterfly House itself was smaller than my mother's shoe closet and we finished 'touring' the place in under 3 minutes.\r \r When we got back to the main park, the show has already started with some cockatoo playing basketball. We didn't stick around for the other shows because we were already tired, hot, thirsty and hungry. We will just watch the shows on Youtube. We'd probably go back there the next time we visit Davao, but maybe after 5 pm and on December when the weather is significantly less hot and humid.\r \r Tips for people who want to visit the park: Bring water, don't lose your other tickets (you will be given 3 stubs - one for the main park, one for the tribu k'mindanawan, and the other for the Butterfly House), and go there after 4 PM. Transpo is not a problem as there are a lot of cabs hanging about, and the staff will call for more cabs for visitors who haven't got private transpo. But there is no transpo going to the Butterfly House (croc-drawn carts, anyone?) so you'll def have to walk.\r \r All in all our visit was a bust mainly because of non-animal related issues. They had lots of other animals (mostly reptiles and birds and 2 tigers) not just crocodiles. Other than the animals, you can go to the Riverside grill/cafe where they serve crocodile- and ostrich-based and normal-animal food (like sisig, steak, etc.). Entrance fee of Php 200 seemed expensive. And don't go to the Butterfly House - avoid it like the plague."
	},
	{
		"User": "cristydti",
		"Location": "makati",
		"DateofReview": "April 30, 2014",
		"ReviewTitle": "Bigger Crocs than in Palawan",
		"Review": "Wow, the crocodiles in Davao are bigger than those in Palawan.....and we were there just in time for their feeding and it was really an experience to see them in action to get their food....."
	},
	{
		"User": "lani g",
		"Location": "Surigao",
		"DateofReview": "April 21, 2014",
		"ReviewTitle": "An \"animal park\"?",
		"Review": "I've been joking about changing the name to \"animal park\" instead of a crocodile alone :) You can see a lot of other animals like snakes, monkey, etc. It's also educational esp. for kids but I don't like to come back and spend another Php 200 for that...quite expensive.It's actually a package of 3 when you pay that amount, together with Butterfly sanctuary & \"Kamindanawan\"... ooopps forgot the name :) I just hope they'll separate the fee for each & not force to pay even if u don't feel like going to the other.\r It will now be affordable to everyone esp. if you'll be paying for the others also :).\r \r It's actually my second time, but the first was a free tour after our seminar. I don't feel like going inside anymore but have to accompany my family. I feel bored already, if only not for my lovedones."
	},
	{
		"User": "Scottie B",
		"Location": "Valencia City, Philippines",
		"DateofReview": "April 13, 2014",
		"ReviewTitle": "Nice",
		"Review": "The park is good but it is sad to see other animals locked up in a cage. It's good to see plenty of crocodiles. They have plenty of attractions inside like feeding the ostrich etc..."
	},
	{
		"User": "Cindy F",
		"Location": "Manila",
		"DateofReview": "April 12, 2014",
		"ReviewTitle": "Expensive and Boring",
		"Review": "Not worth the travel and entrance fees. So as not to waste our time and entrance fees, we opted to have fun taking pictures instead."
	},
	{
		"User": "Darrel H",
		"Location": "Auckland, New Zealand",
		"DateofReview": "April 11, 2014",
		"ReviewTitle": "Worth the time.",
		"Review": "It is a nice small nature park. The birds are great to look at and I like the reptiles. And yes we tried the crocodile it was nice and know it does not taste like chicken."
	},
	{
		"User": "donzero",
		"Location": "manila",
		"DateofReview": "March 24, 2014",
		"ReviewTitle": "its worth the trip",
		"Review": "this is a learning experience and its nice to know that we have places like this that makes sure the species are protected and that they advocate on the care for nature. Kudos, to the team of the crocodile park"
	},
	{
		"User": "Dibyne",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 20, 2014",
		"ReviewTitle": "Crocs Park and mini zoo.",
		"Review": "Great for family outing. Plus they've got a tiger and butterfly sanctuary. for those who are fond of exotic food, they have crocodile lechon and grilled meat."
	},
	{
		"User": "agramsagitro",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Mandaluyong, Philippines",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "March 4, 2014",
		"ReviewTitle": "Crocodile Visit",
		"Review": "Park is clean and well maintained. Besides crocodiles, there are other animals in the park such as birds, monkeys, tigers, etc. I visited at around 12 nn so it was rather hot. Best to visit earlier or later in the day. I would suggest better signs to indicate the location of the other animals in the park. Cages for animals could be a little bit bigger, although the crocs are fine. \r \r For a first time visitor to Davao, I would recommend a visit. \r \r There is a nice restaurant across the street from the Park that serves good grilled dishes including crocodile meat."
	},
	{
		"User": "tksato",
		"Location": " ",
		"DateofReview": "January 28, 2014",
		"ReviewTitle": "Brutal... I wouldn’t recommend Crocodile Park",
		"Review": "We visited Crocodile Park on December 26th and it was appalling seeing the way the animals are kept.\r \r I'm always shocked by the way most Asian places keep their animals which are often beyond the proper conditions, especially space-wise. It would be like keeping people in a 3x3 cell without a chance of going out to the yard ever in their lives.\r \r Indeed it's true what's been said: Crocodile Park has more animals than only crocodiles. Nevertheless, the conditions they are kept are terrible. Most of the birds are locked inside cages they cannot spread their wings and the tiger's exercise area is not enough for a human being to practice jogging – much less a tiger. The giant crocodile was kept in a pound only a little bigger than its own body. I believe the park should either expand the area the animals are kept and the aviary should be way larger. The tigers should have enough space for their exercise and the crocodiles should be kept on better conditions – people should know that only feeding and cleaning is not enough."
	},
	{
		"User": "williamjc55",
		"Location": "Poole, United Kingdom",
		"DateofReview": "January 25, 2014",
		"ReviewTitle": "flying visit",
		"Review": "we visited this on Wednesday 23rd January 2014, plenty to see including the tigers and the highlight the Orang Utan , but to say they were kept in good conditions would not be true , the tigers looked thin , I found it sad but that is my personal view , still the rest was worth a vist "
	},
	{
		"User": "Leland_DLC",
		"Location": "Manila",
		"DateofReview": "January 3, 2014",
		"ReviewTitle": "Good Place to Go With Kids",
		"Review": "Not just about crocodiles. Ostriches can be seen near the entrance. And there are a number of snakes, sheep, tigers, and many other animals. Our favorite place was the Dragon's Den which featured rabbits (and turtles and fish but the rabbits were so cute!) There are shows in the afternoon around 4 pm.\r \r They offer a package deal with an Indigenous People's outdoor exhibit and a butterfly garden. Neither are worth it. Just go for the Crocodile Park."
	},
	{
		"User": "Suzette1223",
		"Location": "Manila, Philippines",
		"DateofReview": "December 28, 2013",
		"ReviewTitle": "Not just a crocodile park",
		"Review": "I was not expecting there are others animals in the park. Not just ordinary animals we saw everywhere but the rare ones. But you will spend thousand pesos for the entrance when you go there with you family."
	},
	{
		"User": "Shamrockbuddy",
		"Location": "Bordentown, New Jersey",
		"DateofReview": "December 26, 2013",
		"ReviewTitle": "Fun, fun, fun",
		"Review": "Loved it ... Hugh crocodiles ... one the largest in the World. family fun, easy to get to and nice way to spend an afternoon."
	},
	{
		"User": "zayki",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "December 11, 2013",
		"ReviewTitle": "Talented crocodiles",
		"Review": "This is a huge park with other animals than crocodiles. But really marked on me is the crocodile show at around 5pm. It is fascinating to see the crocodile \"dance\" as they jump to reach their food from the trainer. Nice place for the little kids."
	},
	{
		"User": "BGonzalez1973",
		"Location": "Jewett City, Connecticut",
		"DateofReview": "December 11, 2013",
		"ReviewTitle": "More than Crocodiles",
		"Review": "This place is called Crocodile Park but offers more. They had a variety of big snakes there, birds, monkey, a very huge crocodile, etc. It is not a huge place but I would recommend going there if in Davao City."
	},
	{
		"User": "belgianguy1",
		"Location": "belgium",
		"DateofReview": "November 25, 2013",
		"ReviewTitle": "Average",
		"Review": "Just average, seen this kind of park too many times\r Just some crocs lying around, and some added bird cages and a couple of sad looking orangutans\r The photo session with the snake and the baby croc is ok \r But a steep 200 p entrance fee"
	},
	{
		"User": "LovellaStratton",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Cagayan de Oro, Philippines",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "November 8, 2013",
		"ReviewTitle": "Too expensive",
		"Review": "I can't understand why it costs 200 pesos ($4.70) to enter this little park. Manila Zoo is bigger and houses lots more animals than this zoo... its entrance fee is a little less than a dollar. \r \r Civet coffee and ice cream made with crocodile eggs are sold here. "
	},
	{
		"User": "CrimsonGrey",
		"Location": "Houston, Texas",
		"DateofReview": "October 24, 2013",
		"ReviewTitle": "Etc Park",
		"Review": "Been to other crocodile farms in Australia, Indonesia & FL for comparison. An honest attempt to portray a croc farm and should be encouraged to show Davao's geographic diversity. However, due to the variety of animals here, suggest to reconsider a name change.\r Additionally, found the shop interesting in that Civet coffee was located at a price that I was willing to pay for!"
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "October 23, 2013",
		"ReviewTitle": "Worth a visit",
		"Review": "I have visited the crocodile park a few times basically to take my extended family, on my visits to Davao. It is small but interesting,..in saying that, I am not a fan of the small enclosed cages.\r As a member of OFI, I found the Orangutan cage not really suitable as there is lack of things for the primate to do, however, I was lucky to be there on feeding and the keeper did an excellent job and the food was really appropriate for their diet - congrats! You do not mind paying an entrance fee and for photos etc if you know the animals are treated well. Overall. a lovely visit."
	},
	{
		"User": "nightrider3315",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "October 16, 2013",
		"ReviewTitle": "Crocodile Park",
		"Review": "This is a chance to get up close to the crocodile and learn a little about wildlife. There are other animals monkeys, birds etc. This a place for people who like to see wild animals. This is an outdoor facility and like the Philippines will be hot. It was a nice little trip. "
	},
	{
		"User": "Knighttravelmd",
		"Location": " ",
		"DateofReview": "October 7, 2013",
		"ReviewTitle": "Interesting",
		"Review": "This plCe has plenty of crocs, ostriches, birds of variety kinds, and other animals. They let u feed moderate size crocs using a bamboo stick and there is a viewing of a large size croc feeding a pig how it comes out of the water eats a portion of the big before going back on the water. There are croc shows but it's cool for the most part for the fee."
	},
	{
		"User": "bidnessboi",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 30, 2013",
		"ReviewTitle": "Just went to Crocodile Park for the first time",
		"Review": "Not a whole lot to do but a pleasant experience. Saw two tigers, fed some ostriches and saw hundreds of crocs. Ate a nice lunch in the end. Enjoyable."
	},
	{
		"User": "coffeefreak",
		"Location": "Caloocan, Philippines",
		"DateofReview": "September 23, 2013",
		"ReviewTitle": "Name is a misnomer",
		"Review": "This place is teeming with all sorts of animals, they should consider renaming it to \"Davao Zoo\"..hahahaha I'm not complaining and the entrance fee was worth it. Make it a point to go there on weekends since the shows that start from 4pm onwards are worth the wait!"
	},
	{
		"User": "RedCoconutGM",
		"Location": "Boracay",
		"DateofReview": "September 6, 2013",
		"ReviewTitle": "You gotta go here!",
		"Review": "I'm so glad that I convinced our group to come here. Everyone had a great time! All of the animals were kept in a humane manner. Excellent and friendly staff ready to serve and management is obviously professional and up to date with current standards. Highly recommended!"
	},
	{
		"User": "xChaLeex",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 6, 2013",
		"ReviewTitle": "zoo with exotic foods",
		"Review": "Just your common zoo with different species of animals. There are also food like crocodile ice cream, croc sisig, etc. However, there is nothing memorable to eating those I guess. This place is great for kids, and there are also other attractions nearby. \r \r How I wish there are lot of reminders how we could take care these animals and not just stare and eat them."
	},
	{
		"User": "Gordonchef",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Vancouver, British Columbia, Canada",
		"Location": "Vancouver, British Columbia, Canada",
		"DateofReview": "September 4, 2013",
		"ReviewTitle": "Have to try to croc meat.",
		"Review": "Tiny zoo, since they have other animals, I think entrance is 100 or 200 peso. You see tons of crocs waiting to be slaughtered for meat and leather use. Their cafe that serves croc products are ok, mind you they are a cafe and not a fine dining resto. They just slap the meat in a grill and 450 peso please....or if you think you can handle a ostrich omelette at 1000 peso, equals to eating 20 eggs i think...It cost that much cause you wasted a good ostrich that would of made them 50,000 when its adult size."
	},
	{
		"User": "sweetab",
		"Location": "Kuta, Indonesia",
		"DateofReview": "August 16, 2013",
		"ReviewTitle": "was the best",
		"Review": "great zoo in davao,was way much better then the one i have visited in manila... great place too.. and the fee was not that bad. worth to visit"
	},
	{
		"User": "Daz5000",
		"Location": "Manchester, United Kingdom",
		"DateofReview": "August 3, 2013",
		"ReviewTitle": "Crocodile Farm",
		"Review": "During my visit to Davao we made a stop at Crocodile Farm/Park, its a good place, we went during the week in the morning so it was quiet. Not much feeding or anything but the amount of Crocs on display is impressive and there is...More"
	},
	{
		"User": "igga200",
		"Location": " ",
		"DateofReview": "August 3, 2013",
		"ReviewTitle": "many animals to see",
		"Review": "it's a great place especially for kids and animal lovers. my favorite part was when we were petting baby tigers, snakes & baby crocodiles.also, watching the feeding of crocodiles was pretty fun especially with the largest in the zoo named pangil. there are a number...More"
	},
	{
		"User": "Christine C",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 31, 2013",
		"ReviewTitle": "Great For The Kids",
		"Review": "Going to the Crocodile Park is a family adventure. The younger kids will love it. And as a family everyone will enjoy the day. There are shows with birds, tigers and crocodile's (of course). As the attractions are outdoors it will be warm so dress...More"
	},
	{
		"User": "Don L",
		"Location": "Mindanao, Philippines",
		"DateofReview": "July 30, 2013",
		"ReviewTitle": "Outside the city, but worth it",
		"Review": "The only problem with visiting the crocodile park is that it is outside the city and taxis are scarce there. We just took a taxi and negotiated with the driver, meter plus 200 pesos per hour waiting. Expensive but worth it. As for the park...More"
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 30, 2013",
		"ReviewTitle": "It's a zoo",
		"Review": "All my kids have visited Crocodile Park a number of times. It's the first for me and my husband. It is actually just 20 to 30 minutes drive from downtown Davao.One can easily get there with a taxi. the Entrance fee is P150.00 for adults...More"
	},
	{
		"User": "Patty M",
		"Location": "Manila, Philippines",
		"DateofReview": "July 26, 2013",
		"ReviewTitle": "full of depressed animals",
		"Review": "the main attraction was this giant crocodile which IMHO looked super duper depressed and lonely. this is the last time i'm ever voluntarily going to a zoo/park with animals. the animals here didn't look happy at all and some of them seemed dirty and underfed....More"
	},
	{
		"User": "Dreamgirl_1253",
		"Location": "Quezon City, Philippines",
		"DateofReview": "July 23, 2013",
		"ReviewTitle": "Not just crocodiles",
		"Review": "The Crocodile Park is actually a zoo housing many other animals. Make sure you visit the crocodile park during the feeding time. We arrived at the park before 4pm, just in time for the feeding frenzy of the small crocodiles (with pieces of chicken) and...More"
	},
	{
		"User": "Tom J",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "surigao",
		"Location": "surigao",
		"DateofReview": "July 4, 2013",
		"ReviewTitle": "An interesting place",
		"Review": "A great place to visit if you take children or wish to bring back childhood memories , lots of animals to see and places to eat , nice gardens and well laid out !"
	},
	{
		"User": "shankaronline",
		"Location": "dubai",
		"DateofReview": "June 20, 2013",
		"ReviewTitle": "Average, but the tribal fire dance is a must see!",
		"Review": "Although it's called a crocodile park, you see several other animals there, like ostriches, Bengal tiger, parrots, binturong, Philippine brown deer etc., most of which are in distressingly small cages, barring the ostriches, which have a fairly large running area. It's tragic to see the three tigers confined to a tiny enclosure, though some of the staff were trying to invite visitors (for a price) to climb onto a ramp for a 'view from top' of the tiger enclosure, though there were very few takers.\r The crocs themselves seem to fade into the background in view of all the other activities going on around the park. One of them is rather huge.\r One thrilling feature is a couple of Filipino chaps doing tricks on a tight rope right above a tank full of dangerous, large crocs. Apart from 'standing on one leg' and dances performed on the tight rope, to the accompaniment of recorded disco music, the chaps drew several gasps from a shocked audience when they pretended to slip and fall into the tank. It gets bloody crowded around the show though, so get to the show early and get places right in front. Small pavilion like stepped seating is also around, but it's pretty much useless with the hundreds standing and crowding about in front. Behind this pavilion are several enclosures housing scores of crocodiles.\r The best part of the croc park however is the tribal fire dance performed by professional dancers in costume. These are apparently traditional folk dances performed by the Tribu K Mindanawan tribals. The many dangerous stunts they perform with fully lighted kerosene torches and fire frames will leave you spell bound for several tense minutes! There are photo ops apelnty after the show as the dancers allow you to take pictures with them while they are still holding their burning torches. Only ignore the kerosene fumes and the smoke!\r All restaurants in the park serve crocodile sisig, a stew like local filipino dish made with croc meat. Fairly tasty."
	},
	{
		"User": "kmittag",
		"Location": "Subic, Philippines",
		"DateofReview": "June 13, 2013",
		"ReviewTitle": "Nice",
		"Review": "Today I get my second positive surprise here. Nice little zoo,and here was very clean compare about the zoo in Subic. Price 150 P also fair, so in all a nice place."
	},
	{
		"User": "Jie-E",
		"Location": "Luzon, Philippines",
		"DateofReview": "June 9, 2013",
		"ReviewTitle": "It's definitely not just about crocs. :)",
		"Review": "The Crocodile Park is located inside the Davao Riverfront Corporate City. And it's actually a mini-zoo because there are other animals there like birds, deers, monkeys, snakes, etc. \r \r On weekends, they have the bird show, crocodile show. There's also a fire dance show at the Tribu K'Mindanawan Cultural Village (which we enjoyed immensely), just a few steps away from the Crocodile Park. \r \r It's best to arrive at the place 2pm or 3pm on a weekend. Have a look around the zoo first, check out their Butterfly House. The bird, crocodile and tightrope walking shows start at 4pm. The awesome fire dance show starts at 5:45pm. Entrance fees are Php 200 for adults, and Php 100 for children under 13 years old. "
	},
	{
		"User": "TerMac84",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 23, 2013",
		"ReviewTitle": "Friendly crocs?",
		"Review": "They look friendly to me! Aside from crocodiles, you have lots of other things to do in this park. Educational and relaxing...."
	},
	{
		"User": "yertle",
		"Location": "fuji",
		"DateofReview": "April 9, 2013",
		"ReviewTitle": "Ho-hum Zoo",
		"Review": "The zoo's ok for kids in their preschool or early gradeschool age. I've been to better zoos... The zoo is clean and spacious but the crocs were not really exciting to see. You know crocs they don't really move much..."
	},
	{
		"User": "lenie",
		"Location": "almere",
		"DateofReview": "April 8, 2013",
		"ReviewTitle": "very poor zoo",
		"Review": "seen an old anzoo? then go and see this one, animals in old cages, and because of the heat sometimes very smelly"
	},
	{
		"User": "Raphael Emerson B",
		"Location": "Makati, Philippines",
		"DateofReview": "April 6, 2013",
		"ReviewTitle": "Both fun and educational",
		"Review": "The owner invited us to see his park but unfortunately he wasnt able to accompany us during the rest of the tour. So we found our way in. There is a tour with human (performer) close encountering with the crocs.-it was fun watching it. It made us aware of the crocs behavior but what is more fun about the tour is when they start presenting us the products coming from the crocodile. we bought these healing enzymes coming from crocs that make wounds heal fast. There are also a shopping areas where you can find good stuffs as souvenirs. =)"
	},
	{
		"User": "excitedmommy",
		"Location": "qc",
		"DateofReview": "April 4, 2013",
		"ReviewTitle": "kids had fun at crocodile park",
		"Review": "It was more of a zoo since they have tigers, snakes, monkeys, birds, crocodiles, etc. kids had fun. We also got to taste civet coffee!"
	},
	{
		"User": "nasmej11",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Iloilo City, Philippines",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "March 31, 2013",
		"ReviewTitle": "the snake is the attraction",
		"Review": "it was a fairly small park. the fun here is taking a photo with a big yellow snake. for 40 pesos you can sit with the snake and have your photo taken."
	},
	{
		"User": "466Neo",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 17, 2013",
		"ReviewTitle": "Not really worth your time",
		"Review": "This place is disappointing and is close to what I see as animal cruelty. The whole place is outdated and could seriously need a big renovation. As the title says its not worth visiting."
	},
	{
		"User": "Mars_&_Ching_Aguilon",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 3, 2013",
		"ReviewTitle": "Lots of fun!!",
		"Review": "Been to other crocodile parks but i can say Davao's the best. The place is clean and well-maintained. Animals are properly cared. Lots of animals compared to other parks. You get a chance to get closer with the crocodile, python, birds, orangutan or even the...More"
	},
	{
		"User": "Loco E",
		"Location": "Makati, Philippines",
		"DateofReview": "February 23, 2013",
		"ReviewTitle": "Boring - save your time & money for something else . . .",
		"Review": "Since our friend had plenty of free vouchers, we headed over to the Croc park for about an hour. The only thing they had going for them was the 15-min. feeding \"show\", we're they dangled some meat for the crocs to jump up and grab,...More"
	},
	{
		"User": "arwen_31",
		"Location": "Vanderhoof, Canada",
		"DateofReview": "February 19, 2013",
		"ReviewTitle": "great animal show",
		"Review": "i enjoyed the animal show. there are other animals also.not only crocodile. they have monkey, parrots, snakes, leopard cat, etc the kids will surely love to visit this place."
	},
	{
		"User": "footloosetomcat",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 19, 2013",
		"ReviewTitle": "Land of the Crocs",
		"Review": "With the mysterious death of Lolong, the world's largest crocodile in captivity, people start becoming curious about this reptile. Don't look now, there's a park built for them in Davao City. You'll see all sizes and shapes of crocs here, plus so much more animals....More"
	},
	{
		"User": "rm1003",
		"Location": "Manchester, United Kingdom",
		"DateofReview": "February 18, 2013",
		"ReviewTitle": "Well worth visiting",
		"Review": "It’s a lot more than just a crocodile park. I would call it a small zoo. They have snakes, Burmese python, ostriches, eagles, birds, apes, and tigers and of course a huge amount of crocodiles of every variety and shape and size. It’s not a...More"
	},
	{
		"User": "balmix_turistas",
		"Location": "Quezon City, Philippines",
		"DateofReview": "February 15, 2013",
		"ReviewTitle": "Recommended",
		"Review": "Enjoyed the wild encounter and the shows especially the fire dancers. Recommended for families with kids"
	},
	{
		"User": "jovie713",
		"Location": "Mindanao, Philippines",
		"DateofReview": "February 14, 2013",
		"ReviewTitle": "crocodile park is the best",
		"Review": "i like all the animals in crocodile park,specially the snakes... i love the view and i also love their ice cream....."
	},
	{
		"User": "kalboHastings",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Hastings",
		"Location": "Hastings",
		"DateofReview": "January 31, 2013",
		"ReviewTitle": "Stunning",
		"Review": "I have never seen so many Crocs in one place.. absolutely enjoy the few hours I spent here - so many people in the park at the time I visited so validates it's attraction. A definitely must see & I will be going back"
	},
	{
		"User": "ASBUCAN",
		"Location": "Tabuk, Philippines",
		"DateofReview": "January 21, 2013",
		"ReviewTitle": "Riding on Bike, Cruising on a Highway",
		"Review": "I followed the advise of a local hire a ride on a motor bike to get there. The driver was young so we got speed. A bit fun for me who has never been on a motor bike ride - on a highway. Didn't expected much since crocs won't move much even how loud you yell at them. Got a little bit sad when restaurant ran out of fresh crocs to serve. But that saved me a lot of money too. But nice people are always around. There's this burger lady who was also selling frozen Croc sisig! She was kind enough to consider my request to cook the meat for me. Without asking for any charge. Of course, she was happy when she received her tip. And yes for desert - vanilla ice cream with crocodile egg! Nice to take pics of the crocs, coz they don't fly away. Toilets are well maintained. Well, on the way back there are taxis waiting, but who wants them when there are motor bikes around! Weeeeee!"
	},
	{
		"User": "toursaver",
		"Location": "Parrish, Florida",
		"DateofReview": "January 16, 2013",
		"ReviewTitle": "Don't expect too much.",
		"Review": "This is the best place for crocs lovers. Nothing unique inside. You'll see different species of crocs, love birds, ostrich, turtle, reptiles and monkey"
	},
	{
		"User": "TravelLight1972",
		"Location": "Lake Louise, Canada",
		"DateofReview": "January 6, 2013",
		"ReviewTitle": "Enjoyed Here",
		"Review": "I was expecting just a park with croccidles but it was full of many animals including siberain tigers. Its very good value for your money and is a great place to bring kids for a few hours. I highly reccomend you go however right before 3pm and wait for the 4pm show. That was the best part by far of the whole experience."
	},
	{
		"User": "gregorian43",
		"Location": "General Santos, Philippines",
		"DateofReview": "December 29, 2012",
		"ReviewTitle": "Disappointing",
		"Review": "The grounds were nice and the Crocs well displayed however the condition and living areas of the other animals left a lot to be desired . the tigers were in cages barely big enough for a domestic cat let alone a magnificent tiger it needs a lot of work to bring it up to international standard ."
	},
	{
		"User": "StewFart",
		"Location": "Penrith, Australia",
		"DateofReview": "December 25, 2012",
		"ReviewTitle": "Never smile at a........",
		"Review": "I enjoyed the visit. The place was small and it didn't take long to see all the attractions. I was expecting to see more exibits"
	},
	{
		"User": "charcieldavao",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 19, 2012",
		"ReviewTitle": "Educational",
		"Review": "Visit this place specially during Friday and saturday late afternoon as they have firedance and cultural dance seeing them for free is a plus. \r The name speaks for its place really plenty of crocs here, small, med, to large, snake, ostrich, orangutan, and tiger are visible in the are plenty of animals here so many to mentions, good thing in this place if you pay for the entrance of 150 you have 3 places to visit the 1)croc park, \r 2)the tribu k which showcase the different native houses of Mindanao tribes, and also there are different tribe who are visible and explain their culture if you wish special if you go to the pasalubong area the ladies who use to sell their are ginuine natives of Mindanao they have matigsalog, manobo, t'boli, bagobo, mans aka, mandaya, and many more. \r 3)You can visit also the butterfly garden which is just nearby the place and part of the 3 place that allows you to visit while you are here. They have also nearby resto the river walk grill which offer the exotic food such as croc sisig, ostrich meat, and native delicacies. "
	},
	{
		"User": "suyen l",
		"Location": "singapore",
		"DateofReview": "November 22, 2012",
		"ReviewTitle": "great family zoo",
		"Review": "its not just the crocodiles but there area lot of animals that you can showcase to your kids to expand there knowledge about animals tis is one good place for you and kids to have fun along"
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 20, 2012",
		"ReviewTitle": "Wide place for many crocs",
		"Review": "You can see baby crocodiles to teenage crocs to adult crocs and even a grandfather or grandmother crocs. One of the best educational place for students even for tourists as well. You can feed the crocodiles- just ask for the assistance. You can have a picture together with the baby crocodile, or with the yellow snake. The place is wide and there are other animals to see, restaurants to eat, and souvenir shops. Want to try to eat an Ostrich Egg Omelet? You can try to eat in one of the Restaurants located inside the crocodile park."
	},
	{
		"User": "SidAgua",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 17, 2012",
		"ReviewTitle": "Crocodiles everywhere and anywhere",
		"Review": "visited this place with my friends. Loved this awesome place with different type of wild animals. We enjoyed taking pictures for every animals in the park. And hey! I enjoyed watching the Tribal Dance Show. It was awesome."
	},
	{
		"User": "bendog2000",
		"Location": "Tacoma",
		"DateofReview": "October 13, 2012",
		"ReviewTitle": "Great Diversion",
		"Review": "Very interesting place that has crocodiles of every size lounging around by the pools. Also has Siberian tigers, ostriches, birds, Burmese pythons, turtles, goats and even rabbits. Great place to visit and educational."
	},
	{
		"User": "queckm",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 2, 2012",
		"ReviewTitle": "tiny zoo with a LOTTA crocs",
		"Review": "Aside from 70 crocs, there's a couple of tigers, around 10 different kinds of birds, lizards, snakes, and a monkey. i guess i shouldn't complain... it is, after all, a crocodile park."
	},
	{
		"User": "KarlaSingson",
		"Location": "Davao city, Philippines",
		"DateofReview": "September 30, 2012",
		"ReviewTitle": "Wonderful Wildlife + Convenience + Great Food Selection",
		"Review": "Undoubtedly the best zoo in Davao, despite it's size. (Of course, zoos in Manila are bigger.) However, their animal repertoire is still impressive, and you can really see that the animals are well taken cared of. What's more, booking and group reservations are convenient, and...More"
	},
	{
		"User": "Airah_18",
		"Location": "Iligan, Philippines",
		"DateofReview": "September 23, 2012",
		"ReviewTitle": "Clean Park, So Many Crocodile....",
		"Review": "We went at Crocodile Park in Davao last September 15, 2012 as a part of our field trip. I found the place clean. There are lots of crocodiles, birds and reptiles. Though I wasn't able to watch the fire dance that night, but my classmates...More"
	},
	{
		"User": "anne70882",
		"Location": "davao city",
		"DateofReview": "September 15, 2012",
		"ReviewTitle": "main park great, others bit off!!!",
		"Review": "It was August 17 and Kadayawan festival is already on in the downtown of Davao, so we decided to take a little out with my visitors to nearby city attraction.... Its not way of PUJ's so for us able to save a little, we take...More"
	},
	{
		"User": "manilabiker",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "September 6, 2012",
		"ReviewTitle": "nice and clean mini zoo",
		"Review": "The Crocodile Farm in Davao is a very nice zoo, there are many colorful small birds when you enter and also other animals as well. they also have a tiger when i last went there. its an attraction in Davao but not much of a...More"
	},
	{
		"User": "hazeyna",
		"Location": "Manila, Philippines",
		"DateofReview": "August 24, 2012",
		"ReviewTitle": "just an ordinary zoo",
		"Review": "the entrance fee seems to be a bit expensive considering the views inside which are all reptiles and some birds."
	},
	{
		"User": "Mikas101",
		"Location": "Singapore",
		"DateofReview": "August 14, 2012",
		"ReviewTitle": "Quaint Park",
		"Review": "It was a great place to go to out of the city. It had only a couple of animals, but i guess for the price you cannot expect much. Basically if you want to be with nature, you could go there. They have a fantastic...More"
	},
	{
		"User": "getright",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "San Diego, California",
		"Location": "San Diego, California",
		"DateofReview": "July 30, 2012",
		"ReviewTitle": "Crowded",
		"Review": "basic Crocidile Zoo few other animlals to see also but not bad place to get away from things and also start point for water rapid ride too."
	},
	{
		"User": "mcgurtiza",
		"Location": "manila",
		"DateofReview": "July 25, 2012",
		"ReviewTitle": "Fun filled afternoon!",
		"Review": "A good place to spend the afternoon with the kids, and the kids at heart. It's a typical zoo with sufficient animals. The show was good, just enough time per show that will not make you bored."
	},
	{
		"User": "Lei P",
		"Location": "Taguig City, Philippines",
		"DateofReview": "July 23, 2012",
		"ReviewTitle": "Too Commercial",
		"Review": "Meet Pangil, a crocodile whose clan has been existing for more than 200 million years! There's also a bird show with \"excessive\" audience participation. To be honest, we didn't like the way they caged the animals. The simulation of their natural habitat is poor and...More"
	},
	{
		"User": "summerlovin_10",
		"Location": "quezon city",
		"DateofReview": "July 21, 2012",
		"ReviewTitle": "Crocs everywhere!",
		"Review": "The park's main attraction are ... Yeah.. Crocs. They also host a show aiming to make us humans aware of other living creatures around us and how we should dispose our garbage properly. They also give the animals participating in the show a bit of...More"
	},
	{
		"User": "Mai_0605",
		"Location": "Dumaguete City, Dumaguete, Philippines",
		"DateofReview": "July 20, 2012",
		"ReviewTitle": "Just for Crocs",
		"Review": "Two of my best buddies went to this park just to experienced with the baby crocodile in our hands. It was great. I so loved it. The entrance fee is 150 pesos, Inside the park you will not only see crocodiles but you'll get to...More"
	},
	{
		"User": "Jeremy N",
		"Location": "Dover, Delaware",
		"DateofReview": "July 8, 2012",
		"ReviewTitle": "Very Fun and Interesting",
		"Review": "Great spot to visit if you are in Davao....you get up close and personal to alot of the animals and I even got the chance to hold a huge python :) Park is clean and well kept and the staff is very friendly. The only...More"
	},
	{
		"User": "Yvette C",
		"Location": "Bangkok, Thailand",
		"DateofReview": "July 7, 2012",
		"ReviewTitle": "Fun!",
		"Review": "Nice zoo. Animals looked happy and great way to promote ecotourism in the Philippines."
	},
	{
		"User": "Maia_0515",
		"Location": "Davao City",
		"DateofReview": "July 2, 2012",
		"ReviewTitle": "A close encounter to live animals",
		"Review": "Crocodile park is located at the diversion road inside a FSDizon & Son's Corporate City. This place also where the Zorb Ball activity is being stationed. There are so many things that you can do to enjoy in this place because they have a clubhouse...More"
	},
	{
		"User": "HALLYCS",
		"Location": "Quezon City",
		"DateofReview": "June 29, 2012",
		"ReviewTitle": "Crocodiles all over!",
		"Review": "I didn't enjoy much on our visit at Crocodile Park. You can see several crocodiles of different sizes and other animals. We've got to see the Feeding Frenzy show which is just basically the feeding time of young crocodiles. I think the entrance fee of...More"
	},
	{
		"User": "Robert J",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Canberra, Australia",
		"Location": "Canberra, Australia",
		"DateofReview": "June 26, 2012",
		"ReviewTitle": "Dundee",
		"Review": "Great Animals Snakes Crocodiles Birds Dears and the monkeys were excelent"
	},
	{
		"User": "Clandestinymph",
		"Location": "Manila, Philippines",
		"DateofReview": "June 17, 2012",
		"ReviewTitle": "Good collection of Crocs",
		"Review": "They have crocs in all sizes, from hatchlings to full grown ones like Pangil. They also have a collection birds, snakes, turtles, tigers, a civet, an iguana and a few mammals.\r There's a photobooth where you can have your picture taken with a baby croc or a huge albino boa constrictor for a minimal fee."
	},
	{
		"User": "Mercedita M",
		"Location": "Manila",
		"DateofReview": "June 14, 2012",
		"ReviewTitle": "So many crocs and boas in this place.",
		"Review": "We went around the whole area and find the place as expected, lots of crocodile Dundee and surprisingly big snakes and other animals like, tigers, monkeys and ostrich. Lots of different types of birds too. I love the fact that we went on a Tuesday were senior citizens are free of entrance fee, my husband got in free."
	},
	{
		"User": "bracomo",
		"Location": "davao",
		"DateofReview": "May 29, 2012",
		"ReviewTitle": "nice but small",
		"Review": "Crocodile park in Davao is a nice place to visit but it is quite small though. Crocodile dancing is somewhat interesting to watch too."
	},
	{
		"User": "Ed I",
		"Location": "Davao",
		"DateofReview": "May 29, 2012",
		"ReviewTitle": "Nice place for tourists",
		"Review": "We enjoyed our walk around and took a lot of pictures. I had never seen a guy walk across on a rope barefoot over a crocodile infested pool. Not just 1 guy but 2. Wow, what balance and what nerves. There's more but that was my photo of the day."
	},
	{
		"User": "LolaGo1",
		"Location": "Washington DC, District of Columbia",
		"DateofReview": "May 28, 2012",
		"ReviewTitle": "SKIP IT OR NOT?",
		"Review": "Having recently visited the Crocodile Park in PUerto Princesa, I am not impressed with the Crocodile Park located in Davao City. The entrance fee of 150 pesos is not worth the visit so my advise is to skip this attraction.\r \r The cages where the animals are kept do not appear to be clean and smell bad. The are few crocodiles and they are smaller compared to those exhibited in Puerto Princesa. \r \r I hope that management of this place keep the place clean both for the sake of the animals and those of the guests visiting this site."
	},
	{
		"User": "maia_cyllene",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 24, 2012",
		"ReviewTitle": "CROCS",
		"Review": "Although it's a little dirty, I enjoyed watching the crocodiles. They keep a very huge croc name Pangil, he is awesome huge!\r \r If you are taking kids with you it's good to give them some educational tour, explaining how these reptiles come from an egg and develop into a huge lizard. hehe,, They have their tourguide and at 4PM daily there is a bird show that everyone will enjoy. \r \r The orangutans are also cute. You could take photos with them and a yellow boa is available for picture taking too. Just be warned it's scaly, cold and heavy. Don't freak out you might scare the snake."
	},
	{
		"User": "Chapopos",
		"Location": "Manila, Philippines",
		"DateofReview": "May 21, 2012",
		"ReviewTitle": "Ordinary Park",
		"Review": "Well, from the name itself, this park is full of crocodiles, small and medium ones (being locked in cages of course!). But it's surprising that it also has some animals like snakes, tigers, monkeys, ostriches and other variety of birds.\r \r It was a nice experience though as it's not always that you see these kind of animals in the city. My wife and I enjoyed taking pictures with them. :) Nevertheless, I found it just ordinary."
	},
	{
		"User": "inabear",
		"Location": "Laguna Province, Philippines",
		"DateofReview": "May 11, 2012",
		"ReviewTitle": "Impressive",
		"Review": "It was much better than I expected. Aside from the many many crocodiles, there were so many other animals! Birds, mammals, etcetera. It was clean, not over crowded, lots of places to sit around, and snack places right outside. A holiday trip to Davao would be incomplete without a visit to the Crocodile Park."
	},
	{
		"User": "travelafeme",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "QCPhilippines",
		"Location": "QCPhilippines",
		"DateofReview": "May 4, 2012",
		"ReviewTitle": "Just okay",
		"Review": "Entrance fee is 150 pesos. You can have a photo taken with the phyton Jasper for 40 pesos. Pangil is long and huge and old ( 80 yrs old ,I think). The park is clean with few animals. You can feed the small crocodile for 35 pesos. There are small souvenir shops around the area. The best time to go there is on Fri, Sat and Sun. They have cultural shows, bird shows in the afternoon. There is a butterfly garden 300 meters from the park but not much to see."
	},
	{
		"User": "Natkeam",
		"Location": "Marbella, Spain",
		"DateofReview": "April 17, 2012",
		"ReviewTitle": "Needs updating",
		"Review": "Crocodile park needs updating. It´s pretty small, but they have some shows with natives i think which we missed, so i can´t comment on this. All in all, it was ok, but i don´t think we would go again."
	},
	{
		"User": "MattAussie",
		"Location": "Sydney, Australia",
		"DateofReview": "April 15, 2012",
		"ReviewTitle": "More than just Crocs",
		"Review": "As the name says it is a \"croc park\" but but there are many other animals to see. fairly good day and the Zorb is close by also"
	},
	{
		"User": "Ponchit_gardenworx",
		"Location": "Davao City",
		"DateofReview": "April 10, 2012",
		"ReviewTitle": "a must see",
		"Review": "very well kept and healthy animals. Clean and safe. go in the afternoon when its a little bit cool. many interactive activities...good show"
	},
	{
		"User": "imojen",
		"Location": "Manila, Philippines",
		"DateofReview": "March 24, 2012",
		"ReviewTitle": "nice for kids",
		"Review": "what i like about the crocodile park is that it is accessible for people who are just in davao for a day. i can easily bring friends there and they'd enjoy taking photos with the giant albino snake and the baby crocs. it is best...More"
	},
	{
		"User": "Mark E",
		"Location": "Makati City",
		"DateofReview": "March 20, 2012",
		"ReviewTitle": "Just Another Tourist Spot",
		"Review": "We already know that we would be seeing crocodiles here. It also showcases other animals including those that are exotic. They also have other fun activities like the photo booth wherein you can have your picture taken while holding an Albino Python or a young...More"
	},
	{
		"User": "sally r",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "March 20, 2012",
		"ReviewTitle": "huge crocs!!",
		"Review": "The first crocodile you get to meet must be the biggest one in asia! It's huge and if you are not carefull it will get you wet. hahahah"
	},
	{
		"User": "daveg7964",
		"Location": "Haverhill, United Kingdom",
		"DateofReview": "March 17, 2012",
		"ReviewTitle": "not that good",
		"Review": "not much to see, includes butterfly farm too, probably more to see/photo there i guess"
	},
	{
		"User": "Iampinoy",
		"Location": "International",
		"DateofReview": "March 6, 2012",
		"ReviewTitle": "A fun filled day",
		"Review": "If you come to Davao, you have to come to the Crocodile park.. I had a lot of fun. You get to take a picture with a python or Boa constrictor. Honestly, I don't know much about snakes. The picture cost 40php. You get a...More"
	},
	{
		"User": "Goddiejens",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Brussels",
		"Location": "Brussels",
		"DateofReview": "March 3, 2012",
		"ReviewTitle": "Best adventure to feed crocs and buy souvenirs",
		"Review": "This is really a great show of wildlife animals. If possible, go and feed a crocodile and take picture or record this adventure. The prices are low, also for good home made souvenirs like coffee."
	},
	{
		"User": "maloucastaneda",
		"Location": "Cainta, Philippines",
		"DateofReview": "February 29, 2012",
		"ReviewTitle": "Davao Crocodile Park doesn’t only house well-cared crocs but has the presence of other exotic animal species",
		"Review": "Davao Crocodile Park doesn’t only house well-cared crocs but has the presence of other exotic animal species like raptors, monkeys, bearcats, snakes, trained birds, and other reptiles makes it one of the most desired tourist destinations in Davao Colorful birds are found around the park as well as the endangered cassowary and many other animals. is like a mini-zoo where we got to see crocodiles, of course :). There are many crocodiles in the farm plus other animals such as monkeys, birds, ostrich, parrots and even a fully-grown tiger. Pythons and snakes can also be found inside the park. We had the chance of petting them (at our own risk).\r The best time to see the crocodiles is during feeding time. Fortunately for us, we were able to catch feeding time, and the many scheduled shows inside the park. \r We met Carlo, the super kulet chimpanzee! We also saw some breeding ponds for baby and semi-sized crocodiles. There are also other animals inside like colorful parrots..the biggest and oldest crocodile inside Davao Crocodile Park: ‘Pangil‘. Pangil I think is about 18 feet long."
	},
	{
		"User": "Airalace S",
		"Location": "Laguna",
		"DateofReview": "February 27, 2012",
		"ReviewTitle": "Fun for Kids but could be a little scary",
		"Review": "We went here during the weekdays so we didn't really get to see the show but there were a lot of crocodiles there!!! The eagles there can be pet but their claws are so huge you will really think twice. There was also an area where you can actually have a face to face encounter with other reptiles that look like baby dinosaurs though we didn't dare to go for they run so fast. Haha. "
	},
	{
		"User": "mjdztep",
		"Location": "Denver",
		"DateofReview": "February 23, 2012",
		"ReviewTitle": "Fun Day in Davao: A must stop destination!!!",
		"Review": "Private zoo which specializes on crocodiles, snakes and birds. This zoo is fun and pleasant. It would be 5 star if there ugly fences did not block viewing of all the animal. Super Highlight!!! at 4pm, you get to hold and take pictures with giant Burmese Boas. You will not believe it. Crocodile feeding is also a fun site, the zoo workers love their job and make this exciting."
	},
	{
		"User": "honolulumark",
		"Location": "honolulu, hawaii",
		"DateofReview": "February 15, 2012",
		"ReviewTitle": "Expensive Crocs",
		"Review": "150 pesos per person to get in. The crocs and other animals are reasonably well cared for compared to other places in PI. Try the durian ice cream. We liked the native village with traditional dwellings but could not find the butterfly farm after looking for it for a long time."
	},
	{
		"User": "BuddhaBear15",
		"Location": "Malolos, Philippines",
		"DateofReview": "December 22, 2011",
		"ReviewTitle": "Lot's of things to see and do",
		"Review": "Crocodile Park isn't just about crocodiles. It's like a mini zoo with different species of birds, reptiles, snakes and some mammals too! It's really fun! And just for P150 each person, you would have access to the Crocodile Park, Butterfly House and the Tribe Park. It's well worth it! Too bad we missed the show because we came in the morning."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 25, 2011",
		"ReviewTitle": "this is an educational park too",
		"Review": "Davao Crocodile Park is a well-maintained park. You cannot see just a crocodile/s here but also some other animals like big snakes, birds, etc. Surely children will enjoy in this place and learn about these animals."
	},
	{
		"User": "GeorgePudadera",
		"Location": "Quezon City",
		"DateofReview": "November 17, 2011",
		"ReviewTitle": "Great for Kids",
		"Review": "It’s a 30-minute drive from Gaisano Mall. You can only reach the park through taxis or private vehicles. On the way to the park, you’ll pass by a zorv ball site which is also open to the public for a fee. It’s similar to the zorb ride in Dahilayan Park, Bukidnon, where you ride the zorb ball that’s to be pushed downhill. I guess your hands and feet are also strapped into the zorb ball’s interior as you do the ride.\r \r Entrance to Crocodile Park is P 150.00 per person on a weekday and P300.00 per person on weekends. Don’t be misled by the name of the park, the park is actually a zoo which houses almost all types of animals, but the main attraction are the crocodiles. Expect that most visitors are families and schools on educational trips. One thing that I can say about the park is that it’s clean and well-maintained. You can go in and out of the park as long as you have your hand stamped at the entrance gate. Policemen/ security personnel are also visible to maintain peace in order. I’m not a big fan of zoos, though."
	},
	{
		"User": "irahgm",
		"Location": "Doha, Qatar",
		"DateofReview": "September 24, 2011",
		"ReviewTitle": "CROCODILE ATTACK!",
		"Review": "Of course the crocodile did not attack us but we were very much excited to see them. I went there with someone who has not yet seen a crocodile in action. You can see birds, eagles, parrots, snakes not only pure crocodiles. We tried to go near the eagle to take a picture since it was open and the people were gone but when we said smile, the eagle tried to jump on me and so I ran (An eagle with an attitude). There's this show wherein a man will walk in a hanging line above the crocodile pool (IT SUPER CRAZZY!) there came a time that he actually fell and the staff had to hurry and help him or else it's dinner time :) \r After the tour in the farm, we went to watch a show about all the natives of Mindanao (to see their culture is wonderful, especially the clothes) there's games and trivia questions and plenty of dances. A must see!\r In the restaurant you can eat crocodile meat! Try it, it's nice and doesn't taste like crocodile at all! (one exotic food am willing to eat)"
	},
	{
		"User": "nicolo1209",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "September 20, 2011",
		"ReviewTitle": "Informative for all Nature Lovers",
		"Review": "We arrived at around 330 pm which was quite ideal because it was not so hot in the area. The entrance fee was P200 from 2 pm onwards. Inside were different types of animals, and not just crocodiles. \r \r At 4:00 pm, there was an eco-show wherein they sort of paraded the animals that were considered the main attractions of the park. This was not simply a show where they made the animals perform, but it was informative that it included how to identify the animals, how to take care of them, and how they are continuously being threatened by the society's unreserved invasion of their shelters. They consider the animals as ambassadors of the environment, as they represent the green environment that is Davao City.\r \r By the end of the show, there was a tightrope act of two men over a cage full of crocodiles. The first man was successful in crossing the rope, the second almost failed, wherein he almost fell to the waters. It was a really terrifying stunt which people from the audience either wished that the man really fell or the whole act was totally unnecessary.\r \r The one-hour show ended with more photo-ops with the animals as well as a tour of the other places of the park. It is well-maintained, but it demands support from the public as well that after the experience, we may have a better appreciation of the animals and nature."
	},
	{
		"User": "ztrips11",
		"Location": "davao city",
		"DateofReview": "April 18, 2011",
		"ReviewTitle": "a real shame for all these unfortunate animals",
		"Review": "we visited this park, which is hardly a park, and were saddened by the conditions there. the crocodile pens are practically dry, but for a little filthy disgusting algae crusted water in them...even the breeding tanks look dirty and poorly maintained. the commercials for this place paint an entirely different picture. the rest of the poor birds and other animals are cramped into tiny wire meshed cages that they can barely move in and get tormented by stupid, uneducated visitors. we especially felt sorry for the tigers there, kept in a caged area better suited for a small dog rather than 2 full sized beautiful animals such as these. \r this place is small, dirty and overcrowded with little real attention given to the animals there except to make money. if this place were in a first world country it would be shut down by animal rights groups in about 5 minutes. i also find it offensive and discriminatory that foreigeners are charged double to enter cheap circus attractions such as these. i happen to be a foreigner and also a resident of the philippines, so i escape this discrimination, but it's always amazing to witness this ridiculous standard. also something you would never see in a first world country. stay clear of crocodile park...you won't be missing a thing."
	},
	{
		"User": "ccduckie",
		"Location": "Victoria, Canada",
		"DateofReview": "December 8, 2010",
		"ReviewTitle": "Everything at once! The best attraction in Davao.",
		"Review": "The Crocodile park compound has everything at once. Before you arrive in the Crocodile Park you can try the Davao Zorb park which is owned by the same franchise. You can also try a water Zorb (great for little kids!) on a pond they have nearer to the park. Water Zorb is free with Zorb purchase.. There is also a butterfly park in the compound as well, although I have not visited that yet! The crocodile park itself is very cool, it also has birds that can sit on your arm, and other animals like ostrich and civets, to name a few! I loved it.. it was entertaining and well maintained. They also had crocodile shows! They have a small restaurant where I heard you can eat crocodile meat, and I believe they even have some kind of garden with dragon fruit trees, but I did not see it yet because I heard it's new."
	},
	{
		"User": "rustycrankshaft",
		"Location": "Auckland Central, New Zealand",
		"DateofReview": "September 12, 2009",
		"ReviewTitle": "Well worth a visit",
		"Review": "What can I say about this place, its no Singapore zoo but what they have is good. When we visited it was a Wednesday and we didn't see anyone past the the main entrance, not even staff so it was like we had the park to ourselves! There are a good variety of animals there and you can get right next to them which is something I've never been able to do. Seriously you could touch the Pythons if you were brave enough (not recommended!) Anyway its not a huge place but good for a hour or so. On certain days they put on a show involving the crocs and other animals which we missed but I hear is very good. Outside the park is the riverside walk where you can get a drink or crocodile steak (if you wish?) and is a nice place to finish the day. \r \r Overall I would say if your in Davao, give this place a visit. Its not going to keep you busy the whole day but is certainly good for a couple of hours. Well done to the staff."
	},
	{
		"User": "Manoi_Rule",
		"Location": "Manila",
		"DateofReview": "August 18, 2008",
		"ReviewTitle": "Crocodile Farm",
		"Review": "Ive been to the crocodile farm twice, sunday afternoons for the 4:30PM show. Its been memorable and a great place to relax."
	},
	{
		"User": "Wolfchild",
		"Location": "",
		"DateofReview": "January 15, 2006",
		"ReviewTitle": "It was interesting, a must see:)",
		"Review": "This park is a really nice place and I did enjoy my visit to the Crocodile Park near Davao. I have visited it in December 2005 when they have been moving the old park to a new location. Anyway, it was fun to see these big crocodiles from so close distance. I expected the park to be bigger though, they have put some other animals as well there, so it looks like a small zoo. The only thing I didn't like is when I saw some small chicken waiting in the cages of the huge snakes to be eaten by the big reptiles.I would recommend you guys to visit it - it's one of the main attractions in Davao!"
	}
]
