[
	{
		"User": "Mona I",
		"Location": "Edmonton, Alberta, Canada",
		"TimeofReview": "Reviewed yesterday ",
		"ReviewTitle": "Greast museum! Worth a visit. ",
		"Review": "What a great find! This museum appears small but it is not! There are 3 floors of diverse species ranging from the house cat to dinosaurs and everything in between. \r Our tour guide Joyce was so sweet and very knowledgable. There was so much great information we got out of the tour. Kids loved it of course! "
	},
	{
		"User": "BriDex",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed 3 weeks ago ",
		"ReviewTitle": "The best! 🌟🌟🌟🌟🌟",
		"Review": "D’ Bone Collector Museum is very educational and a fun place. Thank you to our Kuya Z, super informative and accommodating, pati ang owner. I wish I brought my niece. For sure kids will love it and have many “wow” moments. \r God bless you Kuya Z! ✋"
	},
	{
		"User": "leli G",
		"Location": " ",
		"TimeofReview": "Reviewed 4 weeks ago ",
		"ReviewTitle": "For the kids and kids at heart",
		"Review": "My nephews enjoyed their trip at the museum. Definitely a delightful place for kids and curious kids at heart. A true gem in Davao City."
	},
	{
		"User": "TuffyH1",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed 4 weeks ago ",
		"ReviewTitle": "Fascinating and informative ",
		"Review": "D’Bone was suggested by the tour guide in Museo Dabawenyo. It was a little bit far if you will walk from Museo Dabawenyo even though the walk was tiring it was worth it. The guide in D’Bone was nice and informative. It is really amazing how the owner collected and maintain D’bone. Highly recommended. "
	},
	{
		"User": "wdw2695793",
		"Location": "Benson",
		"TimeofReview": "Reviewed 4 weeks ago ",
		"ReviewTitle": "Great Educational place ",
		"Review": "What a surprise was not expecting it to be so packed with so many different skeletons and fossils not just from the Philippines but from around the world. The tour guide was excellent very knowledgeable we will definitely go back as our youngest is big time into dinosaurs and fossils. Do not miss this place it was a very Educational time for all of us if your unsure of the animals found in the Philippines then you won’t be after a visit well done guys. "
	},
	{
		"User": "curicuis",
		"Location": "Linkoping, Sweden",
		"TimeofReview": "Reviewed February 16, 2018 ",
		"ReviewTitle": "Excellent Museum",
		"Review": "I visited the museum today while spending a couple of very short days in Davao. It was recently remodeled and reopened earlier this year. This is a small museum, but there's a large number of very well organized exhibits; consisting of three floors and each is air conditioned. \r \r This was definitely better than I expected, and a must see for families with small children. The cost was 100 pesos for one adult, but you can request a guide at no extra cost (at least I wasn't asked for anything). The guide was very pleasent, knowledgable and kept me engaged by asking questions at each exhibit. She did earn a tip before I left. \r \r Thank you to the staff for providing these exhibits. They are well displayed, very educational and interesting. This was a great experience overall and I'll definitely return during my next trip to see what has changed or been added."
	},
	{
		"User": "Tor Erling M",
		"Location": " ",
		"TimeofReview": "Reviewed February 16, 2018 ",
		"ReviewTitle": "Did not expect this much!",
		"Review": "I went to D' Bone Collector Museum to give a break from all the walking, and I did not expect this much! Great collection and great staff. Tour was really nicely designed. They have only replicas of two dinosaurs and the rest is real.\r \r I would recommend everyone visiting Davao City to pay a visit here for 30 minutes at the least."
	},
	{
		"User": "Fay Fay Y",
		"Location": " ",
		"TimeofReview": "Reviewed February 9, 2018 ",
		"ReviewTitle": "Very interesting! Must see!",
		"Review": "We really enjoyed our visit to the bone collector museum. Kuya Dave is a cool guy with a real passion for his work. Our tour guide was great and very knowledgeable about all of the specimens. She was able to answer our questions. This museum is well worth the visit if you’re in Davao, it’s a must see! "
	},
	{
		"User": "Los Angeles, California",
		"Location": "Los Angeles, California",
		"TimeofReview": "Reviewed January 26, 2018 ",
		"ReviewTitle": "Nice place for people how likes enviroment",
		"Review": "A place you have to visit og you Are in Davao. The guide Are clever and know everything. About natur and a good guide"
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"TimeofReview": "Reviewed October 31, 2017 ",
		"ReviewTitle": "closed",
		"Review": "went there with my family today and the place was closed. Even the taxi driver was surprised it was not open. Also no info on the gate when it will be open again."
	},
	{
		"User": "Erika G",
		"Location": " ",
		"TimeofReview": "Reviewed September 10, 2017 ",
		"ReviewTitle": "Staff is superb ",
		"Review": "After visiting this museum..You will realise that caring for nature is very important because almost all the bones that were displayed here are victim of irresponsible human who doesn't care about others..My friends and I enjoyed our tour here and the staff were very knowledgable..The owner is also nice looking forward to my next visit here.. "
	},
	{
		"User": "Paul C",
		"Location": "Leeds, United Kingdom",
		"TimeofReview": "Reviewed August 31, 2017 ",
		"ReviewTitle": "Well worth the time to find",
		"Review": "We visited with a 6 and a 14 yr old. We all found the museum very interesting, and very educational. The girl who escorted us round was very pleasant and knowledgeable about the exhibits and took time to answer questions and chat with us. \r We did have a hard time finding the museum. We asked a policeman, street vendors and college kids close to the museum and none of them were aware of it. We just kept walking until we came across it, and it was well worth the effort."
	},
	{
		"User": "Mia P",
		"Location": "Mandaluyong, Philippines",
		"TimeofReview": "Reviewed August 29, 2017 ",
		"ReviewTitle": "Interesting Trip!",
		"Review": "The museum charges 80 PHP per head. It comes with your own guide who's very knowledgeable of the bones inside the museum. The museum would help you be more concerning towards the environment, especially to the sea. The only con I see here is the museum requires you to go inside a small street and taxis rarely pass by."
	},
	{
		"User": "RheivenRei",
		"Location": " ",
		"TimeofReview": "Reviewed August 26, 2017 ",
		"ReviewTitle": "Boned ",
		"Review": "Kids can enjoy this museum, they'll see different sets of bones of different animal but for adult is this kind of boring"
	},
	{
		"User": "lemmorcv",
		"Location": "Las Pinas, Philippines",
		"TimeofReview": "Reviewed August 15, 2017 ",
		"ReviewTitle": "Interesting Stop",
		"Review": "The attraction are collection of bones of today's animals, not dinosaur or any prehistoric animal. Most are sea creatures and mammals. The entry is not expensive and inclusive of a tour guide that will explain to you the displays and and sometimes how the animal dies due to environmental recklessness of the people. Taking photos is allowed but not video. Its three floors of display. I see nice parking in the area. Be prepared to handle a dirty toilet if you need to use one. There are exotic souvenirs on sale in there ticket booth like necklaces and bracelets charmed with animal tooth. This is one good tourist attraction to visit in Davao."
	},
	{
		"User": "Billydl",
		"Location": "Bacolod, Philippines",
		"TimeofReview": "Reviewed August 15, 2017 ",
		"ReviewTitle": "Interesting museum.",
		"Review": "A different kind of museum where one can see the bones of over 2700 specimens on a 3 store building. Found it to be a very educational experience with a guide explaining the different bone specimens. The 2nd and 3rd floor is airconditioned but not conducive for elderly or handicapped people as one has to use the stairs to reach them."
	},
	{
		"User": "Ronna V",
		"Location": " ",
		"TimeofReview": "Reviewed August 9, 2017 ",
		"ReviewTitle": "Amazing Bone Collections",
		"Review": "This is the first stop on my DIY city tour \r Its about 12nn that time and i walked for about 10-15 mins from the center to the bone collector museum.. \r The entrance is 80 pesos...and u can take a look around on thier 3story collections\r It was nice and educational ..\r I got to see diff bones.. \r Diff species...\r It was good something fun and educational... \r Yeah try to check this out when ur in the city \r U can reach by walking or riding pedicab "
	},
	{
		"User": "Anne P",
		"Location": " ",
		"TimeofReview": "Reviewed July 5, 2017 ",
		"ReviewTitle": "The location is hard to find but worth the visit",
		"Review": "The location is hard to find but worth the visit. I am not sure if it is google map that had problem or the user but we had to spend more than an hour roaming around to find this place. The people does not seem to know this museum thus making it harder to find. But once you got there you will be amazed how they preserved the bones of different animals. REally interesting. There's also a sad lesson on how some of the animals died."
	},
	{
		"User": "Don R",
		"Location": " ",
		"TimeofReview": "Reviewed June 22, 2017 ",
		"ReviewTitle": "Must visit",
		"Review": "Lots of bones from different land, water and aerial animals. I didn't expect to find this museum in Davao. I appreciate the owner's effort and passion in bone collection making it an ideal place for educational trips and group tours."
	},
	{
		"User": "Niel D",
		"Location": " ",
		"TimeofReview": "Reviewed June 5, 2017 ",
		"ReviewTitle": "Great stop over! ",
		"Review": "Cool stop over on your trip to davao. Only takes an hour to do and only P80 ($1.6) inclusive of a tour guide. Also educational as they advocate against ocean pollution."
	},
	{
		"User": "JTMFraginal",
		"Location": "Cainta, Philippines",
		"TimeofReview": "Reviewed June 1, 2017 ",
		"ReviewTitle": "Bones Galore",
		"Review": "D' Bone Collector Museum houses a private collection of bones of many animals such as dogs, cats, whales, sharks and others. Entrance fee is 80 pesos for an adult and it is compensated by a guided tour for 30 minutes. Afterwhich, you can go around...More"
	},
	{
		"User": "UsapangGala",
		"Location": "Pasig, Philippines",
		"TimeofReview": "Reviewed May 11, 2017 ",
		"ReviewTitle": "Very Interesting!",
		"Review": "The staff are friendly. They are prepared to answer you questions. Each exhibit has its own story and the staffs assured that the bones in display did came from donations and died of natural causes."
	},
	{
		"User": "MBDAce",
		"Location": "Quezon City, Philippines",
		"TimeofReview": "Reviewed May 4, 2017 ",
		"ReviewTitle": "TWO THUMBS UP! A MUST SEE!",
		"Review": "This place is simply amazing. Another short stop for our last day in Davao for the entrance of PhP 80 for adults this is not so bad at all. I can't say anything but you need to see this place."
	},
	{
		"User": "ElizaR131",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed April 28, 2017 ",
		"ReviewTitle": "Something different from sight seeing and shopping",
		"Review": "When I travel with family, I try to include something educational in the trip. The Bone Collector Museum in Davao City is really very interesting. There is a Php 80 fee for adults and Php 60 fee for children. It includes a tour guide who...More"
	},
	{
		"User": "Loraine Ruth L",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed April 23, 2017 ",
		"ReviewTitle": "Amazing",
		"Review": "I was amazed with their bone collection. Their museum is a 3-floor airconditioned building. They've separated different species like in the 3rd floor, you can find animals that thrive in water and in the second floor, land animals and birds. Tour guide was really accommodating....More"
	},
	{
		"User": "Bill C",
		"Location": "Davao del Sur Province, Philippines",
		"TimeofReview": "Reviewed April 22, 2017 ",
		"ReviewTitle": "Wonderful Hidden Gem!",
		"Review": "D’Bone museum is tucked away in a location that forces you to get off the main streets and see life in Davao City. As most of Davao, it is completely safe. The museum is three stories, has air conditioning and is simply amazing. They also...More"
	},
	{
		"User": "dpalisoc",
		"Location": "Cainta, Philippines",
		"TimeofReview": "Reviewed April 14, 2017 ",
		"ReviewTitle": "Bone Collector inside!",
		"Review": "Well, what can we expect? Different bones inside, souvenirs are also sold inside the museum. A plus would be the bone collector himself is there cheerful for a photoshoot with you. The place is accessible by a tricycle. Visit the place if you're into bone...More"
	},
	{
		"User": "iPesky",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed April 11, 2017 ",
		"ReviewTitle": "Unexpected!!",
		"Review": "This place doesnt have much ads. Going would also make you think because of the tight street with motorcycles and tricycles everywhere. Once you get near the place, you would notice that the beach is already a few meters away from the building. Once inside,...More"
	},
	{
		"User": "jedainz",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed April 6, 2017 ",
		"ReviewTitle": "Informative place",
		"Review": "You'll learn a lot of things from this museum. Great for grade school kids and as a learning activity with parents and children."
	},
	{
		"User": "Aurora M",
		"Location": " ",
		"TimeofReview": "Reviewed March 30, 2017 ",
		"ReviewTitle": "Nice place",
		"Review": "Nice place. You can see different animal bone collector. The staff is nice. The place is clean. The lady explain clearly about the different bone collector."
	},
	{
		"User": "maribel_camelotes",
		"Location": "Davao del Sur Province, Philippines",
		"TimeofReview": "Reviewed March 28, 2017 ",
		"ReviewTitle": "Interesting and Educational",
		"Review": "Schools should include this place in their educational field trips. They educate us how to take care of our environment esp proper garbage disposal . Our tour guide Ms. Princess is very accommodating. I'll be back soon bringing with me my friends."
	},
	{
		"User": "Ken S",
		"Location": " ",
		"TimeofReview": "Reviewed March 25, 2017 ",
		"ReviewTitle": "\"Uncle D\" does most of the tours himself!",
		"Review": "Excellence is what you'll see in how the bones are presented. It's fascinating to see & surprising that this is in Davao. Very informative. There are even skeletons of animals from other parts of the world. It's kind of like the Smithsonian in Washington, DC....More"
	},
	{
		"User": "travellerheartAU",
		"Location": " ",
		"TimeofReview": "Reviewed March 1, 2017 ",
		"ReviewTitle": "Interesting with a real commitment to environmentall friendly practices",
		"Review": "This was an interesting collection!! I was a bit surprised at the sheer number of bones they have. The displays are done very well and the skeletons have been reconstructed really well. The guide was very interesting, and she was keen to share her knowledge...More"
	},
	{
		"User": "bofordborres",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed February 22, 2017 ",
		"ReviewTitle": "Specialist museum with a heart for the environment",
		"Review": "The museum is a good place to visit especially for students. They educate the kids about the environment while discussing the exhibits. They also allow picture taking. It is not only reserved for students, I saw one couple stealing 30 minutes of their coffee break."
	},
	{
		"User": "Lrae_Fernan",
		"Location": "Quezon City, Philippines",
		"TimeofReview": "Reviewed February 15, 2017 ",
		"ReviewTitle": "Bones Bones Bones!! :)",
		"Review": "My 3 year old baby enjoyed the museum! staff are very accommodating, friendly and informative. We enjoyed the experience!! will recommend visiting this place when travelling to Davao. :)"
	},
	{
		"User": "Stuart K",
		"Location": "Kent, United Kingdom",
		"TimeofReview": "Reviewed February 15, 2017 ",
		"ReviewTitle": "museum",
		"Review": "hard place to find its in the middle of small local stores ,will go back again ,and they even asked from what country i was from ,which made me happy"
	},
	{
		"User": "Greeg G",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed February 9, 2017 ",
		"ReviewTitle": "Awesome collection",
		"Review": "Aside from human skeleton, I haven't gone yet to animal bone collection not until I went to D' Bone collector. I was amaze how big are these water creatures and at the same time, I was felt hurt knowing the cause of their death."
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"TimeofReview": "Reviewed January 28, 2017 ",
		"ReviewTitle": "Greta dioramas with numerous skeletons",
		"Review": "This three storey museum in a narrow street almost opposite a smeily drain is the last pace one might expect to find a premises devoted to trying to educate us about not placing litter so that it flows into waterways and eventually into the world's...More"
	},
	{
		"User": "kishmary",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Philippines",
		"Location": "Philippines",
		"TimeofReview": "Reviewed January 19, 2017 ",
		"ReviewTitle": "Kish bday ",
		"Review": "Very educational plus all the bones had their own story. We managed to meet the owner. The staff are well mannered and with full knowledge of each bone story."
	},
	{
		"User": "NinoLeeZhongPing",
		"Location": "Makati, Philippines",
		"TimeofReview": "Reviewed December 31, 2016 ",
		"ReviewTitle": "A unique museum focused on animan conservation",
		"Review": "This museaum is dedicated to animal conservation. Thankful that there is one museum in this part of the country that focuses on the topic. The bone collection is unique, very interesting you see the bone composition of creatures as small as a rat to as big as a whale. There are are a few prehistoric pieces at the ground floor and a curio shop.\r \r Ok, while not like the Natiknal Museum, this will do for now. Tour guides talk like a rapid fire machine gun, good thing they allow you to spend more time to appreciate the musuem after their done with guiding you.\r \r This place museum is a must to educated children. I suggest having a vehicle going to and fro the museum."
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"TimeofReview": "Reviewed December 21, 2016 ",
		"ReviewTitle": "Wow!",
		"Review": "Go there! Really impressive. Interesting thing. Good staff. So many collected items. I found lots of things to know. I heard it is run by a foreigner who lives here."
	},
	{
		"User": "AmorSabella",
		"Location": "Davao City Philippines",
		"TimeofReview": "Reviewed November 11, 2016 ",
		"ReviewTitle": "Educational and Amazing",
		"Review": "It is in a very unusual Place in the City... but good that they have parking area inside the Museum. The place is very good for kids to explore and spend sometime. You have to pay P80 for Adult and P70 for children. It is nice to take a lot of pictures and look at different kinds of Bones."
	},
	{
		"User": "Piumal T",
		"Location": "Vilnius, Lithuania",
		"TimeofReview": "Reviewed October 18, 2016 ",
		"ReviewTitle": "Bones everywhere. Loved it",
		"Review": "The place is hidden but if you managed to find one of the most surprising places ever. Lot of skeletons you can see and be surprised of.The collection is well maintained and the owner is super friendly and explained me everything by himself which made me understand lot of new things too. Must visit in Davao"
	},
	{
		"User": "MediciBoy",
		"Location": " ",
		"TimeofReview": "Reviewed October 4, 2016 ",
		"ReviewTitle": "Location is not too accessible",
		"Review": "The museum is still a work in progress and you can hardly call it a museum at this point since you will find construction crews doing some works and staff sleeping on benches while you're doing your tour and picture taking."
	},
	{
		"User": "jsvviernes",
		"Location": "Metro Manila, Philippines",
		"TimeofReview": "Reviewed September 26, 2016 ",
		"ReviewTitle": "Have a Quick Visit.",
		"Review": "First of all Thank You D'Bone Collector Museum we had a great time Me and my Wife. We've been here September 22, 2016. I just wanted to say in this review to just visit this place, it's an Awesome place to go in Davao. The Collection of Bones was really great for me, Sorry guys I really like this place I do appreciate the Bones so much. Please Visit this place the Entrance fee is just 80 pesos with a tour guide who can explain really well. \r \r Tips: I can give you but not guaranteed Okay for you.\r 1. Visit this place to learn more about the History of their bones and the Story Behind every bone.Their Bones has a Lot of Different Story.Please Visit so you will have more knowledge about the Bones.\r \r 2. Entrance Fee with Tour Guide/ Story teller is Only 80 Pesos only very Cheap.\r \r 3. Bring your Camera and Selfie stick to take pictures. (No Video I think so)\r \r 4. If you want to go there try the Pedicab/Tri-Cycle it's just 5 pesos Only. 10 pesos for two person. short Distance. (for experience only and helping the Locals).\r \r 5. Not that Okay for the Senior Citizen or having a hard time going up the stairs because the building has 3 floors. But still it's a good Time to go here and good exercise for everyone. So just Visit this place.\r \r 6. Enjoy everything you experience, and lower your expectation.\r \r 7. Don't forget to right your name in their log book. Because I did forgot to right there Sorry Bone Collector.\r \r 8. If you want to visit here find more information because they are not always open. I just remember that it is just until 5 PM weekdays. and weekends it depends. not sure of the Time.\r \r 9. If you wish to go in the D'Bone Collector just ask any local in Davao they know it they are knowledgeable then Ride a Multicab/jeep going there or use Waze or Maps so you could see the place easily.\r All In All I Really like this place, must visit. Please Visit D/Bone Collector Museum.\r \r Thanks TripAdvisor\r \r All my Comments/review here are on my own"
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed September 19, 2016 ",
		"ReviewTitle": "Amazing collections in the world",
		"Review": "At first I was hesitant to go inside the museum, besides the P80 pesos entrance fee. I thought there's nothing interesting to see inside but just purely dried bones we can see on TV shows. But I was impressed when we toured inside and up to the 3rd floor. Lots of bone collections are there which I have not seen in other museums. The tour guide was also very smart and with humor as she explains to us the different sections of the museum. It was a fun and learning experience."
	},
	{
		"User": "77Raine27",
		"Location": "Cavite Province, Philippines",
		"TimeofReview": "Reviewed September 8, 2016 ",
		"ReviewTitle": "Quite Interesting",
		"Review": "Entrance fee was for P80. One-of-a-kind museum that is not only educational but also provides insight to help create a clean environment for animal ad mammal protection. The tour guide was the American Darrell Dean Blatchley, who is the president and curator of the D'Bone Collector Museum. There were different species like sharks, whale sharks, fishes, crocodiles, skeletons of various animals even a human skeleton. He would teach you that if we leave trash like plastic bottles this would kill them. "
	},
	{
		"User": "Butterflyonmyleg",
		"Location": "Muscat, Oman",
		"TimeofReview": "Reviewed August 31, 2016 ",
		"ReviewTitle": "Excellent Museum Guide. Not for seniors/people with difficulty in climbing stairs",
		"Review": "We had an very informative visit to D'Bone Collector Museum. What a great collections! Our museum guide was so efficient and has explained everything that we needed to know. It was quite exhausting to go up to the 3rd floor and as we were with my mom who has difficulty on climbing stairs, we took time to reach each floor. I hope the management can put an elevator in the future for the comfort of our seniors and handicapped people."
	},
	{
		"User": "Lawrence A",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Quezon City, Philippines",
		"Location": "Quezon City, Philippines",
		"TimeofReview": "Reviewed July 24, 2016 ",
		"ReviewTitle": "Bones! Bones!",
		"Review": "If you appreciate fossil art, then this is the place to ve. It's a good place to see bones speak of its ancient past."
	},
	{
		"User": "LaiCz",
		"Location": "Paranaque, Philippines",
		"TimeofReview": "Reviewed July 24, 2016 ",
		"ReviewTitle": "A Rare Collection",
		"Review": "A museum where a collection of animal bones from fish, dogs, snakes, horses, crocodile, dolphin, whale, all others and surprisingly a human skeleton are displayed in a 3-story building. Entrance fee is 80 pesos for adults and 70 for kids. We went there on a weekday so we were able to tour the place in a breeze. "
	},
	{
		"User": "beckscambel",
		"Location": "Quezon City, Philippines",
		"TimeofReview": "Reviewed July 18, 2016 ",
		"ReviewTitle": "Instructural Museum",
		"Review": "We have been here last August 2015. The entrance fee cost roughly P 60.00 per head and it close at around 5pm. Were gladly we reached the place before it close. It been a great experience viewing the collection of different kinds of animals and even the bone of human. I hope they have this kind of museum here in Manila. We are tour the place with this great lecturer man with great knowledge of bone and skeleton."
	},
	{
		"User": "Andreas S",
		"Location": " ",
		"TimeofReview": "Reviewed July 13, 2016 ",
		"ReviewTitle": "A great collection",
		"Review": "I agree with others that it is a great educational experience. I nice collection of skeletons of all kind of animals. We spend about 1 hour there with our two boys (9&11) they liked it very much. And learned a lot."
	},
	{
		"User": "virstud",
		"Location": "Caloocan",
		"TimeofReview": "Reviewed July 13, 2016 ",
		"ReviewTitle": "See bones of different animals",
		"Review": "This is within the city near the San Pedro Cathedral. The entrance fee is Php 80 for adult, which contains 3 floors of exhibits. Nothing spectacular and good place to see different set of bones of animals."
	},
	{
		"User": "Michael L",
		"Location": " ",
		"TimeofReview": "Reviewed July 12, 2016 ",
		"ReviewTitle": "Dinosaurs ?",
		"Review": "One of a kind Museum where preserved bones are on display, giving archaeology lessons visually. perfect for students"
	},
	{
		"User": "JMHerald",
		"Location": " ",
		"TimeofReview": "Reviewed July 10, 2016 ",
		"ReviewTitle": "Never expected my visit here would be very educational.",
		"Review": "This is the only bone museum in the Philippines. A range of bones from insects to whales is exhibited in this place. What I like about this place is that the guide really does their job, and they're doing it really well. They explain the differences of the bones, entertains questions well, and tells stories about the origin of the animal before they became a display. Kudos to the owner of the museum and their staff! Hope this museum will continue educating future visitors about the importance of taking care of our environment."
	},
	{
		"User": "aprilsky2016",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed June 9, 2016 ",
		"ReviewTitle": "Let us protect our environment.",
		"Review": "When I planned a tour for my family and visitor at D'Bone Collector Museum I just expected to see lot of bones. The placed proved me wrong. The museum attendant brought us to another dimension as she told us the sad stories of most of the animals and how they ended up dead. I highly recommend this to small children so that at an early age they will know how to become responsible caretakers of mother nature."
	},
	{
		"User": "CaliTo69",
		"Location": "Philippines",
		"TimeofReview": "Reviewed June 5, 2016 ",
		"ReviewTitle": "mini Smihsonian museum in Davao",
		"Review": "the place is not well known to many locals. We went to the Davao City Hall to ask for directions but no one seems to know about its existence. Luckily I have a printed map and showed them the location but still they couldn't give an exact answer. So i moved on foot to locate the museum by myself. Upon reaching the place which is located in a narrow road and no direct route by the jeepneys, one has to pay an admission fee of P80 and a guide will tour you around the place. It is a 3 storey museum which houses numerous skeletons, from whales to 1 year old ostrich and a human skeleton of a granny. I can say it is a very mini Smithsonian museum in the country."
	},
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed May 21, 2016 ",
		"ReviewTitle": "Very educational, kids and adults must visit",
		"Review": "This is the only museum of it's kind in the Philippines. Bones collected from different animals are presented in a nice climate controlled place. Beautiful, amazing bone collection of dolphins and sharks and whales that sadly died after ingesting plastics from the sea. \r Our guide was very courteous and informative. This is a good way of educating our citizens about taking care of our environment. Good job!!"
	},
	{
		"User": "yolyg2015",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Marikina, Philippines",
		"Location": "Marikina, Philippines",
		"TimeofReview": "Reviewed May 19, 2016 ",
		"ReviewTitle": "Educational place to visit",
		"Review": "Went to see this Museum and really learned a lot from the collections I saw. Very good to visit as part of educational tour.. Must for students at all levels"
	},
	{
		"User": "Denise Alysson V",
		"Location": " ",
		"TimeofReview": "Reviewed May 12, 2016 ",
		"ReviewTitle": "Great place!",
		"Review": "This place was amazing. Our niece enjoyed a lot learning about the animals, where they came from, when did they died, what happened to them and how to protect them. Its a lot of fun! We had enjoyed the tour even if we're only 3. You have to come to this place."
	},
	{
		"User": "Abi_girl07",
		"Location": " ",
		"TimeofReview": "Reviewed April 26, 2016 ",
		"ReviewTitle": "Really nice but the location isn't good.",
		"Review": "I really like the content in the museum\r  And the guide is also great. So many information being given and I have nothing but praises for the museum but the location is really not good. It's in the squatters area. Wish that they have better location but I'm thinking that it will be hard to transfer all the artifacts. "
	},
	{
		"User": "wilmagroovy",
		"Location": "Dumaguete City, Philippines",
		"TimeofReview": "Reviewed April 12, 2016 ",
		"ReviewTitle": "Wonderful and educational.",
		"Review": "I expected the place was just a so,so place but when we entered the building it was full of exciting and useful bones to admire.The young lady who was our guide did a wonderful narration on how the bones where found and preserved so that people can realize the wonders and negligence of some people that causes the death of these animals.You also compare how human and animal bones are similar or different in every aspect.Nice collection and it takes a lot of perseverance,effort and money just to assemble one complete bones of an animal.Congratulations to the owner,Daryl?,for a job well done.Thank you for the unique experience."
	},
	{
		"User": "Heri s",
		"Location": "blitar",
		"TimeofReview": "Reviewed March 23, 2016 ",
		"ReviewTitle": "Unique place",
		"Review": "Nice experience to visited this place, all about bone, from the animal up to human bone, good for parent who bring their child to this place, as education .."
	},
	{
		"User": "Maria Gracia M",
		"Location": "Cainta Rizal",
		"TimeofReview": "Reviewed March 22, 2016 ",
		"ReviewTitle": "Interesting Museum",
		"Review": "This is just a 3 floor museum, not so big but very interesting since they have real bones of different species (from land, sea and air) and more coming soon. Very educational because they have a friendly guide to explain things to you and even take you pictures. The explaining is fast though but they will give you a lot of time to stroll the area. The owner is accommodating too. A foreigner who is very fluent in bisaya and tagalog. Entrance fee is 100 for adults and 80 for kids. "
	},
	{
		"User": "dimples0983",
		"Location": "caloocan",
		"TimeofReview": "Reviewed March 18, 2016 ",
		"ReviewTitle": "Awesome",
		"Review": "Pay a visit. Our guide JR was great.. Especially with 3 types of crocs... Darell was also very approaching and friendly to all guests... And not to mention knowledgable.. Ask him questions.."
	},
	{
		"User": "thenavigator8",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed March 15, 2016 ",
		"ReviewTitle": "Amazing",
		"Review": "To see the bones preserved is quite amazing. Though there is an odd smell in the area. THe museum is quite small. Im looking forward to them expanding their collections."
	},
	{
		"User": "bebepenk",
		"Location": "Imus, Philippines",
		"TimeofReview": "Reviewed February 29, 2016 ",
		"ReviewTitle": "good people with good purpose",
		"Review": "more than the museum, we were astonished by how warm we were welcomed by the owner and staffs even if it's nearly closing hours already."
	},
	{
		"User": "Eric E",
		"Location": "Philippines",
		"TimeofReview": "Reviewed February 28, 2016 ",
		"ReviewTitle": "The Philippines should be thankful",
		"Review": "I am a fan of animals, especially dinosaurs. Growing up watching Jaws n' Claws, Walking with Dinosaurs and other shows in Discovery, this place gave me that satisfication of how cool it is to know these things and appreciate life on our planet, and how it evolved to the world we know today. I say, the Philippines should be thankful to have this kind of museum. I dont recall any Philippine government-owned institution that has the variety and volume of animal bones that this place has. Okay, I may have missed it if there's any, but really, I dont recall going to a museum like this here in the country. By any effort, the government should support the sustainability and growth of scientific establishments like this one. If you have kids, I recomment you send them here. If you're not a fan of science, dont come here and say you were bored. Museums are very important in the preservation and enrichment of our knowledge and culture. Places like this should not be overlooked. With that, I will give it a 4-star. I will give it 5 someday."
	},
	{
		"User": "mnjensen",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Odense, Denmark",
		"Location": "Odense, Denmark",
		"TimeofReview": "Reviewed February 27, 2016 ",
		"ReviewTitle": "A good choice in Davao",
		"Review": "This is a good museum ran by an American turned native. For Davao it is an impressive array of old bones from sea creatures."
	},
	{
		"User": "wildlfower777",
		"Location": "Al Ain, United Arab Emirates",
		"TimeofReview": "Reviewed February 25, 2016 ",
		"ReviewTitle": "A Museum Like No Other",
		"Review": "D' Bone Collector Museum is a unique kind of a museum because the collections featured are bones, particularly bones of huge sea creatures and other animals of the large structures. Each artifact is showcased in a unique way with its history and significance carefully outlined. The place also offers video shows and lectures about its artifacts and other useful information about sea and land creatures. Awesome and informative!!!"
	},
	{
		"User": "Valerie L",
		"Location": " ",
		"TimeofReview": "Reviewed February 24, 2016 ",
		"ReviewTitle": "very nice",
		"Review": "very accommodating and interesting. The owner is hands on and you can really tell that he loves what he's doing. I love how he is trying to share his passion with the world and that he does not do it for the profit. I salute whoever made this because this is the first of its kind I have ever gone to in Davao City. Kudos to this place!!!"
	},
	{
		"User": "JanChen2015",
		"Location": "Singapore, Singapore",
		"TimeofReview": "Reviewed February 19, 2016 ",
		"ReviewTitle": "Not to be missed!",
		"Review": "We really enjoyed visiting the D'Bone Collector Museum. During our visit, the owner Mr Darrell was busy assembling a skeleton of a dog with his assistance. We can see his dedication and attention to his work. The lady guide was very patient with our numerous questions, and she tried to answer them as best as she could. The bone displays were very neatly done and was very enticing to see. Highly recommended place to visit when in Davao City."
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"TimeofReview": "Reviewed February 19, 2016 ",
		"ReviewTitle": "take the tour",
		"Review": "wow learned more in Philipines than back home in Kansas.it is a must! tuck back off the main road but a have to see place to go in Davao."
	},
	{
		"User": "Sunshine Tresda... R",
		"Location": "Quezon City, Philippines",
		"TimeofReview": "Reviewed February 17, 2016 ",
		"ReviewTitle": "We had a great time.",
		"Review": "We visited the museum on our first day in Davao. We were in Davao last week, from February 10 to February 13, 2016. It was not a great deal to visit the place, unlike what we'd heard when we got there. I can't remember the guide's name, but his name sounds Florine, he said it was like chlorine with an F. He was good. He knew what he was saying and we enjoyed his company. I personally isn't too much fond of animals and sort, but I learned a lot with all his knowledge. Plus, the owner is a Datu Bago awardee, meaning he is a great man. Visit this place and surely, you will never regret it."
	},
	{
		"User": "Ellen Laspobres F",
		"Location": " ",
		"TimeofReview": "Reviewed February 5, 2016 ",
		"ReviewTitle": "learn something new....",
		"Review": "i was so pity with these bones of animals. coz every bone of it has its own stories. Mostly of them they die because human disposable garbage like can, straw, made of plastic. and some die also of human hands because of being selfish want to earn money. I learn through this that we, as a human are made to take care of them, not to killed them. remember \"you cannot killed the time, time can kill you\". "
	},
	{
		"User": "Jake2014jake",
		"Location": "Pasig, Philippines",
		"TimeofReview": "Reviewed February 2, 2016 ",
		"ReviewTitle": "Sarap to D' Bone!",
		"Review": "You need to ask around a bit in order to locate the museum. While it is in the city center of Davao City, it is not along the main highways or roads but on a smaller street. However, after getting directions, it is not really hard to find. If you have internet based maps or locator applications, use it to quickly reach the place.\r \r This is not your typical museum containing displays of artwork, paintings, and historical artifacts. The museum contains only bones of animals gathered from around the world and from the Philippines. The ground floor, containing the reception area and the souvenir shop, will immediately grab your attention with the fossil of a Velociraptor (dinosaur) unearthed in the Philippines by the owner of the museum, Darrel D. Blatchley. The second floor is dedicated to the bones of land animals like horses, bears, and even common animals like bulls and cats and dogs. On the other hand, the third floor contains displays of the bones of various sea creatures, from whales to sharks to dolphins, and many more. The display of the bones of sea creatures contains detailed accounts of where the animal was found and the circumstances surrounding the death of the animal. Such is aligned with the purpose of the museum which is the preservation of the environment, a laudable cause indeed."
	},
	{
		"User": "Jay S",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed January 28, 2016 ",
		"ReviewTitle": "Went with the kids and had a great time! ",
		"Review": "I went here with the kids of my wife's school. So I tagged along while also bringing along my son. \r \r The tour was great because the main guy was very knowledgeable and had everything memorized to the dot. The kids were not only learning but also laughing because of his humor. \r \r Great time for you and the kids, guaranteed. "
	},
	{
		"User": "Ashley H",
		"Location": " ",
		"TimeofReview": "Reviewed January 15, 2016 ",
		"ReviewTitle": "So much more than a museum!",
		"Review": "Sounded weird at first but you very quickly pick up on the environmental message that comes across with each exhibit and leave thinking about your impact on nature. A great place to take kids but equally as intriguing for all ages. Staff - who take you on a tour of facilities as part of the entrance fee - are friendly and very well informed and the work that has gone into the displays deserves great credit. On the day we visited we were lucky enough to see an autopsy of a dwarf sperm whale (if I'm right) out the back that had beached locally. The owner Darrell Blatchley's young son led us out the back (unsure of where he was leading us) and when we turned the corner we saw the whole bloody scene. Darrell then expertly talked us through the anatomy of the carcass and it's probable cause of death, while his mother supplied us with fresh Aloe Vera for our sunburn. A surreal experience in very friendly family-run surroundings, this is so much more than your usual museum. It's very clear that this is a place run out of love with a very passionate and determined view to improving conservation locally. Everyone should visit to find out how they can help the environment."
	},
	{
		"User": "Ralph S",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "San Antonio, Texas",
		"Location": "San Antonio, Texas",
		"TimeofReview": "Reviewed January 14, 2016 ",
		"ReviewTitle": "Very interesting place to visit!",
		"Review": "This museum is very unique and is run by a very friendly staff. The director won the Datu Bago Award for contributing so much to the community. The displays are works in progress...we will go again soon. Very reasonable admission price that help their conservation efforts."
	},
	{
		"User": "RJ G",
		"Location": "Philippines",
		"TimeofReview": "Reviewed January 11, 2016 ",
		"ReviewTitle": "Fun way to learn;Great for all ages!",
		"Review": "We went to the D'Bone Collector Museum last December 2015 as a big group. Our family had senior citizens, married couples, teenagers and kids in the group and we all learned from the visit. First of all, we would to thank everyone who in one way or the other is part of the maintenance of this very vast collection. Keeping it really clean, organized and fun to visit is key to why we enjoyed our visit. Thanks to your very knowledgeable staff for making our short visit very educational. God bless you all and we will surely recommend your museum to others :)"
	},
	{
		"User": "Zen A",
		"Location": " ",
		"TimeofReview": "Reviewed January 6, 2016 ",
		"ReviewTitle": "Creepy In A Nice Way! #bonespamore",
		"Review": "Since we are pretty new in Davao, hubby and I decided to tour ourselves around the city. The museum is not for free :) though the fee I think is worth the sight that you'll get out of this museum. \r \r Make sure to reach the 3rd floor when you visit. It was a fun learning experience. The owners are nice as well."
	},
	{
		"User": "elacparl",
		"Location": "Metro Manila, Philippines",
		"TimeofReview": "Reviewed January 6, 2016 ",
		"ReviewTitle": "Educational",
		"Review": "Learned tons of things considering the small size of the museum. It's best to tour around with the owner/bone collector/specialist."
	},
	{
		"User": "onsadarrab",
		"Location": "Cagayan de Oro, Philippines",
		"TimeofReview": "Reviewed December 31, 2015 ",
		"ReviewTitle": "Good place",
		"Review": "It's a nice place to drop by. The place is clean and people are very hospitable. You'll learn interesting stories and facts. Please ask for a free tour guide. You can take pictures but not videos. The problem is the road going to the place is so narrow and many \"tricycle\" that makes it more trafic."
	},
	{
		"User": "Ric S",
		"Location": "Baguio, Philippines",
		"TimeofReview": "Reviewed December 26, 2015 ",
		"ReviewTitle": "A rare find",
		"Review": "Tourism write-ups, published or online, of this place offer very few clues about the abundance of bone matter it displays. It has an eclectic collection quite interesting not only to biology and anatomy school kids but also to the ordinary visitor who has a fascination with how animals look beneath skin and flesh. The latter is where I belong so spent more time here than I initially thought. Carefully preserved and curated, this place was truly worth my visit."
	},
	{
		"User": "AniMei1",
		"Location": "Bacolod, Philippines",
		"TimeofReview": "Reviewed December 21, 2015 ",
		"ReviewTitle": "interesting and educational",
		"Review": "We very much enjoyed it, and learned a lot, too! People who visit Davao should see this place! We thought we already knew a lot but visiting this place made us learn more about mammals, land and sea animals and basically the animal kingdom."
	},
	{
		"User": "TonyUy",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed December 18, 2015 ",
		"ReviewTitle": "Bones are in!",
		"Review": "From the Raptor to the whale, and from the bugs to all sorts of mammals and snakes, one would be in awe to find such treasure cove of bone collection in the country! Surely it's a definite adventure for all ages. Carefully arranged and a story to tell on each of the exhibit, three floors of amazing collections will guarantee your curiosity and tons of added knowledge."
	},
	{
		"User": "pixiedust010",
		"Location": "Singapore, Singapore",
		"TimeofReview": "Reviewed December 16, 2015 ",
		"ReviewTitle": "Amazing find",
		"Review": "It may not be an ample collection of bones but it's remarkable to have someone who value the preservation of animals bone/ skeleton. I was shocked to see a human skeleton as well. I hope the government will suffice financial support to the museum."
	},
	{
		"User": "Jeremy N",
		"Location": "Dover, Delaware",
		"TimeofReview": "Reviewed December 9, 2015 ",
		"ReviewTitle": "Outstanding!",
		"Review": "This place is really a best kept secret..alot of taxi drivers dont know where it is but if you tell them Alemandras gym stop its a short walk from there....very interesting and the tour guide we had named Wen was very informative and you could tell she enjoyed her job...the place is very well kept and sooooo many bones from all types of animals and marine life. The area around it may seem seedy to some but rest assured its very nice people and very helpful and you will feel very safe and comfortable...if you are in Davao do not pass up this gem."
	},
	{
		"User": "HurricaneRob",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Houston, Texas",
		"Location": "Houston, Texas",
		"TimeofReview": "Reviewed December 3, 2015 ",
		"ReviewTitle": "Bones of all sorts",
		"Review": "We found this museum to be far more than what was expected, in fact the owner gave us some background information"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed December 3, 2015 ",
		"ReviewTitle": "A must see for every person in davao",
		"Review": "it is just a museum with bones. but the staff is knowledgable , full of stories, the walk to the museum is through a squatterarea which is also entertaining. it will take you an hour or so to do the tour."
	},
	{
		"User": "Li M",
		"Location": " ",
		"TimeofReview": "Reviewed December 2, 2015 ",
		"ReviewTitle": "Little adventure ",
		"Review": "It's a great place to visit and learn what is not seen everyday. The experience was an eye opener to what we don't see through books and televisions. Definitely recommended to be visited when in davao :)"
	},
	{
		"User": "MarsRK",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed November 30, 2015 ",
		"ReviewTitle": "Don't judge a book by its cover.",
		"Review": "I went last month with my sister. It was easy to locate considering it's in a poor location but still in the center of the city. The entrance fee for adults is P100.00. It's a weekday and there were only few people at the lobby...More"
	},
	{
		"User": "Elmo B",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed November 19, 2015 ",
		"ReviewTitle": "Informative, Realistic, Alien and A Must To Know For Everyone",
		"Review": "Getting Here A bit tricky finding this place. I recommend that one just take a walk from Davao Museum/Museo Dabawenyo. No need to take the tricycle ride that will charge you hefty for a short walk. D' Bone Collector Museum - Floor 1 Pay the...More"
	},
	{
		"User": "Lenore B",
		"Location": "Mandaluyong, Philippines",
		"TimeofReview": "Reviewed November 9, 2015 ",
		"ReviewTitle": "Back to school",
		"Review": "Remembering my younger years when I was in school. The insights provided by the in-house tour guide was very informative. Ideal for school children."
	},
	{
		"User": "Iceman272",
		"Location": "Grafton, NY",
		"TimeofReview": "Reviewed October 17, 2015 ",
		"ReviewTitle": "Educational",
		"Review": "This was a good little place to visit with more to see than we expected. It's excellent for a school group. The collection is of modern bones, not fossils. So, don't expect any fossils other than some shark teeth. The collection includes horses, dogs, turtles,...More"
	},
	{
		"User": "Kristienne L",
		"Location": " ",
		"TimeofReview": "Reviewed October 17, 2015 ",
		"ReviewTitle": "Nice experience ",
		"Review": "It was very nive to be here.. Very educational and staffs were very accomodating. Although we had a hard time finding it,but thanx to Google.."
	},
	{
		"User": "Felicia C",
		"Location": "Singapore, Singapore",
		"TimeofReview": "Reviewed September 22, 2015 ",
		"ReviewTitle": "A MUST-SEE in Davao City!",
		"Review": "I was really fortunate to have been given a guided tour by Darrell. He was really engaging and was able to relate the bone collection to current events and concerns such as pollution in oceans, and the threat of extinction of certain animal species. For...More"
	},
	{
		"User": "Anna May V",
		"Location": "Pasig, Philippines",
		"TimeofReview": "Reviewed September 20, 2015 ",
		"ReviewTitle": "An Advocacy in 3 Floors",
		"Review": "Entrance fee is 80p. Upon entry, you will be greeted by the bones of a saltwater crocodile on display. We got Mark as a guide, a local marine biology student who was just spouting with historical and encyclopedic information. He would even give pop quizzes,...More"
	},
	{
		"User": "bukoshake2015",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Los Banos, Philippines",
		"Location": "Los Banos, Philippines",
		"TimeofReview": "Reviewed September 15, 2015 ",
		"ReviewTitle": "Interesting Place for Family or Friends",
		"Review": "Unexpectedly nice place to visit. Very informative tour and full of bones! :) The staff are as well educated about the theme and recent events related to wildlife. the owner was as well hands-on. He even posed with us holding a reticulated snake"
	},
	{
		"User": "robmaghinang",
		"Location": "Valenzuela, Philippines",
		"TimeofReview": "Reviewed September 15, 2015 ",
		"ReviewTitle": "One of the highlights of your Davao stay!",
		"Review": "D' Bone Collector Museum is the biggest of its kind in Southeast Asia and it is expanding very aggressively. \r \r The museum founder and curator, Mr. Darryl Blatchley, is very entertaining, expert-like and approached me to talk about his passion when he saw me checking the collection alone. For almost half an hour, we discussed how the museum started at the third floor and expanded to the rest of their three story building. He also shared his thoughts about people marking the museum down for being located in a dense residential area. C'mon, people, they have no control over it! Moving the museum on another location will cost more money which could have been allocated to expand the collection and improve the current building. Besides, as Mr. Blatchley told me, by bringing business and points of interests to developing areas, the government is more likely to focus and improve it as evidences on the museum's current location. This business strategy caught the eye of the government and both are now planning to open another D' Bone Collection Museum in a town somewhere in Southern Samar and will feature something big (I am not authorized by Mr. Blatchley to disclose potentially business confidential info). I will remember this business and economic model when I go back and finish my Political Science next year. He is such a great, passionate guy who offered me a free tourist map of Davao on my way out. \r \r The preparation area for the bones are moved somewhere else and there is very minimal smell of the skeletons. The place is air conditioned and very near the town center (walking distance from the Museo Dabawenyo). All personnel are very friendly and sounds very knowledgeable about the remains of the animals.\r \r The country is very lucky to have people like Mr. Darryl Blatchley who, despite having foreign blood, showcase their passion in the Philippines and speak Cebuano and Filipino fluently. I hope you continue your great work for the benefit of tourists and your community and good luck in Southern Samar! Keep an eye on the price of Red Horse, okay?"
	},
	{
		"User": "julietteBacolod",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed September 3, 2015 ",
		"ReviewTitle": "very educational!!!",
		"Review": "Flamboyant, very vocal owner.... guides are helpful. A little bit awkward location. Very educational... just tolerate the bad smell near the entrance cause it's where the owner peels of the skins of his next stuffed animal. :)))))"
	},
	{
		"User": "KingRegis",
		"Location": "Marikina, Philippines",
		"TimeofReview": "Reviewed September 3, 2015 ",
		"ReviewTitle": "One of A Kind Museum",
		"Review": "The D Bone Collector Museum was part of our City Tour. It was located in a Building which is not entirely finished. The Museum specializes in Bones. All 3 floors of the Museum is dedicated to Bones. It is very educational and worth the Visit."
	},
	{
		"User": "Jimcheng222",
		"Location": "Singapore, Singapore",
		"TimeofReview": "Reviewed September 2, 2015 ",
		"ReviewTitle": "Informative and good purpose",
		"Review": "It was very educational and I did learn a lot. The guide (GR or JR) did provide some trivia and facts and he was good at explaining as well. What I enjoyed it for is how repeatedly he reminded us of the importance of the preserving and taking care of our environment as it always has an impact to the animals and our lives. When you break the circle of life, then it causes some problems to the rest of the circle."
	},
	{
		"User": "Jarjar20",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed September 1, 2015 ",
		"ReviewTitle": "Great!",
		"Review": "Great collection! It's amazing how the bone collector got to amass these materials for exhibit. The area going to the museum is a bit cramped, however."
	},
	{
		"User": "Chato D",
		"Location": " ",
		"TimeofReview": "Reviewed August 23, 2015 ",
		"ReviewTitle": "Museum with a Heart♥",
		"Review": "It's not your conventional museum. The tour was a guided one without paying extra for the guide. \r  It showcases, as the name implies, bones of various animals both found locally and overseas. What makes it interesting is the story behind each animal which by the way were generally donated to the museum. Some animals perished because they have ingested trash such as plastic bottles thrown recklessly into bodies of water or got entangled with fishing nets.\r  I recommend that children visit this museum."
	},
	{
		"User": "Than T",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed August 13, 2015 ",
		"ReviewTitle": "True Accounts of Bone Collection Advocacy",
		"Review": "I just discovered this museum during this visit. And it was a worthy visit for a minimum fee. Not every Dabawenyo knows this place, so better ask the staff of Museyo Dabawenyo for the correct direction.\r \r The museums facade is cyanotic with huge black gate that kinda signify a seemingly Gothic place. But once you get inside and the jester tour guide starts touring you around, you would find as I had found no better place to learn about the dead and the living traces of them. I could say that I am one of the fortunate people to witness true accounts of bone collection advocacy. There is indeed plenty of things to see and learn (3-floor gallery at that!), and to realize as we live our days with other living creatures. Love the experience!"
	},
	{
		"User": "Mitch A",
		"Location": " ",
		"TimeofReview": "Reviewed August 11, 2015 ",
		"ReviewTitle": "MUST GO MUSEUM",
		"Review": "The entrance fee is 80 pesos only. It's worth it tho. Very informative and the tour guide is initiating to take a picture of me because I went there solo. Overall, it was fun at the same time the bones are worth instagramming!!!"
	},
	{
		"User": "marsyahata",
		"Location": "Manila",
		"TimeofReview": "Reviewed August 2, 2015 ",
		"ReviewTitle": "Very Informative, Get a Tour Guide!",
		"Review": "To be honest, this was not really included in our itinerary. But we figured we had a few hours to kill that day, so we decided to go. And boy did we make the right decision.\r \r It was quite hard to go to and from the place. The cab drivers weren't really sure where the place was, so we had to give him directions obtained through the internet. The road the museum was a narrow two way road so it may it is quite a challenge.\r \r Upon entering and paying for our entrance fee, we were informed to climb up the museum and was told that we have a tour guide waiting for us. Upon arriving on the second floor.. there was no one there. So we just went and checked out the exhibits on our own. We climbed to the third floor and saw a family with a tour guide, and we weren't acknowledged. So after checking out the exhibit, we decided to go down (museum is only 3 floors) again to the 2nd floor and revisit the exhibit there.\r \r It was only then we were greeted by a tour guide. It is imperative you get a tour guide because we missed a whole lot without someone explaining what, where and how the bones were obtained. The tour guide was very knowledgeable and quite funny, and made us appreciate what we were seeing. Seeing the bones was impressive, but hearing stories about them was what made this trip better.\r \r We were also lucky to meet the owner as he was arranging things on the museum lobby. It is quite impressive what he is doing for awareness. \r \r My fiance and I were very impressed. The facilities might not be eye popping, but the effort put in creating the exhibits, and the stories behind them sure made our trip to the museum an unforgettable experience."
	},
	{
		"User": "Dioneli S",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Iloilo City, Iloilo City, Philippines",
		"Location": "Iloilo City, Iloilo City, Philippines",
		"TimeofReview": "Reviewed August 1, 2015 ",
		"ReviewTitle": "Highly recommended",
		"Review": "This is a great museum. For Php80 only, you get a guided tour of the three floor museum (lobby+2 floors display area). The tour is very entertaining and educational. You can see that the guides really care alot about their work. The museum owner is very friendly as well and even does the tour if the other guides are already booked. If you get a chance and he is available, choose him as your guide instead. He's very funny and he's animated when he tells anecdotes about the animals they've preserved.\r \r There is a big whale skeleton the third floor that is great for selfies.\r \r Though the road going to this museum is narrow, they have a enough parking space available. Also, if you are sensitive to smell, bring a scented hanky or chew a candy to mask the scent of the chemical they use to preserve the bones.\r \r Maybe they could expand someday so they could include other large mammals such as elephants and lions. Overall, highly recommeded. Not just for kids but for adults as well."
	},
	{
		"User": "n_alunan",
		"Location": "Makati, Philippines",
		"TimeofReview": "Reviewed July 29, 2015 ",
		"ReviewTitle": "The Great D'Bone Collector Museum of the Philippines not only in Davao City",
		"Review": "One of a kind museum... It is a rare opportunity to see this kind of Museum... from animals to fish to whales... variety of bone structure of a creation... It is Mr Ruben and Ms Wanda of NAITAS Davao who introduce this kind of travel variations and it is really great... They are not only bones of habitat from the Philippines but bones of habitat around the world... so great ... so awesome... they have a great English speaking tour guide in house also .... Great Place"
	},
	{
		"User": "Vsevolod L",
		"Location": " ",
		"TimeofReview": "Reviewed July 27, 2015 ",
		"ReviewTitle": "Messy but cool",
		"Review": "The collection itself is nice, a lot of stuff and some of is very intresting and cool to see. However, the maintainance of the museum lacks in a lot of different ways. It is frustrating to see such unscientifical presentation and so many holes in information that feels fundamental for a museum of that kind. Nothing about where the bones were found, the scientific name of the animal, how old the object is and so on. Also their backgrounds to different objects look really budget and wierd (especially the horrible photoshoped wallpaper of roses, butterflies and bugs... you have to see it). It is such a messy use of beautiful and intresting objects."
	},
	{
		"User": "Mark L",
		"Location": "Bulacan Province, Philippines",
		"TimeofReview": "Reviewed July 25, 2015 ",
		"ReviewTitle": "Unique and Interesting",
		"Review": "It is near the Museo Dabawenyo. The bike ride cost 10php going to the museum. It has an entrance fee. The whale shark skeleton is the best part."
	},
	{
		"User": "markbenjamin",
		"Location": "Baguio, Philippines",
		"TimeofReview": "Reviewed July 23, 2015 ",
		"ReviewTitle": "Educational and Great Purpose",
		"Review": "I am an animal lover so I learned a lot form this experience. There are 3 floors. Each floor has it's own \"theme\". Clean and airconed. The only downside is the location of the museum."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed July 15, 2015 ",
		"ReviewTitle": "A Museum Like No Other in Mindanao",
		"Review": "If you are interested in knowing about the fauna in the Mindanao area, you can learn about them by their bones displayed very artfully and professionaly in D' Bone Collector Museum. You might miss the street going to it, since it is San Pedro Extension, a small street with a lot of tricycles. Surprisingly, our Starex was able to manuever to the colorful blue building. You won't miss it. The museum has 3 floors but each floor is about 200 sqm only. A tour guide (and sometimes the owner! which makes for a more interesting tour!) is well trained to describe the bones on display. I like to take my young guests and children to this museum! But for adults, it is definitely a \"must see at least once\" destination."
	},
	{
		"User": "Mahal Kita M",
		"Location": "Makati, Philippines",
		"TimeofReview": "Reviewed July 8, 2015 ",
		"ReviewTitle": "Nice info",
		"Review": "We tried to look for the location of this museum so we walked until we reached the are. It was an amazing museum our first time to visit about bones of species. We traveled around asia and the first time we experience the museum about bones."
	},
	{
		"User": "ocervin",
		"Location": "Gothenburg, Sweden",
		"TimeofReview": "Reviewed July 7, 2015 ",
		"ReviewTitle": "Very small place",
		"Review": "This \"museum\" is a sorted Collection of bone, put together by a private collector, mostly by donations.\r It's based in a small 2-floor\r Building and includes a total of 2\r Room with glass aquariums for the skeletons.\r There are quite many different animals, but mostly fish and birds.\r \r You are allowed to take photos.\r Entrence fee is PHP 80.\r \r Note: It's a bit tricky to find, even for a local taxi driver, because it is based in a non-tourist area.\r It's about 200 meters in from the closest main road.\r I would advise using taxi all the way because there are a lot of traffic on the small road and also beggers asking for money. I.e Poor area...\r \r Do not expect to see a modern and \"classy\" museum."
	},
	{
		"User": "bam086",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed July 2, 2015 ",
		"ReviewTitle": "very informative",
		"Review": "the owners were very accommodating and explained all the items in the collection. Very interesting bones and it really looks like the owners are bent on making this a quality display - highly recommended that you visit this place"
	},
	{
		"User": "AndreiSabang",
		"Location": "Cebu City, Cebu City, Philippines",
		"TimeofReview": "Reviewed June 17, 2015 ",
		"ReviewTitle": "Worth the visit",
		"Review": "One of the highlights on our trip was the visit to this awesome museum. There were a lot of animal bone display that are from all over the world. The tour guide was pretty good and told us the story of almost each animal there. The location moved so it was a bit hard to track down via taxi so it's best to have a GPS out just in case. The driver said that the establishment where the museum is located used to be a family circus so that might help locating the area."
	},
	{
		"User": "Marklyn M",
		"Location": " ",
		"TimeofReview": "Reviewed June 16, 2015 ",
		"ReviewTitle": "See bones come alive!!!",
		"Review": "We walked our way to the museum and it was worth it. It's a private museum spearheaded by an american missionary Mr. Darrell Blatchley. We were told by the guide that there are only 3 museum of its kind in the world. Yeah only 3. The museum will not only tickle one's imagination , but also will raise awareness on conservation of the our precious wildlife. I do think that the place is underrated and one couldn't go away without learning something at least something from it.\r We found Mr Blatchley working on his upcoming exhibit which will house dinosaurs.\r I personally thanked him for bringing his collections here to us."
	},
	{
		"User": "saf7670",
		"Location": "Peterborough, United Kingdom",
		"TimeofReview": "Reviewed June 16, 2015 ",
		"ReviewTitle": "Excellent educational and highly entertaining.",
		"Review": "This is my second visit to the DBone collector museum, and once again very impressed with the whole experience, The group consisted of around 10 Filipinos and myself, and the guide taking us around was explaining the history and information regarding the exhibits mainly in tagalog, which isnt too much of an issue for me as I can follow limited tagalog. But I can see where this may be an issue with others.\r On my previous visit the guide gave the tour totally in English.\r Overall the exhibits are well presented and very educational, I wish we have more places like this to teach about environmental issues.\r I can recommend this museum to anyone visiting Davao regardless of age."
	},
	{
		"User": "Jan B",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed June 12, 2015 ",
		"ReviewTitle": "nice museum",
		"Review": "its my first time to go in this kind of place and its really feels a little strange for me. tidy and i think its recommended to other first time goers in davao"
	},
	{
		"User": "Jonathan B",
		"Location": "Bangkok",
		"TimeofReview": "Reviewed June 11, 2015 ",
		"ReviewTitle": "An Interesting Private Museum",
		"Review": "Founded by American Darrell Dean Blatchley, D' Bone Collector Museum is a rather interesting collection of bones from animals both native to the region and from around the world. The mounting of the specimens is rather well done, and the animals are mounted in natural positions. \r \r The highlight of the museum, though, in my opinion, is not a skeleton but rather the mounted skin of the extremely rare megamouth shark, one of the few on the display in the entire world. It was going to be butchered where it was caught in Cagayan de Oro, but Mr. Blatchley rushed to the site to save the skin and jaw for display."
	},
	{
		"User": "Dondi A",
		"Location": " ",
		"TimeofReview": "Reviewed June 3, 2015 ",
		"ReviewTitle": "Very educational for the kids",
		"Review": "Apparently, it's the largest collection of bones in the country, and it's privately maintained by a private individual (and an American, even - Uncle D). Loved all the stories each set of bones presented, and was impressed by how much we learned in this visit. Definitely a must-visit for families with young kids!"
	},
	{
		"User": "MMLO",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed May 27, 2015 ",
		"ReviewTitle": "Support this wonderful museum",
		"Review": "This is a non-ngo supported museum. All collections are part of a private collection and it was really impressive. Please support this so that his collection will grow. Bring your kids to appreciate the value and importance of animals. Very insightful."
	},
	{
		"User": "KB D",
		"Location": " ",
		"TimeofReview": "Reviewed May 13, 2015 ",
		"ReviewTitle": "Totally a BONER! Best for those doing a biological field trip.",
		"Review": "If you're a tree-hugger and someone who advocates for marine life, this is absolutely for you! \r The entrance fee of 50 pesos brings you to three levels of a building stuffed with endemic land and sea creatures. The enthusiastic guides provide excellent information about the sources of the bones. This kind of museum is best to inspire children of collecting age to pursue a life-long interest in gathering (not hoarding) materials of value. Best for those doing a biological field trip."
	},
	{
		"User": "Andrew_BeMyGuest",
		"Location": "Singapore",
		"TimeofReview": "Reviewed May 8, 2015 ",
		"ReviewTitle": "much better than i expected",
		"Review": "try to join one of the tours hosted by the owner - daryle. he is a great presenter and passionate environmentalist."
	},
	{
		"User": "larj2013",
		"Location": "Quezon City, Philippines",
		"TimeofReview": "Reviewed May 4, 2015 ",
		"ReviewTitle": "skull & bones",
		"Review": "extensive collection of animal bones..the place was really organized...very impressive! the place was hard to find though but ask for a guide and you will definitely find the place for educational tour..."
	},
	{
		"User": "sweethomes",
		"Location": "Cebu Island, Philippines",
		"TimeofReview": "Reviewed April 29, 2015 ",
		"ReviewTitle": "informative",
		"Review": "Great for students...clean and well-organized A tour guide will give you information about the museum"
	},
	{
		"User": "Jeanilyn M",
		"Location": " ",
		"TimeofReview": "Reviewed April 24, 2015 ",
		"ReviewTitle": "Mother Earth's creations are Amazing!",
		"Review": "We we're so amazed of the bones we've seen from the lobby to 3rd floor! Our exceptional tour guide (Kuya JR) explained to us the stories of how the animals died. What's very disapointing to know is they died because of the garbages made by humans which they unknowingly have eaten. At the end of the tour, the tour guide reminded us that the animals were made first by God before humans. We ( you & me ) are entrusted to take care of them. "
	},
	{
		"User": "James G",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed April 16, 2015 ",
		"ReviewTitle": "Cool Place & Informative Tour",
		"Review": "This museum houses around 700 (and counting) impressive bone collection. The place is owned by Darrell Dean Blatchley, who greeted us warmly upon entering. Don't get shocked if he suddenly speaks to you in Tagalog or Bisaya fluently! haha! ^^\r \r Me and my mom were impressed at the several bones housed at that place. From domestic animals to those you see in Animal Planet, seriously, it's a feast to the eyes and curious mind. I love how the tour is keen on details (from how they were able to acquire the animal bones, cool FYI for each animal or specie, to environmental impacts). The tour clearly raises environmental awareness. Some of the animals they've acquired have died due to pollution (i.e. the specie ate a bottle cap or other foreign objects) or other man-made reasons.\r \r The tour guides are cool and friendly. They'd definitely answer your questions regarding the bones and species there.\r \r Though there is a hint of a weird smell (probably mostly coming from where they perform the autopsy of the animals etc.), come on guys, would that stop you from exploring this cool place? The place ain't smelly. Period.\r \r I'd visit this place again maybe with some of my friends who haven't been to Davao or who have been to Davao but missed the opportunity to go here.\r \r Thanks Darrell and Kuya Mark (our tour-guide)!!! ^^"
	},
	{
		"User": "Morks",
		"Location": "Quezon City, Philippines",
		"TimeofReview": "Reviewed March 31, 2015 ",
		"ReviewTitle": "Uniquely educational and relevant",
		"Review": "Loved that the museum showcased bones but also included the causes of death of the marine animals --- mostly water pollution"
	},
	{
		"User": "Magiting",
		"Location": "Sydney, Australia",
		"TimeofReview": "Reviewed March 26, 2015 ",
		"ReviewTitle": "Amazing Works",
		"Review": "I like the display and explanation of the guide, steep stair is bit hassle for persons with weak knee"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"TimeofReview": "Reviewed March 25, 2015 ",
		"ReviewTitle": "Amazing destination",
		"Review": "It's a kind museum that you won't find elsewhere on this side of the globe. While it's all bones of animals of different sizes, shapes and species, the way it's presented to guests makes one appreciate life and the importance of taking good care of our environment. Kudos to the owners who brilliantly came up with this idea and continually making the museum more educational and interesting!"
	},
	{
		"User": "NathanSison",
		"Location": "Manila, Manila, Philippines",
		"TimeofReview": "Reviewed March 17, 2015 ",
		"ReviewTitle": "Provoking and interesting",
		"Review": "A place that may be hard to find if you commute by jeepney, I suggest taking a cab. We arrived at the museum around 4PM, just enough time to explore the place. Interestingly, a guide will tour you around and we are lucky because at the time of visit, It was only me and my friend who was there, so we definitely had more chance to learn and ask questions from the guide. It will definitely provoke many things in your mind such as protecting the wildlife both in the land and the creatures of the sea who play a very vital role in our ecosystem. As an additional, below, there is also a skeleton of a real human being. "
	},
	{
		"User": "superVeee09",
		"Location": "Lucena City",
		"TimeofReview": "Reviewed March 10, 2015 ",
		"ReviewTitle": "fascinating",
		"Review": "It is an awesome museum. It is like a hole in the wall museum. You never thought that you will see a bone collection like what they have."
	},
	{
		"User": "NorthernMIGuy",
		"Location": "Michigan",
		"TimeofReview": "Reviewed March 10, 2015 ",
		"ReviewTitle": "Interesting and informative",
		"Review": "A very non-traditional museum, but in a very good way. D' Bone Collector Museum is right in Davao City, and is a fun and informative way to spend a couple of hours. I received a guided tour, and I was thoroughly impressed by both the museum's collection and the knowledgeability of my tour guide (I'm pretty sure that he was the owner/operator). The museum is passionate about what they do, and about education. I was told that the museum only accepts specimens that died naturally, were accidentally killed (such as fishing bycatch), or had to be euthanized. I appreciated that fact, as it means that none of the specimens on display there died simply for the sake of putting them in the museum. The museum has specimens as large as a sperm whale, all the way down to the tiny tarsier that is native to parts of the Philippines. It was sad to hear how many of the sea creatures died due to ingesting garbage (usually plastic) or were killed by fishermen, but at least now their skeletons are helping to build awareness regarding these important issues."
	},
	{
		"User": "Mrs F",
		"Location": " ",
		"TimeofReview": "Reviewed March 7, 2015 ",
		"ReviewTitle": "Interesting & very informative",
		"Review": "This museum is very interesting & the staff who assisted us explained every detail on their collections. It promotes conservation and it opened my mind to the world of different animals I never knew of. It was worth a visit!"
	},
	{
		"User": "Sally C",
		"Location": "Butuan, Philippines",
		"TimeofReview": "Reviewed March 4, 2015 ",
		"ReviewTitle": "A Life-Changing Visit",
		"Review": "I've been to Davao many times but it's my first time to visit D'Bone Collector Museum last week. I just accompanied our students on their field trip in which the place was included in the itinerary. I visited the museum in Mati and had a great appreciation of the big skeleton of Sperm Whale. Little did I know that the persons who assembled the bones were the owner and staff of the D'Bone Collector Museum. It's great to know that there are people like them ( Sir Darrell and staff) who are passionate to spread education about animal conservation, love for Mother Earth, and valuing oneself. I recommend this place for all students to visit. It's worth the time and a life-changing one too."
	},
	{
		"User": "TayNayNak",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Luzon, Philippines",
		"Location": "Luzon, Philippines",
		"TimeofReview": "Reviewed March 1, 2015 ",
		"ReviewTitle": "A lesson on conservation!",
		"Review": "When in Davao City, do find time to drop by this unique museum, and be enriched by the stories behind the collection, and more importantly, learn about conservation and the environment. Kudos to the owner, Darrel, for setting up this wonderful collection."
	},
	{
		"User": "leftovertoo",
		"Location": "Oslo, Norway",
		"TimeofReview": "Reviewed February 12, 2015 ",
		"ReviewTitle": "Worth a Visit.",
		"Review": "We enjoy off the beaten path type places, which this is. The museum is interesting and all the exhibits are made of real bones. The Whale exhibit upstairs hanging on the ceiling is humbling. Its one of its kind in the Philippines. The owner Darrel was at the exhibit when we were there and gave some interesting background on the history of the place and his involvement. Worth a visit for sure."
	},
	{
		"User": "adangoyjr",
		"Location": "Dubai, United Arab Emirates",
		"TimeofReview": "Reviewed February 12, 2015 ",
		"ReviewTitle": "A must-see in Davao",
		"Review": "Never thought that there is a place like this in Davao. It is a must see. Very educational and the staff were just amazing. I wish the location of museum is somewhere else."
	},
	{
		"User": "Walter20104",
		"Location": "Amstetten, Austria",
		"TimeofReview": "Reviewed January 28, 2015 ",
		"ReviewTitle": "Interesting Place - good guide.",
		"Review": "Quite good collection of any kind of animal skeletons - very tidy location. The guide was very compentent and did his best to explain about the history. Recommendable but no big \"wow\"."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"TimeofReview": "Reviewed January 17, 2015 ",
		"ReviewTitle": "Amazing collection!",
		"Review": "The best museum we came into. The owner/tour-guide was nice and knows what the whole museum's display. Articulate and knowledgeable of the various collections and the background of the specific animal. You will not be bored, but be attentive. Great experience."
	},
	{
		"User": "treeman52",
		"Location": "Syracuse",
		"TimeofReview": "Reviewed January 13, 2015 ",
		"ReviewTitle": "An Interesting visit.",
		"Review": "My wife and I recently visited this attraction. It was nice but hard to find. While we were visiting, The owner was just starting on a Cobra that villagers had just killed. It was interesting to watch him and how he did his work. The guide that led us around seemed to know what he was talking about. Though he did get a few of his facts wrong. If you are interested in museums at all. Then this is a must see."
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"TimeofReview": "Reviewed January 10, 2015 ",
		"ReviewTitle": "2nd visit",
		"Review": "My first visit was last 2012. It was already good despite of unfinished museum. \r \r What made my first tour better was our tour guide back then was Darell (owner). He was really passionate in educating all the visitors about his collection. You will really feel that he is not after the money that he will earn from the entrance fee, he really wanted most people to realize the damage that we are causing for simple things that we could have avoided to save a certain type of specie. \r \r I thought my 2nd visit will be boring because I already saw most of the collections 2 years ago but I was wrong. They have constructed the 2nd floor and put more collections (some are donated). \r \r What Darell has done good is that he trained the staff and they sound really knowledgeable of every piece of his collections. \r \r This is a must-see museum in Davao. :)"
	},
	{
		"User": "Gab D",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed January 3, 2015 ",
		"ReviewTitle": "A must see!",
		"Review": "The museum is awesome, right from the entrance! The bone collections are incredible! You would not believe what the cheap entrance fare would get you to experience. Even kids will be intrigued and delighted of the unique features of the museum."
	},
	{
		"User": "RossH667",
		"Location": "Broadbeach, Australia",
		"TimeofReview": "Reviewed December 18, 2014 ",
		"ReviewTitle": "Fascinating",
		"Review": "What a large variety of preserved animals. Obviously the person who owns this place is passionate about their work. This is well worth a visit"
	},
	{
		"User": "Sy0ni",
		"Location": "Manila, Manila, Philippines",
		"TimeofReview": "Reviewed December 9, 2014 ",
		"ReviewTitle": "Fantastic collection",
		"Review": "It was my first time in Davao and this place was definitely on my list. The place was of full fossil with stories to tell. Combine it with friendly staff that will tour you around the place. They have massive collection of bones in all sort of sizes. Kudos to Mr. Darrell Dean Blatchley for putting up such a museum. I was really awed by what I saw and it's really worth the trip."
	},
	{
		"User": "funhuntr",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila",
		"Location": "Manila",
		"TimeofReview": "Reviewed December 9, 2014 ",
		"ReviewTitle": "Quite a surprise",
		"Review": "Thank you tripadvisor or else we wouldnt have known this existed. My travel companions (family) were quite surprised and delighted on the visit. A must - see and please feel free to donate and buy their stuff to keep their efforts going!"
	},
	{
		"User": "Kaye214",
		"Location": "Davao",
		"TimeofReview": "Reviewed December 7, 2014 ",
		"ReviewTitle": "Always a pleasure",
		"Review": "I have been here almost a dozen times, bringing various friends and relatives who visit Davao City, and each time is enjoyable. The unique bone collection is expanding all the time so you will see something new once in a while. It is located in a shady part of the city, so make sure to go during the day. There is a minimal entrance fee and one of the tour guides will walk you through the whole exhibit, which contains land animals, insects, fossils, forest animals, and sea animals. There is an underlying theme of how our human actions harm animals. It is very educational. The best tour guide is the caucasian owner (he can do the tour in English, bisaya or tagalog), followed by the young man (sometimes he speaks too fast but he is very friendly and you can ask questions) and rarely, the young woman. Tour will take about 1-2 hrs, and is a must visit, especially for kids."
	},
	{
		"User": "salingkatkat",
		"Location": "Antipolo City, Philippines",
		"TimeofReview": "Reviewed November 24, 2014 ",
		"ReviewTitle": "More than just a museum!",
		"Review": "We walked from Museo Dabawenyo to D’Bone Collector Museum at 3:30 in the afternoon. Not a good idea, but it was all worth it!\r \r The museum is a treasure of ‘real’ bones from animals all over the world. A collection of Mr. Darrell Dean Blatchley (unfortunately, we were not able to meet him in person); the museum showcases different bones, skulls, and skeletons.\r \r The museum is in partnership with the local government units and the Bureau of Fisheries and Aquatic Resources. What I love about them is the advocacy to bring the message to the people on how we can better take care of the environment and the animals.\r \r It was an awesome experience!\r \r As of November 2014 the entrance fee is Php100 for adults and Php50 for students."
	},
	{
		"User": "chebsterss",
		"Location": " ",
		"TimeofReview": "Reviewed November 21, 2014 ",
		"ReviewTitle": "AWESOME!!",
		"Review": "One of the best museums ive been to. If youre in davao, dont miss to visit this place. Not only that its educational but it gives awareness too. Most of the animals there died because of human error. 2 thumbs up guys!! I will be visiting this place again, soon. I'm looking forward to see the new collections."
	},
	{
		"User": "Gretzkydgreat",
		"Location": "Davao City",
		"TimeofReview": "Reviewed October 5, 2014 ",
		"ReviewTitle": "\"AWESOME & AMAZING\"",
		"Review": "The family had so much fun with the collection of the different species. They are amazed how \"uncle D\" put everything into place even the smallest animals. It is also an eye opener for everyone to protect the environment. You will discover why these animal die and the cause of their death. His collection is both a hubby and donations from different people in the region and neighboring place. We also had a close encounter with D' Bone Collector \"uncle D\". Thank you for answering all the questions that my little boy \"Arthur\" while at work preserving some insects. A must visit when your in Davao City include this in your itinerary, and you will have so much fun."
	},
	{
		"User": "Jelleinne J",
		"Location": "Quezon City, Quezon City, Philippines",
		"TimeofReview": "Reviewed September 16, 2014 ",
		"ReviewTitle": "I loved it!",
		"Review": "The location was a bit inconvenient when you are commuting but it is totally worth it! \r \r I would especially recommend it to kids for them to be more aware of how to protect and care for our environment. You see, several of the species here died because they ingested plastics and other stuff that people did not dispose properly. "
	},
	{
		"User": "marxcabrera",
		"Location": "Manila, Philippines",
		"TimeofReview": "Reviewed September 10, 2014 ",
		"ReviewTitle": "One of a Kind",
		"Review": "They did a good job with the painstaking construction of the skeletons. I also liked how enthusiastic the guide was during our tour of the museum. I wish they had a bigger space so people can actually see and appreciate each piece from afar, especially the big ones like the sperm whale. The place itself is pretty hard to find as well. This one definitely has more things to improve on, but as it is now, the museum has something good going on. "
	},
	{
		"User": "Rolly M",
		"Location": "Las Pinas, Philippines",
		"TimeofReview": "Reviewed September 9, 2014 ",
		"ReviewTitle": "An American with a Filipino heart!",
		"Review": "I met Darrell Blatchley when a fellow caver from Pangasinan brought me to D' Bone Collector Museum. Since I did four years in Babuyan Cetacean Research, I have plenty of knowledge about whales and dolphins. But I was really humbled by Darrell not only that he knows so much about the whales and dolphins and other species of the Philippines, he gave a lot of time and effort in collecting bones of animals in and around Davao to educate visitors from Davao and other places.\r \r You will learn a lot if you are into the environment. And to explain why the title is like that, He is married to a Filipina and the use of D' instead of \"the\" says so much about him being a Filipino at heart. And of course he loves the Philippines so much and he wants to protect our environment."
	},
	{
		"User": "Lynard M",
		"Location": "Las Pinas, Philippines",
		"TimeofReview": "Reviewed August 24, 2014 ",
		"ReviewTitle": "informative",
		"Review": "arrived here around 10 am, museum was closed, have to wait for the tour guide. but then again, it was a nice experience though"
	},
	{
		"User": "Yuna Y",
		"Location": "Manila, Manila, Philippines",
		"TimeofReview": "Reviewed August 21, 2014 ",
		"ReviewTitle": "The unexpected bones",
		"Review": "the museum is located in a small street in Davao City. It s ou pleasure that the owner personally toured us in the museum. Entrance fee is around 50 pesos for walk in guests. They also accommodate school field trips.The owner was nice and he has a lot of stories behind the bones that he collected. He is also environmentalist and a diver that helps the community and animals to live together in harmony. This museum is very educational and eye opener for us people to be a good steward to the world. I personally encourage you to visit this museum for the unique stories of how the animals died because of our negligence with our own wastes. "
	},
	{
		"User": "Jennifer S",
		"Location": " ",
		"TimeofReview": "Reviewed July 21, 2014 ",
		"ReviewTitle": "Unique place in Davao",
		"Review": "We learned about the museum through tripadvisor and was not disappointed, cool museum with a good collection of bones and good friendly English speaking guide who explained the different specimens to us. Great value. But the location is not ideal due to busy narrow streets, but once there, there is parking available."
	},
	{
		"User": "Pam B",
		"Location": "Cebu City, Philippines",
		"TimeofReview": "Reviewed July 17, 2014 ",
		"ReviewTitle": "Great learning opportunity - even better if you have the right guide!",
		"Review": "We went to D' Bone Collector Museum last Mar 2014 with the partner and our 12-month-old daughter. The place is within a residential neighborhood. We became slightly worried that we were lost - we were just walking our way around with a backpacking bag and an infant. We still went ahead though and finally saw the big building with a huge sign, it's pretty hard to miss.\r \r When we went inside, Darrell, the owner, was there but he was busy preparing to transport some bones to some local government agency. It's pretty amazing what he's doing considering that he's not a Filipino.\r \r We were greeted by their staff who walked us around. There wasn't much that he told about the bones so we just went ahead and enjoyed the displays ourselves. The girl had been busy asking personal questions and texting. Still, we enjoyed our time at the museum.\r \r Darrell was also kind to offer us a better tour the next time we get there, after he read about my review of the museum in my blog.\r \r I think there were also plans of expanding in Cebu but I'm not too sure about it."
	},
	{
		"User": "slyvargas",
		"Location": "Bacoor, Philippines",
		"TimeofReview": "Reviewed July 13, 2014 ",
		"ReviewTitle": "Fun and educating",
		"Review": "It's a no brainer that one has to stop-by at this museum before leaving Davao. If you're riding a cab within the city when going to the museum, tell the driver to bring you to San Pedro street \"extension.\" And refer to the map for the exact location of the site-- https://www.google.com/maps/place/D'Bone+Collector+Museum/@7.061142,125.612706,17z/data=!3m1!4b1!4m2!3m1!1s0x32f96d8103f873ab:0x54d9a93413bc6d7b\r \r Check out their Facebook page too!\r https://www.facebook.com/pages/D-Bone-Collector-Museum-Inc/216407245052538"
	},
	{
		"User": "Jess F",
		"Location": " ",
		"TimeofReview": "Reviewed June 27, 2014 ",
		"ReviewTitle": "Choices and consequences",
		"Review": "Yesterday I decided to drop by at the museum and with me were my two teenage daughters and my parents. Mr. Blatchley gave us a fun, very informative and inspiring tour around his museum. His message is that we should take good care of our environment since it is not only affecting us but the animals that live in it. And since it is a complex ecosystem then we humans are also affected in the end.\r I love also the message she imparted on my teenage daughters. He told them that we shape our lives by the choices we made. Good choices results in good consequences. Bad choices results in bad consequences. Our choices determines our destiny.\r I encourage everyone who visits Davao City to include a visit in this museum in your itinerary. Bring along your children with you. I assure you that it will be an hour well spent and well worth it."
	},
	{
		"User": "Ken G",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed June 26, 2014 ",
		"ReviewTitle": "must visit d bone collector museum",
		"Review": "so much fun and it was interesting ..bones of whales are very big ..i could not imagine but surely you will enjoy if u could come to bone collector museum."
	},
	{
		"User": "Foodandtravelcrazy",
		"Location": "Cebu ",
		"TimeofReview": "Reviewed June 13, 2014 ",
		"ReviewTitle": "Must visit while in Davao!",
		"Review": "I was very surprised at this amazing collection of an American guy who seems more Filipino than I am! It will inspire, educate and interest all especially the young ones. This is definitely a one of a kind attraction in Davao that's worth visiting."
	},
	{
		"User": "AprilCamias",
		"Location": "San Pedro, Philippines",
		"TimeofReview": "Reviewed June 11, 2014 ",
		"ReviewTitle": "BONEfied",
		"Review": "Way to the museum was a joke. It was like some places near the aplaya with tons of homesteader and the like. (so you wont be able to recognize if the museum really exist there or you are in the right track). Upon getting there, you will pay 100 for the entrance fee. it consists of 3 floors, but the museum were only at the 2nd and 3rd floor. Small Species were on the 2nd floor and the large ones are at the 3rd floor. It was really great and informative. Even the tour guides will give valuable info that you will just know from there. Before we leave, it was a great pleasure to meet the foreigner who owns the museum. (and luckily, that day he has just capture an old turtle) :) "
	},
	{
		"User": "Howie G",
		"Location": "Abilene, Texas",
		"TimeofReview": "Reviewed May 24, 2014 ",
		"ReviewTitle": "Intriguing displays & Headline in Mindanao Times",
		"Review": "On the day I visited the museum, by serendipity, the front page article \"What's Killing our Whales\", appeared on the Mindanao Times with an account of how a very rare \"gingko beaked\" whale had died off the beaches of Davao and the necropsy done, by D.D. Blatchley, at the D-Bone Museum. \r \r Mr. Blatchley and a crew of local citizens had tried to keep the whale alive when it was discovered lethargically swimming in the bay but, their efforts could not undo the damage of a fisherman's float found in its intestines nor other plastic items, that were the ultimate cause of death. \r \r Indeed, many of the marine animals' bones on display were caused by ocean garbage and the displays have the actual items as were the cause of death displayed with the bones for many as well. Quite fascinating. And, sad. I believe the gingko beaked whale in question in the Mindanao Times will be on display at some time too.\r \r So, it was even more fascinating having the opportunity to have a guided tour of the museum done by Mr. Blatchley himself, in English. His knowledge of marine and land animals is fantastic. There are numerous awards and certificates in the museum attesting to his expertise. His tour was crisp, informative, entertaining, and well worth the time. If I should return to Davao--which I hope someday to do--I will definitely want another visit to the museum. \r \r Hope this google map link helps others locate the museum as I note some reviews indicating it was hard to find: https://www.google.com/maps/place/D'Bone+Collector+Museum/@7.061142,125.612706,17z/data=!3m1!4b1!4m2!3m1!1s0x0:0x54d9a93413bc6d7b"
	},
	{
		"User": "MelP160",
		"Location": "Davao City, Philippines",
		"TimeofReview": "Reviewed May 5, 2014 ",
		"ReviewTitle": "Worth a Visit",
		"Review": "This museum, although challenging to reach, is worth a visit. The collections are arranged by type of species and are appropriately displayed according to habitat. The guides do a good job of explaining the collection and the importance of taking care of the environment. The owners are passionate about their advocacy and it shows in the way they carefully set up the museum and the way they handle the tours. \r \r They also sell souvenirs of crocodile teeth and the like aside from t-shirts."
	},
	{
		"User": "saf7670",
		"Location": "Peterborough, United Kingdom",
		"TimeofReview": "Reviewed April 12, 2014 ",
		"ReviewTitle": "Unusual but entertaining and educational",
		"Review": "After spending a day alone trying to locate this museum, I took a local companion as a guide and we finally found it. \r As you reach quezon and San Pedro junction there is a sign with an arrow, however this arrow points in the wrong direction, and you should ignore this and continue down the small road directly ahead and D'Bone Collector is about 400m on the right hand side.\r The museum houses a large selection of skeletons of both land and sea animals, anatomically correct and posed. Everything from ostrich, to horse to even a genuine 6 legged cow! and whale.\r There is a guide who will tell you the stories of the exhibits and the American owner.\r Cost for adults is 50php so this is a cheap way to spend a few hours if you can find it!"
	},
	{
		"User": "Derwin P",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Makati, Philippines",
		"Location": "Makati, Philippines",
		"TimeofReview": "Reviewed April 9, 2014 ",
		"ReviewTitle": "A Great Alternative When Visiting Davao",
		"Review": "I added this in our itinerary on my latest visit to Davao with my parents and relatives simply because it is ranked # 3 I think in the Trip Advisor attractions in Davao City. This museum, is hard to compare to Eden Park or the Philippine Eagle Center or the famous resorts in Samal Island (it really depends on your preference or what you want to see or do) but this is a definitely a must-see and the tour will take an hour max so it will suit the need of those on hectic schedule or even for business travelers. It offers a very clear perspective on the advocacy of the owner to save marine life by promoting awareness and accountability in taking care of our surroundings. It is very educational and definitely an eye-opener for me. I normally prefer nature, beach and mountains on my travels but this time, I can definitely say that this is one of the highlights of my trip. The only downside is its location. If you are riding a cab, the driver said they don't normally pass by the street leading to the museum because of its bad reputation for crime/violence. Well, if you are visiting day time, I think it is perfectly safe."
	},
	{
		"User": "Ulysses R",
		"Location": " ",
		"TimeofReview": "Reviewed March 21, 2014 ",
		"ReviewTitle": "Unexpected Find!!!",
		"Review": "Tripadvisor lead me to visit this museum. We had hard time to look for it because we are searching the wholr San Pedro Avenue just to find it. We never reached Bucana actually because we thought that who would put a museum in Bucana. We thought that a museum would be found in around a decent place however the owner did he put it there for a reason. There was an minimal entrance fee. It opens 10am but we are not aware and went there at 9am. But the owner gladly welcomes us still. \r The tour around the museum was DOUBLE AWESOME!!! It is educational and would ignite awareness on the impact of everyday choices that we make.\r Never expected to be like that. The guide was accomodating and never boring. "
	},
	{
		"User": "Deana M",
		"Location": "Los Angeles, California",
		"TimeofReview": "Reviewed February 17, 2014 ",
		"ReviewTitle": "Great learning experience",
		"Review": "I only had a couple of days in Davao and this definitely was my favorite - educational and insightful. You see and learn so much and hopefully you come out with a new sense of awareness. If you have a couple of hours to spare, I highly recommend stopping by."
	},
	{
		"User": "Leipacariem",
		"Location": " ",
		"TimeofReview": "Reviewed November 9, 2013 ",
		"ReviewTitle": "Very insightful and educational",
		"Review": "One of the the museums really worth visiting. The tour will really raise one's awareness regarding the impact of humanity’s action to our precious animals. I was really moved when I learned that many of the sea creatures which were featured in the museum died because of their ingestion of plastics. "
	},
	{
		"User": "nlturney",
		"Location": "Springfield, Missouri",
		"TimeofReview": "Reviewed October 20, 2013 ",
		"ReviewTitle": "Nice collection of bones. Very interesting.",
		"Review": "I was very impressed with the museum. There was a nice collection of bones from land and sea animals. Definitely worth visiting. It was very interesting."
	},
	{
		"User": "WanderLustDavao",
		"Location": " ",
		"TimeofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City",
		"Location": "Davao City",
		"TimeofReview": "Reviewed October 7, 2013 ",
		"ReviewTitle": "One of a kind museum",
		"Review": "Bones, bones and more bones. Yet each set of bones tells an interesting story. It's a museum like no other, making it a must-visit whenever in Davao. A great story to tell home."
	}
]
