[
	{
		"User": "delight_2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 5, 2018",
		"ReviewTitle": "The information gap",
		"Review": "The past event that you have not known about Davao history, will be foretold once you visit the said museum.\r \r  Imagine, how the Japanese first settled in Davao city before the WW II, build the city 1st school, hospital, administrative building and other developments that after WWII, they were forcibly returned to Japan leaving behind their fruits of their labor that the Davaoenos would later improved and utilized it for the good of all settlers in Davao even for the future. \r \r Then I was wondering where the known political figure in Danao City, Cebu, PH Duterte's and the Almendras family clan went from Danao City, Cebu on the 60's and 70's .\r \r \r It was after 40 yrs. after , that I was able to visit the said Museum, I have known their journey to Davao region to became a 2nd Davao city builders for good and just human settlement.\r \r  First the Duterte patriarch, the father of our current President of PH, has become the 1st Governor, then a Congressman and a cabinet secretary during late Marcos time. \r \r Then followed by Almendras who was also a great political figure in Danao City , Cebu, PH to became also a governor in Davao when vacated by Pres.Duterte's father when he became a cabinet secretary of the late President Marcos. \r \r The information gap has been filled up when I visited the said museum for the first time alone after leaving Danao city on the late 60's and studying and working until retirement in Iligan City and Lanao del Norte for 40 long yrs.\r \r After all education is a continues process, even retired we can still learn."
	},
	{
		"User": "Luke T",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "May 15, 2017",
		"ReviewTitle": "Interesting visit",
		"Review": "I love history and while this museum is very small, it was worth the visit for me. The staff were friendly and helpful. Plus they listened to my questions and had answers to most of them. It would be great if they would expand and get more items and more information to share with the people."
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 21, 2017",
		"ReviewTitle": "Nice",
		"Review": "A good place about Davao's history. But don't miss the Museo Dabawenyo. This is a different place and often mixed with that. Take your time, read, understand. Davao has a big history and I really think a bright future."
	},
	{
		"User": "GreenOnePointFive",
		"Location": "Quezon City, Philippines",
		"DateofReview": "October 11, 2016",
		"ReviewTitle": "Knowing History is Free",
		"Review": "Knowing History is Free. First, to visit the place is Free Admission. You can now learn the history and arts of Davao. Explore the rich culture, biodiversity, tribes and more!"
	},
	{
		"User": "arjunsin",
		"Location": "New Delhi, India",
		"DateofReview": "October 11, 2016",
		"ReviewTitle": "Small and Simple",
		"Review": "Its a small and simple museum. I was brought there by the taxicab. But the photo on this page is wrong. The exterior of this museum is different."
	},
	{
		"User": "aprilsky2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 7, 2016",
		"ReviewTitle": "Going down memory lane.",
		"Review": "This is a great place to know Davao then and now, the people and its culture.The place is fully air-conditioned and the receptionist and manager of the museum are both helpful and courteous. The events and memorabilia are arranged neatly and systematically The perfect place to bring first time tourist in Davao either local or international."
	},
	{
		"User": "mike k",
		"Location": "Dumaguete City, Philippines",
		"DateofReview": "June 2, 2016",
		"ReviewTitle": "Good visit",
		"Review": "Good choice to a place to visit, however I would have liked to just take my time and look and read everything instead of the guided tour was to short,"
	},
	{
		"User": "timballenger",
		"Location": "Dumaguete City, Philippines",
		"DateofReview": "June 2, 2016",
		"ReviewTitle": "Davao trip",
		"Review": "This is the most interesting place we visited in Davao, the Museum is set up really nice and there is a lot of information posted, the tour was too short. If I return I will definitely visit again."
	},
	{
		"User": "lookout111",
		"Location": "Worthing, United Kingdom",
		"DateofReview": "February 10, 2016",
		"ReviewTitle": "fun night out",
		"Review": "large pub with dance floor at the back and beer garden in the rear, great for a starter spot for a Friday or Saturday night out, this place is packed but the bar staff could be faster as you can stand for ages at the bar and not get noticed.\r music is up to date and fun mixed crowed."
	},
	{
		"User": "Pasig, Philippines",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 2, 2016",
		"ReviewTitle": "Another very good museum in the City of Davao",
		"Review": "A museum well worth your time to visit if you want to be informed of the history of the Davao Region. Do not mistake this museum for the Museo Dabawenyo which is an entirely different place. The museum is not at the city center, and requires an approximate 30 minutes or more of travel. As part of city life, there is a bit of traffic in going to the place so if you have a limited time for your trip to Davao City, be aware of this factor. There is an entrance fee of 100 pesos as the museum is privately owned. The amount is well worth it, as the museum is in pristine condition, and air-conditioned. The museum showcases the history and culture of the Davao region, and of Islamic and tribal Mindanao. The displays include native cloth and weaving, the clothing of the various ethnic tribes, and the historical artifacts of the region. This museum has numerous excellent displays which will satisfy any history buff visitor."
	},
	{
		"User": "Pilipinong T",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "January 25, 2016",
		"ReviewTitle": "amazing old Davao inside tghe museum, and amazing new dava when you step out. Better visit the museum.",
		"Review": "An hour to the museum introduced us to the history of Davao. There were also food and restaurants near the museum. Because of the road repair, expect a big big traffic. But over all, the experience was nice"
	},
	{
		"User": "AlbertodelaPaz",
		"Location": "Chiang Rai, Thailand",
		"DateofReview": "December 4, 2015",
		"ReviewTitle": "A Must visit. Portal to the Past. Beautifully presented.",
		"Review": "This is a privately owned museum devoted to sharing information and educating visitors about the history of Davao. Any of the items displayed at the museum come from private collections of prominent persons from Davao City. Most of the permanent display is located on the...More"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 8, 2015",
		"ReviewTitle": "For history buffs only",
		"Review": "i love history and that is why i like this museum. there is lot to learn(like a dutchman was the first to write davao in a journal). the collection of daily stuff is nice to see. the guides know a lot. but it is not...More"
	},
	{
		"User": "JPHickman",
		"Location": "Dudley, United Kingdom",
		"DateofReview": "September 11, 2015",
		"ReviewTitle": "Interesting museum",
		"Review": "Interesting little museum, showing traditional tribal wear and day to day life of the tribal people, well kept but strangely in a sub division."
	},
	{
		"User": "Brisflip",
		"Location": "Brisbane",
		"DateofReview": "September 2, 2015",
		"ReviewTitle": "If you want to understand Davao history, then this is a must",
		"Review": "Great place to understand the history of Davao, some great reading and pictorials. Individual guided tours a bonus."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 29, 2015",
		"ReviewTitle": "Davao Museum, a must visit destination in Davao City.",
		"Review": "You cannot know a place without dropping by their museum! It is a short cut to discovering the culture and heart of Davao! I have experienced three changing exhibits on the first floor of the Davao Museum Lanang (permanent exhibits are in the second floor...More"
	},
	{
		"User": "markbenjamin",
		"Location": "Baguio, Philippines",
		"DateofReview": "July 28, 2015",
		"ReviewTitle": "Everything About Davao City",
		"Review": "Location: Easy to locate. Waling distance from D' Bone Collector and Osmenia Park. Facade: Clean and really simple. Staff: Upon entering they greeted me with a smile. They are also knowledgeable about their culture coz every time I ask the tour guide (sorry I forgot...More"
	},
	{
		"User": "davao_dude",
		"Location": "Davao City",
		"DateofReview": "July 17, 2015",
		"ReviewTitle": "Showing you Davao's history",
		"Review": "Very nice collection of pieces of Davao City's past. I just hope that they bring in an authentic Davao museum guide. When we were there, the guide was obviously just memorizing her spiel as she was an intern from a university and was not really...More"
	},
	{
		"User": "aziannegirl",
		"Location": "San Francisco, California",
		"DateofReview": "May 8, 2015",
		"ReviewTitle": "Informative Enough",
		"Review": "The museum is tucked away within a subdivision. There is an entrance fee of P80. No tour guides available. It was interesting to read the history of Davao. I would recommend visiting this museum to read about the facts, then supplement it with a guided...More"
	},
	{
		"User": "Sydney, Australia",
		"Location": "Sydney, Australia",
		"DateofReview": "April 23, 2015",
		"ReviewTitle": "Short and sweet",
		"Review": "It's interesting free and guided by a young and passionate guide, but was a little rushed, probably the shortest museum visit I have ever done."
	},
	{
		"User": "mummyharris",
		"Location": "Canvey Island, United Kingdom",
		"DateofReview": "April 18, 2015",
		"ReviewTitle": "Umm not sure",
		"Review": "Visited this Wetherspoons with my husband and have to say the food was fantastic but Bar service was appalling. My husband went to the bar and waited his turn but the young barman served at least 8 customers before him he was so disgusted he let rip at the poor barmaid who served him. So food 10/10 bar service 2/10 :("
	},
	{
		"User": "StR1F3",
		"Location": "Pagadian City, Philippines",
		"DateofReview": "April 12, 2015",
		"ReviewTitle": "Educational?",
		"Review": "Well, I get to know the TRUTH behind...^_^ just kiddin. No facts to unravell, no mysteries to solve...But you get to know the culture and heritage of the City, how it came to be...andit always is associated with how the present Head of the City made it 4th to the world's most peaceful city. ^_^"
	},
	{
		"User": "Magiting",
		"Location": "Sydney, Australia",
		"DateofReview": "March 26, 2015",
		"ReviewTitle": "Nice Local Museum",
		"Review": "We did have a good time during the tour, tour guide explain the different ethnics Iiving in Davao the local politics among the tribes are been discussed and explained."
	},
	{
		"User": "Robert M",
		"Location": "Glendale, United States",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Culturially enlightening",
		"Review": "Very enlightening from original tribal origins to current day Davao. The trials endured during WW2, artifacts were all interesting and educational."
	},
	{
		"User": "adangoyjr",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "February 12, 2015",
		"ReviewTitle": "A Museum within a Subdivision",
		"Review": "A simple museum. No guide. So, just enjoy and learn on your own. I wish the museum is located somewhere probably in the city center."
	},
	{
		"User": "Steven H",
		"Location": "Worthing, United Kingdom",
		"DateofReview": "February 2, 2015",
		"ReviewTitle": "great!",
		"Review": "friendly staff. quality service and food. I would always go here if I wanted great tasting food and drink. best place in Worthing"
	},
	{
		"User": "Dean M",
		"Location": "Mission Viejo, California",
		"DateofReview": "January 16, 2015",
		"ReviewTitle": "Small, mildly interesting",
		"Review": "It's a small place that's off the main road in a housing development called Insular Village 1. We took a taxi and the staff called a taxi for us when we were done. It's a small two story museum. We initially had a guide but between her English skills and limited information we wound up just walking by ourselves. Does a nice job of outlining the history of Davao City and the surrounding area. Mainly pictures and histograms, not a ton of artifacts to be seen. You can view the entire museum in 90 minutes easy. "
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "January 12, 2015",
		"ReviewTitle": "Visual information about the culture and its people",
		"Review": "Entrance is free. Well organized inside. The tour guide was smart and articulately deliver the best information about the different sections of the museum. Best place to be informed about Davao and its cultural background."
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "Well-maintained place",
		"Review": "This museum is a private owned museum. It's a bit pricey and a bit boring too but you will see where your money is going. You can't take pictures in some areas. It's a go-around-and-understand-it-by-yourself museum."
	},
	{
		"User": "Quezon City, Quezon City, Philippines",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "December 21, 2014",
		"ReviewTitle": "Awesome Tour",
		"Review": "The artifacts were well preserved, tour guide was hilarious and we learned so much from her. This is a must visit for tourists..., entrance is free =)"
	},
	{
		"User": "AppleVManila",
		"Location": "Manila",
		"DateofReview": "November 14, 2014",
		"ReviewTitle": "First time to enter a free museum with substance",
		"Review": "Commendation to the city government.When I first made our ite, this is not part because I thought it's just a boring museum but our van service brought us here. What I noticed, 1: Museum if FREE! 2: They have tour guide for guest 3: It is air conditioned. Talk about using public fund to educate tourist! This is really a good way to get to know about davao."
	},
	{
		"User": "darlynn1925",
		"Location": "Jackson, Tennessee",
		"DateofReview": "October 24, 2014",
		"ReviewTitle": "Worth a visit",
		"Review": "Worth a visit while in Davao, and its free. Will help a non-Davaoeno know the province and their history. Proud that the city is funding this museum to promote tourism."
	},
	{
		"User": "AkoBato",
		"Location": "Worthing, United Kingdom",
		"DateofReview": "October 19, 2014",
		"ReviewTitle": "Great pub :)",
		"Review": "great night atmosphere Music starts about 9/10. Good selection of food and drinks Have been here loads and love it :) Would deff recommend"
	},
	{
		"User": "christa d",
		"Location": "Manila, Philippines",
		"DateofReview": "September 22, 2014",
		"ReviewTitle": "Small But Terrible",
		"Review": "Small museum located in downtown Davao, near the Catholic Cathedral and the Osmena Park, with many things in it. Cool place. Helpful staff. Very educational. Worth an hour or so if you're within the CM Recto rotunda, before strolling down the park and / or attending service at the nearby church."
	},
	{
		"User": "251Michigan",
		"Location": "Tasmania, Australia",
		"DateofReview": "September 2, 2014",
		"ReviewTitle": "Good collection of artifacts",
		"Review": "Nice museum.Its not a typical museum.built up area is small but has decent collections of artifacts.I found the staff to be very nice.As there are many places to see around Davao city you can include this also in your itinerary."
	},
	{
		"User": "itoy_MNL",
		"Location": "Singapore, Singapore",
		"DateofReview": "August 20, 2014",
		"ReviewTitle": "staff were great, small but full of interesting bits",
		"Review": "was worth going to\r staff offers guided walks but doesnt ask for donation or money, just leave you in peace when they are done explaining\r no taking of pictures on some halls\r very informative and well kept\r its fully pack for such a small space\r its in a corner near a rotatanda besides osmena park"
	},
	{
		"User": "daveblinx",
		"Location": "Vienna, Austria",
		"DateofReview": "July 27, 2014",
		"ReviewTitle": "Small but beautiful",
		"Review": "The small museum of Davao and Mindanaos history is not far away from the really good SM supermarket in Lanang. Combining shopping and culture makes a worthwhile afternoon.\r Groundfloor you get an overview and with the big mapsite the knowledge where in Mindanoa historic things happened. And history starte earlier than the Spain discovered the island! \r First floor you see arts, craft, cloth, music instruments more rhytmic ones and I was allowed to play one to find out the tone changes depending where you touch it. Learned a lot."
	},
	{
		"User": "Blackburn, United Kingdom",
		"Location": "Lansing, Michigan",
		"DateofReview": "June 21, 2014",
		"ReviewTitle": "Great",
		"Review": "Everyone is great. I learned a lot. I will go back again. They had things to see from all time periods."
	},
	{
		"User": "cristydti",
		"Location": "makati",
		"DateofReview": "April 30, 2014",
		"ReviewTitle": "Beautiful museum",
		"Review": "nice to know the different cultures of Davao and what Mayor Duterte did to the city to get so many citations and awards....."
	},
	{
		"User": "Darrel H",
		"Location": "Auckland, New Zealand",
		"DateofReview": "April 11, 2014",
		"ReviewTitle": "Great little museum",
		"Review": "Great place to come and cool off and get to know a bit of local history. I like places like this as they are not to full of information just enough to give you a sense of the place. Guides are friendly and knowledgeable."
	},
	{
		"User": "BlueBrrr",
		"Location": "manila",
		"DateofReview": "March 24, 2014",
		"ReviewTitle": "its worth the trip",
		"Review": "a great learning experience. its worth the trip.the staff are freindly and the exhibits are very well maintained and taken cared of."
	},
	{
		"User": "Shamrockbuddy",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 20, 2014",
		"ReviewTitle": "a detailed history",
		"Review": "It features the rich history of Davao City, from its beginnings up to what it is right now. That includes the intelligent and professional people behind the progress of Davao City. it also showcase the different ethnic groups around the region."
	},
	{
		"User": "BGonzalez1973",
		"Location": "Manila, Manila, Philippines",
		"DateofReview": "February 28, 2014",
		"ReviewTitle": "discover DAWOW",
		"Review": "interesting facts from old davao until the present. It's like Davao government's gift to its visitors. Spend like half an hour in this FREE museum and you'll just be amused. great!"
	},
	{
		"User": "Laurie269",
		"Location": "Manila, Philippines",
		"DateofReview": "February 3, 2014",
		"ReviewTitle": "Nice to Visit, Knowledgeable Guides",
		"Review": "It was enriching to visit the Davao Museum. It is a small museum, but worth the visit to get an idea on the culture and history of the city. Volunteers will accompany you through the different halls, where there are exhibits of the different indigenous...More"
	},
	{
		"User": "RodgerOndat",
		"Location": "Bordentown, New Jersey",
		"DateofReview": "December 26, 2013",
		"ReviewTitle": "Hmmm ... good but not enough information given",
		"Review": "I enjoyed my visit but honestly, I felt a little uncertain as to what I was looking at. They need to have guided tours or someone on the upper floors to answer questions. But overall worth the visit."
	},
	{
		"User": "Chiang Rai, Thailand",
		"Location": "Jewett City, Connecticut",
		"DateofReview": "December 14, 2013",
		"ReviewTitle": "Good History",
		"Review": "There is no charge to go in this museum. It is a small museum but don't let that fool you. It is very rich in history. There was a person to take us around the museum and he was very knowledgable about the different aspects...More"
	},
	{
		"User": "Dreamgirl_1253",
		"Location": "Quezon City, Philippines",
		"DateofReview": "July 23, 2013",
		"ReviewTitle": "Learn about the various tribes of Davao",
		"Review": "Visiting the museum is free of charge, and your party will be accompanied by an able guide who will talk about the various tribes of Davao City and give you an insight into the political structure of the city. It is quite interesting to learn about the tribes, their striking characteristics, their style of clothing and the design of their houses."
	},
	{
		"User": "jheviray",
		"Location": "Manila, Philippines",
		"DateofReview": "June 28, 2013",
		"ReviewTitle": "Good museum staff",
		"Review": "They have good staff to explain the littlest details of the museum. Worth the 1-hr visit! Especially for history lovers!"
	},
	{
		"User": "sophiegrayy",
		"Location": "Manila, Philippines",
		"DateofReview": "May 3, 2013",
		"ReviewTitle": "Diverse Davao",
		"Review": "A good way to have a general perspective of Davao. \r \r Davao Museum is a must-see if you wish to learn about the diverse, vibrant cultural influences and ethnic groups in Davao. The museum presents the original settlers of what is now the Province of Davao and Metro Davao - their way of life, homes, tools, fabric, clothing, musical instruments, cultural practices.\r \r Small, tightly-focused collection. Devote no more than 30 minutes to this visit, unless you are in the mood to converse with the staff, who share their insights on Davao's history and origins, and museum trivia - such as: volunteer curators from Alberta, Canada helped in the display design."
	},
	{
		"User": "Huminca S",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 17, 2013",
		"ReviewTitle": "If interested in Davao historie and the people",
		"Review": "This is the best place to learn a bit about Phillippines if you visit Davao from an outside country."
	},
	{
		"User": "ccduckie",
		"Location": "Luzon, Philippines",
		"DateofReview": "November 8, 2012",
		"ReviewTitle": "An Educational Trip",
		"Review": "If you would want a dose of history about Davao you will definitely appreciate what this museum has to offer. Although small and compact, you would be able to grasp a little bit of a history about Davao (I did not realize that Davao have a lot of Japanese inhabitants doing trade way way way back!). The museum was small as mentioned so we were able to finish it within 2 hours. Recommended for adults and kids alike."
	},
	{
		"User": "Clandestinymph",
		"Location": "Manila",
		"DateofReview": "October 15, 2012",
		"ReviewTitle": "Small and Clean Museum",
		"Review": "A small and clean museum that will take u less than an hour to see everything. A good way to spend a morning, jus don't expect too much. Entrance fee is 100 for adults and 20 for children."
	},
	{
		"User": "Mercedita M",
		"Location": "Jakarta, Indonesia",
		"DateofReview": "October 10, 2012",
		"ReviewTitle": "The first place in Davao you should visit before exploring more of the area",
		"Review": "I went to Mindanou last August 2012 using AirAsia. Flying from KL to Clark, and from here I continue to Davao. The first time I arrived I was a bit worried because some people said that there is political unrest in Mindanao. In this case the Islamist rebels want to have their own independence. It is said some tourists are kidnapped to highlight their causes. However when I arrived in Davao, Mindanao for the first time, all those fears are gone. Davao and other Mindanao cities are safe to travel. Only in a few area we may need to be careful. \r So, to make it short, I went to explore more about Davao which used to be dubbed as Little Tokyo. The best place to dig more information about Davao definetly is the Davao Museum. Free guide is provided which is good. However u cant take pic inside the museum. Well, mabuhay:)"
	},
	{
		"User": "Manila",
		"Location": "Victoria, Canada",
		"DateofReview": "September 17, 2012",
		"ReviewTitle": "Not really a Must-See, but well worth a visit.",
		"Review": "It wouldn't be on my top 10 list of things to do in a day, but we really enjoyed this quiet little museum. It had very interesting ethnographic things, including head dresses, photographs, and tribal instruments that looked almost Balinese."
	},
	{
		"User": "Chapopos",
		"Location": "Manila, Philippines",
		"DateofReview": "May 21, 2012",
		"ReviewTitle": "No picture taking",
		"Review": "I was so disappointed that they don't allow tourists taking pictures inside the museum. You have no choice but listen to the museum's staff going through some stories about the history of Davao. Expect that the only souvenirs you will get are pictures outside the museum. :("
	},
	{
		"User": "raobert",
		"Location": "Namur, Belgium",
		"DateofReview": "December 30, 2011",
		"ReviewTitle": "Worth a visit",
		"Review": "This Museum, although fairly small, is a mine of information regarding history of Mindanao. This info is usually rather difficult to come by.\r I appreciated also the BW photos from past times showing how the Davao was.\r There are interesting comments about middle age contacts between Phils and China.\r Beautiful specimens of Davao clothing are on display, as well as musical instruments"
	}
]
