[
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "June 30, 2017",
		"ReviewTitle": "I like their supermarkt",
		"Review": "Shopping for food and other kitchen items can be best bought here. They have assortment of food choices local products ... means Davao products are sold here. coffee, chocolates, locally made wine are here. Imported item are also displayed. Some other grocery items can be found here and not from other stores. \r \r I usually shop at the old Felcris , now that it is here in the center and bigger. It is not nice to be missed."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 3, 2017",
		"ReviewTitle": "Lots of Parking in this Mall",
		"Review": "Parking to me is a big issue since I have a van. I therefore like to go to the Felcris Supermarket there since there is a good assortment of imported goods! You won't believe my apo from Manila wanted whipped cream and I had gone all over the other supermarkets and found it only here! I also found Spray cooking oil, bottled cranberries, Crisco for my apple pies. They have a nice assortment in their deli of sausages, chorizo de bilbao for my paella, and lots of cheeses including my favorite Davao-made Malagos cheese. Speaking of Malagos, their chocolates are also available here, 65% and 75%, and the tablea too. Apart from the grocery, we visit the few restaurants like the Mandarin for Chinese and Mansuko for affordable Japanese. We have coffee at the Figaro which at about 4 pm serves beer! It is a favorite hangout of my hubby's classmates! I shop at the Chimes there but prefer their original store in Sales St in Chinatown. There are a lot of travel agencies and very convenient LBC and Western Union. They have a guitar store and an art store which is also a studio for learning especially during the summer to keep the children busy. Some specialty stores are Bench etc. not many. They have a huge atrium. It hasn't been discovered yet as an events venue!"
	},
	{
		"User": "tonyangbee",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 21, 2016",
		"ReviewTitle": "A quiet mall",
		"Review": "This mall is clean with a plenty parking space however, there are still plenty of vacant stalls there. There only few tenants and few stores to shop at so there is lesser options. Also, their grocery is connected with their dept. store. I think the only place Iike there is the resto named The Perch which has yummy food especially its bacon strips but pricey. Also, if you wanna pay your water bill after office hours (after 5pm), you can do it here coz its still open with a shorter queing line."
	},
	{
		"User": "Maria Teresita E",
		"Location": "San Francisco, Philippines",
		"DateofReview": "June 4, 2016",
		"ReviewTitle": "Nothing to do at all",
		"Review": "Felcris Centrale is beautiful outside and the inside, but you have nothing else to do after shopping, it is definitely a waste of time."
	},
	{
		"User": "Miler15",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 1, 2016",
		"ReviewTitle": "Felcris centrale",
		"Review": "It not completely open yet and its been more that a year. There are still a lot of areas to open a business. Its kinda out of the way if based on the route i am taking. But there are a number of good food here and not that crowded."
	},
	{
		"User": "Sponge B",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 26, 2016",
		"ReviewTitle": "Loneliest mall in Davao.",
		"Review": "Well all i can say that , it's good to have a new mall in our city. The last one you'll visit, maybe if they could add more, they might have a chance to compete."
	},
	{
		"User": "Gordonchef",
		"Location": "Vancouver, British Columbia, Canada",
		"DateofReview": "March 14, 2016",
		"ReviewTitle": "Wasted space and ghost town mall",
		"Review": "The newest mall in davao city. Been over 1 yr. Not full at all. Nothing special inside the mall. Its small. Havent seen the oark8ng with more than 20 cars. Not enough tenants. Only 2 resto inside the mall. Perch was the only reason i went here."
	},
	{
		"User": "iamatopmodel",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 3, 2016",
		"ReviewTitle": "Spaces still not fully occupied",
		"Review": "I was consistently present everytime a new mall opened in the city. Over Felcris Centrale's first year of operations i observed there aren't that much of new lessees that opened inside. There's just a handful of restos to choose from."
	},
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 14, 2015",
		"ReviewTitle": "new place to hang out!",
		"Review": "Felcris Centrale is a new mall along Quimpo Blvd almost across the Land Transportation office (LTO). It's along a highway so taxis and jeepneys (SM-Toril route) pass this route regularly. There is also parking at the back. \r Chimes Specialty store is the main department store inside, then Felcris Supermarket is the grocery store. \r Clinique and VMV Hypoallergenics have stalls inside. At least at these stalls I am assured they have new stocks. \r Plains and Prints was on sale so we took more time trying on lovely dresses.\r There are several restos around the place and a big open air atrium, but it was raining at the time so we went inside a Japanese resto (Mansuko I believe). Food was very good and inexpensive.\r In the Supermarket, there were nice choices of Davao specialty chocolates, several repacked bags of nuts, and several wine selection.\r I saw Perch and I have heard good reviews about it, but we had our fill, so now I have reason to visit again.\r Felcris Centrale is a new place to hang out, but they need to fix all that roof leaking."
	}
]
