[
	{
		"User": "Amy S ",
		"Location": " ",
		"DateofReview": "November 8, 2017",
		"ReviewTitle": "HISTORICAL GAP FARM!",
		"Review": "Why do I give this review the title Historical Gap Farm? The reason why is because of what my family and I learned about its discovery. If anyone wants to know about it, I encourage you to visit Gap Farm."
	},
	{
		"User": "Anne P ",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 5, 2017",
		"ReviewTitle": "You can skip this",
		"Review": "you will not miss anything at all if you will not visit this place. actually, there is really nothing to see. the place is poorly managed and a waste of time and money."
	},
	{
		"User": "randychoy94 ",
		"Location": " ",
		"DateofReview": "June 20, 2017",
		"ReviewTitle": "I had so much fun",
		"Review": "I was amazed with the place. I never expected that there is a place such nice as this here in Davao. So cleam and educational. The past seems just an armslength away. It such a nice place"
	},
	{
		"User": "Gine P ",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "May 16, 2017",
		"ReviewTitle": "It was Okay",
		"Review": "Entrance fee is expensive for this park. Not much going on here but if you have nothing to do or no where to go...this is the place then:/ Please bring mosquito repellent. Not busy here at all."
	},
	{
		"User": "Luke T ",
		"Location": "Kent, United Kingdom",
		"DateofReview": "May 15, 2017",
		"ReviewTitle": "Not worth the money",
		"Review": "We went hoping to see something interesting and not worth the entrance fee. The picture of the water buffalo with the rider at the entrance was the only thing interesting. Food service is very slow and the staff ignore you. There are other places much...More"
	},
	{
		"User": "Stuart K ",
		"Location": " ",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "gap farm",
		"Review": "gap farm is great ,will go back again ,lots to do and love the tunnel ,if you like walking then its the place for you"
	},
	{
		"User": "Melvin S ",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 8, 2017",
		"ReviewTitle": "It was fun",
		"Review": "A good tourist attraction. I have enjoyed the cangga ride and most of all the swimming in the pool. I had a very great time."
	},
	{
		"User": "slazenger552 ",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 23, 2016",
		"ReviewTitle": "A place to explore and have fun with family",
		"Review": "Gap Farm has been a very favorite place to those who look for fun, refreshment, nature and learning. That's why, this place is the favorite to educational tours, dating couples, gimmick of friends, family outing or picnics and even a special occasion with family or...More"
	},
	{
		"User": "Jay S ",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "July 26, 2016",
		"ReviewTitle": "Poorly Maintained And Boring",
		"Review": "The area is vast and hilly. But, exploring to other areas of the farm isn't really worth it unless you simply want to exercise. There are also areas where it is dangerous for your kids to go because there are no fences and they can...More"
	},
	{
		"User": "tolentinomaldex ",
		"Location": " ",
		"DateofReview": "July 6, 2016",
		"ReviewTitle": "Very Good for Fieldtrips",
		"Review": "Mindanaoans schools are always having their fieldtrips to this place. The flora nad fauna of Mindanao can be seen here in diversity."
	},
	{
		"User": "slazenger552 ",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 26, 2016",
		"ReviewTitle": "Educational place",
		"Review": "This place is good for family gatherings and educational tour for schools. Lots of information are written around that the students can learn. The play area is very wide and safe for kids."
	},
	{
		"User": "Aphio1925 ",
		"Location": "United Kingdom",
		"DateofReview": "May 21, 2016",
		"ReviewTitle": "Picnicking",
		"Review": "Good for family and friends picnic. Nice to visit and see. Good for walking and relaxation. Entrance fee is very cheap and had a chance to enter the cave inside the farm..."
	},
	{
		"User": "Dimple S ",
		"Location": "Musashino, Japan",
		"DateofReview": "April 21, 2016",
		"ReviewTitle": "Disappointing",
		"Review": "Perhaps it's because we came on a summer, we experienced a series of blackout. We came here during lunchtime hoping to have a great meal. It turns out that not all in their menu are available. It took them a long time to serve it...More"
	},
	{
		"User": "Kae Y ",
		"Location": " ",
		"DateofReview": "January 31, 2016",
		"ReviewTitle": "Good for Family and Friends",
		"Review": "Went here with my friends, had good fun for the day trekking round the area with animals here and there. They have a pool and scrumptious Filipino food, fresh fruit shakes and the likes! Would recommend for picnics and small children, they can learn as...More"
	},
	{
		"User": "Giagie ",
		"Location": "King's Lynn, United Kingdom",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "A Promising and Quietude Place",
		"Review": "A Great Place for Educational Tours! Its just 15 mins away from Crocodile Farm, Entrance fee cost 50 peso/person. We are welcome by a Giant Water buffalo, eye catching land of Promise landscape they do even have statues of Domestic animals, Statues of all Presidents...More"
	},
	{
		"User": "malkingreg22 ",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 27, 2015",
		"ReviewTitle": "nice place for a afternoon out",
		"Review": "came here for a few hours and realy enjoyed it cost 50 peso per person food was good well maintained if you explore the whole park will maybe take you around 3 to 4 hours didn't like the security man we asked for a taxi...More"
	},
	{
		"User": "ingmar b ",
		"Location": "Iloilo City, Iloilo City, Philippines",
		"DateofReview": "October 15, 2015",
		"ReviewTitle": "lots of pinoy culture",
		"Review": "the location is good(next to the high way). the surroundings are green. there is a pool. there is a simple restaurant. the concept of showing the tribes and the magical creatures of the phillipines is good. but the artist that makes these statues doesnt do...More"
	},
	{
		"User": "Dioneli S ",
		"Location": "Panabo City, Philippines",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "Lots of Potential but Needs Maintenance",
		"Review": "Could have been a great place but sadly lacks maintenance. This is an orchard and thus, have lots of fruit bearing trees. There are rotting fruits and leaves along the pathways. Lots of ants, fruit flies and mosquitos. It's a big place and we only...More"
	},
	{
		"User": "leyopal ",
		"Location": "Folsom, California",
		"DateofReview": "July 4, 2015",
		"ReviewTitle": "GAP Farm...keeper of childhood memories!",
		"Review": "After 2 decades, I went back a month ago to this wonderful place..this time with my children. I just wanted to let my children experienced the scenic views of GAP Farm carved in the hills of Maa, Davao City. I took pictures of my children...More"
	},
	{
		"User": "Anonymous-Itchy-Feet ",
		"Location": " ",
		"DateofReview": "July 4, 2015",
		"ReviewTitle": "It used to be nice...",
		"Review": "Unfortunately, this farm resort have fallen into disrepair. It used to be clean and with so much fun things to do. It has a swimming pool, a cafeteria, huge park grounds for horseback riding, statues to amaze and scare you, and picnic areas. However, in...More"
	},
	{
		"User": "Karololivar ",
		"Location": "Davao City",
		"DateofReview": "June 30, 2015",
		"ReviewTitle": "Feels nostalgic",
		"Review": "A great place to introduce to the young ones the culture of davao....it maybe not the same as before but still a good place to visit and reminice....."
	},
	{
		"User": "WanderLustDavao ",
		"Location": "Amsterdam",
		"DateofReview": "June 22, 2015",
		"ReviewTitle": "Nostalgic Park",
		"Review": "GAP Farm was a place we often visit during our childhood years in the 80s. Nothing much has changed. To be positive about it, if you haven't visited this in 20-30 years, this place brings back a lot of nostalgia, and I enjoyed it. The...More"
	},
	{
		"User": "MijnlieverdFH ",
		"Location": "Davao City",
		"DateofReview": "March 4, 2015",
		"ReviewTitle": "Different from what i have seen before",
		"Review": "The place was the best so far as i knew before but this time it is disappointing to know the look it showed. Not like before. Maybe because of the new resorts and recreation spots at present growing strong on the city. The management should...More"
	},
	{
		"User": "KlausDORING ",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 28, 2015",
		"ReviewTitle": "Not like before",
		"Review": "GAP Farm was one of the first places I visited 25 years ago while being in Davao for the first time. Once upon a time ... . Yes, guys, what did you do with this former so wonderful place??? Sorry, when in Davao - visit...More"
	},
	{
		"User": "yazhel ",
		"Location": "davao",
		"DateofReview": "October 3, 2012",
		"ReviewTitle": "not properly mentained",
		"Review": "its a good place, but more likely a haunted place, its not properly cleaned and mentained. i remember going there when i was a kid. it is so much more different now, maybe due to wear and tear, :("
	},
	{
		"User": "bracomo ",
		"Location": "Mandaue, Philippines",
		"DateofReview": "May 29, 2012",
		"ReviewTitle": "not worth visiting",
		"Review": "I hate this place. There is nothing nice about the cement sculptures in it. The place is not well kept. I wouldn't recommend this place to anyone. Waste of money"
	},
	{
		"User": "csaramir ",
		"Location": "Manila, Philippines",
		"DateofReview": "May 25, 2011",
		"ReviewTitle": "Refreshing and Relaxing",
		"Review": "Just a few minutes taxi ride from downtown Davao City is the lush greenery of Ma-a called tha GAP Farm. With an entrance fee of Php 30.00, three urbanites like us were able to experience half a day , a taste of rural farm life...More"
	},
	{
		"User": "travellingblog ",
		"Location": "",
		"DateofReview": "April 2, 2011",
		"ReviewTitle": "Somewhere new",
		"Review": "GAP is appropriately dubbed the land of promise because visiting this place promises to be an unforgettable experience. This place is perfect for nature lovers. The lush green scenery and the abundant varieties of trees, flowers and plants is a sight to behold. At night...More"
	},
	{
		"User": "Wolfchild ",
		"Location": "",
		"DateofReview": "January 17, 2006",
		"ReviewTitle": "Very strange place",
		"Review": "The GAP farm is not far away from the Crocodile park near Davao so you can visit it if you plan to check the Philippine freshwater crocodile conservation area, although I wouldn't recommend such a visit of this so called farm. I really don't know...More"
	}
]
