[
	{
		"User": "Steve J",
		"Location": "Norwich, United Kingdom",
		"DateofReview": "5 days ago",
		"ReviewTitle": "If your in pearl farm this is a must",
		"Review": "This was a great little tour the clams are amazing and beautiful clear snorkelling The guide took loads of great photos which we will cherish for life"
	},
	{
		"User": "naidenaelle",
		"Location": " ",
		"DateofReview": "2 weeks ago",
		"ReviewTitle": "Mesmerizing Clamps",
		"Review": "It was my very first time doing this kind of adventure and it was fun. Its not too deep and you can barely touch the clamps, though its not literally that you can touch them but you can come closer to really see it by...More"
	},
	{
		"User": "Gerard L",
		"Location": " ",
		"DateofReview": "4 weeks ago",
		"ReviewTitle": "Taclobo!!!",
		"Review": "Visited the giant clam sanctuary on the recommendation of a college friend who happens to have a farm in Samal Island, and who had some staff working at Pearl Farm, where I was billeted. The Taclobo tour was just a few minutes away by boat...More"
	},
	{
		"User": "Karen N",
		"Location": " ",
		"DateofReview": "4 weeks ago",
		"ReviewTitle": "Snorkel your way",
		"Review": "If you don't have gears for snorkeling before going here as well as action camera, they have it here for rent. If you don't know how to swim, there are guides with floaters you can hold on to. It's quite scary at first but relaxing...More"
	},
	{
		"User": "Maggie Y",
		"Location": "Gennadi, Greece",
		"DateofReview": "February 13, 2018",
		"ReviewTitle": "Spectacular",
		"Review": "Seeing the giant clams and the coral beds was a great experience. The guide is experienced and guides you around the reef."
	},
	{
		"User": "Ricky P",
		"Location": " ",
		"DateofReview": "October 9, 2017",
		"ReviewTitle": "Fascinating and colorful",
		"Review": "At first I was hesitant of pushing through this activity because I thought it was boring. But boom! When I started snorkeling, I got excited with everything that I see! Hundreds of giant clams in different colors and sizes plus a lot of colorful fishes....More"
	},
	{
		"User": "jonalber2",
		"Location": "Singapore, Singapore",
		"DateofReview": "September 5, 2017",
		"ReviewTitle": "A Must",
		"Review": "Try to visit during low tide so you are closer to the clams. This sanctuary has THE MOST colorful and gigantic clams I've ever seen! And thousands of them! Your car/tricycle/habal habal will take you to the dock. From the dock, you have to take...More"
	},
	{
		"User": "John Patrick M",
		"Location": " ",
		"DateofReview": "August 9, 2017",
		"ReviewTitle": "Definitely a must, if you're visiting Samal island",
		"Review": "We had a great time here, the guides were very accommodating. They even lent their personal memory card for the underwater cam that we rented and they just sent the captured pictures to our mobile phone. Will be definitely back in the future!"
	},
	{
		"User": "streeteasy55",
		"Location": "New York City, New York",
		"DateofReview": "August 7, 2017",
		"ReviewTitle": "great swim",
		"Review": "huge, giant clams anyone? heck, this is the place. Great experience snorkeling around and observing giant under water. must to do if you are in samal island. highly recommended"
	},
	{
		"User": "Meinard V",
		"Location": "Singapore, Singapore",
		"DateofReview": "August 1, 2017",
		"ReviewTitle": "A side trip from Samal Day tour ",
		"Review": "It was recommended by a family friend who is from Samal. It didn't disappoint. It's great they do briefing first before taking you to the area."
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "July 15, 2017",
		"ReviewTitle": "HIGHLIGHT OF SAMAL ISLAND",
		"Review": "Love love love the Giant Clam Sanctuary. I've never seen Giant Clams up close so we thought it would be a new adventure. It did not disappoint. We didn't book a tour ahead of time and being low season (right after summer), there weren't a lot of boats that'll bring you across to the floating sanctuary. There was a small boat that offered 1,000, but we had a mini snack with local noodles and the locals said we only had to pay 500. Good thing the boat driver agreed, and we were on our way. The entrance fee was I think 100 pesos and you can rent a snorkel, rash guard and GoPro for a fee. We had all our equipment, but rented out a GoPro. I suggest you bring your own SD card since they don't have one available. \r \r Absolutely had the time of my life. Would definitely go back, plus they gave you an orientation of the cause. So far there are 2,000+ Giant Clams in the sanctuary "
	},
	{
		"User": "Ronna V",
		"Location": " ",
		"DateofReview": "July 12, 2017",
		"ReviewTitle": "Worth the travel. Amazing giant clams",
		"Review": "7 kilometers to be exact right from the hagimit falls\r You will find this amazing giant clam sanctuary. \r Going to the sanctuary u need to hire for a bangka to bring u .. Cost 500 pesos good for 4-6 pax ( quite expensive for solo traveler like me. \r And additional 100 for the entrance fee \r 100 if u wanna rent snorkle mask - its a must \r 300 if u want to rent go pro.. \r \r It was like 3 -5 mins boating to get to the sanctuary its located just near to the famous pearl farm. Resort. \r \r The people incharge there welcomed me and they told me theres 5mins lecture.. \r \r After that we proceed to the snorkling site with lifevest and 2 interns assisting for the 1 hr tour. \r \r The water s warm..and when i saw the underwater i was like... Omg this is it. Amazimg. The giant clams were really amazing , plus diff species of fishes, sponges, corals. Sea anemones.. Its amazing. All i can just say say while looking around is wow.. \r Going to the deep part you will see bigger clams as in omg bigger than me for sure.. \r I really enjoyed this experience its really worth it.. And i would definetely comeback with my son..he will love the place am sure.. \r Worth the travel. Worth the money . \r \r - ive been bitten 3 times w those meduim sized fishes.. While i was trying to take picture near the giant clam..they said they are protecting their environment.. I disturbed lol.im sorry..."
	},
	{
		"User": "jonsapon121",
		"Location": " ",
		"DateofReview": "June 8, 2017",
		"ReviewTitle": "First time ",
		"Review": "Amazing to do. Definitely gonna do this again. Very safe. Need a better underwater cam next Time. People selling real mother pearls for good prices, just barter with them"
	},
	{
		"User": "Rravrav",
		"Location": "Manila, Philippines",
		"DateofReview": "May 1, 2017",
		"ReviewTitle": "Must See in Samal",
		"Review": "The best part of our Samal Tour! It's so amazing to see life in those big clam shells.. . Seeing them upclose with wonderful colors of violet orange and a lot more!! \r \r Besides the clams, there were corals and anemones, so you'll find fishes, schools of small fishes and starfishes while snorkeling.. .\r \r Entrance/environmental fee is P100, you can also rent snorkeling gear for P100 and GoPro action camera for 300.. .\r \r Please dont forget to give some tip to your guide.. its a way of supporting our tourism industry."
	},
	{
		"User": "hijaviajeraph",
		"Location": "Quezon City, Philippines",
		"DateofReview": "April 27, 2017",
		"ReviewTitle": "Meet and Greet Taclobo",
		"Review": "It is very unusual for me as a manila girl to see those huge clams here at Samal Island. As part of the itineraries in doing your Samal Island Hopping, you will a chance to see and swim with the clams and other creatures like uncommon fish breeds and of course my favorite star fishes are around the sanctuary.\r \r You have to pay Php100 as environmental fee for reservation and protection of the sanctuary.\r I can give you my friends contact number, he is a local tour guide/boatman here at Samal. He could help you to experience this adventure ^_^"
	},
	{
		"User": "travellerheartAU",
		"Location": " ",
		"DateofReview": "March 1, 2017",
		"ReviewTitle": "Great chance to see the Giant Clams",
		"Review": "Great chance for everyone to see the Giant Clams. Even an inexperienced snorkeller can come along, since the water is so calm\r \r The Taklobo Sanctuary is committed to the protection of the Giant Clams, and helps to educate people on why we don't want to kill these lovely beings"
	},
	{
		"User": "Jennelyn T",
		"Location": "San Jose del Monte, Philippines",
		"DateofReview": "February 20, 2017",
		"ReviewTitle": "Amazing!",
		"Review": "This is the first time I had the chance to have a close encounter with some of the (soon-to-be) endangered species. Thank you for protecting this sanctuary.They even have a professional diver that accompanies people, and even takes pictures and videos underwater. So even if you're a beginner or a pro diver, this should be included in your bucket list."
	},
	{
		"User": "lberezovski",
		"Location": "Sydney, Australia",
		"DateofReview": "February 11, 2017",
		"ReviewTitle": "Giants clams",
		"Review": "We went snorkling. Beautiful clams some of them a meter high. Different colours and big starfish. Our guide even picked a blow fish for us yo touch. Very friendly guides. Enjoyed it in full"
	},
	{
		"User": "R_Briz",
		"Location": "Makati, Philippines",
		"DateofReview": "February 7, 2017",
		"ReviewTitle": "Giant clams",
		"Review": "The sanctuary is good and the staff taking care of it are nice. Cost of transfer from a local boats is Php500, a bit pricy ."
	},
	{
		"User": "virmen",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "November 21, 2016",
		"ReviewTitle": "Giant Clam",
		"Review": "nice experience so far .. diving with the giant clams, hmmmm i might go back there soon with my friends"
	},
	{
		"User": "Michael A",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 9, 2016",
		"ReviewTitle": "Leisure fun",
		"Review": "Can be done. However, you should bring your own flippers and diving glasses. Best at new moon or full moon when the low tide is really deep. Otherwise it is rather 3 meters to the animals."
	},
	{
		"User": "eatlivetraveldrink",
		"Location": "Washington DC, District of Columbia",
		"DateofReview": "October 27, 2016",
		"ReviewTitle": "Interesting activity",
		"Review": "This is an activity offered to the guests at Pearl Farm Resort - you go to this area in the water and fro there swim out to the shallows where you can see giant clams. Cool activity for water lovers."
	},
	{
		"User": "thess-rhina",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "July 20, 2016",
		"ReviewTitle": "Worth visit!! ",
		"Review": "Its worth the visit..going there is quite adventure..esp when riding a tricycle..nd u may contack (09468577160) yanyan(tricycle driver? )For ur adventure trip in samal island he is nice guy nd worth the price for tour in hagimit falls.taclobo islnd.bat cave for 1000pesos..and can nego if...More"
	},
	{
		"User": "Hồng Anh N",
		"Location": " ",
		"DateofReview": "July 14, 2016",
		"ReviewTitle": "Interesting Ecotourism!!!",
		"Review": "Giant clams are endangered species and need protection. Through Taklobo tours in Giant Clam Sanctuary in Samal island, you can see real giant clams in wild and enjoy their unique beauty and their colorful mantle. Most of them are hatched successfully in giant clam hatchery....More"
	},
	{
		"User": "Kaye P",
		"Location": " ",
		"DateofReview": "July 11, 2016",
		"ReviewTitle": "Must visit ",
		"Review": "The guys in charge of this place are very nice. You should visit this so you can help preserve the place. We snorkel saw the clam that is 1Meter long. It's fascinating to see them. Don't forget to bring cash for tip."
	},
	{
		"User": "Atila E",
		"Location": "Izmir, Turkey",
		"DateofReview": "June 10, 2016",
		"ReviewTitle": "Must visit",
		"Review": "To rqach this place is rather expensive and time consuming but it is worth. You must see these giant clams . You get good info about clams here."
	},
	{
		"User": "Munky08",
		"Location": "Pasig, Philippines",
		"DateofReview": "June 1, 2016",
		"ReviewTitle": "Unique experience",
		"Review": "I've had fun snorkelling around the area. Seeing those giant clams is a fulfilling experience. Totally recommended."
	},
	{
		"User": "John L",
		"Location": " ",
		"DateofReview": "May 22, 2016",
		"ReviewTitle": "Freedive with the giant clams",
		"Review": "We paid 100pesos for the entrance fee and I immediately jump in the water and follow the tour guide i brought snorkels with me and leave the lifejacket in the boat, i asked the guide to go down and go near the clam because it...More"
	},
	{
		"User": "jaritrip",
		"Location": " ",
		"DateofReview": "May 1, 2016",
		"ReviewTitle": "Interesting to know about giant clams",
		"Review": "I enjoyed the giant clams that arranged properly. Nice for educational tour especially for the student studying marine biologist. They preserved giant clams"
	},
	{
		"User": "JELN24",
		"Location": "Makati, Philippines",
		"DateofReview": "April 7, 2016",
		"ReviewTitle": "A Must See in Samal",
		"Review": "I first visited the Sanctuary last May 2015 and had a wonderful time so I returned with family last March 2016. Last time we went to the Sanctuary we took a boat for 500 pesos and paid 100 for the entrance and another 100 if...More"
	},
	{
		"User": "jblaza",
		"Location": "Marikina, Philippines",
		"DateofReview": "March 24, 2016",
		"ReviewTitle": "Snorkel alongside giant clams",
		"Review": "When we were doing our Samal Island Tour, we made sure to include the Giant Clam Sanctuary in our itinerary. It was well worth the trip.\r \r Prior to the trip, I contacted the Davao del Norte State College about the tour and they were very responsive. They even provided the mobile number of Mr. Xavier Lopez, the head of the Marine Station, for our queries.\r \r From the highway, our habal-habal entered a road and after several minutes of riding, we arrived in Brgy. Adecor. From the Barangay, there is a small wharf where a pump boat can be rented for Php 500, which is paid directly to the boat man; it is good for up to 6 pax and for up to 2 hours. The wharf offers a view of Malipano island and is situated between the Pearl Farm Resort and the Davao del Norte State College Marine Reserve Park where the giant clams are.\r \r (Although the boat man offered to take us around Malipano Island and to the Pearl Farm Resort for an additional Php 500, we opted not to due to time constraints.)\r \r There is a series of huts/rafters built inside the marine reserve park where the boat docks and a short orientation is conducted. The entrance fee is Php 100 per person. It was Ms. Rebecca who gave the orientation and she was happy to answer the questions that we had about the Marine Station and the giant clams. Although snorkels, rash guards, and underwater cameras were available for rent, we brought our own. Drinks (bottled water, soft drinks) are available at the marine station.\r \r After the orientation, we were assigned a guide who would bring us closer to the giant clams. Life vests were provided. We went during low tide and shallower water gave a better view of the clams. We were lucky that we went early and had the entire reserve for ourselves. The guides told us that during peak seasons, they only allow up to 35 pax inside the marine station at a time to prevent untoward incidents from happening (both to the guests and the clams).\r \r Initially, the guide tugged us using a floater. Eventually, we were snorkeling around on our own. Our guide was happy to show us the different species of giant clams in the marine station. Along the sand bar, you can get really close to the giant clams so be careful not to touch/hit them. They cautioned us to not get our appendage inside the clams as it would require killing the clam to open it up if part of the body gets stuck. They added that it has not happened to any guest yet, but we figured that we would rather not be the first. While chatting with the guides, we learned that they were all certified divers and had training for first aid and water rescue.\r \r After returning to the dock, I asked where they kept the young giant clams. Ms. Rebecca said that their office at the wharf served as a nursery, but it is not open to visitors because of biosecurity considerations. She added that the giant clams produced in the marine reserve are given out to the different marine sanctuaries within Samal Island. Nevertheless, we were able to take a peek inside the nursery when we returned to the wharf, albeit from outside the door.\r \r It was great to have a close encounter with these majestic creatures."
	},
	{
		"User": "Mariel G",
		"Location": "Baliuag, Philippines",
		"DateofReview": "March 15, 2016",
		"ReviewTitle": "Almost an hour boat ride was worth it",
		"Review": "It is high tide when we arrived in this place. The clams were very big and very great to look at. I really love this place. The guides were all patient enough to help us since we can't step on the clams while we are swimming."
	},
	{
		"User": "Leydee D",
		"Location": "Samal Island, Philippines",
		"DateofReview": "March 3, 2016",
		"ReviewTitle": "Natural and beautiful",
		"Review": "Unforgetable experience. I always make sure that my friends and family and guests too would be able to visit this place.. Simply amazing."
	},
	{
		"User": "Kates A",
		"Location": "Cavite City, Philippines",
		"DateofReview": "February 12, 2016",
		"ReviewTitle": "Informative and amazing experience",
		"Review": "We paid P1000 for the boat but we were told we can haggle down to just P500. We paid for the snorkeling gears rental, too. They built a wooden house in the middle of the water so they can be close to the sanctuary. Before you get to the water, a staff will discuss few information about the Taclobo and some precautionary instruction. There will be staff assigned per group in approaching the clams, you can either have a life vest, hold a life preserver or just swim.\r \r Its a big farm of giant clams! There are also colorful fishes and starfishes. You can't hold the Taclobo to prevent damaging them and bruising you so be careful. The staff assigned to us is very generous in entertaining us with the history of the Taclobos in Samal Island. Its very informative and we appreciated it. All staff are professional and friendly.\r \r What i love the most is they dont just treat the farm as a money cow for the tourists, they do really care and take care of the giant clams. That is a big plus!"
	},
	{
		"User": "Charleen C",
		"Location": "Manila, Philippines",
		"DateofReview": "February 11, 2016",
		"ReviewTitle": "It's okay",
		"Review": "The activity is just okay. Nothing exciting. The only thing unique is that you get to touch a giant clam. The guides and caretakers are very nice and knowledgable."
	},
	{
		"User": "Peter19502013",
		"Location": "Davao",
		"DateofReview": "January 7, 2016",
		"ReviewTitle": "Interesting , beautiful and educational",
		"Review": "During a day trip on boat the captain suggested a stop over here. It is really worthwhile to see. The clams and the corals are very beautiful. A good snorkelling stop over including some education about these giant clams. Before entering the water you listen to 5 minutes lecture which makes the whole experience more valuable. This is good for both adults and kids. "
	},
	{
		"User": "Grace H",
		"Location": "Quezon City, Philippines",
		"DateofReview": "January 5, 2016",
		"ReviewTitle": "Amazing experience!",
		"Review": "We visited Samal Island last November 2015 and as part of my bucket list, I \"NEED\" to see these giant clams!\r Going there is quite an adventure specially when you're riding a tricycle. By the way, we rented a trike for \r P1,500.00 which includes going to 4 other tourist destinations in the island. As we arrive at Adecor, Samal, you have to rent a boat for P500.00 (1 person to 10 max) which will bring you to the sanctuary. A tour guide will provide you a short introduction on the different kinds of clams you'll see underneath the ocean. There is a fee of P 100.00 (I guess for the maintenance or entrance) and another P 100.00 is you rent a snorkeling gear (which I guess is necessary unless you have your own) The guide/diver will tour you around while holding a floater explaining the kinds of clams underneath you. It was worth it!"
	},
	{
		"User": "RickN6900",
		"Location": "Los Angeles",
		"DateofReview": "December 8, 2015",
		"ReviewTitle": "Nice Snorkeling trip",
		"Review": "Spent an afternoon floating lazily along while viewing the giant clams in the bay. There are so many of different colors and sizes. Very nice for those who like to take photographs underwater."
	},
	{
		"User": "Morris Adelon A",
		"Location": " ",
		"DateofReview": "November 23, 2015",
		"ReviewTitle": "Giant Clams",
		"Review": "Swim to see the different kinds of taclobo as the locals calls it. Safe, fun and a really unique, new experience only in Samal. Enjoy the water and the sight. Caretakers are accomodating and friendly. Make sure to visit this place and help the locals and the NGOs in the conservation and preservation of this creatures before its too late."
	},
	{
		"User": "Dimple S",
		"Location": " ",
		"DateofReview": "September 28, 2015",
		"ReviewTitle": "Nature Unmatched",
		"Review": "Never miss the chance to see these one-of-a-kind creatures. They may not be originally from Davao (I learned that they were shipped from Bolinao) but they sure are at home in this sea. You will really appreciate the beauty of nature once you snorkel with them. There are beautiful fish as a bonus of this experience."
	},
	{
		"User": "Vanessa G",
		"Location": "Manila, Philippines",
		"DateofReview": "September 2, 2015",
		"ReviewTitle": "Unique Experience",
		"Review": "lots of giant clams and sea urchins. OK to go once and see the giant clams but its not worth going back."
	},
	{
		"User": "Alison T",
		"Location": "Singapore",
		"DateofReview": "July 23, 2015",
		"ReviewTitle": "Do not miss this activity.",
		"Review": "It was a great experience to see the giant clams. At first, we thought they were just big stones underneath the sea. We saw water snake too. Do not struggle and do not touch it. We really loved to see all the different fish, star...More"
	},
	{
		"User": "DingLacostales",
		"Location": "Manila, Philippines",
		"DateofReview": "July 10, 2015",
		"ReviewTitle": "Unique experience",
		"Review": "You can see the giant clams up close and even touch them. I know it pales in comparison if your doing any scuba diving and such but it's a pretty good experience."
	},
	{
		"User": "SGregersen",
		"Location": "Kalundborg, Denmark",
		"DateofReview": "July 4, 2015",
		"ReviewTitle": "Great snorkeling",
		"Review": "Great experience to snorkle on giant clams - the largest was 1,5 meter wide. After a dive on Diaz Wall nearby, we persuaded the captain to take us the sanctuary."
	},
	{
		"User": "vardkeem",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "June 18, 2015",
		"ReviewTitle": "GIANT . . . .really, clams at least 2 feet",
		"Review": "memorable experience seeing those beautiful creatures underwater, really amazing. the fare to the sanctuary is expensive for group under 5 persons."
	},
	{
		"User": "Kim K",
		"Location": "Manila, Philippines",
		"DateofReview": "June 14, 2015",
		"ReviewTitle": "Protecting the clams",
		"Review": "I loved that the Philippinos are taking the preserving of the clam species seriously and are helping restore the protection of the ocean life"
	},
	{
		"User": "ronsdy",
		"Location": "philippines",
		"DateofReview": "March 27, 2015",
		"ReviewTitle": "top 2 best places to visit in Samal",
		"Review": "When in Samal this place the the coral garden area are the place place to visit and go for a swim. The people taking care of the clams are very knowledgeable and would share their passion for taking care of the clams."
	},
	{
		"User": "virmen",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "March 21, 2015",
		"ReviewTitle": "the place is quite nice for you to enjoy be sure to bring your own things for snorkeling",
		"Review": "the place is quite nice for you to enjoy be sure to bring your own things for snorkeling/i like the clams the tour guides as well they explain what happening there/."
	},
	{
		"User": "Laagankaayoko",
		"Location": "Iligan, Philippines",
		"DateofReview": "December 22, 2014",
		"ReviewTitle": "The Last of the Giants",
		"Review": "Best way to encounter this last of giants. They showed me a 19months old which a size of a 5peso coin. Don't know how old are those 1.5 meters length when you go there you can ask it for me to know. Best time to...More"
	},
	{
		"User": "RomanesinAsia",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 26, 2014",
		"ReviewTitle": "Yes , they are GIANT !",
		"Review": "Feels good to see a place dedicated to preserve these incredibly huge and beautiful animals. Nice snorking for all the family, Very friendly guides. Easy to get there."
	},
	{
		"User": "rubberunethical",
		"Location": "Dubai",
		"DateofReview": "August 10, 2014",
		"ReviewTitle": "Clean thrilling swim",
		"Review": "Scorching hot out in mid-sea. Swam all around but saw clams fewer and far between than advertised in the hundreds."
	},
	{
		"User": "DrunkenDugong",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 26, 2014",
		"ReviewTitle": "Snorkeling with Giant Clams",
		"Review": "The Giant Clam Sanctuary on Samal Island is an ongoing conservation project of the Davao del Norte State College and is open to visitors. It's a protected breeding colony of several species of giant clams, taklobo in the local language. Giant clams have been overfished...More"
	}
]
