[
	{
		"User": "sabi0james",
		"Location": "Manila, Philippines",
		"DateofReview": "March 7, 2018",
		"ReviewTitle": "wide variety of shops and in an accessible location",
		"Review": "The mall has several levels of shops, restaurants, and activities that one can spend hours inside without getting bored. There are conveniently placed ATMs for those in need of cash. The viewdeck, also called the peak, houses several bars and restaurants for those who would want to stay up late. One of the best mall in Davao."
	},
	{
		"User": "xheroine1981",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 21, 2018",
		"ReviewTitle": "Student Mall",
		"Review": "Gaisano Mall maybe can be term as Student Mall because it is surrounded by schools like San Pedro College, Davao Chong Hua High School and Holy Cross of Davao College\r As of now, it is an 8-storey mall that gives a lot to offer such as \r a. Supermarket (meat and chicken are fresh and items are cheaper) \r b. Department store (most of the items are cheaper), \r c. Cafe, Fast Foods, Restaurants \r d. Phone store (accessories, mobile and telecom service)\r e. Some branded name store (US Polo, Wrangler, Puma, Mossimo)\r f. Electronics (such as Sony)\r g. Movie houses\r h. Home and Furniture\r i. Children's playground\r j. School supplies"
	},
	{
		"User": "Michelle B",
		"Location": " ",
		"DateofReview": "January 11, 2018",
		"ReviewTitle": "'G' Mall",
		"Review": "More of a high end mall as compared to other malls in Davao city. Nevertheless it's a superb mall with shops for everything and everyone. However they need more lifts in there and signage that leads to the back outside food area."
	},
	{
		"User": "Mehylander",
		"Location": "Morgantown, West Virginia",
		"DateofReview": "January 4, 2018",
		"ReviewTitle": "large and conveniant",
		"Review": "Abreeza Mall probably has the nicer stores but this mall has a very nice selection. Even their food selection seems to be a little better."
	},
	{
		"User": "carljosephburlat",
		"Location": "Zamboanga City, Philippines",
		"DateofReview": "December 28, 2017",
		"ReviewTitle": "Old but stylish",
		"Review": "GMall is still the best mall in Davao even if new malls sprout in areas like Matina and Lanang. Many shops to choose from."
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 6, 2017",
		"ReviewTitle": "OK MALL",
		"Review": "The mall has lots of stores, some with good deals and some are over priced. There are also a lot of places to eat while you are walking around. The one thing that surprised me was that some of the prices were more expensive than in the states."
	},
	{
		"User": "leigh n",
		"Location": "Ho Chi Minh City, Vietnam",
		"DateofReview": "October 3, 2017",
		"ReviewTitle": "Shop for supplies for a 2 week stay",
		"Review": "Everything is available here , including good lunches and pizza take aways , parking is normally available for the car , and a little congested by motor bikes picking up and dropping of fares , but a good coffee is available on the first floor just a little store but they make it how I like, the supermarket has most things an expat would need, just stay away on a Saturday or Sunday unless you go early as like most shopping centers in Davao they get swamped with people, but over all a good easy experience,"
	},
	{
		"User": "Luke T",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "May 29, 2017",
		"ReviewTitle": "lots of stores",
		"Review": "We wandered arounds for several hours window shopping and Kat from a couple of items to take home. Not as expensive as Abreeze and I think greater selection."
	},
	{
		"User": "Mark I",
		"Location": "Leicester, England, United Kingdom",
		"DateofReview": "May 21, 2017",
		"ReviewTitle": "Horrible mall, only redeeming things are The Peak, and the computer/phone shops",
		"Review": "I don't quite know why anyone would want to go to this mall apart from the fact that it is near quite a number of schools/universities. Traffic round this area is terrible, and it always seems to be packed with people.\r \r For supermarkets, the Robinsons in the basement is ok (better than SM but not as good as the NCCC in Matina).\r \r I would not choose to go to this place; but if you need your computer or phone fixing, or need components/peripherals, this is the place to go.\r \r The restaurant area at the top called Summit or Peak is not bad."
	},
	{
		"User": "Honolulu, Hawaii",
		"Location": "Honolulu, Hawaii",
		"DateofReview": "May 12, 2017",
		"ReviewTitle": "Mall a bit on the smallish side but lots of shops",
		"Review": "There are a lot of shops here and on days that I did visit this mall it was very busy. There are many levels to the mall itself and at the base level directly in the middle seems to be a sale of some excess inventory every day. That could explain why there was always a large crowd on hand on the days that I happened to be there."
	},
	{
		"User": "falthaher",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 6, 2017",
		"ReviewTitle": "Not bad place but go to the rooftop ",
		"Review": "Mall is a mall, however, the rooftop cafe, restaurant, bars are really nice and unique specially at night. I discovered the rooftop by looking from hotel (The Pinnacle Hotel & Suits), the mall closes early but the rooftop restaurants, cafe, bars... stay open to midnight and 2 am weekends. "
	},
	{
		"User": "Robert B",
		"Location": "Phoenix, Arizona",
		"DateofReview": "March 28, 2017",
		"ReviewTitle": "Great shopping",
		"Review": "Very clean , friendly people. Great choice of food. Very safe place to go and great deals on clothes"
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 23, 2017",
		"ReviewTitle": "Too much mall",
		"Review": "No question. It is clean, it has everything. Too much for me, my feet are aching. If you go there bring time. And money of course. Supermarket, department store, book store, cloth, banks, shoes, jewelry, food."
	},
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 7, 2016",
		"ReviewTitle": "My default mall but... parking area stinks!",
		"Review": "Gaisano Mall is my default mall, meaning I go to this mall for everything : grocery, shopping, mailing, paying bills etc. But every time we enter the parking area and we have to open our window to get a parking card, the smell is horrible... I was hoping it would improve, but over time it's getting soo bad."
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "a big mall",
		"Review": "walked to gaisano from my hotel uno (15 minute walk)\r crowded(because there was a gma kapuso caravan at the event hall)\r bigger than SM Ecoland Davao. But kinda Gaisano mall is kinda old and the overall aura is kinda yellowish, not like SM malls that has a light ambiance."
	},
	{
		"User": "John S",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "August 13, 2016",
		"ReviewTitle": "Poor customer service",
		"Review": "If you want to return an item or have been over charged they take forever to give you the refund, like they want you to give up.\r Even with looooong cues in the check outs they only operate about half of them in grocery witch is poor and price-tags often have a lower price then you're being charged.\r Have been there many times and it's always the same"
	},
	{
		"User": "Nikolai S",
		"Location": "Oslo, Norway",
		"DateofReview": "June 15, 2016",
		"ReviewTitle": "Great place",
		"Review": "Great place for doing Your Grocery shopping with its big Grocery store at the bottom of the Mall. \r \r The Hair Studio is a fantastic place to get your pedicure, manicure, hair treatment by their wonderful staff. Highly recommended especially if you are used to the European non existence offers of these kind of services in Hair Saloons. \r \r Nice safe airconditioned common areas and many different kind of stores available. \r \r The stores less High end Compared to the newer Abrezza Mall, but also a bit less pricy. "
	},
	{
		"User": "AGMMAC",
		"Location": "Pasig, Philippines",
		"DateofReview": "June 6, 2016",
		"ReviewTitle": "Mall for affordable finds",
		"Review": "We went to Gmall to look for shirts. It's a place for cheap and affordable finds. It was pretty crowded though. I do appreciated the fact that it was easy to get a taxi, with helpful taxi attendants. There were also several dining options in the mall."
	},
	{
		"User": "SherwinJoseph",
		"Location": "Luzon, Philippines",
		"DateofReview": "April 15, 2016",
		"ReviewTitle": "A new mall, small but complete",
		"Review": "This is one of the few new malls in Davao City. It looks small but relatively huge in terms of shopping options. \r \r Located along CM Recto Ave (I hope I am right), the mall offers a wide options of food stalls and shops -- fashion and clothing, electronics, supermarket, and department store. \r \r Relatively clean and organized. \r Very accessible via public transportation."
	},
	{
		"User": "Phuket, Thailand",
		"Location": "Phuket, Thailand",
		"DateofReview": "March 17, 2016",
		"ReviewTitle": "Great food court ",
		"Review": "The food here is actually better than alot of the restaurants. You can see what you are ordering and its sizzling hot!"
	},
	{
		"User": "DonkeyFood",
		"Location": " ",
		"DateofReview": "March 7, 2016",
		"ReviewTitle": "Bigger than it seems",
		"Review": "I went to this mall as it was the closest one to Marco Polo hotel. I thought it would be a small mall with only local stores but it really baffled me. This mall was bigger than most malls I've been to and I spent 4 hours just windowshopping:/"
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"DateofReview": "February 21, 2016",
		"ReviewTitle": "another great mall",
		"Review": "lots of thing to see and do. like how clean the mall and the area around the mall is. just a short walk to other malls."
	},
	{
		"User": "FrogBandit",
		"Location": "London, United Kingdom",
		"DateofReview": "February 13, 2016",
		"ReviewTitle": "good for shopping, eating and exploring",
		"Review": "I preferred this mall to the Abreeza for some reason but in any case it offers what most malls do. I recommend a visit for a few drinks, eating ans maybe some shopping :)"
	},
	{
		"User": "Maria Teresita E",
		"Location": "San Francisco, Philippines",
		"DateofReview": "January 27, 2016",
		"ReviewTitle": "Need to speed up service",
		"Review": "Gaisano Mall of Davao is still the best place to shop but you must have to extend your patience because the lines at the counters of the department store is very long, and some employees can't handle wholesale purchases at the department store."
	},
	{
		"User": "Ralph S",
		"Location": "San Antonio, Texas",
		"DateofReview": "January 14, 2016",
		"ReviewTitle": "My favorite mall in Davao!",
		"Review": "We go here several times a week to shop for our groceries and other needs. We're always discovering new things there."
	},
	{
		"User": "malkingreg22",
		"Location": "King's Lynn, United Kingdom",
		"DateofReview": "January 3, 2016",
		"ReviewTitle": "Very good clean and cheap ",
		"Review": "Very good mall very cheap everything u need is here even got Lisa imported meats KFC Mac Donalds jollie bees Not so good for getting taxi"
	},
	{
		"User": "J_Mon0",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2015",
		"ReviewTitle": "Great buys!",
		"Review": "So many stalls and stores to choose from. Greats bargains and sales. Food stalls had a great variety, super cheap. Great alternative place for buying souvenirs and pasalubongs---especially if you want to avoid hot, crowded, busy outdoor stores for tourists. Super cheap and fun buys!"
	},
	{
		"User": "Elmo B",
		"Location": "Manila, Philippines",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "Tourists Buy Souvenirs and Pasalubong (Gift) Food Here",
		"Review": "Souvenir Items and Pasalubong (Gift) Food, buy it here\r \r After so much moving around the city, we found out that souvenir items are much cheaper inside GAISANO DEPARTMENT STORE and you can use all sorts of payment method.\r \r From refrigerator magnets, hats, wallets, purses and scarves it is cheaper in here.\r An indigenous purse (made from fiber) only cost 29 pesos here agains 45 pesos in another souvenir shop outside.\r \r Food items like durian candies, mangosteen candies and more, buy it from GAISANO SUPERMARKET\r You can even buy the popular MALAGOS CHOCOLATE too.\r \r You may find the place crowded but this is highly accessible by jeep and taxi or simply walk. Davao is a safe place (ranked 8th in the world for safety)."
	},
	{
		"User": "Iceman272",
		"Location": "Grafton, NY",
		"DateofReview": "October 16, 2015",
		"ReviewTitle": "Hasn't changed much",
		"Review": "Always a good mall to wander in this city. We used to go here a lot in 2002. The mall has not changed very much in the intervening years. I still enjoy it."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 22, 2015",
		"ReviewTitle": "Everything you need in one mall!",
		"Review": "Gmall is at the corner of J.P. Laurel Avenue (or Bajada) and Start.Ana avenue beside the Davao Chinese High School. You will not miss it cause it is why there's always a traffic jam in that corner coz all the jeepneys stop there. \r It's a one stop shop Mall: post office, LBC air cargo, National Bookstore, pizza places, fast-food galore, six cinemas with lazyboy seats! \r There are several parlors and barbershops, several skinclinics and travel agencies too.\r Teenagers love to hang around this place, as there are game areas, hobby places, mini fountain park at the Peak and even a basketball area.\r The grocery area is huge that the layout is still confusing, but what you can't fine in other grocery shops, you'll surely find it here. Just watch out what you get coz it could be the imported kind and it's a different price from the local produce. Am not sure if they intentionally mix the imported goods with the localgoods.\r I could spend the whole day at gmall; shopping, pay my bills, mail some letters, watch a movie, get some hardware stuff, do my groceries, have some lunch in a different resto every time I go."
	},
	{
		"User": "GeraldWennerstr... W",
		"Location": "Valencia, Philippines",
		"DateofReview": "August 21, 2015",
		"ReviewTitle": "All That Glitters Is Not Gold",
		"Review": "Malls in the Philippines all have the same attractions - latest gadgets, clothes, groceries, fast food and regular restaurants. All well and good - except when it comes to getting consumer help before and after buying. Knowledge of products is minimal and getting replacement or service after sale takes 3-4 weeks at the earliest."
	},
	{
		"User": "Mits A",
		"Location": "Taguig City, Philippines",
		"DateofReview": "August 10, 2015",
		"ReviewTitle": "A must visit for the thrifty traveller",
		"Review": "It's a great mall for good buys in cheap prices, it so happened that when I went there everything was on sale. Thumbs up for me!"
	},
	{
		"User": "Pao P",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 29, 2015",
		"ReviewTitle": "Its great to be here!",
		"Review": "Basically Gmall's dept. store have everything you need with a great array of products to choose from. Expect big discounts while shopping"
	},
	{
		"User": "Dinah A",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 25, 2015",
		"ReviewTitle": "Big Discounts!",
		"Review": "Enjoy shopping with big discounts big savings on all quality items. All you need at one stop-shopping. Its all here, great to be here!!!!!"
	},
	{
		"User": "Shayne L",
		"Location": " ",
		"DateofReview": "July 25, 2015",
		"ReviewTitle": "The place to shop!",
		"Review": "If you're looking for something great but affordable, or a place to just relax and unwind, GMall is the place to be."
	},
	{
		"User": "Erl09",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 24, 2015",
		"ReviewTitle": "Great finds and nice place to shop!!!",
		"Review": "Believe me! All you need is here! From fashion, style, clothes, food, groceries, gadgets & technologies and a lot more! From cheap to valuable items which is very cool! I've never seen this kind of Mall in Davao that can offer you almost all things you want/need! Also, great place at the peak! Great events at the atrium! Keep it up!"
	},
	{
		"User": "Jeff O",
		"Location": " ",
		"DateofReview": "July 24, 2015",
		"ReviewTitle": "A very cozy place!",
		"Review": "Among the great places in Davao, Gaisano Mall of Davao is noteworthy. I saw lots of affordable and quality products to choose from! Moreover, the main thing for me is that I never get bored there."
	},
	{
		"User": "April M",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 23, 2015",
		"ReviewTitle": "WOW Gmall Davao",
		"Review": "Gaisano Mall of Davao is a huge ,all that offers quality services and products for all consumers. The exterior and interior design is very creative and it added to its consumers comfort. The security implements strict checkpoint to assure the consumers safety."
	},
	{
		"User": "Kurt Wendell C",
		"Location": " ",
		"DateofReview": "July 22, 2015",
		"ReviewTitle": "Shopping Experienced to Remember!",
		"Review": "Shopping Experienced to Remember! Cheap but quality guaranteed products. its nice to chill and relax with friends & Family."
	},
	{
		"User": "Makati, Philippines",
		"Location": "Makati, Philippines",
		"DateofReview": "July 15, 2015",
		"ReviewTitle": "A lot like Manila",
		"Review": "It was my first time to step in Gaisano Mall and to think, it is indeed just like Metro Manila Malls, particularly Ayala Malls. It was nice although I haven't taken much of our time visiting here but I guess it will be most likely advisable to visit this place. :)"
	},
	{
		"User": "Ida Cel D",
		"Location": "Philippines",
		"DateofReview": "July 15, 2015",
		"ReviewTitle": "Cheap finds and cool rooftop area",
		"Review": "This is where you find the boutique stores. Not much on the big brands but if you value style over brand names, this is the mall for you. Lots of sale items too. One of the reasons you have to check this mall out especially at night is the rooftop area. Restos and watering holes that won't leave you poor when you go in are great and a bonus that it has a good view of the sea as well. Easy to get to as taxis and jeepneys frequent the area. Do your christmas shopping here. \r \r For those with cars, this mall has multilevel parking so your cars would be well-guarded and shielded from the sun. "
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "Accessibility, choices, comfort",
		"Review": "I enjoy shopping at GMall because it's centrally located at Davao's downtown area. The choices of stores found in the mall are also the ones that I regularly patronize. There are also a lot of good and affordable finds in their department store and grocery, especially imported ones. Sales attendants are also friendly. Plus being a movie buff, they have 8 cinemas that satisfy my cravings."
	},
	{
		"User": "Christine J",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "June 5, 2015",
		"ReviewTitle": "One Stop Shop",
		"Review": "If you want a place to dine, shop, relax and everything, Gaisano Mall of Davao is the perfect place to go. I've been to many malls and shopping centers. But with this mall, I'm soooo delighted. Yeah.. I mean it."
	},
	{
		"User": "ajmiphranum",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 4, 2015",
		"ReviewTitle": "Great Savings",
		"Review": "Everything I need is here. More choices, more affordable. It's a one-stop shop. I was very satisfied."
	},
	{
		"User": "Dondi A",
		"Location": " ",
		"DateofReview": "June 3, 2015",
		"ReviewTitle": "THE place to shop",
		"Review": "I've been to many shopping centers all around the country, but GMall (as they call it), has the WIDEST (and I really mean it) range of choices in their department store. And true to the Gaisano name, it also has really good deals and price points for shopping. A great place to load up on pasalubongs (and even advanced Christmas shopping) before going back home.\r \r And I liked the Peak on the roofdeck. Very cool and scenic to relax/eat/coold down after all that shopping."
	},
	{
		"User": "revita k",
		"Location": "toronto",
		"DateofReview": "May 13, 2015",
		"ReviewTitle": "convenient",
		"Review": "a 5 minute walk from the hotel. cheap stuff too. but if you want high-end joints, go to SM City or Abreeza Mall. take a taxi with your hotel guard, so they can record the plate# of the cab. just in case."
	},
	{
		"User": "tbose",
		"Location": "Kolkata (Calcutta), India",
		"DateofReview": "March 31, 2015",
		"ReviewTitle": "A good mix and choices of shops and eateries",
		"Review": "Loved the concept of restaurants and eateries on the top floor. Basketball court, Parking and a great view of the city."
	},
	{
		"User": "Samy N",
		"Location": " ",
		"DateofReview": "November 21, 2014",
		"ReviewTitle": "Excelent for Teens ",
		"Review": "It's such an excellent place for teens, there's so many teen wear shops, many fast food restaurants, games area, electronics floor. I think it's best dating place for teens. And at the bacement there is big supermarket."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "November 7, 2014",
		"ReviewTitle": "Bustling with energy",
		"Review": "I love this shopping mall as it has nearly everything you require. It may be an old style building but it is like an ants den with everybody hurriedly scurrying everywhere. It oozes with enthusiasm and the selection of shops is great. I was very impressed that they have a child minding service and games on the top floor including a cinema and food court. Every floor is well designed so you can find what you are looking for - thumbs up. Just needs a good music store."
	},
	{
		"User": "Bacolod, Philippines",
		"Location": "Bacolod, Philippines",
		"DateofReview": "September 20, 2014",
		"ReviewTitle": "The Peak, attraction at Gaisano Mall",
		"Review": "wow! large shopping complex in Davao, crowded with students, families & barkadas on weekend..they have afternoon Sunday mass at he top floor..wait for the sunset & enjoy the night at The Peak..beautiful fountains too..oops! watch out for electrical wirings at the top floor & stairs ,management must inspect regularly for the safety of mall goers."
	},
	{
		"User": "Liezel G",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "August 8, 2014",
		"ReviewTitle": "I always go back here because products are cheaper",
		"Review": "This is one of the oldest mall in Davao but they still compete with the others. They offer cheap products that I liked. I usually get my groceries here as it's the nearest to my place. We enjoy the cinema as well."
	},
	{
		"User": "JEmmanuelLasPinas",
		"Location": "Las Pinas",
		"DateofReview": "June 21, 2014",
		"ReviewTitle": "reliable mall with lots of stores",
		"Review": "GMall is one of the older original malls in Davao City. It is big with lots of stores that cater to all income brackets. There are many restaurants to choose from. It is centrally located and is very accessible."
	},
	{
		"User": "kalboHastings",
		"Location": "Hastings",
		"DateofReview": "July 18, 2013",
		"ReviewTitle": "Best in Davao",
		"Review": "Ive been here in Davao twice & this time for 3 weeks & been to all the malls here & even tho SM Lanang is now available felt that the Gaisano Mall was still the best - easy to navigate, so many stores & the...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "February 17, 2013",
		"ReviewTitle": "Great place, very accessible",
		"Review": "Grocery store with complete stuff from veggies, fruits, cereals to imported goods and many more. Also close to the hardware store, and kitchen wares that i found most of the stuff i needed. Books stores, high-end bags and clothing and shoes can be found here...More"
	},
	{
		"User": "Jordan V",
		"Location": "Macao",
		"DateofReview": "February 9, 2013",
		"ReviewTitle": "Interesting Place To Visit!",
		"Review": "They say that the only way for you to understand the people living in a particular place, live like they do! Well we did and the place was a huge surprise to us...the structure was old, but wait we were mesmerized when we got inside!...More"
	},
	{
		"User": "Jacksonville, Florida",
		"Location": "Jacksonville, Florida",
		"DateofReview": "January 29, 2013",
		"ReviewTitle": "Excellent Mall",
		"Review": "Since this mall was only a mile away from my hotel, I opted to go here rather than the other plushier mall which was another mile further away. And as it turned out, I couldn't be any happier with my decision. It was a great...More"
	}
]
