[
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 20, 2017",
		"ReviewTitle": "The Peak and the mall needs a clean up!",
		"Review": "A few years back, when the Peak opened , nice high end shops opened here, I remember a pizza and pasta at the top most area. There were several yogurt places, a bakeshop, a mediterranean resto, etc. The fountain and lightings were nice, elevators were working. Area around was maintained and clean. Lately, I see shops closing, corners around the stores are dirty and dusty. It's like the cleaners sweep and leave the dirt in the corners or worst sweep them toward the staircases which are horribly dirty."
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 9, 2017",
		"ReviewTitle": "Good view of the city",
		"Review": "Went here with the kids and saw a lot of lights and Christmas type stuff, the view of the city was good and the kids liked it. The fountains were also cool."
	},
	{
		"User": "Capt Mark O",
		"Location": "Hong Kong",
		"DateofReview": "October 13, 2017",
		"ReviewTitle": "The parking building is poorly designed",
		"Review": "Drove to the roof deck parking level of The Peak, and do not have good words to say to the designer of the parking garage. There is a lack of signage, and total lack of intuitiveness to get to higher levels or to descend from the higher levels to the lower levels.\r \r The Peak itself is an average place to visit with restaurants surrounding small pools of water. \r \r The nearby Pinnacle hotel looks just as high as The Peak so its really just a name of a restaurant area that is part of the Gaisano Mall. Average as average gets."
	},
	{
		"User": "Tony_King_Jr",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 9, 2017",
		"ReviewTitle": "Just Fine",
		"Review": "If you just want to take a mini photo shoot by their bridge or have your meal to different restaurant in the area. You could also have fun to their bars."
	},
	{
		"User": "Benedict A",
		"Location": " ",
		"DateofReview": "July 14, 2017",
		"ReviewTitle": "A Peek of Davao",
		"Review": "The Peak - Davao is one of the must-go-to places in this city. It offers a breezy atmosphere and a breathtaking view of the entire city. \r \r It is refined by chic food places and fun bars for friends and family to enjoy. The wide open garden offers a fashionable place for events or snapshots. \r \r Must visit!"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "June 17, 2017",
		"ReviewTitle": "Another variation from other Malls",
		"Review": "Restaurants up here plus the view of a certain part of Davao city. Nice place to stay for a while. Took some food choice and had our lunch."
	},
	{
		"User": "katehreena",
		"Location": "Cancun, Mexico",
		"DateofReview": "May 17, 2017",
		"ReviewTitle": "Chill out",
		"Review": "The place is located on the top of Gmall. There are a lot of restaurants to choose from. There is also an acoustic band on the weekends. Its a nice place to just hang out and chill after work."
	},
	{
		"User": "Ste3f-3f",
		"Location": " ",
		"DateofReview": "April 13, 2017",
		"ReviewTitle": "Nothing ",
		"Review": "There's a view that is far from being spectacular. The architecture is nothing special. The building is rotting as usual because they don't maintain it as usual. You can find normal food, many chains. \r At least it's clean. \r The Mall itself is a standard mall.\r No need to go to the rooftop, but in the mall you find the expectantly things. "
	},
	{
		"User": "Jane A",
		"Location": " ",
		"DateofReview": "November 16, 2016",
		"ReviewTitle": "The view is perfect for relaxing your tired feet from shopping",
		"Review": "The view is relaxing at the top! I love the design and cute landscaping of this open area. Island of Samal is seen and the blue sky is breathtaking for me.. It consists of restaurants, bars, and small parking area. The view is perfect for relaxing your tired feet from shopping!"
	},
	{
		"User": "maryjoy0408",
		"Location": "Toril, Philippines",
		"DateofReview": "October 20, 2016",
		"ReviewTitle": "nice view",
		"Review": "it'a nice place,it seems you're in the other country building,there's a lot of couples though,seems like a park,and the acoustic band was great also"
	},
	{
		"User": "Acid P",
		"Location": "Tagum City, Philippines",
		"DateofReview": "October 8, 2016",
		"ReviewTitle": "Cool View and Great Restos",
		"Review": "Located at the upper level of Gaisano Mall. The peak offers a nice scenery, vibrant lighting and different types of food shops. You can choose from different restaurants located at the peak."
	},
	{
		"User": "Borgyliscious",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "September 27, 2016",
		"ReviewTitle": "Nice View at the top of Gaisano Mall",
		"Review": "One of the places in Gaisano Mall wherein you can relax and breath fresh air and see some nice views. When you got hungry, there are a lot of restaurants to choose from. It has even easy access to GMall's Parking."
	},
	{
		"User": "AlbertodelaPaz",
		"Location": "Chiang Rai, Thailand",
		"DateofReview": "September 1, 2016",
		"ReviewTitle": "Off beat oasis in the Middle of Davao City",
		"Review": "At the name suggests, it is on top of something - in this case a shopping mall called Gaisano smack in the middle of Davao City. The Peak hosts a cluster of eating places - burger joints, mid-range restaurants and places where you and friends can hang out. Best to come here late afternoon when the sun is just about to set and the lighting paints the building in changing hues of color.\r \r Many people loiter at the fountain at the center of the peak admiring their surroundings and just soaking in the beauty as if immersed in a bath. It is a very pretty place to be - provided it is not raining.\r \r There is a railing over which you can get a commanding view of the Davao City Skyline and see Mt. Apo and Mt. Talomo over the horizon. The other end gives you a view of Samal Island and the Gulf of Davao.\r \r This is a really nice place to end a day of shopping where you can relax, have a cold drink, eat and be merry."
	},
	{
		"User": "Stein M",
		"Location": " ",
		"DateofReview": "August 18, 2016",
		"ReviewTitle": "stop there for lunch, never again",
		"Review": "everage, after beeing humiliated by the staff , i left with intention to never go back, it did not make my day"
	},
	{
		"User": "Werner I",
		"Location": "Karlskoga, Orebro Lan, Sweden",
		"DateofReview": "July 28, 2016",
		"ReviewTitle": "A high place in Davao",
		"Review": "Absolutely worth a visit. You can look out over Davao city. Buy coffee or food in some of all restaurants. They have a smoking area too, not so many in Davao this days :)"
	},
	{
		"User": "Michael L",
		"Location": " ",
		"DateofReview": "July 12, 2016",
		"ReviewTitle": "Cramped development",
		"Review": "This is classic example of piecemeal development, more security is recommended to prevent crime and indecent acts"
	},
	{
		"User": "Jemir T",
		"Location": " ",
		"DateofReview": "June 7, 2016",
		"ReviewTitle": "GMALL ROOFTOP YET FANCY",
		"Review": "The structure and surroundings was fancy enough for me. There are restaurants for you and your loved ones if you love quiet & peaceful to dine with. It was cool when I got there. You can see the streets & buildings in the city nearby. There were activities to do outside the area for the kids to play. Also the place is great for friends who loves to drink cold beers. Overall the place is very peaceful during late nights. "
	},
	{
		"User": "adnan c",
		"Location": "Cotabato City, Philippines",
		"DateofReview": "April 29, 2016",
		"ReviewTitle": "good idea",
		"Review": "if you want a place more quiet in Gaisano Mall, go to this place. it is located at the rooftop of the mall, basically you will find there many places to eat. i think every weekends as well they have zumba for all there. what i like about The Peak is Club Echelon. whats good about The Peak also is that you can have a good view of Davao city also, most especially at night. i frequently eat in Pepper Lunch here at The Peak.. definitely this place is good for picture taking especially at night, daytime also as long as it is not really hot/warm."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 16, 2016",
		"ReviewTitle": "Refreshing at night",
		"Review": "With all the lights in the evening and with the blow of the cold wind, you can be relaxed, even by just standing at the porch. The place is romantic too, so be sure to bring your partner with you."
	},
	{
		"User": "Anna Liza D",
		"Location": "Jaro, Iloilo City, Philippines",
		"DateofReview": "March 19, 2016",
		"ReviewTitle": "Gaisano mall rooftop- literally!!!",
		"Review": "Whats there to see? = none Whats in there= students wearin their school uniforms Is it safe= yeah, but better not to comfy with it Overall review= so not worth wasting time to"
	},
	{
		"User": "Tins C",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "February 27, 2016",
		"ReviewTitle": "family peak",
		"Review": "a park at the top. it was so amazing, you can see a park with colorful fountain at the peak of the mall with restaurant and bar surrounded."
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"DateofReview": "February 19, 2016",
		"ReviewTitle": "best veiw",
		"Review": "such a great view. there are only 2 places that have great view this is the better one. Taklobo is the other one"
	},
	{
		"User": "zbad1",
		"Location": "Southlake, Texas",
		"DateofReview": "February 9, 2016",
		"ReviewTitle": "Very slow, but still a nice view and atmosphere!",
		"Review": "So there were probably only 12 people in the entire place when we went there on a Wednesday night, but I guess that's just Davao, right? The views and breeze were nice! Great music. Nice food choices. I'd go back again if I ever have to go back to Davao again. (sleepy town!!)"
	},
	{
		"User": "San Antonio, Texas",
		"Location": "San Antonio, Texas",
		"DateofReview": "January 14, 2016",
		"ReviewTitle": "It's the Top Floor of Gaisano Mall!",
		"Review": "Nice place to g o to have your picture taken by the big DAVAO sign display. Several restaurants there, including a Mama Maria Pizza which has a buy one/take one special after 2 pm."
	},
	{
		"User": "Chrïstïnę B",
		"Location": "Sweden",
		"DateofReview": "November 5, 2015",
		"ReviewTitle": "Overlooking to some parts of DAVAO CITY",
		"Review": "Overlooking to an Island. The place is safe. On top of the mall. Many restaurants but has a curfew like 10pm. Nothing Special. Coffee Shops, Japanese Restaurant, Milk Tea. Good for students, single and perhaps dating on a budget."
	},
	{
		"User": "RodgerOndat",
		"Location": "Chiang Rai, Thailand",
		"DateofReview": "October 16, 2015",
		"ReviewTitle": "On of those places that just beacons you to come.",
		"Review": "You are unlikely to know or find the Peak if you are new to Davao and do not know anyone who knows about it. It is located at the Rooftop of the Gaisano Mall at the center of town. Several restaurants are located there. The...More"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 15, 2015",
		"ReviewTitle": "its just a mall not an experience",
		"Review": "ok. you have a nice view of davao. but its not the highest view and it is not the best view. so people, if you need stuff, its a good place. if you want to be high.climb mount apo"
	},
	{
		"User": "Sabrina T",
		"Location": " ",
		"DateofReview": "October 15, 2015",
		"ReviewTitle": "Soothing and relaxing feeling",
		"Review": "It gives you a soothing and relaxing feeling specially after a tiring shopping and you will watch the amazing view from above."
	},
	{
		"User": "jopin",
		"Location": "Manila",
		"DateofReview": "September 6, 2015",
		"ReviewTitle": "OK place for teenage hangout",
		"Review": "Average-looking place for people to enjoy a bit more space than crowded areas at the lower floors of this same mall and the others in the city. Not relaxing at all as the young adults walking and dancing about consider the whole thing as their...More"
	},
	{
		"User": "Bryce C",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "September 1, 2015",
		"ReviewTitle": "Not as good as what the reviews say.",
		"Review": "It may give you an almost 360 view of the city, but it's not a spectacular view. It's also on top of a mass market mall. You can take a car and drive it up a spiral path, a very narrow spiral path where the...More"
	},
	{
		"User": "lalai57",
		"Location": "Davao City",
		"DateofReview": "September 1, 2015",
		"ReviewTitle": "nice view together with friends",
		"Review": "nice place for strolling with friends and feel relax. suggest to have more improvements.. so that the next time we visit the place we could sphere more time."
	},
	{
		"User": "Las Pinas",
		"Location": "Las Pinas",
		"DateofReview": "August 31, 2015",
		"ReviewTitle": "Good spot to people watch",
		"Review": "This is a good spot to just sit and have a cup of coffee and people watch. It can get crowded on evenings and especially on weekends."
	},
	{
		"User": "WVKayaker",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 7, 2015",
		"ReviewTitle": "Concerts sometimes.",
		"Review": "It's at the top floor of the Gaisano Mall in Davao City. It stands out due to location and eateries nearby. Hangout place for the \"Selfie\" generation."
	},
	{
		"User": "Edlyn A",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 5, 2015",
		"ReviewTitle": "Great place !!!!!",
		"Review": "This place is right in the heart of Davao city . Loves spending time with my friends and my family here... 👯👭👬👩‍👩‍👦👩‍👩‍👧👩‍👩‍👧‍👦👨‍👨‍👧‍👧 This place is So Perfect !!!!! Especially at night.... 👍🏼💯☺️ Must!!! Visit!!!!"
	},
	{
		"User": "Pao P",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 25, 2015",
		"ReviewTitle": "Best place for the weekend",
		"Review": "Right in the heart for Davao city, this place is complete with a wide array of bars & restos you need during the weekend!"
	},
	{
		"User": "Shayne L",
		"Location": " ",
		"DateofReview": "July 25, 2015",
		"ReviewTitle": "Greatness at its peak",
		"Review": "Unwinding is a must every once in a while. Whether you'd like to do your relaxation through a good food or a cold drink, experience it at The Peak."
	},
	{
		"User": "April M",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 23, 2015",
		"ReviewTitle": "\"Excellente the Peak\"",
		"Review": "It's not just an ordinary place. It is a place with extraordinary view, comfortable and relaxing ambiance that is suitable for all types. It is a place for those who seek entertainment since it offers free Zumba and live acoustic music. The PEAK of G-Mall...More"
	},
	{
		"User": "Dinah A",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 23, 2015",
		"ReviewTitle": "Perfect place!!",
		"Review": "Perfect place to hangout with family and friends. Delicious food and nice view. It's great to be here!! PinaSmile."
	},
	{
		"User": "Mikee P",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 22, 2015",
		"ReviewTitle": "It's great to be here!",
		"Review": "I love the food specially chicken charlie, love the ambiance and the people I encounter all of them are smiling and happyyyyyy.!!"
	},
	{
		"User": "Kurt Wendell C",
		"Location": " ",
		"DateofReview": "July 22, 2015",
		"ReviewTitle": "Great to Chill and unwind",
		"Review": "Bars and Resto's are Good. Best Experienced and the Food & Service are quality guaranteed!.Its Great to be Here!"
	},
	{
		"User": "Teresa v",
		"Location": "Spain",
		"DateofReview": "July 3, 2015",
		"ReviewTitle": "Refreshing spot",
		"Review": "This is on top of one of the most frequented malls in Davao City. Here, a good number of restaurants, store and coffee shops is situated. This is a nice place especially during the night as one can enjoy a good view of the city while having good food in any of the restaurants there. Good place for picture taking too. "
	},
	{
		"User": "Leslie C",
		"Location": "Quezon City, Philippines",
		"DateofReview": "June 28, 2015",
		"ReviewTitle": "Heavenly Dining at Earthly Prices",
		"Review": "This is where you can view the entire City- overlooking. Like an aerial-view of the rest of the province. It is best to visit in the morning. Or mid-afternoon just before sunset comes... then early dinner to later dinner;even its quite chilly or foggy- you can chill out and unwind to the nearby restaurants and pubs after enjoying the view tour."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "Good choices, great views",
		"Review": "Choose a seat, grab a cup of tea and enjoy the ambiance. Just a 5 minute walk from the place where we normally stay, love the modern architectural design. Although, sometimes it could be noisy due to it's popularity esp to the young people who like to be in this place. "
	},
	{
		"User": "Christine J",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "June 4, 2015",
		"ReviewTitle": " ",
		"Review": "The view is breathtaking especially at night and when there is a slight drizzle. The cool mountain breeze adds to the appetite and the dishes are presented as though they were done in artist studios. The overall experience is one of exhilaration because there are a number of picture pretty corners in the complex and one can enjoy a quick stroll in the gardens after a hefty meal. Lo and behold, the prices will not upset you or your purse! "
	},
	{
		"User": "ajmiphranum",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 4, 2015",
		"ReviewTitle": "Perfectly Perfect!",
		"Review": "Aside from the scale and range of choices of shops and merchandise at GMall Davao, I also enjoy going there because of The Peak. They have an array of restaurants and cafes that fit everyone's budget. At night, it's also a nice place to chill or hang out at the bars with friends and colleagues. "
	},
	{
		"User": "Jeff O",
		"Location": " ",
		"DateofReview": "June 2, 2015",
		"ReviewTitle": "Awesome!",
		"Review": "Yeah.. It's perfectly perfect! You can find everything here.. Wonderful view. Perfect place to relax and the like.. Amazing!"
	},
	{
		"User": "Erl09",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 28, 2015",
		"ReviewTitle": "Night Life at The Peak",
		"Review": "Excellent Bars, Mono and Club Echelon to hang out with friends and drinks while enjoying the night in the middle of the City!"
	}
]
