[
	{
		"User": "Lenisyl Marie T",
		"Location": " ",
		"DateofReview": "April 2, 2018",
		"ReviewTitle": "CHARGE TO EXPERIENCE",
		"Review": "The ambiance of the place so nice and beautiful..\r But the customer service is very poor.. their staff are very rude to their customer!. one of my encounter with the girl staff telling me!. \"ayaw cge'g yawyaw man kay madungog ka sa among mngt. \" (mam stop complaining might our mngt. hear you) the male staff naman telling us.. because we have some several complain during our stay. and they are under staff!.. \"kung dghan mog reklamo dria hawa mo\" ( if you have a lots of complains here! you can leave)!"
	},
	{
		"User": "Loida P",
		"Location": " ",
		"DateofReview": "January 28, 2018",
		"ReviewTitle": "A Quick Visit at Samal",
		"Review": "PROS\r Nice beach\r With videoke \r Homey ambiance\r Comfortable cottages\r Lots of trees\r \r CONS\r Small expensive rooms\r No restaurant\r Common CR \r The caretaker is often out of her post, you have to call her in her house inside the resort\r \r If you’ll spend just a day in Samal, I would recommend this place\r \r Just bring food and drinks."
	},
	{
		"User": "Ericson L",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 16, 2017",
		"ReviewTitle": "One of the best place for overnight chill out",
		"Review": "The place is very good if you would like to spend an ovetnight to chill. We visited the place to unwind from the stress of the city.\r \r The place is accessible by car and/or public tricycle/habal-habal. The entrance fees and other related fees were fine and not that costly.\r \r Facilities were good. Perfect design of the cottages, pathways and staircases. They also have a perfect spot for pitching a tent.\r \r The white sand and waters were good. Very clean as expected. It is indeed perfect for overnight stay.\r \r One thing that they need to improve is that, they need additional staff to maintain order of the place. During our arrival, I think the personnel that we have met at the front desk were not the actual front desk personnel (I think so) because of the way they treated us and that was already late night and might the front desk personnels were already ended their shift (in my opinion). Also, on the next day, we have discovered some cottages were not yet clean. Upon my observation, they might have limited staff on their resort. I hope they have enough people to handle the maintenance.\r \r Overall, that was a relaxing experience. My weekend was well spended!"
	}
]
