[
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 13, 2016",
		"ReviewTitle": "Its far away but worth it",
		"Review": "one of the nice things is the drive towards the place. it is over a cemented road through the woods. the place is very natural. the pool is nice and cool. a lot of the food was out of stock but the service was good. they also organize hikes to caves from there"
	},
	{
		"User": "Maia_0515",
		"Location": "Davao City",
		"DateofReview": "November 3, 2016",
		"ReviewTitle": "Raw and Serene...",
		"Review": "I've been here with my cousin's just to simply allow our little kiddo's in the house unwind and our feet brought us here.. this is a bit far but accessible place.. the place is raw though it has a few structures and a nook where you could pose for a photo op..."
	},
	{
		"User": "rey m",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 22, 2015",
		"ReviewTitle": "Soo not worth getting lost",
		"Review": "The road to Gumamela is confusing and if you're using only waze/google maps as your guide, you will surely get lost. We spent almost 2 hours navigating the road. The place is not well maintained, it's super humid, they have no cellphone signal, and it's too expensive consider its location and overall appearance. We paid P100/pax for the entrance to the resort, P3,000.00 for their so-called pavilion, which is actually just a mid-sized cottage with no electric fan, and P300 for the lechon corkage."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 22, 2015",
		"ReviewTitle": "Secluded refuge",
		"Review": "It's a place where you want to be away from the hustle and bustle of the city without leaving the city. They have nice cottages and a pool where you can relax all day. Food is also interesting as they serve gumamela-based fares and drinks."
	},
	{
		"User": "Arnold Cesar R",
		"Location": "Manila, Philippines",
		"DateofReview": "December 27, 2012",
		"ReviewTitle": "History, Nature and Adventure Rolled into One",
		"Review": "To be fair, I only spent a few hours in this place- one lazy Christmas afternoon- to check it out, and more importantly, check the road as no one from my family is familar with the way. \r \r It was quite tricky but the map on the resort's webpage proved useful plus the signs on the road that also gives distance to destination (Gumamela).\r \r Place- secluded, quiet, peaceful. It has a historical significance too (WW2). Swimming pool is average but with few guests, it is more than enough. There is also a small wading pool for kids. Cottages of various types dot the surrounding. Choose which type suits your group- overnighter, day tour-sleeper, day tour-eater, etc. \r \r Price- bundling is always easy on the pocket and more interesting to customers esp if bundling offers flexibility. But when we got to CaveRock, we were charged a fee almost every 100 meters since we entered (gate, pool, cottage). Not a very warm welcome considering that getting there means a bumpy long ride. Overall price: not cheap but also not very expensive. \r \r People- the owners were gracious and warm people. The staff though needs some time to warm up. Generally, service was good although food took some time to arrive (~1 hour).\r \r Downside: cooking/grilling is not allowed. Understandably this is to prevent fire since the place is mostly made of light marerials. Bring insect repellant. \r \r Upside: you can bring raw meat/fish and let kitchen staff do the cooking- for a fee, of course. Be ready for more adventure- in drinks (hibiscus mojito) and in trekking (spelunking). There's billiard table, bikes, etc. Noisy videoke is absent- thank you! \r \r Rooms for overnight accom are simple but elegant. Toilets are modern and clean. And lastly, dont your camera as there are many interesting things for a shutterbug."
	}
]
