[
	{
		"User": "Maria I",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Cool ",
		"Review": "Nice place , full of people .. a lots of small waterfalls.. fun place. If you’re looking for a place to make a grill and relax all day here it is !!!"
	},
	{
		"User": "Steve J",
		"Location": "Norwich, United Kingdom",
		"DateofReview": "5 days ago",
		"ReviewTitle": "Worth a look ",
		"Review": "We went there on a Sunday we did feel we were the attraction being white tourists but everyone was really friendly Make sure you take your swimwear"
	},
	{
		"User": "Karen N",
		"Location": " ",
		"DateofReview": "4 weeks ago",
		"ReviewTitle": "Worth the visit",
		"Review": "We visited Hagimit Falls as part of our inland tour. The guides are amiable and very helpful. They sure know how to take pictures for your profile picture! The cliff jump to the 13ft deep water is definitely fun and the cave slide is a new experience for me. Kudos to the guides! "
	},
	{
		"User": "matei823",
		"Location": "General Santos, Philippines",
		"DateofReview": "March 8, 2018",
		"ReviewTitle": "Nature! Great side trip",
		"Review": "My kids had a blast exploring the many pools. We enjoyed the cool water from the falls. For small kids though, they need to be held and should have flotation devices. The trek upwards after the swimming, not so enjoyable! Overall, a must experience for those who travel to Samal, especially during the rainy months. During the summer the falls have just a little volume."
	},
	{
		"User": "Chris P",
		"Location": " ",
		"DateofReview": "February 15, 2018",
		"ReviewTitle": "Ok for kids? ",
		"Review": "This is a perfect example of how to totally destroy what once was a beautiful place! Garbage everywhere. Fake concrete pools and waterfalls. A huge disappointment!!!"
	},
	{
		"User": "RamDurai",
		"Location": "Kuala Lumpur",
		"DateofReview": "January 24, 2018",
		"ReviewTitle": "Beautiful",
		"Review": "We had a great time hiking around taking pictures just wished we swan in the falls.Might be a little hard to find but worth it."
	},
	{
		"User": "Peter T",
		"Location": " ",
		"DateofReview": "December 21, 2017",
		"ReviewTitle": "Small and safe water fall - a treasure for kids",
		"Review": "It is a small waterfall. The lifeguard posted near the fall help new visitors by guiding them and taking them through a cave inside the fall. My son loved the trip and did multiple rounds inside the cave. A small tip made the lifeguard happy. Non slippaey and 5 ft water."
	},
	{
		"User": "MrSnatch",
		"Location": "Worcester, United Kingdom",
		"DateofReview": "December 11, 2017",
		"ReviewTitle": "Nature Tripping",
		"Review": "If you want to go nature tripping in Samal and enjoy some cold water, Hagimit is definitely one of those. Just pay 100 pesos for the entrance fee and 5 pesos for the environmental fee. Just a tip, bring food as they dont have food stalls where you can buy food."
	},
	{
		"User": "jgayongorsa",
		"Location": " ",
		"DateofReview": "November 20, 2017",
		"ReviewTitle": "A breath of fresh air",
		"Review": "Having past hagamit falls the other day the wife and i decided to go back there today having checked out a few reviews .\r It was about 10k from where we are based in lanang. So we fueled up the scooter amd went, it was real easy to find clear signage on main road. Upon arrival we had to pay 5 peso each enviromental, the track down to the falls part concrete part dirt track, plenty of parking and a small store for basic foods amd drinks.\r Entrance to get us both to the falls was 150 peso there are two parts to this place the free amd the waterfalls source.\r I must say at this point if you have elderly or disabled in your party its a no as there an incredable amount of very steep steps down to the resort.\r The park itself has local native people living in and around the area which makes it work well all very friendly. On route you get a glimpse of what you are going to and it was awsome blue looking river very clean i couldnt wait to get down there, its about a 15 minute walk. Finally all you can here is the sound of the fall ! So very relaxing , i just wanted to get changed and jump in, there were some locals already there swimming, again friendly and approachable they said it was deep enough to jump off the rocks so i did!so invigorating clean cold water peacefull and sureen. A great place for pictures and over all well worth a visit, ill be taking the kids there for sure"
	},
	{
		"User": "UsapangGala",
		"Location": "Pasig, Philippines",
		"DateofReview": "October 18, 2017",
		"ReviewTitle": "Swim and Trek",
		"Review": "Advisory:\r 1. I won't advise the place if you have elderly with you. The place requires climbing up and down.\r 2. Don't set your expectations very high. For me, the place has didn't us a \"wow\" factor but the place is still worth it. The water is not that clear too.\r 3. If you can't control your kids, don't bring them to this place. \r \r The place is not bad, although I didn't like after your enjoyment on the swimming you may become exhausted when climbing up to the exit. \r \r I hope the place should be maintained otherwise the beauty of the falls will be lost. "
	},
	{
		"User": "seedhunter",
		"Location": "Hyderabad, India",
		"DateofReview": "October 13, 2017",
		"ReviewTitle": "Not so impressive",
		"Review": "Although this fall is located in serene ambiance, it is just very ordinary waterfall. But good place for picnic and swimming in cold water. Fee 15 Peso."
	},
	{
		"User": "Richee Genesis T",
		"Location": " ",
		"DateofReview": "October 10, 2017",
		"ReviewTitle": "Picturesque",
		"Review": "P15 entrance fee which is really really worthy. The place is really beautiful. I suggest to go early because at around 10am, people starts to go there and it would be not okay on pictures. Haha. If you're gonna swim, you are required to rent a cottage which ranges from P150-400. Everyone should try the cave hidden at the falls. Quite an experience. "
	},
	{
		"User": "Ricky P",
		"Location": " ",
		"DateofReview": "October 9, 2017",
		"ReviewTitle": "I wished it was raw",
		"Review": "The beauty of nature is not alleviated by any man-made improvements. In my honest and personal opinion, every natural tourist spot should only be reserved by keeping it clean and not modifying it by creating something just for human comfort. This falls should have been a lot more beautiful if it was not turned into a resort type spot. "
	},
	{
		"User": "queenmary28",
		"Location": "Pagadian City, Philippines",
		"DateofReview": "September 13, 2017",
		"ReviewTitle": "Educational Tour",
		"Review": "i was so amazed the beauty of Hagimit Falls as my first time to enter Davao. The water is so clear and cold. You can swim how long you want, and you can wear also life jacket for as long as to maintain your safety."
	},
	{
		"User": "Aya K",
		"Location": " ",
		"DateofReview": "September 10, 2017",
		"ReviewTitle": "Nice, but...",
		"Review": "It had rained the night before we went to the falls, so the water was muddy. They only collected half the price because of that, Php50.00 is the regular entrance fee.\r \r We did not stay long as there was nothing much to do with the water looking like that. However if it had not rained, i imagine the place is nice for family getaways or for those who just want to spend some time with nature."
	},
	{
		"User": "jonalber2",
		"Location": "Singapore, Singapore",
		"DateofReview": "September 5, 2017",
		"ReviewTitle": "Like a massage shop you never want to leave",
		"Review": "Unfortunately, the rain was pouring when we visited Hagimit Falls on a habal habal. That day, the water looked murky and brown. Our guide said that on a normal sunny day, the water is bluish. Eitherway, already wet and tired, we took the plunge. Once on the rocks, with the water on our backs, my muscles were singing out in praise! This was a great massage to end our day of touring Samal Island. We stayed on the rocks (thank God, we didn't fall asleep) for what felt like hours. \r \r The stairs going down the falls, is very manageable. Not challenging at all. There are also small shops at the water's edge selling snacks."
	},
	{
		"User": "Sony A",
		"Location": " ",
		"DateofReview": "September 2, 2017",
		"ReviewTitle": "Worth a Try",
		"Review": "So this is one of the few trips you can explore in samal island , even though its not really well maintained because of vandalism everywhere, but having said that this place is a worth a try, also its very cheap , from entrance fee to cottages and overnight !"
	},
	{
		"User": "Tony_King_Jr",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 9, 2017",
		"ReviewTitle": "Just don't give up easily",
		"Review": "Don't be discourage when going down the stairs. Just be mindful of your safety and belongings. I didn't saw any lifeguard in the area."
	},
	{
		"User": "Cza C",
		"Location": " ",
		"DateofReview": "July 28, 2017",
		"ReviewTitle": "A bit dirty",
		"Review": "The place is okay .. the trip was worth it except ror the fact that as time goes by trash can be seen eveyrwhere in this place... a lot of tourists are just throwing trash everywhere .... the only thing good bout the place is the falls "
	},
	{
		"User": "Ronna V",
		"Location": " ",
		"DateofReview": "July 17, 2017",
		"ReviewTitle": "Cold water 😄😄😄",
		"Review": "One of my itinerary in salmal trip is checking out this hagimit falls\r Just right after my taclobo tour i went here. 40 pesos entrance and theres a local guide inside the park.. \r Its up to u if u will give a tip of not \r I gave 50 am.not rich am just budgetarian backpacker. \r The guide is great and accomodating. \r Ok went there weekdays so the place is not crowded.. Some locals and a group of indian medical students from davao.. \r \r The place is nice.. And the water is cold. I love it. Went inside the small cave behind the falls ... \r Its a must see if ur not in a hurry and u want to relax with the falls ..but i guess weekend will be full of guest. \r Am.happy :) "
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "July 15, 2017",
		"ReviewTitle": "Fuuuuun!! ",
		"Review": "As soon as you enter the location, you'll need to trek over a flight of stairs before reaching Hagimit Falls. At first, it's pretty underwhelming since it's just a few levels and not that steep but there's more than meets the eye. There's a staff that is willing to help be your on site photographer (we didn't really sign up for it but it was a great surprise). He's a guide that knows the ins and outs of the falls to give you great insta photos. Apparently, there's a small hidden cave inside the falls and you need an expert to help guide you. There's a sign that says \"No jumping\" but he'll tell you the perfect place to stand and where you should jump to make it safer. All you have to do is to give him a tip. \r \r The benches and huts are charged so we just placed our stuff by the side of the falls. Plenty of other stuff to do but we were already satisfied with the photo ops and the tiny cave. "
	},
	{
		"User": "jonsapon121",
		"Location": " ",
		"DateofReview": "June 8, 2017",
		"ReviewTitle": "Nice experience ",
		"Review": "Fantastic falls. There are some people to help you climb the falls, just tip them. Good service would bring friend next time"
	},
	{
		"User": "Jose Victor M",
		"Location": " ",
		"DateofReview": "June 1, 2017",
		"ReviewTitle": "Another way of relaxing in Samal",
		"Review": "It just takes a short walk and you will arrive at Hagimit falls. We have done a bit of exploring here too and as you go downstream you will see some resorts with rentable huts if you want to have a picnic here. The water is refreshing to swim in so don’t hesitate to take a dip with your companions and enjoy the sound of the falls. It's another way of relaxing in Samal even when you're not in a beach."
	},
	{
		"User": "ALventureBlogs",
		"Location": "Quezon City, Philippines",
		"DateofReview": "May 28, 2017",
		"ReviewTitle": "exciting waterfall",
		"Review": "Water is good, cool and clean!!! But man-made structures altered nature. Budget friendly trip. Good for family outing and bonding"
	},
	{
		"User": "Roxy604",
		"Location": "Vancouver, Canada",
		"DateofReview": "April 27, 2017",
		"ReviewTitle": "Nice place to spend the day; popular with locals",
		"Review": "It’s quite a ways in (from the highway) to even get to the entrance of where the waterfalls are. The road is very narrow – one lane going both ways; give and take for sure. Small, low-lying cars not a good idea on this path. It’s quite far from the main road, but if you don’t mind the walk (most people do), it should be fine.\r \r It’s probably prettier when it’s brighter out, but when we went there it was a little gloomy so it didn’t look quite as great. It’s a busy place, lots of people having picnics and swimming in the pools by the falls. I believe you can rent little huts and tables for picnic purposes. The main waterfall area is quite busy, but there are other quieter areas around the property, you just have to explore and go against foot traffic.\r \r There isn’t much to see here. So unless you are planning to stay and have a picnic and going swimming, might be best to skip it. It’s just not worth the hassle just for viewing purposes. Also you have to pay a fee to get in."
	},
	{
		"User": "niccaalyssa",
		"Location": "Manila, Philippines",
		"DateofReview": "April 26, 2017",
		"ReviewTitle": "Beautiful View.",
		"Review": "This was one of the most beautiful place of Davao that I had visited so far. The water was so refreshing because its cool ( i mean icy cool). The people there were that very accommodating that they took our picture from top till we drop. Plain is beautiful. "
	},
	{
		"User": "Luchie Kin A",
		"Location": " ",
		"DateofReview": "March 27, 2017",
		"ReviewTitle": "Summer Samal Island Tour",
		"Review": "This place is quite nice.. Not as what I expected from the viewed photos on the internet. But surely a great place and wonderful falls 😂 cottages are expensive I find it unreasonable for the place."
	},
	{
		"User": "Leiann L",
		"Location": " ",
		"DateofReview": "March 2, 2017",
		"ReviewTitle": "Best place to cool down after a tiring day of island hopping",
		"Review": "The place is very big and lots of falls to choose from. It can accommodate as much guests as possible. Cottages are spread around. Better to go bere after a very tiring day as the water is very relaxing and fewer people go there around 4pm. The entire falls will be all yours once families and friends go home late afternoon. But not advisable for elders or people with weak knees as there will be a lot of walking on stairs. Ample space for parking."
	},
	{
		"User": "Jennelyn T",
		"Location": "San Jose del Monte, Philippines",
		"DateofReview": "February 20, 2017",
		"ReviewTitle": "Cool waterfalls with a cave inside",
		"Review": "The waterfalls were like a therapeutic massage, plus the water is cold, at the side of the falls is a narrow cave (not for the claustrophobic). A very scenic place as well..."
	},
	{
		"User": "jan j",
		"Location": "makati city",
		"DateofReview": "February 14, 2017",
		"ReviewTitle": "Nice place for picnic and little adventure...",
		"Review": "Descending down to the falls has been made easy by the cemented stairway. The place is cool and relaxing. Many nice spots for picture taking. It is my first time here to jump off a cliff. And get into a small cave and swim my way out to the open... Worth visiting. There are also huts and grilling place for rent. You just need to bring your own food and buy coconut juice and sticky rice cake from the locals selling along the road to help the locals..."
	},
	{
		"User": "Milany A",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 4, 2017",
		"ReviewTitle": "Coooollllllddddd Water",
		"Review": "The place is crowded on weekends but the water remains cold. It was awesome! And very affordable! It is also an adventure going there on a bumy ride or in a heart-wrenching hike. But still, it's a good place and I highlyrecommend it to anyone who would like to relax. It's worth a visit. "
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"DateofReview": "February 3, 2017",
		"ReviewTitle": "Worth a quick visit but not a huge falls",
		"Review": "There is a P5 environmental fee charged at the turnoff from the main road with a further P40 payable after a few hundred metres of tricycle travel.\r \r One then walks 300 metres along an at times steep path that has a ramp or steps to reach the falls. Here someone tried but failed to charge me again, perhaps believing I wanted to use a table, although there were only two.\r \r The falls had a good flow but they are only a metre high.\r \r It is worth a visit but do not expect the falls to be anywhere near as good as Tinago Falls outside Iligan City, Mindanao."
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 22, 2017",
		"ReviewTitle": "Used to be so nice",
		"Review": "The falls are phantastic. Clear cold water. A very beautiful thing. \r Not beautiful is the crowds of people making noisy music abd throwing their garbage everywhere, on the ground, in the water, unbelievable.\r There should be more waste baskets. \r Ugly also the tons of concrete and the many buildings there.\r If you go there on a weekday off season you might have the chance for some silence. "
	},
	{
		"User": "Gabriel M",
		"Location": "Taguig City, Philippines",
		"DateofReview": "January 11, 2017",
		"ReviewTitle": "Cool and very nature",
		"Review": "We had a great time with my friends and stayed here overnight... Enjoyed the cool water and the very natural beauty it can offer.."
	},
	{
		"User": "krisna m",
		"Location": " ",
		"DateofReview": "January 3, 2017",
		"ReviewTitle": "Cold waters",
		"Review": "Its my 2nd time in Hagimit already and what I like is at the top because the water is cold and fresh but there is an additional fee if you wanted to go there."
	},
	{
		"User": "macasaetchris",
		"Location": "Makati, Philippines",
		"DateofReview": "December 14, 2016",
		"ReviewTitle": "Place time to visit is during summer",
		"Review": "Entrance fee: 10 pesos\r Hagimit Main Entrance Fee: 50 pesos (Discounted because the water wasn't clear)\r \r It was rainy when I went here. The water was muddy unlike the pictures but mainly because it rained hard the night because and during my stay here. But I bet this place is as good as advertised. I'll be back soon! "
	},
	{
		"User": "Dennis R",
		"Location": " ",
		"DateofReview": "December 14, 2016",
		"ReviewTitle": "Dont Go if Raining!!",
		"Review": "We went here and the tricycle driver said that The Water in the Falls is not clear coz of the 2 day rain.the road going down the Hagimit Falls is very very slippery.Dont wear fitflops and just dont go there when its raining.you wont appreciate the beauty of the falls :( "
	},
	{
		"User": "April C",
		"Location": " ",
		"DateofReview": "December 1, 2016",
		"ReviewTitle": "Hagimit Falls in Samal",
		"Review": "You just cant miss this when you're in Samal. Definitely a must see. There are about three different falls areas where you can swim and relax and there are really helpful guides in the area who are willing to help. These are locals and some \"tips\" or gratuities will be much appreciated. "
	},
	{
		"User": "virmen",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "November 21, 2016",
		"ReviewTitle": "chasing waterfalls",
		"Review": "chasing waterfalls, hmmmm even t he waterfalls is not soo nice but the water is very clear so it adds the beauty in this place."
	},
	{
		"User": "Wreckxki",
		"Location": "Quezon City, Philippines",
		"DateofReview": "November 18, 2016",
		"ReviewTitle": "Small Falls",
		"Review": "It was easy going to the falls because you need to walk down a flight of stairs, but it was tiring going back to the entrance. \r \r It was a small falls, we went there on a Tuesday but there were quite a number of people. There are tables and cottages available for rent around 150php I think. It would be better to take food/drinks with you because there are not a lot of stores available. \r \r Since there are other falls that are better and nicer in Samal Island. You may skip going to Hagimit especially if you are only on a day tour."
	},
	{
		"User": "Pio S",
		"Location": " ",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "It was so so",
		"Review": "I didnt like the way it was maintained. It lacked a little bit of organization. The stores there had limited food being sold."
	},
	{
		"User": "Karakus77",
		"Location": "Emirate of Dubai, United Arab Emirates",
		"DateofReview": "October 14, 2016",
		"ReviewTitle": "Cool down under the falls",
		"Review": "Was nice going down under the falls with an old fashioned raft , u can swim and have shower under the falls , get ur fridge magnets, eat local food , have massage , little fishes come and tickle ur feet in a little pond , was Awesome , pple are soo friendly "
	},
	{
		"User": "MediciBoy",
		"Location": " ",
		"DateofReview": "October 4, 2016",
		"ReviewTitle": "Beware of this tourist trap",
		"Review": "Fees will be asked from you naturally but the moment you step inside that's where the nightmare starts and where the con begins. Sitting on a table next to the falls would cost you somewhere around 150 to 250 pesos and that is depending on who owns the tables. \r We didn't spend much time on this horrid place because it was way too crowded. We decided to take the shortcut going back up to where we are parked and to our surprise we were being asked to pay if we would like to use the short cut and the only way we will be allowed to pass there is if we use one of their picnic tables which is far from where the falls are. Unsurprisingly there's a sign on front that says passing through the short cut is free (I assume its the city government who placed it) but the business scam situated right next to the short cut stairs wouldn't allow you unless you pay or you use their tables which is around 150 pesos if I remember correctly. Again, this is a PUBLIC are and this is way too crowded with minimal facilities. So go at your own risk but personally this is rather a waste of time."
	},
	{
		"User": "jtwanders",
		"Location": "New York",
		"DateofReview": "October 3, 2016",
		"ReviewTitle": "Popular Samal Attraction",
		"Review": "We visited the falls as part of a day tour. It was pretty packed with people swimming and hanging around so we didn't stay too long. Should you visit, I'd recommend walking around to the other end of the falls which is secluded providing shade and falls without all the people."
	},
	{
		"User": "Stuart H",
		"Location": " ",
		"DateofReview": "September 23, 2016",
		"ReviewTitle": "Family visit",
		"Review": "Nothing to get excited about, a family water park with small natural pools for bathing, there are drink and food amenities on site."
	},
	{
		"User": "Kazumi S",
		"Location": " ",
		"DateofReview": "September 21, 2016",
		"ReviewTitle": "I love fresh water",
		"Review": "First , when i saw the photos on google i feel like i don't like it there but my friends wants to go to experience the hagimit falls, the fresh water ,the view and etc. and here comes the D-day. I enjoy a lot. i love the water , the view and the little cave inside the falls. It's awesome =!!!! "
	},
	{
		"User": "77Raine27",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "September 8, 2016",
		"ReviewTitle": "One of the main Attraction in Samal",
		"Review": "Locals and tourist would visit this place to swim and enjoy the falls, You would need to walk at the topmost portion of a mountain. Has several clear water flowing from the mountain. There are huts\r where you can place your things and have picnic. There are also stores inside where you buy sodas, crackers, chips, among others"
	},
	{
		"User": "KISSoulRock",
		"Location": "Manila, Philippines",
		"DateofReview": "July 23, 2016",
		"ReviewTitle": "Nature At It's Best",
		"Review": "Wonderful Place... Within Samal Island... Great for a refreshing & cool swmming experience... my Family had A Great Time."
	},
	{
		"User": "thess-rhina",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "July 20, 2016",
		"ReviewTitle": "Just quite fun",
		"Review": "Its nice place but dont go over weekend bcoz its too crowded..and dont expect much..cottage need to rent and need to pay entrance fee 40 pesos.."
	},
	{
		"User": "Aphio1925",
		"Location": "United Kingdom",
		"DateofReview": "July 18, 2016",
		"ReviewTitle": "Not much",
		"Review": "Went there thru a single motorcycle . It wasn't a good experience as i am scared of single motorcycle , but that time i dont have a choice. Saw the waterfalls and there was only a little water that flows on it at the time of my visit. Very few tourist was there and it was so quiet and we didn't even stay for more than ten minutes."
	},
	{
		"User": "MJeR",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "Overcrowded",
		"Review": "I was kinda expecting of an enchanting feeling but i just find the place overcrowded. I didnt find the long downward walk compensated by the place. I didnt find the place to be clean since there's a hell lot of people everywhere. Like everywhere. Swimming area are mostly man-made. \r If you wan' serenity, relaxed and safe swimming time, this aint the place for you."
	},
	{
		"User": "JMHerald",
		"Location": " ",
		"DateofReview": "July 10, 2016",
		"ReviewTitle": "Include this on your bucketlist when you go to Samal Island",
		"Review": "I enjoyed our visit here during our trip to Samal Island. The falls is just marvelous when you see it. You can jump on top of the falls (its not that high) but it's not recommended. The water's cold which is very good during summer. \r \r I should highlight though that you can enjoy your stay here without renting any cottages. Our group just saved P300-500 by not renting a cottage because we just placed our items on the ground. Be mindful that locals will come and will charge you of cottage fees just by placing items, or staying for a while, in a cottage."
	},
	{
		"User": "Jona A",
		"Location": " ",
		"DateofReview": "July 10, 2016",
		"ReviewTitle": "Commercialized but still got a nature feel to it",
		"Review": "Good for a daytrip. Entrance is 50 each. There is an area there that is more secluded and the water cleaner - you only need to pay P20 more. Bring your own food. Dont go on weekends."
	},
	{
		"User": "Andrew P",
		"Location": "Swansea County, United Kingdom",
		"DateofReview": "June 26, 2016",
		"ReviewTitle": "Brilliant",
		"Review": "Came here to see the falls and I had a brilliant time. The area is very interesting and a must see place for any tourist visiting. It's fun to get to and fun while your there"
	},
	{
		"User": "Michelle V",
		"Location": " ",
		"DateofReview": "June 13, 2016",
		"ReviewTitle": "Best part of Samal Island tour",
		"Review": "Best value for your PhP40 entrance fee. We were able to explore and get to different levels of the falls with the guides there for a minimal tip, but we based it on how much we enjoyed the adventure they got us into and for ensuring our safety.\r \r You may contact Kuya Jun (‪0930 981 0216‬) for your Samal Island tours (has tricycle w/c can accommodate at least 5 more passengers and a good photographer). He can include Isla Reta as your fifth destination to the standard 4 destinations(Monfort Bat Sanctuary, Hagimit Falls, Taclobo, Maxima Aqua)in the Samal Island tour. Entrance fees, environmental fees,fare to Taclobo and Isla Reta are excluded from the PhP1500 rate (as of 2016). If you wish to avail a boat for private tour of the beaches in Talikud Island, you may also ask Kuya Jun, rate as of the moment is PhP3500/boat."
	},
	{
		"User": "Atila E",
		"Location": "Izmir, Turkey",
		"DateofReview": "June 10, 2016",
		"ReviewTitle": "Excellent for swimming",
		"Review": "In Samal ,island you can spend one day here. Falls make some pools to swim. Water is quite chilly. Very good for hot days"
	},
	{
		"User": "Dan S",
		"Location": "Spring Grove, Pennsylvania",
		"DateofReview": "May 22, 2016",
		"ReviewTitle": "Excellent area to cool off",
		"Review": "The falls were a real highlight for me. I enjoyed the jumping, climbing and generally just playing in the water. It's a cool, natural spring and river and a great natural resource for the locals of nearby areas to visit."
	},
	{
		"User": "babykeaamiche21",
		"Location": "Pescara, Italy",
		"DateofReview": "May 15, 2016",
		"ReviewTitle": "Must visit in Samal",
		"Review": "When we went there on a weekday morning and we were the first ones to visit the falls. Actually we were just planning to take some pictures and not swim because me and my sister don't know how to swim well. Anyway, the kuyas there told us to swim and take pictures and assisted us. \r \r I don't know if it tends to get crowded during weekends, but I do suggest going there on weekdays and early morning. \r \r By the way there's an environmental fee you need to pay aside from the entrance fee."
	},
	{
		"User": "Pietro B",
		"Location": " ",
		"DateofReview": "May 8, 2016",
		"ReviewTitle": "Nice cool fun ",
		"Review": "Great get away from the heat. Make sure you bring some food and drinks and relax by the river with many waterfalls. Good fun"
	},
	{
		"User": "Cecilia J",
		"Location": "Geneva, Switzerland",
		"DateofReview": "May 6, 2016",
		"ReviewTitle": "Cooling waters in the heat",
		"Review": "When visitors come over to Davao City and we have time for some pleasant waterfall fun, Hagimit Falls in Samal Island is something we look forward to. We usually go to \"Mahal Resort\", which has a short cut down direct to the falls from its parking area. Though called a \"resort\", it's really just a collection of huts where you can eat and put stuff on, with a collective bathroom and toilet, as well as four airconned bedrooms with their own bathroom, good for overnights or for the day, at reasonable rates. Of course, the main attraction is the series of falls and their basins where people and kids can go swimming or just plain dunking for fun. The water is usually very very fresh, but make sure it has not rained heavily the day before or there may be too much debris being swept away by the flowing waters. There is a little store that sells some drinks and snacks; other than that, you have to bring your own food, cutlery, etc. If you're nice enough, you could request the owner (if she is around) if her staff help could buy roasted chicken in town - of course in addition to the cost of the chicken, you'll have to pay for the transportation and give a tip. In our experience, having been here several times, the falls are always fun; however, it is true as in a previous review that more and more concrete is being built, which is definitely a pity. Also, sometimes the karaoke gets too loud - but then just go into the waters with the gushing flows and you'll hardly hear the horrible noise. Nevertheless, we always leave the place in a fantastic mood."
	},
	{
		"User": "Peter19502013",
		"Location": "Davao",
		"DateofReview": "April 6, 2016",
		"ReviewTitle": "Paradise being destroyed by commercial interests ( concrete walls, fences , wire )",
		"Review": "We have visited here many times during the past few years. In most countries a natural pearl like this would be protected from development by law. Not so here unfortunately.\r One developer has constructed bigger and bigger dams by concrete. This really destroys the feeling of natural beauty. Furthermore this developer seems not friend with the guy( s) next door so they have set up fences and even wire between the falls. A bridge has been closed with gate and padlock. It is really sad to see it going this way.\r But having said all above, kids seem to enjoy to swim there."
	},
	{
		"User": "she m",
		"Location": " ",
		"DateofReview": "March 18, 2016",
		"ReviewTitle": "Hagimit falls",
		"Review": "Best of nature at no pay. I only pay for I thnk 40php entrance fee. The travel from park inn hotel would take up max 2hrs with traffic to these falls. Worth the time and money."
	},
	{
		"User": "Leydee D",
		"Location": "Samal Island, Philippines",
		"DateofReview": "March 16, 2016",
		"ReviewTitle": "Nature",
		"Review": "Affordable and cold running water. Visit on weekdays when there is no much people going. Good for big family and friends to enjoy."
	},
	{
		"User": "Mariel G",
		"Location": "Baliuag, Philippines",
		"DateofReview": "March 15, 2016",
		"ReviewTitle": "Cold running water",
		"Review": "We arrived at this place on a weekday! This is very convenient since we are the only tourist at that time. The water is clean and we only paid 20 pesos for the entrance."
	},
	{
		"User": "tainted_canvas",
		"Location": "Philippines",
		"DateofReview": "March 7, 2016",
		"ReviewTitle": "Nice side trip",
		"Review": "stayed here only for a few hours but my little girl enjoyed every bit of it. Since we are in Samal and we went on the island hopping trip, she really didn't have much time on the water because they were deep. She was wearing a vest though but still.. she enjoyed this so much. The water was good. Nice. It's still a natural body of water even though they turned it into a resort so there will still be forest-y stuff on the sides but it was still good. there are some vandalisms... but overall a nice experience. "
	},
	{
		"User": "BarryFisher",
		"Location": "London, United Kingdom",
		"DateofReview": "March 2, 2016",
		"ReviewTitle": "Great inexpensive day out",
		"Review": "Numerous small waterfalls and pools for all ages to play in. Lots of covered picnic areas for the family. A great and cheap day out.. great for families"
	},
	{
		"User": "Joy B",
		"Location": "Iloilo Province, Philippines",
		"DateofReview": "February 29, 2016",
		"ReviewTitle": "One of God's best creation! ❤",
		"Review": "We didn't swim because we had lack of time though we really want to.. people swimming there really had fun with the flows of the water.. it's really clean, clear, and cold water.. I would love going back here next time and will really swim. Wew! "
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "February 25, 2016",
		"ReviewTitle": "Take a deep breath",
		"Review": "Relax, unwind and feel the cool taste of nature. When on Samal Island, the Hagimit Falls are a must."
	},
	{
		"User": "Jay S",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 25, 2016",
		"ReviewTitle": "Most Underrated Place in Samal",
		"Review": "I went here twice but dont let the tiring long stairs upon entry fool you. My first visit was awful because it was packed and a lot of people were smoking. \r \r The second visit, however, was nothing short of revitalizing. We went in early around 6 in the morning and came in at the new entrance but to a lower level. They just opened and you could see how surprisingly safe to walk on rocks because they take out the moss cleanly. \r \r I was even able to swin for 2 hours because of how refreshing the water was and how convenient some parts are due to the natural shade of trees.\r \r I will be back. That is a promise. "
	},
	{
		"User": "Angela M",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 12, 2016",
		"ReviewTitle": "Nature + Lanscaped",
		"Review": "accessibility -good via habal-habal view - good. nothing unusual. amenities - fair. with cottages etc. Compared to other falls, this fell short in meeting my expectation. Maybe because most part were already landscaped and there are areas where the water are already stagnant."
	},
	{
		"User": "GraceJ1",
		"Location": " ",
		"DateofReview": "February 10, 2016",
		"ReviewTitle": "Exploring ",
		"Review": "Thiers no words to say it's a beautiful place love to come again it's very affordable and amazing place"
	},
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "February 9, 2016",
		"ReviewTitle": "Beautiful location spoiled",
		"Review": "Hagimit falls is OK. But why did they have to spoil it with so much cement? It's a lovely place... so tranquil. Why spoilt it by cementing-in a wonderful, natural place? But it's still nice for a refreshing swim in cool water, I guess. Just...More"
	},
	{
		"User": "Kates A",
		"Location": "Cavite City, Philippines",
		"DateofReview": "February 9, 2016",
		"ReviewTitle": "Close to nature",
		"Review": "What i like about Hagimit is the size of the area. There are smaller cascade of falls and multi-layered natural pools. Some parts are dirty due to leaves, rotting branches and water seems stagnant and murky but to be fair, that's how nature goes. I...More"
	},
	{
		"User": "Jonamarie S",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 6, 2016",
		"ReviewTitle": "Beyond expectation",
		"Review": "It's my friends first time in Mindanao, it's all our first time in Hagimit. What welcomed us was beyond what we were expecting. What a wonderful creation of God. We all kept FALL-ing in love with the place. Falls after falls.. wahhh. We cancelled out...More"
	},
	{
		"User": "Jake2014jake",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 4, 2016",
		"ReviewTitle": "Being one with nature is easy here!",
		"Review": "Imagine the sound of flowing water, of cascading water, relaxing, soothing. Imagine lush trees and vegetation, where you can either lounge and rest and have a picnic, or walk around and feel closer to nature. This is what you will find when you visit Hagimit...More"
	},
	{
		"User": "Yna Clarissa F",
		"Location": " ",
		"DateofReview": "February 3, 2016",
		"ReviewTitle": "Amazing 1",
		"Review": "We went there August last year,and I told you guys it was so amazing,cooling and relaxing place. My kids are very amazed too."
	},
	{
		"User": "Christine Joy M",
		"Location": " ",
		"DateofReview": "January 28, 2016",
		"ReviewTitle": "Not as beautiful as you see in pictures ",
		"Review": "Or maybe we were there on the wrong season. Or maybe there could just be so much people on one place at the same time. Or maybe because I've been to better looking falls. Nevertheless it was still beautiful but did not meet my expectations."
	},
	{
		"User": "Edlyn A",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 13, 2016",
		"ReviewTitle": "Adventures!!!!",
		"Review": "I really love this place ... My brother and my sister was so delightful because I took them to this place. This place is very perfect for family and friends... 😍😍"
	},
	{
		"User": "Marga A",
		"Location": " ",
		"DateofReview": "January 8, 2016",
		"ReviewTitle": "Hmmm",
		"Review": "Chlorinated-man-made place. I was expecting more but it didn't really deliver. It's not what I expected and a bit dirty. I could smell chlorine in the water which was super weird."
	},
	{
		"User": "Mikas101",
		"Location": "Singapore",
		"DateofReview": "January 5, 2016",
		"ReviewTitle": "Multiple Falls & Multiple Pools",
		"Review": "It is a unique place and experience to behold, as one enters the waterfall park. There is a long trek; roughly 500m-1km from the car park to the main swimming areas, but the Government did a great job of cementing steps and there is a ramp which makes it easier. Get ready for some cardio so that your body gets warmed up for the cold plunge in the waterfalls. We took a stroll around the park before going to the main section where everybody was and had a great time enjoying the scenery.\r The place also has multiple pools for you to swim in and its scattered around so despite there being a lot of people, it does not feel packed. Its unique also that it is in a sense not just one single plunge waterfall but a bunch of them scattered around due to the nature of the river and streaming of the water. And as all Filipino public parks, one can cook or bbq there, but they did a great job in separating it from the main pool areas. There are acceptable changing facilities and toilets there. \r \r Entrance fee:P40\r Cottage/Table Rental: P150-P250"
	},
	{
		"User": "Ralph S",
		"Location": "San Antonio, Texas",
		"DateofReview": "December 21, 2015",
		"ReviewTitle": "Wow, what a nice surprise!",
		"Review": "The park is about a 10 minute trike ride from the Babak Port which you reach from the SaSa Port in Davao. You can catch the \"banka\" people boats from the Sasa Palenke (market), or the big car ferry from SaSa port. The fare is only 10 piso each way. Once you get to Babak take a trike to the park is about 250 piso (foreigner price ;) . After you enter the park it's about a 5 minute walk down the hill to the falls. The falls will leave you amazed. You can rent a table for 150 piso or a nipa hut for 250 piso. The locals sell beer and soft drinks, no need to bring your own. The toilets are in good shape. You can rent a hut for overnight for 600 or 1000 piso, but no electricity...No swimming after 5pm, so why bother staying there overnight? The walk back up the hill is good exercise...lol The place is crowded on holidays according to the very friendly local workers. We look forward to our next trip back in the new year."
	},
	{
		"User": "Rexoy",
		"Location": "Davao",
		"DateofReview": "December 12, 2015",
		"ReviewTitle": "A good place to end the day",
		"Review": "After going around samal in a hot and sunny day its a good idea to end it at hagimit falls by dipping in its cool water and have a relaxing or rather a hard hydromassage! Be prepared for a bit of long walk downhill and back uphill!"
	},
	{
		"User": "Adventurer996",
		"Location": "Tampa, Florida",
		"DateofReview": "December 5, 2015",
		"ReviewTitle": "Beautiful falls",
		"Review": "I only had a short time there, it started raining but it is well worth the entrance fee! You can eat, drink, and swim"
	},
	{
		"User": "calub m",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "December 2, 2015",
		"ReviewTitle": "A natures way to massage",
		"Review": "We did not expect that hagimit falls are composed of several layers of torquise cold water. You can occupy any spot where you can enjoy more the falls. We did try 2 spots where it is not too deep. then the other one where you can swim and jump from the stones :D what i did not like is that there is this area \"Mahal kita Resort\" they have a gate which is open to public. But when your inside and used their \"Balsa\" you have to pay them. We did not notice the sign, but we were dis appointed how they treated visitors/tourist they locked the gate prohibiting us to transfer the other side of the falls. And what they advised was for us to just cross the gate \"over the bakod\" how come they were too lazy to open it for us. "
	},
	{
		"User": "Harvey T",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 24, 2015",
		"ReviewTitle": "Nice Surprise!",
		"Review": "I heard about Hagimit for quite a while now but I visited the place just recently for the first time. My expectation was low and it was an unplanned visit. Time of visit was really early in the morning, around 7AM, and we are few of the first guests to arrived.\r \r Our plan back then was just to see the place and take some pictures. No plan of taking a dip at all because we are heading to the beach. Our short trip to the falls ended up with staying for 3 hours of taking pictures and swimming on its small lagoons. The water was clear and the lagoons have the hues of torquise to blue. Water is cold and very refreshing.\r \r The area is a bit small so I imagine it can get crowded during weekends. I hope the management will limit the number of heads who can visit to maintain its cleanliness and damage to nature will be controlled. Entrance fee is P40.00."
	},
	{
		"User": "Morris Adelon A",
		"Location": " ",
		"DateofReview": "November 23, 2015",
		"ReviewTitle": "Multi Flowing Falls",
		"Review": "Exotic place were you can stay to enjoy a relaxing dip. Experience the cave behind the falls and jump off the deep part. Ask for assistance with the locals they are glad to assist. Tables with shade are available for your convenience. Remenber water is cold."
	},
	{
		"User": "MarieMarc2014",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "November 23, 2015",
		"ReviewTitle": "Get in touch with Nature",
		"Review": "I love the sound of the rushing water. The cleanliness of the place. The people are nice and accommodating. A true beauty."
	},
	{
		"User": "Nickate N",
		"Location": " ",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "Great view and clean falls",
		"Review": "huge places to walking around clean water and very clear , nature friendly , quiet and very comfortable . Relaxing and nice view and lots of cottages u will be stay and accommodating also."
	},
	{
		"User": "Elmo B",
		"Location": "Manila, Philippines",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "Miniature Falls Worth A Glimpse For Those Who Have Not Seen One",
		"Review": "For those who haven't seen a tropical waterfalls or any waterfalls, Hagimit falls would interest you. Perhaps around 12 feet on the tallest one. The premises also offers cottages and picnic tables. A few people we saw taking a dip on the water. A few houses around the falls a bit an eyesore. There was also a resident dog loitering."
	},
	{
		"User": "alinebuizon",
		"Location": " ",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "Hagimit Falls",
		"Review": "A must-see in Davao, Samal Island. Though far from the city but you will enjoy the boat ride and the habal habal ride from Sasa Wharf to Penaplata. You will wonder where the water is coming from. There are layered of mini falls aŕranged magnificently. Amazing work of nature. You can choose your own spot and get a self massage in the falls."
	},
	{
		"User": "jed1017",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "October 28, 2015",
		"ReviewTitle": "Nature Trip!",
		"Review": "Nice falls.. There are many people when we went there but we still enjoyed the view. Just be prepared for a long walk."
	},
	{
		"User": "Jameson L",
		"Location": "Antipolo City",
		"DateofReview": "October 3, 2015",
		"ReviewTitle": "Nature's plus",
		"Review": "Hagimit falls is a very refreshing place to visit. With its multiple 'mini' falls to look at and experience. Although the place, just like other places, has its pros and cons. If you are a senior citizen you'll have difficulties navigating its long steep stairways. But if you're adventurous enough this place is worth trying."
	},
	{
		"User": "Mars_Hilario",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 30, 2015",
		"ReviewTitle": "Falls In Love",
		"Review": "A good side trip there is the waterfalls hidden in the forest. We walked almost 1 hour and we walked 10 minutes to visit Hagimit Falls. It’s one of Samal Island’s great natural sights and worth the effort, just enjoy the trek as it is a really trek to nature.\r \r For the nature lover, you can spend your day here with a grilled meat with an ice-cooled beer while enjoying the cool-breeze of nature. Chillax!\r \r I love the place, small but terrible!"
	},
	{
		"User": "Vince M",
		"Location": " ",
		"DateofReview": "September 24, 2015",
		"ReviewTitle": "It speaks eloquence of Nature",
		"Review": "It is a unique place to see, enjoy and take a plunge. It is in the heart of Samal Island which offers fresh water dips for the whole family."
	},
	{
		"User": "Anna May V",
		"Location": "Pasig, Philippines",
		"DateofReview": "September 19, 2015",
		"ReviewTitle": "Cool Waters, Great Views, Simple Amenities",
		"Review": "Entrance is 40p, there are a fair number of steps to descend (and climb back up later). Cottages range from 100- 250. I suggest you rent one, otherwise you will be charged 10p per use of the restroom, changing room, open shower.\r \r This soured my experience a bit, since we settled on an unmarked cottage (no fees posted anywhere), and before leaving a lady approached us and wouldn't budge until we paid her at least 100p, else she would charge us for each use of the facilities.\r \r Other than that, the views were great (you can't take a bad photo), the water cool and refreshing. The rocks are a bit slippery, but there were life guards and there are life vests for rent. You can also ask for services of a guide to assist in deeper waters.\r \r I'm still glad we went, and might even return when in the area."
	},
	{
		"User": "robmaghinang",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "September 12, 2015",
		"ReviewTitle": "Reconnect with nature.",
		"Review": "Just visited Hagimit Falls yesterday on a solo backpacking travel. Here's the rundown:\r \r The upside:\r \r 1. Easily accessible from prime tourist spots via motorcycle. \r 2. Raw beauty of nature with some modern amenities and electricity but don't expect too much.\r 3. Cheap entrance fee of Php 40 (less than US$1).\r \r The downside:\r \r 1. During my stay, I don't see much uniformed security personnel or life guards roaming around.\r 2. Rocks could be very, very slippery. If you see it green, test it first for moss that make things a bit dangerous to step on. Be wary of the color of water, the bluer the deeper and the holes could just be right beside you.\r 3. Needs maintenance."
	},
	{
		"User": "Ramon F",
		"Location": " ",
		"DateofReview": "September 5, 2015",
		"ReviewTitle": "You shall not pass!!!",
		"Review": "Thats right, you pay the first entrance at near the road, the second approaching the resort. After that you descend down the falls,so i took the left, theres this lady who greeted us with \"cottage\" for stay, we said no because we'll just take pictures and we're backpackers, after that we decided to take the same path back to exit, this woman told us we are not allowed to go through there anymore, so we where confused, she said we didnt rent her a cottage and we cannot have access to that exit, she said we should take the long hike to the exit, so we did, beware of that woman, shes like gandalf, and oh by the way the area is not great, vandalism on some rocks, water not that special, not clear, EVERYTHING IS A RIP OFF..."
	},
	{
		"User": "Vanessa G",
		"Location": "Manila, Philippines",
		"DateofReview": "September 2, 2015",
		"ReviewTitle": "Breathtaking but so many people",
		"Review": "Falls are really breathtaking as there are a lot of areas to swim. However, some are really deep and needs to be cautious. Lots of locals come here so expect a lot of people."
	},
	{
		"User": "Berna T",
		"Location": "Las pinas",
		"DateofReview": "August 25, 2015",
		"ReviewTitle": "Needs proper maintenance",
		"Review": "Going to hagimit falls is an easy 30 to 45mins habal-habal ride from pearl farm. It could be very hot on your way so a sunblock will surely be a lot helpful. I advice that going there you should be in your swim wear because the place doesn't have a decent area for changing. It will be a lot ease that you'll just have to dive in those inviting waters upon arriving. Yes, it could be a hot day going there, but the comfort of diving in the cold hagimit falls could be really refreshing. The waterfalls is clean, maintained and with quite a number of lifeguards you could pay to accomodate overseeing your swimming children if you decide not to swim for a minimum fee. They Also provide rentals for life vests so if you are not a good swimmer you'll feel confident jumping in. I am amazed at how they were able tomaintain the waterfalls area free from vandals but I however feel sad that the area going to the main waterfalls fell short of my expectations. The waterfalls is located about 500m walk down a cemented stairs which in my opinion has ruined the total nature feel for the place. Although, I guess this set up has helped a lot of senior citizens in reaching the place but I'm thinking of using other materials for a stair than having it cemented. It also saddened me that there were vandals in different areas that I almost didn't want to finish the trip. Luckily we finished and it was worth it. My children enjoyed their dip."
	},
	{
		"User": "RickN6900",
		"Location": "Los Angeles",
		"DateofReview": "August 20, 2015",
		"ReviewTitle": "Nice place to visit on a hot afternoon",
		"Review": "Nice relaxing place but quite a few steps down and of course, back up. Water was brisk and the falls are nice. Great place to go with a group for a picnic or bbq."
	},
	{
		"User": "Bygz P",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 10, 2015",
		"ReviewTitle": "Excellent place to Relax and to have a Massage from the Nature",
		"Review": "If you're wanting to have a break that is exciting but as the same time relaxing, then I guess this place is right for you! you can actually go to this place just by renting a \"Habal-Habal\" motor - a single motor that cost 100...More"
	},
	{
		"User": "Audreeadjel",
		"Location": " ",
		"DateofReview": "August 5, 2015",
		"ReviewTitle": "HAgimit falls",
		"Review": "We rent a habal habal (single-motor) for 100 pesos each inclusive of back and forth going to hagimit falls dont know if its expensive for the fare. We have no intention in dipping as we want only to explore. Main entrance is 40pesos and far...More"
	},
	{
		"User": "Vsevolod L",
		"Location": " ",
		"DateofReview": "July 27, 2015",
		"ReviewTitle": "Strange",
		"Review": "This is a strange place. I wouldn't call it waterfalls since it is basically stones that water runs over and eventually falls for some meter. The water is nice to swim in and chill for a while, but there is not much really to see....More"
	},
	{
		"User": "bernzepol",
		"Location": "Bournemouth",
		"DateofReview": "July 20, 2015",
		"ReviewTitle": "Fantastic!",
		"Review": "Yes, from a great nature lover it was fantastic. There were 3 levels of waterfall. With the help of the guide, manage to climb up there. Stairs were a bit rickety, but its part of the fun. They are currently making improvements on the site...More"
	},
	{
		"User": "SGregersen",
		"Location": "Kalundborg, Denmark",
		"DateofReview": "July 4, 2015",
		"ReviewTitle": "Great fun",
		"Review": "From the parking area we walked along a number of tiny falls, where the local kids were playing and having e great time. The peak of the trip was the wide 8m tall fall, where lots of people enjoyed life in and out of the...More"
	},
	{
		"User": "Dragon51",
		"Location": "Jersey, British Isles",
		"DateofReview": "June 30, 2015",
		"ReviewTitle": "Overcrowded and Underwhelming",
		"Review": "It was school hols so I guess a place like this will be overcrowded, but I guess my friend's son had a thoroughly good time. I found it underwhelming being quite dank humid down there and the hundreds of steps down (well possibly an exaggeration)...More"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 28, 2015",
		"ReviewTitle": "Beyind the beach",
		"Review": "Samal Island is not all beach. Hagimit is one of their popular inland attractions. The area is composed of various pools where the waters cascade into, so you can find your own spot to enjoy Hagimit. Takes some short hiking to get to the llace...More"
	},
	{
		"User": "ANNann00",
		"Location": "Philippines",
		"DateofReview": "June 21, 2015",
		"ReviewTitle": "Nature's beauty",
		"Review": "This is the first time i came around the falls and it was awesome, makes you appreciate what the nature can do. The falls are small but so refreshing and clear. Be ready to jump on the water!"
	},
	{
		"User": "vardkeem",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "June 18, 2015",
		"ReviewTitle": "mini waterfalls, around 2 meters",
		"Review": "PROS- cool waters after the beach and near from the road CONS- shallow water and small waterfalls, no place to buy food and drinks"
	},
	{
		"User": "Elliot P",
		"Location": "Caloundra, Australia",
		"DateofReview": "June 17, 2015",
		"ReviewTitle": "Just awesome",
		"Review": "Clean and full of things to explore. Plenty of places deep enough to dive into. Also has a secret cave behind one of the waterfalls that's cool to go into. Good fun to travel from one end to the other through and up the falls if you are daring ☺"
	},
	{
		"User": "Len V",
		"Location": "Manila, Philippines",
		"DateofReview": "June 4, 2015",
		"ReviewTitle": "Relaxing and refreshing....",
		"Review": "Away from the hassle and bustle of city life and yet not too far to go.. The sound of water falling is so relaxing.. so clean and refreshing.. I always enjoy nature..a paradise to my eyes...The staff are helpful and the entrance fee is just minimal.. Good for family getaway for a day!!!"
	},
	{
		"User": "lytzfmarchan",
		"Location": "bacoor",
		"DateofReview": "May 28, 2015",
		"ReviewTitle": "nothing fancy- smaller than other falls",
		"Review": "not much space for lounging or sitting and less activity. too many people when we were there so we stayed for less than an hour and left."
	},
	{
		"User": "joann c",
		"Location": " ",
		"DateofReview": "May 19, 2015",
		"ReviewTitle": "fresh water to bath with",
		"Review": "this is a public local camping/outing park. it cost 50 pesos per person to get in the park. It is not handicapped friendly. the walk down to the spring can be slippery when it's raining. This place is still not develop. a little walk up the park and we see where the water came from. there is another 10peso per person to swim closer to the spring."
	},
	{
		"User": "KB D",
		"Location": " ",
		"DateofReview": "May 13, 2015",
		"ReviewTitle": "Nice trek, cool falls, worth visiting! ",
		"Review": "My buddy and i arrived late in the afternoon so as soon as we got off the habal-habal (motorcycle) we dashed downhill to the falls (entrance fee is 40 pesos). It was a pretty sight! Several low to medium-height falls are in the area that feed five to six feet cool pools. Huts line the falls where visitors can have picnic and karaoke. There's resorts available in the area should you wish to stay overnight. Must never miss this when in Samal Island! "
	},
	{
		"User": "MrDestiny",
		"Location": "Sydney, Australia",
		"DateofReview": "May 11, 2015",
		"ReviewTitle": "Another natural place \"improved\" with concrete paths",
		"Review": "It would be nice if places like this used more natural products that blend in with the environment, rather than overdosing with concrete everywhere. So I had to use my imagination to think what it must have been like originally before it was turned into a money making operation.\r There was quite a crowd there when we visited, I think I was the only foreigner, and the locals were enjoying themselves in the various pools. I couldn't help but see many potentially dangerous spots and wouldn't be surprised if there had been accidents there, especially as many Filipinos don't actually know how to swim.\r The other thing I noticed was a lot of trash, such as plastic water bottles strewn around on the ground, and also to a lesser extent in the water.\r It must have been a beautiful place once upon a time."
	},
	{
		"User": "nheesa",
		"Location": " ",
		"DateofReview": "May 1, 2015",
		"ReviewTitle": "Nature <3",
		"Review": "I went here last Feb2011 and it really changed a lot. Fair enough because there are a lot of tourist who enjoyed going there. The entrance fee is Php40 the habal-habal ride is about Php 80-100 depends on where you are from.\r If you love nature then this is one of the best places to go when you visit Samal. \r  There are signs that you can't dive but we are just as hard-headed as the others. :) it's a very fun experience."
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 27, 2015",
		"ReviewTitle": "The top part of the falls is the best",
		"Review": "the top part of the falls is the best. There is almost no people over there. it is more a nature experience over there. down the falls it is more concreted and more busy. there are also ATV's for rent and for people that want to go to the highland this is a good starting point."
	},
	{
		"User": "Lim P",
		"Location": "Makati",
		"DateofReview": "April 19, 2015",
		"ReviewTitle": "Not A Waterfall at all!",
		"Review": "This place is touted as a waterfall but to me it is not a waterfall. I have seen better waterfull in other parts of the world. There are so many people swimming there and the water so dirty. You have to climeb a rather steep stairs to get to the top and make your way down. . water pring"
	},
	{
		"User": "niquedejesus",
		"Location": "Manila, Philippines",
		"DateofReview": "April 10, 2015",
		"ReviewTitle": "Refreshing and amazing",
		"Review": "Entrance fee: Php 40 per head\r Table with umbrella rental: Php 150\r \r It is located inside the Hagimit Nature Park where several resorts/area owners can be found. There are cottage rooms for overnight stay too. Our tricycle driver brought us to this part of the park where you need to pay Php 150 to use their table. We weren't supposed to rent one, but I found the area so pleasing for lunch so we decided to buy lunch and eat there, by the falls. So refreshing. The owner was so kind and asked our driver to buy lunch for us. He said he can get Sugba (grilled fish), it's just perfect! I gave him P300. He came back with 2 big pieces of RAW bangus (milkfish) and some tomatoes, onions, calamansi, chilies and uncooked rice. I was shocked as I thought I was already waiting for a cooked lunch. The owner offered to grill it for us though, no charge.\r \r While waiting for lunch, we swam in the refreshing river. The other owner offered to take photos of us, lots of photos. When lunch was served, we devoured it like crazy! Sans the utensils. It was a lunch serving big enough for four to five people for only Php 300. How fun! It was one of the best lunch of my life!\r \r Check out the full itinerary of our Samal trip at\r http://www.moniquedejesus.com/2015/04/samal-island-davao-in-three-days.html"
	},
	{
		"User": "Roseann G",
		"Location": "Calamba, Laguna, Philippines",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Be sure to bring your swim suits! ",
		"Review": "As much as we wanted to take a dip, we lacked time. Instead, we just toured around, take pictures and yes, we did have fun. Its a bit tiring specially going back to the parking area. Its an uphill challenge for us. It is nature at its finest. Two thumbs up for this place, its a must visit. "
	},
	{
		"User": "Jim B",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 11, 2015",
		"ReviewTitle": "Nature at its finest",
		"Review": "While visiting Samal Island, my fiancé and I decided to visit Hagimit Falls. Let me tell you, if you love nature, beauty, refreshing water, a photographer's heaven, then you will love Hagimit Falls. For a small fee, p40, you can enter this beautiful paradise. We spent several hours photographing the beautiful scenery, swimming in the pools, and walking around. I would definitely recommend this attraction to anyone visiting Samal Island. But rather then pay a resort's fee of up to p3,000 you can catch a tricycle to and back for about p400. Spend the day swimming and soaking up nature at its finest."
	},
	{
		"User": "grace175",
		"Location": "Davao del Norte Province, Philippines",
		"DateofReview": "March 10, 2015",
		"ReviewTitle": "GOOD HIDE OUT",
		"Review": "From a demanding city to a nonviolent place in hagimit.. just very relaxing, stresses are gone.. expenditures are affordable!! ^_^ ..such a wonderful treasures in Davao. =))"
	},
	{
		"User": "joy t",
		"Location": "Cebu City, Philippines",
		"DateofReview": "March 2, 2015",
		"ReviewTitle": "good for a change",
		"Review": "we brought roast chicken and ate it there...we spend half of the day just swimming and head back to the resort.. we enjoy it and we like the place"
	},
	{
		"User": "yasameen_desu",
		"Location": "Manila, Philippines",
		"DateofReview": "February 23, 2015",
		"ReviewTitle": "Great for nature lovers!",
		"Review": "We dropped by Hagimit Falls on our way from Kaputian Beach to Camudmud. Our habal driver suggested for us to visit the place and we figured it wouldn't hurt to have a quick look. We were not expecting anything and quite honestly we just wanted to be in a cool place after a long and hot drive. Upon arriving, we were told that a 40php fee for entrance is required per person for a day tour and if we wanted to get a cottage, there would be a separate fee for it. We told the lady at the entrance counter that we'll just have a quick look.\r \r There is a comfort room for no fee inside the premises. If you are not that physically active, walking down and up the cemented staircase might be exhausting. But if you're a mountain climber and runner, going to the falls is like a walk in the park.\r \r I've seen some falls before so my friend and I were expecting just one Falls spot but Hagimit is like a series of different falls. There are several spots and cottages around the area. It would have been great if we were able to stay for a quick swim. The place is really cool, water is cold and refreshing. Definitely worth the 10-15 minutes side trip from the main road/highway!"
	},
	{
		"User": "ljdinbelize",
		"Location": "San Pedro, Belize",
		"DateofReview": "February 19, 2015",
		"ReviewTitle": "Beaufiful scenery",
		"Review": "Great sight to see, lots of stairs but well worth the walk. Take bathing suit as you may wish to swim."
	},
	{
		"User": "Aimorosa",
		"Location": "Manila, Philippines",
		"DateofReview": "February 18, 2015",
		"ReviewTitle": "Relaxing stop after a hike",
		"Review": "this is a good spot to have a breather in the island.. as you approach the area you can hear the inviting flowing water from the falls. the view is spectacular, the water is so relaxing. we did a trail run at the island and this is one of the stops we made. \r it's worth it!"
	},
	{
		"User": "daveg7964",
		"Location": "Haverhill, United Kingdom",
		"DateofReview": "February 12, 2015",
		"ReviewTitle": "Travel from paradise resort by motorcycle",
		"Review": "Staying at paradise or other resorts, you can take motorcycle or car to the waterfalls take a picnic with you the water was clear and very refreshing (cold) although best to avoid after rain as water is very muddy, lots of locals there nice to mingle its free but if you take car/jeep then you need to pay a small fee"
	},
	{
		"User": "PrincessVictoriaK",
		"Location": "Raleigh, North Carolina",
		"DateofReview": "February 4, 2015",
		"ReviewTitle": "It's just an average place to bond with family.",
		"Review": "If you are like me who wants to visit different places, better include this with your adventure. We go there cause my mother knows one of the owner and we like to relax away from the city."
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "January 31, 2015",
		"ReviewTitle": "I expected more",
		"Review": "Going there with habal habal is too expensive. And: rough road. Falls are good looking - a kinda romantic atmosphere. Everything just average."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "January 13, 2015",
		"ReviewTitle": "Road to the place is bumpy.",
		"Review": "The falls is not as high as we thought about waterfalls.\r \r  Yet there were a lot of similar low waterfalls scattered within the area. To go down the place took us less time; but was thinking how could it be in going back. It was a high steep staircase, and so one has to make stops i getting back up to the parking area."
	},
	{
		"User": "Mary Ann F",
		"Location": "San Juan, Philippines",
		"DateofReview": "January 1, 2015",
		"ReviewTitle": "Rocky Road",
		"Review": "Going to Hagimit falls is not worth to try. The habal habal charge is expensive and nothing special to see in this place. Rough road all the way from Pearl Farm to Hagimit Falls"
	},
	{
		"User": "Venus66_08",
		"Location": "Valencia City, Philippines",
		"DateofReview": "January 1, 2015",
		"ReviewTitle": "Not as expected",
		"Review": "I found the place truly wonderful and amazing but it was not what I expect because the water was not clear maybe because of the rain, so disappointing to see a color brown water but the falls is so good looking."
	},
	{
		"User": "Jong V",
		"Location": "Lauderdale Lakes, Florida, United States",
		"DateofReview": "October 7, 2014",
		"ReviewTitle": "love of nature",
		"Review": "its a little bit remote place but very nice, Dislike- there was no signage on the enter section showing the location of the falls."
	},
	{
		"User": "TravelBug1469",
		"Location": "Manila, Philippines",
		"DateofReview": "September 22, 2014",
		"ReviewTitle": "Nature Adventure",
		"Review": "Far from the likes of great waterfalls but a good nature adventure no less. Made up of many small falls one after another - cascading down rocks, boulders, and natural terrain along a river - Hagimit is ideal for swimming with its cold, refreshing, and not so deep water. There's lot of fun walking above and hopping between rock formations. Foot bridges are available in some areas. There are cottages and umbrella for guests but no decent food available. Confusing was the rate because except for entrance fee, numerous 'rights' claimants of land along the river bank collect 'fees' each time you hop from one place to another. Better plan your trip; bring anything you need and stay where it is most convenient to you.\r Unfortunately for us, we never had the chance to swim; the water was highly silted when we went there because of heavy downpour the night before.\r Take a motorcycle (habal-habal) from the resort (where you stay) anywhere in Samal Island and tell driver to bring you to Hagimit. Make sure to arrange for two-way ride since the place is remote and no regular transport going there. From Davao City - with own vehicle - head southeast on Davao-Bukidnon Road (Pan Philippine Highway) towards De Lara Street then turn left onto Mac Arthur Highway all the way onto Buhangin Underpass then turn right towards Davao-Panabo City Road until you reach the ferry terminal going to Samal Island. After disembarking off the ferry, drive straight from the port then turn left towards Babak-Samal-Kaputian Road, Take the first right along Babak-Samal-Kaputian Road then turn left going to Hagimit."
	},
	{
		"User": "hopper28",
		"Location": "Cagayan de Oro, Cagayan de Oro, Philippines",
		"DateofReview": "September 3, 2014",
		"ReviewTitle": "small but amazing",
		"Review": "upon reaching the entrance of the falls, one would say \"is this all?\". following the 500m trail, however, and then finally reaching the series of falls, one would be truly amazed by how the true nature of the falls were. i mean, there were no major renovations done by the resort owners that I truly appreciate that they did not do something to the nature.\r \r the little falls are an enjoyable scenery & once you hop into the water, one would not worry to drown because its like 4-5ft water level (except of course for water level near the fall-its around 7ft they say)"
	},
	{
		"User": "nike0608",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "August 23, 2014",
		"ReviewTitle": "Ok",
		"Review": "I was not really a fan of the place. I think due to the storms that hit before our trip there, the falls is not as good as it used to be. However, it was a great way to bask in the cold water after touring the whole island under the heat of the sun. Refreshing but I expected better. "
	},
	{
		"User": "rubberunethical",
		"Location": "Dubai",
		"DateofReview": "August 10, 2014",
		"ReviewTitle": "Tho we paid both lower & higher entrance fees, caretaker hostility",
		"Review": "When we tried to exit the campers' only route after a quick tour. Pretty place but crowded and unfriendly this time."
	},
	{
		"User": "MelP160",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 7, 2014",
		"ReviewTitle": "Go early and avoid the crowds",
		"Review": "We went at 8 am to this popular attraction to beat the crowd. We found a nice spot and just lay down on the rocks. Bliss- feeling the water wash over our bodies."
	},
	{
		"User": "Wam R",
		"Location": " ",
		"DateofReview": "July 2, 2014",
		"ReviewTitle": "Try jumping off the cliff and down the falls!",
		"Review": "It had been an wonderful experience! Try jumping off from the top of the falls down like what my friends and I did, and I'm sure you'll enjoy it here. The only thing that made me not rate this as excellent is the long walk (upwards) that we had to make to get there. But over all it was awesome!"
	},
	{
		"User": "Christine D",
		"Location": "Makati, Philippines",
		"DateofReview": "July 1, 2014",
		"ReviewTitle": "Could be better",
		"Review": "The water falls are unique and have their beauty. I just wish the diversity of the place is better preserved to be appreciated more by humans. We came there at the peek of the holiday, hence there were a lot of people in the area. A lot of rules were not being followed by the locals like \"no diving\" but a lot of diving were made by the locals. Well can't expect much for a Php20 entrance fee. Saw a water lizard speeding off on top of the \"quieter\" side of the falls."
	},
	{
		"User": "Richard C",
		"Location": " ",
		"DateofReview": "June 17, 2014",
		"ReviewTitle": "Useless water falls",
		"Review": "Went to visit this \"water falls\", paid 40 pesos for each person to enter. It is a self guided tour yourself type. Why pay if no one cares to tell you where to go. There are signs if that is fine with you. There was a restroom but padlocked. Why even bother putting a restroom if your not going to let anyone use it. Terrible place... surely a waste of time and money. You better go somewhere else usefull."
	},
	{
		"User": "wyn0nna",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 8, 2014",
		"ReviewTitle": "perfect for hot summer",
		"Review": "never a fan of falls until i've seen the place. i don't know how to swim so i have to consider its depth. good thing there are places there where we can enjoy"
	},
	{
		"User": "DON9260",
		"Location": "General Santos, Philippines",
		"DateofReview": "March 15, 2014",
		"ReviewTitle": "Samal trip",
		"Review": "the place is cool and beautiful... me and my friends really enjoyed the place... we really had fun and wish to be back here again..."
	},
	{
		"User": "summer q",
		"Location": "Manila, Philippines",
		"DateofReview": "March 15, 2014",
		"ReviewTitle": "So serene!",
		"Review": "i stayed long in this place though it was just a day tour.but it's really great.i took a lot of pictures and did some crazy activities there.this is a must-see place."
	},
	{
		"User": "TangAdrao",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 21, 2014",
		"ReviewTitle": "Worth Weekend Getaway",
		"Review": "HAgimit Falls is located in Penaplata, Samal Island. Like any other local nature attraction, it doesn't have much to offer other than its little falls with its layered natural basins that always make everyone captivated. It is surrounded with dense trees making the experience more like in the middle of a jungle. It's difinitely a one worth destination for family or for anyone searching for a place to be one with nature. One can actually trekk up and find tree house with breathtaking views of the forest. It has some cheap cottages and the entrance fee is just cheap as well.\r \r Bring your own food when planning to spend your lunch or dinner there. The place is quite far from panaplata market so it's more hassle free if you bring food before going there."
	},
	{
		"User": "AGV_1419",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "January 28, 2014",
		"ReviewTitle": "Waterfalls bringing you closer to nature.",
		"Review": "From 40php/person we were given a 50% discount because the river was a lil murky as it rained two nights before.The trail leading down to the waterfalls is about 3-5 minutes walk, so bringing a lot of stuff with you is not really ideal. From the end of the trail you could already see one of the many small waterfalls. There are bamboos and full-grown trees, so you'd feel more closer to nature. :) It separates/split into two as water flows downstream. It's like a ladder of waterfalls of different heights (approx 2 ft to 7 ft) creating natural swimming pools (4ft to 7ft according to the caretaker). There are open cottage and close huts/rooms for rent. If your looking for a side trip or day-tour or picnic venue, I recommend this place. Think twice though if you are planning to bring your young children with you or those who have problems with their knees/knee joints.\r \r *From Davao City ride the City Island Tour Bus going to Samal Island/Kaputian, ask the conductor to drop you off in Penaplata. From Penaplata, ride a habal-habal 20php, one-way, per person."
	},
	{
		"User": "Dee G",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "September 26, 2013",
		"ReviewTitle": "Used to be so Beautiful",
		"Review": "We used to go to Hagimit Falls with friends some 9 years ago. It used to be so beautiful. The beauty of the place was not with the falls, but with how secluded it was. There was no entrance fee, no cottages and no stores. The road was not developed too, but again, it was these that made the whole experience fun.\r \r Now, they turned the falls into some sort of resort. Guests have to rent cottages and there's an entrance fee. On weekends, there's a lot of people so expect noise and (maybe) chaos. \r \r If you want to spend the day relaxing, head to a beach instead. I suggest Talicud Island where Leticia by the Sea is. The resort's to die for - excellent for both body and mind. \r \r Here's a helpful article about Talicud Island - http://tropicalvacationspotsblog.com/why-talicud-island-at-davao-city-is-worth-a-trip/"
	},
	{
		"User": "My26",
		"Location": " ",
		"DateofReview": "September 14, 2013",
		"ReviewTitle": "Blue water",
		"Review": "usually the water is not clear if it rained a night before.\r If you plan to eat your lunch, bring everything from food to plates because they dont have restaurant inside. Many tables, open and close cottages for rent. Water is refreshing, sometimes very cold.\r \r I like the area of Mahal because they make their place like swimming pool type, safe for kids. Ofcourse you still need to watch them very good because sometimes theres a strong current. Also nice concrete pathways (stairs), much easier.\r \r Compared from year 2008 which is natural and not crowded, the place now is full of cottages and entrance fee cost 40/adult, 20/kid.\r \r ATV ride is also available for rent, except when we visit during weekdays."
	},
	{
		"User": "Shei928",
		"Location": "Manila, Philippines",
		"DateofReview": "September 11, 2013",
		"ReviewTitle": "Muddy water..",
		"Review": "We were there in the morning but the night before the trip it rained so the water is not clear. Instead of Php 40 they asked for Php 20 because of the color of water. Falls is not that high so don't expect too much. The place is also not convenient to go to especially in habal habal. "
	},
	{
		"User": "Dean C",
		"Location": "Baguio, Baguio, Philippines",
		"DateofReview": "September 10, 2013",
		"ReviewTitle": "Hagimit Falls, Samal Island: Photo Review",
		"Review": "It was great visiting Hagimit Falls and Nature Park which was a 10 minute ride after the view point area. Here we had to pay P40/each entrance fee. We felt that everything should be paid in Samal, nothing is free. But since we were already there, we went in and saw the beautiful natural swimming pool created by Hagimit Falls. The water was cold but refreshing. We took a dip and enjoyed the flowing water. Again, we had to pay for cottage fee which is I think was P150 regardless how short our stay was. \r \r More photos and videos of Hagimit Falls are found at : http://watwatworld.com/2013/09/10/discover-island-garden-city-of-samal-a-travel-guide-and-adventure/"
	},
	{
		"User": "xChaLeex",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 6, 2013",
		"ReviewTitle": "Great but worried about the future of this place",
		"Review": "This has been one of the best falls I've ever been. Compared to others, it doesn't have the mother falls of altitude nearby but it has lots of place where you could cool down. The flow of water stretches down to at least 10 pools of water. With cottages all over the place, and ATV adventure for rent, I am a bit worried that this place will lose its beauty in the future if not preserved properly. It is always crowded and therefore nature is abused, I would want this place to be untouched like those of Siquijor and Baler."
	},
	{
		"User": "Cqdt",
		"Location": " ",
		"DateofReview": "August 9, 2013",
		"ReviewTitle": "Great place for the family",
		"Review": "I went to hagimit falls with my family due to curiosity mostly. Entrance fee is relatively cheap and the water was clear and very cold. It's a great place for the family to bond/ talk since there's no loud music or reception.\r The only thing that bothered me was the maintainance of the toilets and changing rooms. They were horrible. The management should do something about it. \r The stairs leading to the falls can be quite challenging to very old people. I'd discourage you to bring them along especially that there are no existing facilities for the less abled. \r Overall, I still enjoyed seeing this attraction. It's a nice way to spend an afternoon with the family."
	},
	{
		"User": "PDD-101",
		"Location": "Davao",
		"DateofReview": "July 3, 2013",
		"ReviewTitle": "tut tut what a bad way to treat nature",
		"Review": "Took a trip to Hagimit falls and was somewhat dismayed at what I encountered The entrance fee is 20 peso for adults and 20 for kids and then they sting you for another 20 for car parking. As there is no other way to get there apart from your own car (unless you want to hire a local motorcycle taxi) then it is a sting to get a extra charge for parking.\r \r The steps down are steep and the steps have been cut uneven and at different heights and lengths so making the walk more difficult - at the entrance to will start to see the multitude of signs put op to tell you what you can not do\r \r There are no signs to direct you to what you can do or where to go. You end up wondering around the winding badly laid and very very ugly concrete paths that looks like a bunch of kids threw down one sunday afternoon with no planning or supervision.\r \r There is no where to get changed if you want a swim and I saw 2 people having a full wash soap and shampoo in the pools\r \r There is no easy entrance to the water, there was no thought given to how people would get in or out of the pools.\r \r If you stand next to one of the very small and badly constructed open huts for a few second you will feel the air pressure change as people rush to demand 250 peso from you. But look around for help and information and its a ghost town\r \r The \"falls\" them selves are just a few meters high and the pools are full of sharp unseen boulders and stones\r \r As more and more Locals get to travel and see other tourist attractions in other countries they will come back and realise how badly their own natural attraction are being used and abused\r \r A definite thumbs down from me. A drunk blind man could have planned this \"attraction\" better\r \r \r \r \r \r ."
	},
	{
		"User": "MissKellyG",
		"Location": "Manila, Philippines",
		"DateofReview": "June 15, 2013",
		"ReviewTitle": "Refreshing",
		"Review": "For someone who doesn't walk to far places often, I had a harder time climbing down the steps towards the pools of water and back up. But it was worth it when I saw how clean the waters were. It was a refreshing dip."
	},
	{
		"User": "SupahEileen",
		"Location": "Manila, Philippines",
		"DateofReview": "April 27, 2013",
		"ReviewTitle": "For the oldies, they say it's a goodie",
		"Review": "My mom and stepdad went here for my mom's birthday celebration in March. She was pretty happy but my stepdad expected more (he's gone to bigger falls like iguazu, niagara and the one in croatia - forgot the name - so excuse him)\r we were happy that he made it to the bottom of the stairs.\r they had their lunch there and my mom went into the water. \r it's not as cold as she thought.\r \r i have a more in depth review of the place on my blog. it's here http://thesupertourists.com/exploring-davao-and-samal-nature-trips-for-the-seniors/"
	},
	{
		"User": "Robertvon",
		"Location": "Nashville, Tennessee",
		"DateofReview": "April 7, 2013",
		"ReviewTitle": "OK",
		"Review": "The locals seemed to like it but I was used to the waterfalls of Odda, Norway last year so these were tiny compared to Norway."
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 28, 2013",
		"ReviewTitle": "Hagimit Falls..hidden no more.",
		"Review": "My two elder kids had already visited Hagimit Falls in Samal Island more than 3 years ago, unexploited in the midst of a virgin forest I saw their pictures taken in Hagimit Falls. It was inviting. I wanted to go to Hagimit then but my kids warned me that it is difficult to get there as trail is not yet develop especially for our age. There was no entrance fee then. Until lately I heard that going there is a lot better now as public transportation is already available and concrete stairs are built for easier trail.\r \r Hagimit is in Samal Island, about 2 kilometers from Penaplata Public market. Signage is visible along the national road. P5.00 per person is collected by the local people for environmental fee, My 11 year old daughter is free, but not for the entrance fee which is P40.00 per person. We walked down the cemented stairs for about 15 to 20 minutes to the falls. We had to carry all our stuffs with us, food, bags, water etc. as it would be tiring to get back to the parking area if we left something we need.\r Hagimit Falls is just a small waterfall that has natural swimming pools. It is hidden by full grown trees and natural vegetation from the hot rays of the sun. I didn’t sun block then. Water is very cold and refreshing. Although Samal Island has a lot of nice and developed beach resorts with white sand and clear and clean waters, Hagimit Falls is a nice destination to visit. It may not be as beautiful and developed but it is still a nice getaway.\r There is one thing I regret not doing while in Hagimit. I stayed in just one or two waterfalls. I thought that was all. That was disappointing to me because I learned there were still a lot of falls I haven’t seen had I only took time to walk a hundred meters more from the main bathing area. Three of my companions told us they went as far as 150meters more and saw two more wonderful falls. But that was late announcement as we were already on our way back to our van. Maybe for the next visitors, they should try to go a little farther to check.\r Open cottages are rented for P300.00. Grilling stations and wash areas are available. I don’t like the idea of them charging the public for P5 to P10 comfort room usage. I doubt children would do it somewhere or worst, in the waters just to do away with the fees. I hope this concern would be given attention by the people maintaining the resort."
	},
	{
		"User": "466Neo",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 17, 2013",
		"ReviewTitle": "Very nice place",
		"Review": "Its well worth visiting very pretty place, but be warned its very slippery there, and a lot is getting bad accidents so did we"
	},
	{
		"User": "Storyseamstress",
		"Location": "Philippines",
		"DateofReview": "March 11, 2013",
		"ReviewTitle": "Eco-friendly management needed asap",
		"Review": "A long trek downhill to these multilevel falls should be worthwhile, but the encroachment of people and their has begun to spoil the natural beauty of the place. Some guests have vandalized the rock formations, making one wonder if anyone cares to keep the place pristine at all. Better management is urgently needed, and the unsightly overnight cottages, unnatural barriers, and other needless concrete structures should be dismantled immediately. "
	},
	{
		"User": "New_YLOO",
		"Location": "Philippines",
		"DateofReview": "February 4, 2013",
		"ReviewTitle": "Hagimit is NOT in Apo island",
		"Review": "Not sure why Hagimit is showing here - Hagimit falls is in Samal garden island - off Davao. I have been there - and it is quiet beautiful."
	},
	{
		"User": "Andy B",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "January 19, 2013",
		"ReviewTitle": "Falls everywhere",
		"Review": "I was surprised when i went to hagimit falls and saw not just one but actually a lot of falls..it was falls everywhere. very nice place, affordable and very enjoyable place to be with family or friends. very nice experience and area is pretty accessible...More"
	},
	{
		"User": "lizl0ves2travel",
		"Location": "Manila, Philippines",
		"DateofReview": "October 26, 2012",
		"ReviewTitle": "Wonderful Place to Chill",
		"Review": "I loved it! Much more easy to access than other big falls. It has many mini-falls and you can choose your own spot. It was early in the morning when we went there so it wasn't crowded. I was like a happy kid playing and...More"
	},
	{
		"User": "JoyfulSoLe",
		"Location": "Makati",
		"DateofReview": "August 25, 2012",
		"ReviewTitle": "A refreshing retreat",
		"Review": "It's a relaxing and soothing atmosphere. The falls are easy to reach as compared to other off the beaten path like the grand Aliwagwag Falls. It can be a quick escape from the scorching heat of the sun. The good thing about the place is...More"
	},
	{
		"User": "Pieter-Jan V",
		"Location": "Samal, Davao, Philippines",
		"DateofReview": "August 10, 2012",
		"ReviewTitle": "Nice blue water",
		"Review": "Many deffirent falls with many small poolswhere you can swim. Try to go on a day with no rain the day before because the rain bring mud from the mountain and the water can be brown"
	},
	{
		"User": "Todd B",
		"Location": "Las Pinas City, Philippines",
		"DateofReview": "July 13, 2012",
		"ReviewTitle": "Hagimit Falls: Worth the trip",
		"Review": "This was a lovely spot to while away an afternoon. The water in several of the man-made pool areas was extremely chilly, though. I cramped up after about 10 minutes of swimming and had to get out to warm back up. There are vendors in...More"
	},
	{
		"User": "wendell v",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "July 12, 2012",
		"ReviewTitle": "A True Gift of Nature",
		"Review": "This is probably just me (us) but Hagimit falls gave me (us) genuine relaxation. Just the sight and sound of the waterfalls can already give you a sense of serenity and being one with nature. I love the way how the water massaged my whole...More"
	},
	{
		"User": "HALLYCS",
		"Location": "Quezon City",
		"DateofReview": "June 29, 2012",
		"ReviewTitle": "Good Massage",
		"Review": "We went here June so no crowd of people. Stayed here for a couple of hours. There's nothing much to do but to drown yourself in the falls. Water is good. Put yourself under the flowing water for a good massage."
	},
	{
		"User": "Macben_1969",
		"Location": "San Fernando La Union, Philippines",
		"DateofReview": "May 6, 2012",
		"ReviewTitle": "Nice place",
		"Review": "For a minimal entrance fee, you can enjoy bathing in the cool waters of this beautiful mini-falls. The water looks clean but not clear. There are rentable tables and huts in the vicinity that makes the place look untidy and disorganized. The trek to the...More"
	},
	{
		"User": "rpacute",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 5, 2012",
		"ReviewTitle": "Natures beauty ruined by development",
		"Review": "The falls is beautiful. However, it is ruined by unplanned/ unsupervised development. The resort at the lower end is in much better condition than the one near the source."
	},
	{
		"User": "Pierre C",
		"Location": "Cebu City, Philippines",
		"DateofReview": "April 26, 2012",
		"ReviewTitle": "If you are lucky",
		"Review": "The site itself is very nice but it has been overdeveloped and if it is crowdy the day you will visit it, you may not appreciate it the way you should. We were there in summer time and of course, it was crowdy. People everywhere. If you are there with your family, you will be able to take the most of it and your children will really enjoy jumping into the river or sliding on a rock. If you just want to relax, arrive there very soon. Later, it will be too late."
	},
	{
		"User": "lily p",
		"Location": "Makati, Philippines",
		"DateofReview": "February 3, 2012",
		"ReviewTitle": "hagimit",
		"Review": "-Good place to have a back massage, just choose which falls you'd like. \r -If you are not gonna get a cottage, you are not allowed to put your things just anywhere. You can only put them on the grass or on the soil. That was what we were told by a boy who kept asking us if we were gonna get tables or cottages.\r -I did not understand why they have to have 2 resorts in the area. The whole place seemed a little bit unorganized and messy because of this.\r Nevertheless we enjoyed our visit there, the water was refreshing plus we had free back massage from the falls!"
	},
	{
		"User": "OWSI",
		"Location": "Luzon, Philippines",
		"DateofReview": "January 28, 2012",
		"ReviewTitle": "It could be better",
		"Review": "its a beautiful natural feature ruined by development."
	},
	{
		"User": "tinamiranda",
		"Location": "Manila, Philippines",
		"DateofReview": "January 18, 2012",
		"ReviewTitle": "Nature did it all, man just keeps destroying it",
		"Review": "On our way to the falls we passed by many signs that said Hagimit Falls – printed on the signs was the face of salon owner Jessie Mendez. Apparently, he owns a part of the resort.\r  Hagimit Falls is a series of water falls with varying degree of sizes. The whole resort is divided into portions. Some parts are well-maintained while the others are just plain unattractive.\r  There are some cottages scattered in the area and prices start at ₱50 . Guests at the resort may bring in food and can swim in the area. The time we went there, the water was not clear due to the heavy rains brought by typhoon Sendong. You can see pictures of Hagimit Falls at my blog www.shootwritepost.blogspot.com"
	},
	{
		"User": "Rexoy",
		"Location": "Davao",
		"DateofReview": "January 11, 2012",
		"ReviewTitle": "Great Massage",
		"Review": "The falls made for a great hydro massage after exploring Samal for the day. However, it is not for the physically challenged, the distance from the parking area to the falls was a bit considerable, adding to that the terrain becomes slippery if it drizzles, other than that it is a must experience in Samal"
	},
	{
		"User": "ccduckie",
		"Location": "Victoria, Canada",
		"DateofReview": "January 6, 2012",
		"ReviewTitle": "Natural",
		"Review": "The falls were quite nice, although rather muddy and not the crystal clear water we were expecting. It's all quite natural, so you can rent a hut for the night, but no food available so bring your own. It's about a 15 mins hike in."
	},
	{
		"User": "japanagogo",
		"Location": "Hong Kong, China",
		"DateofReview": "January 1, 2012",
		"ReviewTitle": "Splashdown, 2011",
		"Review": "The atmosphere of Hagimit Falls is lovely. A refreshing, cool spot with several different pools and places to jump into the water, my gf and I spent a lovely afternoon swimming about and jumping from the falls (signs clearly marked the depth of the pools). Yes, one has to pay for tables to eat, but the prices are not exceptional (150Php for the cheapie, 250Php for a nicer table). A great place for families...we were surrounded by many Filipino families relaxing and enjoying the same atmosphere as us! On an island with not much to do, I'm surprised this attraction is ranked 3 of 4."
	},
	{
		"User": "Ingrid H",
		"Location": "Oslo, Norway",
		"DateofReview": "November 8, 2011",
		"ReviewTitle": "hagimit falls",
		"Review": "lovely afternoon at the falls! Great place, but very ugly pipes lying around everywhere."
	},
	{
		"User": "sunshine36NewDelhi",
		"Location": "Shanghai, China",
		"DateofReview": "October 31, 2011",
		"ReviewTitle": "Where were the falls?",
		"Review": "Not much to see or do here. We bought our lunch with us and had to pay to use a table. We thought that since we paid an entrance fee would could use the facilities for free. I would skip the falls."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 30, 2011",
		"ReviewTitle": "Relaxing place for family and friends",
		"Review": "It's a very nice, secure place for family and friends. The place is a bit far from the city center but it's worth it when you arrive there. So refreshing, with P20 and P40 entrance fee for kids and adults respectively. It's like a hidden paradise in Samal Island. There was an overnight cottage which was still under construction. At the moment, only nipa hut cottages are available."
	}
]
