[
	{
		"User": "Fluttershy_0927",
		"Location": "Abu Dhabi, Abu Dhabi, United Arab Emirates",
		"DateofReview": "February 25, 2018",
		"ReviewTitle": "Nostalgic feeling. Great place",
		"Review": "Though the tunnel is quiet short because of land division as explain by the knowledgeable tour guide, it was a great to experience and explore the Japanese Tunnel. Maybe you only need 30 mins to explore everything but I can say it is worthy."
	},
	{
		"User": "Tor Erling M",
		"Location": " ",
		"DateofReview": "January 26, 2018",
		"ReviewTitle": "Good guides",
		"Review": "Funny place to learn about the historie about Davao. And see how the Japanere attack the the city under the city."
	},
	{
		"User": "Ailene E",
		"Location": " ",
		"DateofReview": "January 3, 2018",
		"ReviewTitle": "Historical",
		"Review": "Nice experience to enter this historical site. Educational for the kids as well as for the adults. Recommended for all"
	},
	{
		"User": "PaangGala",
		"Location": "Zambia",
		"DateofReview": "December 6, 2017",
		"ReviewTitle": "the shortest tour ever",
		"Review": "its the shortest tunnel i have ever visited. If youre into WWII it may make it into your list. the only thing this tunnel had the others didnt was the replica of the Buddha and gold bars."
	},
	{
		"User": "redgotsohigh",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "World War Tunnel",
		"Review": "Tunnel built during the WWII era. Kinda damaged already and is very muddy when you go inside, there's also a prison in it that is very small but is said to fit 6 prisoners during the war."
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 9, 2017",
		"ReviewTitle": "WORTH A STOP",
		"Review": "I went here today with my family and it was good to see, the tour guide was friendly and gave interesting info about this place. The tunnel was not very long, and the guide said that some of the tunnels had caved in on another...More"
	},
	{
		"User": "Raf O",
		"Location": "Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Little history about Japanese",
		"Review": "Clean tunnel and very well lighted. Its a short tunnel but they said its more than 7km long. It's wet inside and slippery so be very careful. 50 pesos entrance fee"
	},
	{
		"User": "lindaeddie",
		"Location": "Ponte Vedra Beach, Florida",
		"DateofReview": "March 8, 2017",
		"ReviewTitle": "WW II tunnel ",
		"Review": "Built by Filipino POW's, this is a historical, but sad, place to visit. Only a portion of the original exists and is forming stalactites and stalagmites. It will take approx 30 min max, but worth the trip."
	},
	{
		"User": "Stuart H",
		"Location": " ",
		"DateofReview": "February 28, 2017",
		"ReviewTitle": "Interesting",
		"Review": "It was a little hard to find, but once we found it, had a good visit and learned a little more history of the war and how the locals were treated."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 23, 2017",
		"ReviewTitle": "Family Time",
		"Review": "Together with my husband and 2 children, we went here some time late last year and in January 2017 to allow the kids to have an enjoyable time swimming. The place may not be as grand as other pool resorts, but it is clean, has...More"
	},
	{
		"User": "Stuart K",
		"Location": "Kent, United Kingdom",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "japanese tunnel",
		"Review": "its very cold in the tunnel ,not many people visit it ,so its good for me i have the tunnel to myself ,it was average but wont go back there"
	},
	{
		"User": "Olav Tore B",
		"Location": " ",
		"DateofReview": "February 8, 2017",
		"ReviewTitle": "Exciting",
		"Review": "A very historic tunel from World War 2 that the Japanese buildt. Very strange to see and vissit. Recommend a vissit :-)"
	},
	{
		"User": "John K",
		"Location": "Helsinki, Finland",
		"DateofReview": "December 24, 2016",
		"ReviewTitle": "Poor in every way",
		"Review": "The food is horrible and expensive. The staff is unfriendly and unresponsive. Did not get order correct."
	},
	{
		"User": "Nick T",
		"Location": "Philippines",
		"DateofReview": "December 2, 2016",
		"ReviewTitle": "a glimpse of the past",
		"Review": "a private property that have been opened for the public to appreciate history of Davao City during the Japanese occupation and WWII. I actually didn't know it existed, I am lucking to have visited this tunnel, I thought this is the only one of its...More"
	},
	{
		"User": "Amy S",
		"Location": " ",
		"DateofReview": "November 6, 2016",
		"ReviewTitle": "HIDDEN TREASURE ANYONE?",
		"Review": "After the war, several people were into treasure hunting. The Japanese tunnel above was discovered not too long ago. One may wonder, what were those Japanese doing at the time?"
	},
	{
		"User": "Shanseif2468",
		"Location": " ",
		"DateofReview": "November 2, 2016",
		"ReviewTitle": "a glimpse of history",
		"Review": "a quick glimpse of history, visiting japanese tunnel here in davao. tour guide gives you an idea on how it was built during WWII one of a must visit place when in davao."
	},
	{
		"User": "MediciBoy",
		"Location": " ",
		"DateofReview": "October 4, 2016",
		"ReviewTitle": "Quite interesting",
		"Review": "Facts offered by the staff/tour guide is quite interesting but given that the tunnel is only a few meters long, you can definitely take a pass on this attraction."
	},
	{
		"User": "Whangs",
		"Location": "Manila, Philippines",
		"DateofReview": "September 19, 2016",
		"ReviewTitle": "Nice to Know, but not that impressive",
		"Review": "Nice to know that this SHORT tunnel is part of kilometer long labyrinths the Japanese Imperial Army had dug using slavery at the time. Nice to see WWII artifacts, but very limited."
	},
	{
		"User": "GOFAR71",
		"Location": "Philippines",
		"DateofReview": "August 11, 2016",
		"ReviewTitle": "Quick Fun !",
		"Review": "This is for quick fun when in Davao. There's nothing much to it but it is part of history. Just take all the selfies you want. We had fun fooling around with the statues."
	},
	{
		"User": "Birmingham, United Kingdom",
		"Location": "Birmingham, United Kingdom",
		"DateofReview": "July 18, 2016",
		"ReviewTitle": "good",
		"Review": "good history , enjoyed very much as i am intrested in history , tunnels are long and wet , and also if you are 6ft then its no good as the tunnels are very low , , but worth the visit"
	},
	{
		"User": "JMHerald",
		"Location": " ",
		"DateofReview": "July 10, 2016",
		"ReviewTitle": "Just a tunnel",
		"Review": "There's nothing to look forward on this place but a 15-minute walk inside a dark, muddy, wet, earthy-smelling cave which historical information discussed by guide can be googled and replicas inside the cave are unappealing."
	},
	{
		"User": "gabbyxiu",
		"Location": "Surabaya, Jawa Timur, Indonesia",
		"DateofReview": "June 29, 2016",
		"ReviewTitle": "japan historical in davao",
		"Review": "Dark, wet, short walk, has prison inside outdoor pool looks dirty, cheap price ^^ This location in busy area, near jeepney & 3cycle"
	},
	{
		"User": "David B",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 29, 2016",
		"ReviewTitle": "Tunnels.......",
		"Review": "To be honest it was somewhat disappointing. The history of the place is undeniable and the authorities have tried to keep that history alive but could do so much more. The major parts of the tunnels collapsed long time ago leaving just a short section...More"
	},
	{
		"User": "Gromzzzz",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "June 20, 2016",
		"ReviewTitle": "Great example of history that was not preservve",
		"Review": "The tunnel is but a short walk now only 150 meters. So sad that the government did do its part in preserving this."
	},
	{
		"User": "Kurt D",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 11, 2016",
		"ReviewTitle": "Pool needs repair ",
		"Review": "The place is actually historical. And their hotel price is really affordable. They also have a restaurant which offers breakfast lunch & dinner. They also have an outdoor pool designed for kids but it needs repair since it has broken tiles. During our stay one...More"
	},
	{
		"User": "Mhoogie",
		"Location": "Caloocan, Philippines",
		"DateofReview": "June 9, 2016",
		"ReviewTitle": "Zzzzzzzzzz",
		"Review": "If you want to post pictures on the net just for the sake of people knowing you've been here there go on. Nothing seems so interesting and the fee you'll pay is a lot better to spend on other activities."
	},
	{
		"User": "Aphio1925",
		"Location": "United Kingdom",
		"DateofReview": "May 21, 2016",
		"ReviewTitle": "A piece of history",
		"Review": "See the tunnel from the history. Dine at the nearby restaurant and enjoy the beautiful sorroundings of the place"
	},
	{
		"User": "flxmanuel",
		"Location": "New York City, New York",
		"DateofReview": "April 21, 2016",
		"ReviewTitle": "just a tunnel...",
		"Review": "nothing interesting here but the resort within the compound.just a plain tunnel with several life size figures inside.visit will last ten minutes...they can definitely make it more interesting"
	},
	{
		"User": "Aniht",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "April 16, 2016",
		"ReviewTitle": "Scary but Historical",
		"Review": "Worth to stop to this very interesting place in Davao, its scary though, thats why we didnt take photos"
	},
	{
		"User": "Meridian, Mississippi",
		"Location": "Meridian, Mississippi",
		"DateofReview": "April 13, 2016",
		"ReviewTitle": "A Tunnel",
		"Review": "It is a portion of a tunnel used by the Japanese during WWII, what more can you say. It is a nice stop, short tour, but worth it I guess"
	},
	{
		"User": "joycesheenlim",
		"Location": "Iligan, Philippines",
		"DateofReview": "April 12, 2016",
		"ReviewTitle": "so historical! :)",
		"Review": "we've been here with our workmates as part of our city tour. japanese tunnel will give you an experience of mixed past and present history of the place. its good to know some facts of our history. the receiving of the place is great with some decent and clean place. if your into historical tour then don't miss the japanese tunnel. its surely educational and offers an incredible experience."
	},
	{
		"User": "Alexis Ian Lom... F",
		"Location": " ",
		"DateofReview": "April 4, 2016",
		"ReviewTitle": "''The Japanese Tunnel !''",
		"Review": "We visited this place just last march we went around touring the tunnel it was underground Japanese base during World war 2 which was found in 1965 accidentally and was interesting at least. The staff and the tour guided were friendly and willing to answer the questions when ask, the resort look simple like any other resorts even with the Japanese theme but overall it as great at least due"
	},
	{
		"User": "Heri s",
		"Location": "blitar",
		"DateofReview": "March 23, 2016",
		"ReviewTitle": "Historical",
		"Review": "Not so long tunnel, but quite okay to explore, they provide some guide to inform you the history and other, just nice place to visited in davaocity"
	},
	{
		"User": "Lea R",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "March 4, 2016",
		"ReviewTitle": "My 50 pesos didn't went to far when I went to this place",
		"Review": "50 pesos is expensive for an entrance fee for this place and our assigned tour guide, talked very fast and seems to want our tour here to be finished as soon as possible. The place is interesting and seems to be teeming with history but I felt somewhat robbed because of the guide and the tunnel was shorter than I expected"
	},
	{
		"User": "mnjensen",
		"Location": "Odense, Denmark",
		"DateofReview": "February 27, 2016",
		"ReviewTitle": "Somewhat interesting",
		"Review": "It is a piece of the old tunnels. In it self it is not that impressive - but when the history is considered it is worth a short visit."
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"DateofReview": "February 19, 2016",
		"ReviewTitle": "tunnel not much more",
		"Review": "tour only into tunnel had a great guide to tell me about it but not really much to it. got attack by the birds that live in it at least that was exciting. water creating stalagtites cool"
	},
	{
		"User": "Andyfarquar",
		"Location": "Trowbridge, United Kingdom",
		"DateofReview": "February 19, 2016",
		"ReviewTitle": "Unimpressive short tunnel with little to see",
		"Review": "We were not very impressed with the whole thing, it was very limited and felt like a waste of time really. There's not much to see and value for money is hard to justify... If you're in the area already, ok take a look but don't make a detour from your tourist route for it...."
	},
	{
		"User": "Loise P",
		"Location": " ",
		"DateofReview": "February 17, 2016",
		"ReviewTitle": "The tour guides need training!",
		"Review": "The tunnel is located along the city's diversion road there is no jeepney or bus route going to the place. We took a taxi to get to the place which costed around 250 pesos. With the entrance fee of 50 pesos you can get inside the tunnel for 15 mins. with a tour guide. Unfortunately, our tour guide was not informative and accommodating as we expected.We asked her if the statue inside is replica of the Yamashita Treasure and she answered \" of course po! if totoo yan matagal nayang na nakaw. \"."
	},
	{
		"User": "danmbuen",
		"Location": " ",
		"DateofReview": "February 10, 2016",
		"ReviewTitle": "Nothing much to do here",
		"Review": "The location is within the city thus accessible by public transportation.\r \r Nothing much to do and see aside from the tunnel. But it is a different experience knowing this tunnel was made by Filipinos decades ago and serves the Japanese army.\r \r I recommend this place for history lovers."
	},
	{
		"User": "Wellington, New Zealand",
		"Location": "Wellington, New Zealand",
		"DateofReview": "February 7, 2016",
		"ReviewTitle": "Been there, done that",
		"Review": "Went there when we were passing through Davao, the guide was really helpful in explaining the history of the tunnel. It is of slight interest for 5-10 minutes but really shouldn't bother coming here unless you're driving past it anyway (like us). Bit underwhelmed since I had just recently gone to Corregidor but Davao made an effort so I applaud them for that. Beware of the darkness and BATS when inside the tunnel."
	},
	{
		"User": "Ellen Laspobres F",
		"Location": " ",
		"DateofReview": "February 5, 2016",
		"ReviewTitle": "historical, looks hunted",
		"Review": "as we visited this japanese tunnel its looks like 500 to 600 meters only. the history is so interesting. can you imagine how many filipino die in their small jail inside?? its totally alot. the tourist guide also explain how the japanese survive inside the tunnel. some of the exit tunnel are close due to residency. "
	},
	{
		"User": "Lovelle P",
		"Location": " ",
		"DateofReview": "February 1, 2016",
		"ReviewTitle": "A taste of history",
		"Review": "The place is surprisingly well-preserved. Definitely a must for educational tours. I was awed by the small, caged-like area where the tour guide said used to house filipino prisoners."
	},
	{
		"User": "reinavender",
		"Location": "Singapore, Singapore",
		"DateofReview": "January 22, 2016",
		"ReviewTitle": "Tourist trap, don't bother",
		"Review": "I'm a history buff but the place looked like one big movie prop. Been to different tunnels as well and this one was just sad."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 14, 2016",
		"ReviewTitle": "A short tunnel, but my Cu chi experience was even shorter!",
		"Review": "A must see for first time visitors to put the Japanese community in Davao in perspective. Located just a few minutes from the city center, it is easily reached by private and public transport. There is a hotel and restaurant that owns the tunnel"
	},
	{
		"User": "Doris J",
		"Location": " ",
		"DateofReview": "December 23, 2015",
		"ReviewTitle": "Nothing much to see",
		"Review": "It is not a long tunnel as I expected and there is nothing much to see except small prison and Japanese statue. I appreciate how the tour guide explain the history of the tunnel though."
	},
	{
		"User": "HurricaneRob",
		"Location": "Houston, Texas",
		"DateofReview": "December 3, 2015",
		"ReviewTitle": "A tunnel",
		"Review": "It was interesting as far as history goes.. but VERY boring .. you walk into and out of a tunnel.. no cool air inside.. be prepared to sweat .. needs work to make it worth visiting"
	},
	{
		"User": "Rebecca G",
		"Location": " ",
		"DateofReview": "December 2, 2015",
		"ReviewTitle": "Short but sweet...",
		"Review": "Very short tour. Walk up and back in the tunnel. Interesting piece of history. If you're tall you'll have to walk crouching over! :)"
	},
	{
		"User": "kingkoo",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "October 16, 2015",
		"ReviewTitle": "Quick stop aint so bad at all",
		"Review": "We got lost going there, well for out of town travellers like us better ready your map or gps to save you the trouble. It was a quick stop, we had a tour guide that time and learned few things about how it was built and how long the tunnel is... Better have your flashlight with you when planning to.visit. not bad at all. "
	},
	{
		"User": "David K",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "September 30, 2015",
		"ReviewTitle": "nice place",
		"Review": "i have been there once not to much to see but there is a lot to learn there things you never knew before its a great place for young kids and people of all ages"
	},
	{
		"User": "Quezon City, Philippines",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 22, 2015",
		"ReviewTitle": "Experience the Japanese Era",
		"Review": "We have had our Japanese Time experienced inside the tunnel. Scary though but you will learn alot how those japanese survived during the war."
	},
	{
		"User": "Jarjar20",
		"Location": "Manila, Philippines",
		"DateofReview": "September 1, 2015",
		"ReviewTitle": "well-maintained",
		"Review": "This makes for a good stop-over. The tunnel is short, clean, and well-maintained. Didn't get to try the food at the nearby restaurant, though."
	},
	{
		"User": "loislaneNy/nj",
		"Location": "ny/nj",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "interesting but sad part of WW2 history",
		"Review": "I found this very interesting my Filipina friends found it depressing as many Filipinos died in making these tunnels, but my feeling is that hopefully by seeing sites like this history will not be repeated"
	},
	{
		"User": "Sheena F",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "July 6, 2015",
		"ReviewTitle": "Short side trip.",
		"Review": "Interesting place to see. But it was short. We finished the tour for less than 30mins. Entrance fee was 50pesos. There was a tour guide. Not much relics. But the experience of going inside decades old tunnel was a different experience."
	},
	{
		"User": "bam086",
		"Location": "Manila, Philippines",
		"DateofReview": "July 2, 2015",
		"ReviewTitle": "short but scary",
		"Review": "pros: guided tour, well lit ways, interesting, very informative guide cons: kind of short (nothing compared to correigidor (did I spell it right?), nothing inside - would have wished for some relics of the past"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "Recreation and history",
		"Review": "While its now a resort and restaurant, Japanese Tunnel is still first and foremost a historical site. It gives visitors a glimpse of the life during the Japanese occupation with the diorama inside the tunnel."
	},
	{
		"User": "alexarian",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 22, 2015",
		"ReviewTitle": "Side trip",
		"Review": "Interesting if you're a history buff like me & my hubby. But not much to see really. The tour will be over in 30mins or less."
	},
	{
		"User": "Jean Paula M",
		"Location": " ",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "A place worth visiting",
		"Review": "This tunnel was accidentally discovered in 1942. This tunnel is really worth visiting and I was surprised to learn that they're open even on sunday."
	},
	{
		"User": "KatzT",
		"Location": "Manila, Philippines",
		"DateofReview": "May 16, 2015",
		"ReviewTitle": "Landmark worth remembering",
		"Review": "The Japanese tunnel is located at the diversion road of davao city. The tunnel has been preserved well. It is hand made by the Filipino prisoners during the Japanese time. There is an entrance fee of 50 Php to get inside the tunnel. You will...More"
	},
	{
		"User": "jamjar136",
		"Location": "Melbourne",
		"DateofReview": "April 29, 2015",
		"ReviewTitle": "Nice Historical tour. short but sweet",
		"Review": "I enjoy learning about WW2 places, battles etc. So I thought I'd give it a go. It is on the way back from Eden park so not out of the way if you have gone there. The tunnel itself is about 75 meters long. At...More"
	},
	{
		"User": "Charis K",
		"Location": " ",
		"DateofReview": "April 20, 2015",
		"ReviewTitle": "A piece of hostory",
		"Review": "An alive piece of history. It was very nice for me to learn from so closed the history of Japanese Philippines war. A very educated about the tunnel history guy had undertaken to explain us everything. It was really nice visit."
	},
	{
		"User": "jeanjer2010",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 18, 2015",
		"ReviewTitle": "Summer Get Away with my family & officemates",
		"Review": "Nice swimming pool specially for kids, very high corkage for the foods & beverages that you will bring."
	},
	{
		"User": "James G",
		"Location": "Manila, Philippines",
		"DateofReview": "April 16, 2015",
		"ReviewTitle": "Quick & Cool Historical Find!",
		"Review": "Despite the tour being quite short, it's packed with a lot historical FYIs. The fact that I was able to enter this tunnel which was used during the WW2 by the Japanese and explore it was really amazing. There's a small Buddha shrine there, the...More"
	},
	{
		"User": "JEmmanuelLasPinas",
		"Location": "Las Pinas",
		"DateofReview": "April 16, 2015",
		"ReviewTitle": "good for a visit",
		"Review": "A bit of history not too far from the city. There is really nothing much to see but the tunnel. Needs some maintenance. Good for a visit."
	},
	{
		"User": "MrDestiny",
		"Location": "Sydney, Australia",
		"DateofReview": "April 14, 2015",
		"ReviewTitle": "Interesting bit of history",
		"Review": "If you have even the slightest interest in WW2 history you will find it worth a visit, it's only P50 and you will get an informative guide to show you."
	},
	{
		"User": "Lim P",
		"Location": "Makati",
		"DateofReview": "April 13, 2015",
		"ReviewTitle": "What tunnel!",
		"Review": "This tunnel is disappointing! Too short and nothing much to see. It takes me less than 15 mins to savour the sights in the tunnel. I have seen many other tunnels which is more unique than this. I will not go there again."
	},
	{
		"User": "Lee H",
		"Location": "Rose Hill, North Carolina",
		"DateofReview": "April 2, 2015",
		"ReviewTitle": "Interesting but short",
		"Review": "This is not a big attraction but I enjoyed it. The tunnel is very short because they have closed off most of it due to safety concerns. The entrance fee is 50 pesos and comes with the tour guide."
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 25, 2015",
		"ReviewTitle": "dont go here",
		"Review": "the only good thing about the japanese tunnel is the restaurant next to it. overpriced. stupid. the tunnel is only 25 meter long."
	},
	{
		"User": "TayNayNak",
		"Location": "Luzon, Philippines",
		"DateofReview": "March 1, 2015",
		"ReviewTitle": "Unique tour!",
		"Review": "The tour is short and quick, but I guess one that would really pique the interest of history buffs. Since its just a short tour, it would be a good idea to include this in your itinerary."
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "February 15, 2015",
		"ReviewTitle": "Historical - but not much more",
		"Review": "Why an entrance fee? Okay, it's a historical place - the tunnel has always interested me. But the food? Forget the restaurant."
	},
	{
		"User": "Nico M",
		"Location": " ",
		"DateofReview": "January 25, 2015",
		"ReviewTitle": "Short but interesting",
		"Review": "For a 50php fee, I suppose it was pretty alright. The tour was kinda short since the owner was only able to purchase and preserve about 100m or the actual tunnel. But I'd say it's the most important part of the tunnel. If you're into...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "January 18, 2015",
		"ReviewTitle": "A tunnel to showcase the Japanese occupation in Davao",
		"Review": "During the WW2 the Japanese occupied this part of Mindanao specifically in Davao City and the suburb. The tunnel interest us. to make a comparison of the Cu Chi tunnel in Vietnam. This one is just a tunnel with some other few stops. \r \r The entrance/reception area is nice with some landscaped portion. There is the hotel too and the restaurant."
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "I want to go further",
		"Review": "Very interesting place to go. (If only I can continue walking until I reach the other end of the tunnel. I'm curious on how far the tunnel is and where it will lead me. People can always say the distance, but it would be nice if you will really see and experience it by yourself. They have accommodations, swimming pool and restaurant. \r \r If you're laid back, this is a place for you. "
	},
	{
		"User": "Mary B",
		"Location": "Gatineau, Canada",
		"DateofReview": "December 9, 2014",
		"ReviewTitle": "Its a Tunnel. Historically intersting",
		"Review": "Not really all much to see but it is historically intersting. For the small P50 fee or whatever it is now... I mean really just over $1.25 you get to walk down a WW2 Japanese tunnel. The little restaurant is ok for a quick snack..."
	},
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "November 23, 2014",
		"ReviewTitle": "Yes, it's a tunnel, but....",
		"Review": "I visited with a friend from UK. A guide walked us through the tunnel which I guess is about 200m in length. It is well lit with a cement floor, and in places you have to duck as the roof is low. But there is precious little to see, and the guide could not tell us a great deal about the history or purpose of the tunnel during WW2. So, rather disappointing. But for 50 Pesos, probably worth calling in if you are passing through on the CP Garcia highway."
	},
	{
		"User": "TravelBug1469",
		"Location": "Manila, Philippines",
		"DateofReview": "September 24, 2014",
		"ReviewTitle": "Nice To Know",
		"Review": "Nothing much to see, just a short tunnel but well kept with some interesting stories associated with it. Backpackers and tourists who wanted more important attractions to visit may find the place boring, but for a family who needs bonding or a romantic couple who don't have myriad of activities in their itinerary, it is a 'nice to know' place where everyone will enjoy - not the tunnel per se (but) - the amenities offered in this family resort. \r Located at Balusong Extension (diversion road going to the airport) Hillcrest Subdivison in Matina District, it is a bit far from the city. Jeepney ride may be difficult but taxis are readily available."
	},
	{
		"User": "raymmiconmapper",
		"Location": "Bacolod, Philippines",
		"DateofReview": "September 20, 2014",
		"ReviewTitle": "interesting place",
		"Review": "Japanese tunnel in Davao city is an interesting place esp.those who valued WW2 stories & landmarks..well lighted & well kept, no urine stench nor spooky images."
	},
	{
		"User": "Wellcraft443",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 2, 2014",
		"ReviewTitle": "Nothing to see",
		"Review": "It was pretty much a waste of time. The guide was clueless as well as the front desk. Typical Filipino incompetence."
	},
	{
		"User": "Armeneloise",
		"Location": "Manila, Philippines",
		"DateofReview": "August 6, 2014",
		"ReviewTitle": "Short! Interesting",
		"Review": "The 50-peso tour is a bit short. The tour guide was just fine. Interesting story of the tunnel. Nothing to see much. Just 3-5 spots inside."
	},
	{
		"User": "christa d",
		"Location": "Vienna, Austria",
		"DateofReview": "July 27, 2014",
		"ReviewTitle": "Never beeing comfortable",
		"Review": "As it has a privat owner not much of the original tunnel can be visited. As it rained, it was interesting to discover, that the water went through the stones. Got wet in the tunnel.\r Had pitty with the men who had to stay there for their duty. Never ever could it be comfortable.\r Besides the tunnel is a good restaurant."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 25, 2014",
		"ReviewTitle": "Worst front desk staff",
		"Review": "The Japanese tunnel is apiece of history. The tunnel was built during one of the world wars by prisoners and served as a base for the Japanese soldiers. \r The tunnel is apparently quite long but only a short portion of it is open to the public for safety reasons. The guide was great sharing her knowledge of the site. \r Over all the experience was impressive. We decided to stay in the hotel because the staff on duty at the front desk was very helpful.\r On our last day the staff was just awful. It just goes to show how one bad apple can ruin a good experience. I asked if she could call cebu pacific because I wanted to take durian home with me.\r She gave me the phone and telephone directory. That did not help me since I was not familiar with the place.\r I went to the small office at the back thinking they could help me. They promised to call cebu pacific themselves and they would inform me of the results.\r They called to inform me it was not possible.\r Guys it can be done. You can take durian with you on the plane if it is placed in a container that is properly sealed. For your information."
	},
	{
		"User": "Val Anthony S",
		"Location": " ",
		"DateofReview": "July 11, 2014",
		"ReviewTitle": "Just a tunnel",
		"Review": "Get a bit of history and close encounter with the balinsasayaw. Tunnel is quite short since most of it is no longer safe for viewing."
	},
	{
		"User": "Cherrymay D",
		"Location": "Pasay, Philippines",
		"DateofReview": "June 30, 2014",
		"ReviewTitle": "historic tunnel",
		"Review": "a very short tunnel.. nothing much to see yet a lot to learn .I think 50php entrance fee is too much for this low-maintenance attraction."
	},
	{
		"User": "Noel S",
		"Location": "Blackburn, Australia",
		"DateofReview": "June 12, 2014",
		"ReviewTitle": "well worth a visit, read on",
		"Review": "I read anout this tunnel in a magazine, so I visited it in march 2014. I found it very interesting and well looked after, 50php entry very cheap, I asked the tour guied many questions but got no answers and it seams I knew more...More"
	},
	{
		"User": "daveblinx",
		"Location": "Blackburn, United Kingdom",
		"DateofReview": "June 11, 2014",
		"ReviewTitle": "Interesting place",
		"Review": "The guide gave us an excellent tour, explaining the history of the tunnel and pointing out the different areas. The guide even took some photos for us of my Wife in the tunnel prison cell. Short visit maybe 25mins but I enjoyed it."
	},
	{
		"User": "batgurls",
		"Location": "metro manila",
		"DateofReview": "May 22, 2014",
		"ReviewTitle": "eerie adventure",
		"Review": "May 2013 before flying back to Manila, our driver drove us to this place to explore. The tunnel is within the property of a small resort. Unnoticeable from the road. What catched our attention was statues of 2 soldiers clad in Japanese & Filipino guerilla...More"
	},
	{
		"User": "GraceSanJuan",
		"Location": "San Juan",
		"DateofReview": "May 15, 2014",
		"ReviewTitle": "learned a lot",
		"Review": "The tour guide was very helpful. Although, we had to take another taxi, since we have no idea of its location- NO Davao map available."
	},
	{
		"User": "DeeEss23",
		"Location": "St. Albans, United Kingdom",
		"DateofReview": "May 12, 2014",
		"ReviewTitle": "Its a tunnel",
		"Review": "That may or may not go anywhere, and was dug by the Japanese during the war. There is a crashed plane above it. That pretty much sums it up."
	},
	{
		"User": "cristydti",
		"Location": "makati",
		"DateofReview": "April 30, 2014",
		"ReviewTitle": "not worth the Php 50.00 entrance",
		"Review": "the tunnel was short and not much to see.....although it was part of history because it was built during World War II, i think an entrance fee of Php 10.00 would be enough for the people to take a look at the tunnel.....anyway, not much...More"
	},
	{
		"User": "kuyals",
		"Location": "Hays, Kansas",
		"DateofReview": "April 16, 2014",
		"ReviewTitle": "Interesting",
		"Review": "If you have an interest in history this is well worth a visit. The entry fee is only P50 which includes a guided tour. The guide I had knew the basic facts and it does not take very long. It is interesting that they did...More"
	},
	{
		"User": "manila",
		"Location": "manila",
		"DateofReview": "March 24, 2014",
		"ReviewTitle": "unexpectedly nice",
		"Review": "didn't expect i'd see a tunnel used in WWII during my Davao trip. however with the knowledgeable guide, i stumbled upon this place and learned a lot from it."
	},
	{
		"User": "Jeremy N",
		"Location": "Dover, Delaware",
		"DateofReview": "February 26, 2014",
		"ReviewTitle": "Interesting WW2 history...",
		"Review": "Very quick tour and only 150 meters long so not much to see but still interesting and you can get a good feel how the Japanese lived during WW2. P50 entry fee is nominal."
	},
	{
		"User": "tksato",
		"Location": " ",
		"DateofReview": "January 28, 2014",
		"ReviewTitle": "The Best Experience in Davao City",
		"Review": "Even if you can do the Japanese Tunnel in 5 minutes, it provides people with a great experience on how the Japanese soldiers used to live during II World War. I thought the price was honest and the place was interesting, from a historic perspective....More"
	},
	{
		"User": "tom_herrera",
		"Location": "Makati, Philippines",
		"DateofReview": "January 15, 2014",
		"ReviewTitle": "Short historical tour",
		"Review": "Short but interesting historical tour. Filipinos, Japanese, Gold bars, Golden Buddha, Ferdinand Marcos thats what youll learn. If you are in Davao, why not visit?"
	},
	{
		"User": "Mia S",
		"Location": "Cebu City, Philippines",
		"DateofReview": "January 6, 2014",
		"ReviewTitle": "Tourist spot",
		"Review": "Honestly, tourist spots here in the middle of Davao City are not the many so this is a good spot to check out for a short time."
	},
	{
		"User": "jadedrock",
		"Location": "Pasig, Philippines",
		"DateofReview": "January 5, 2014",
		"ReviewTitle": "just a tunnel, nothing much to see",
		"Review": "It's situated below a restaurant, which makes it easy for visitors to access (easy to park here too). You have to pay 50.00 to enter, a tour guide will join you and orient you on the history of the tunnel. It is well lit inside,...More"
	},
	{
		"User": "Leland_DLC",
		"Location": "Manila",
		"DateofReview": "January 3, 2014",
		"ReviewTitle": "Worth the side trip.",
		"Review": "For P50, it's worth making a short side trip to this place. Pretty interesting how the 150 m tunnel supports itself and that it used to run for 7 km."
	},
	{
		"User": "Shamrockbuddy",
		"Location": "Bordentown, New Jersey",
		"DateofReview": "December 26, 2013",
		"ReviewTitle": "Eerie ... Damp ... and probably loaded with ghosts",
		"Review": "Loved it ... not built for tall Americans but worth the visit. Dark, damp, dripping with water from the ceilings ... spookie Japanese soldier figures all around you ... You will have a tour guide and she will make it a memorable visit."
	},
	{
		"User": "BGonzalez1973",
		"Location": "Jewett City, Connecticut",
		"DateofReview": "December 14, 2013",
		"ReviewTitle": "Interesting",
		"Review": "I had a guided tour through this Japanese Tunnel. It seemed very authentic. The tour guide was very knowledgable and talked about the different aspects of the tunnel as we walked along. She even was gracious enough to take pictures of us as we walked...More"
	},
	{
		"User": "Cinnabon H",
		"Location": "Cagayan de Oro City, Cagayan de Oro, Philippines",
		"DateofReview": "October 26, 2013",
		"ReviewTitle": "japanese tunnel",
		"Review": "its good for family outing . because of its facilities where the kids can have a good time. i love the pool with those big sized kids stuff . hotel room is also divine. there are stuff the family members can do while at stay....More"
	},
	{
		"User": "Alice Springs, Australia",
		"Location": "Alice Springs, Australia",
		"DateofReview": "October 24, 2013",
		"ReviewTitle": "Extremely Interesting",
		"Review": "I really wanted to see this tunnel having read the book \"escape from davao\" and it is a real eye-opener. Not something made up for tourists but something with meaning and history. Once inside, I could imagine what this tunnel was really used for -...More"
	},
	{
		"User": "nightrider3315",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "October 16, 2013",
		"ReviewTitle": "Japanese Tunnel",
		"Review": "This tunnel was discovered 30-40- years after WWll ended when a new highway was being constructed. The tunnel is an example of the types of tunnels the Japanese built all over the Pacific at that time. It is low ceiling ed as the Japanese soldier was small in stature. It has gun storage rooms and various other rooms related to war. It is of historical interest to those into history. It is damp. There is a restaurant on site. "
	},
	{
		"User": "coffeefreak",
		"Location": "Caloocan, Philippines",
		"DateofReview": "October 8, 2013",
		"ReviewTitle": "excellent side trip",
		"Review": "Considering the length of the tour and what's to see, the entrance is a bit expensive but since it's a private property, I quite understand. What I like about this place is that it's accessible- the other places in Davao are way tooooooooooooo far."
	},
	{
		"User": "RedCoconutGM",
		"Location": "Boracay",
		"DateofReview": "September 6, 2013",
		"ReviewTitle": "Cool",
		"Review": "Short and sweet. Our guide was well educated and gave us an excellent tour, albeit short..sorry, I forgot her name. I would definitely recommend a stop over here to check it out. Actually, the next time I visit, I'll stay here at the hotel. Reasonable rates and clean rooms. Great job to all the staff at the Japanese Tunnel!"
	},
	{
		"User": "Kaye214",
		"Location": "Davao",
		"DateofReview": "August 21, 2013",
		"ReviewTitle": "So-so Historical Tour",
		"Review": "I recently took a couple of visitors here as one of them enjoys historical places. The tunnel was made during the world war 2 and used by the Japanese, hence its name. The tour was quite educational but short, around 5-10 minutes. The guide could have spoken more clearly and been much more entertaining--after she cited some facts as we went through the tunnel, we had to prompt her with questions to learn more. Towards the end, her mind had wandered because when my friend asked her a question she made that sound you make when you're not really listening anymore. If you have been to other historical tunnels like the Vietnam and South Korea, you might be left wanting for more. If you haven't been to one, it's still worth a visit. If you're pressed for time or not really into historical places, I would recommend visiting the other tourist spots instead."
	},
	{
		"User": "IanT6",
		"Location": " ",
		"DateofReview": "August 20, 2013",
		"ReviewTitle": "Interesting 2nd World War Tidbit",
		"Review": "Didn't expect there is an intricate channel of underground tunnel within the city of Davao. It was built during the Japanese invasion of the Philippines. Accordingly, Japanese loots gold bar was hidden here. Some swallow and their nests can be seen upclose."
	},
	{
		"User": "iamatopmodel",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 6, 2013",
		"ReviewTitle": "Not the regular kind of tour",
		"Review": "It really helps to train their tour guides well in explaining the history of the tunnel. I thought our guide was well informed and friendly. I just wish that what theyre sharing with us are all facts (we have no way of proving otherwise)."
	},
	{
		"User": "igga200",
		"Location": " ",
		"DateofReview": "August 3, 2013",
		"ReviewTitle": "piece of history",
		"Review": "i have learned not to expect much when visiting tourist spots in the philippines since mostly they are false advertising. however, i actually like visiting the tunnels because it was an educational visit. the tour guide was really pleasant & patient with us & we learned a lot about davao from her."
	},
	{
		"User": "Dibyne",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 30, 2013",
		"ReviewTitle": "literally, Tunnel!!!",
		"Review": "Here, its a different kind of adventure.. hiking through their tunnel.. but expect the food to be very basic, though lately, there are renovation and improvement of the place. \r \r To make the trip more interesting, make it part of your itinerary to visit also crocodile park.."
	},
	{
		"User": "maincampus",
		"Location": "Cotabato City, Philippines",
		"DateofReview": "May 8, 2013",
		"ReviewTitle": "wonderful memories",
		"Review": "we had three birthday celebrations at Japanese Tunnel, and i would say it was an exhilarating experience. The location is ideal, and the amenities like the use of the pool made the parties more fun. The place is ideal for selected visitors, and so exclusive events are welcome in this resort.Although it is not as big as the other resorts, it has its own attraction too, like the tunnel,Food is good, and the staff is always ready to serve.During free time, this place is perfect for the kids.. and adults for dining. My grandchildren enjoy the clean and exciting design of the swimming pool, and so they always invite me to visit the place all over again. Parking is not a problem, now that it has extended its parking space. I would want to be back to this place, be cause it makes me recall the blissful experience of our family gatherings."
	},
	{
		"User": "Cotabato City, Philippines",
		"Location": "Cotabato City, Philippines",
		"DateofReview": "May 4, 2013",
		"ReviewTitle": "A family celebration",
		"Review": "We only saw the tunnel briefly and there was nothing more to see since the tunnel is short, but it served its purpose. Why? Because it is considered a landmark, one of the remaining souvenirs of past Japanese invasion. The saving grace is the swimming pool, found just nearby, good for kids and adults alike. The kids enjoyed swimming in the long pool, with the recently added features found at the end. You can order food and eat there while watching everybody. The food is just right, and the service is superb. And if you don't have your own ride, it is easy to hail a taxi or you can request the staff to call a taxi for you. Or if you intend to stay overnight, they have good hotel rooms you can choose. We've been here many times already and still wanting for more!"
	},
	{
		"User": "466Neo",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 17, 2013",
		"ReviewTitle": "Not worth visiting at all",
		"Review": "I think this is the most disappointing place I have visited in Davao, this place is way to overrated and in my eyes not worth more than 5 minutes, and only if one has special interest in the war."
	},
	{
		"User": "arwen_31",
		"Location": "Vanderhoof, Canada",
		"DateofReview": "February 19, 2013",
		"ReviewTitle": "historical tour",
		"Review": "this is a short tunnel discovered by road workers while digging the place. A tunnel built during the Japanese time. all you could see here are replicas. it became like a museum. maybe I have appreciated the place when they left something original like a...More"
	},
	{
		"User": "balmix_turistas",
		"Location": "Quezon City, Philippines",
		"DateofReview": "February 15, 2013",
		"ReviewTitle": "Historical",
		"Review": "We're glad we tried to visit this place on our last night at Davao. We enjoyed the tour inside the tunnel. It gave us a feel of history. A learning experience."
	},
	{
		"User": "kalboHastings",
		"Location": "Hastings",
		"DateofReview": "January 31, 2013",
		"ReviewTitle": "historical",
		"Review": "Must say that whilst there is a lot of history associated with the tunnels - they are too short & seem too commercialized..."
	},
	{
		"User": "BasilioD",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "November 24, 2012",
		"ReviewTitle": "Excellent Trip",
		"Review": "Although it's true that this tunnel is rather short, there's a lot of history packed into this tunnel system. This tunnel was \"discovered\" in 1960 during the construction of Diversion Road. Lots of skeletons of both Japanese soldiers and Filipinos prisoners were found at this...More"
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 20, 2012",
		"ReviewTitle": "Short tunnel but amazing",
		"Review": "Our visit there was a very short one because the tunnel is only 150 meters because the management closed the other tunnels coz it collapsed. But the short tour was amazing because there is history about the place, how the Filipino slaves suffered under the...More"
	},
	{
		"User": "Derbal",
		"Location": "Manila, Philippines",
		"DateofReview": "November 10, 2012",
		"ReviewTitle": "Worth the view, certainly for anyone interested in WWII",
		"Review": "Its good for what it is, but other than the tunnel itself (seen one seen em all) there's nothing to write home about. As someone very interested in WWII history I'm pleased I saw it, but to standard tourists I'd not suggest its worth going...More"
	},
	{
		"User": "ukjeprox",
		"Location": "Davao",
		"DateofReview": "November 6, 2012",
		"ReviewTitle": "Slightly interesting",
		"Review": "Expected more of this place but was a little dissapointed. Arrived at the tunnel and was shown to hotel reception where we had to wait for about 30minutes for a guide. Eventually someone did turn up and we were take outside to the tunnel entrance...More"
	},
	{
		"User": "aki0618",
		"Location": "Manila, Philippines",
		"DateofReview": "July 11, 2012",
		"ReviewTitle": "okay lang",
		"Review": "not so fancy, maybe because it brings back not so good memories of the past"
	},
	{
		"User": "Manila",
		"Location": "Manila",
		"DateofReview": "June 14, 2012",
		"ReviewTitle": "A highly commercialized tunnel",
		"Review": "Yes maybe it is true that this the tunnel were the Japs hid their treasures but they turned it into a super commercial place by establishing a hotel and a japanese restaurant right in the area, capitalizing on the tunnel. Leaves a bad taste in...More"
	},
	{
		"User": "RogerbDavaoCity",
		"Location": "Davao City",
		"DateofReview": "June 8, 2012",
		"ReviewTitle": "THE JAPANESE TUNNEL RESORT, HOTEL, RESTAURANT - Good food and a trip back to Davao City's recent past",
		"Review": "BY ROGER M. BALANZA\r durianburgdavao mindanao newsblog\r http://durianpost.wordpress.com\r \r There is a place in Davao City where you can both have a taste of the best food the premier city of Mindanao can offer---and a chance to make a trip back to Davao City's recent past.\r D’Japanese Tunnel Family Resort and Restaurant, snugly nestled on a slope in Balusong along the Carlos P. Garcia Highway (South Diversion Road) is both a landmark destination for tourists for its historical value and good food.\r A main attraction is the 300-meter Japanese Tunnel, constructed in 1942, a reminder of the Japanese Occupation during World War II.\r A guided walk through the deep tunnel is an eerie experience, given stories about the brutality of the war that did not spare the Dabawenyos.\r The tunnel, built on forced labor by the locals, served as cover and storage for armaments and soldiers of the Japanese Imperial Army. The visitor/tourist is greeted by life-size replicas of Japanese soldiers at the entrance to the tunnel.\r Inside there are various weaponry (vintage machine guns, ammos, guns explosives); tables and chairs in what looks like the office or command center of the Japanese soldiers.\r There is a chapel with a replica of a huge Golden Buddha, Japanese bank notes and holding cells apparently for captured American and Filipino soldiers.\r You get the rare experience for only P50 entrance fee.\r \r The Japanese Tunnel has a 3-storey hotel, a swimming pool and the restaurant now also making waves for good food (Chinese, Filipino and Western cuisine and, of course, Japanese!) and becoming as famous as the tunnel.\r \r Buttered, Chicken, Mixed Seafood Vegetables, Sinuglaw, Sweet and Sour Lapu2x, Sinigang na Hipon\r MADAYAW DABAW!!!"
	},
	{
		"User": "LolaGo1",
		"Location": "Washington DC, District of Columbia",
		"DateofReview": "May 28, 2012",
		"ReviewTitle": "TUNNEL VISION OR NOT?",
		"Review": "My tour package included 4 sites of Davao City - the Japanese Tunnel is one of these sites. As mentioned in several reviews, the tunnel is very short with only a handful of displays From my tour guide, I learned that the tunnel was discovered during the construction of the highway facing the tunnel. \r \r What impressed me most are the stalactites and stalagmites on the walls of the tunnel. I only noticed them when my tour guide brought them to my attention\r \r For those interested in tunnels used during the World War II, I suggest that a visit to the Malinta Tunnel located in the Corregidor Island be made."
	},
	{
		"User": "Christan A",
		"Location": "Baguio",
		"DateofReview": "May 2, 2012",
		"ReviewTitle": "Historic site",
		"Review": "Godd place and has a touch of history but needs to be upgraded to be more relevant."
	},
	{
		"User": "Macben_1969",
		"Location": "San Fernando La Union, Philippines",
		"DateofReview": "April 25, 2012",
		"ReviewTitle": "Quite eerie but nice experience",
		"Review": "We went here on our way to the Phil eagle center. The place looks eerie and dark esp since we were the only visitors at that time although there are installed lights inside. While inside the cave you can hear some buzzing/rumbling that reverberates inside the tunnel coming prob coming fr vehicles outside which adds to the eerie feel. The guide showed/told us the interesting sites/stories behind the Golden buddha replica inside and the lifesize japanese army figures inside. There is an entrance fee for a guided tour of this 300m tunnel. A very informative experience you should not miss when visiting Davao. And since this is a resort, you can check also check in their hotel which is perched on top on the hill where the tunnel is. They have a nice pool. Food at the resto isn't so good though."
	},
	{
		"User": "joeydvm",
		"Location": "Ha'il, Ha'il, Saudi Arabia",
		"DateofReview": "April 20, 2012",
		"ReviewTitle": "tunnel experience",
		"Review": "the tunnel views are somehow spooky but its okay. They do a hotel within the property but be prepared to have a long stride up to your rooms. They have a pool also if you to splurge to some swimming fancy, right beside their resto..."
	},
	{
		"User": "imojen",
		"Location": "Manila, Philippines",
		"DateofReview": "March 23, 2012",
		"ReviewTitle": "don't expect much",
		"Review": "the tunnel is very short with only 2-3 exhibit spaces. no one can give you a tour and the japanese restaurant does not serve any japanese food. but definitely a nice stopover when you are on the road."
	},
	{
		"User": "Mark E",
		"Location": "Makati City",
		"DateofReview": "March 20, 2012",
		"ReviewTitle": "Brings you Back in Time",
		"Review": "It simply brings you back in time. The tourist guide was knowledgeable. She answers all our questions regarding the tunnel. It's nice to know that this place has been preserved. We were told that it was discovered at the time the national highway is in construction. Also, it is a longer tunnel but it was cut to just cater to tourists.\r \r Make sure you wear shoes or sandals that you're ready to have wet. The tunnel has a dry to wet flooring and is muddy at some points. Also, make sure that you're ready to dock a bit as some ceilings are low even for an average person."
	},
	{
		"User": "maloucastaneda",
		"Location": "Cainta, Philippines",
		"DateofReview": "February 29, 2012",
		"ReviewTitle": "Japanese’s hide out in Davao during the World War II, now a tourist spot",
		"Review": "Japanese Tunnel, entrance fee is 50 pesos per person, about 30 minutes from the town proper, said to be the Japanese’s hide out in Davao during the World War II, now commercialized, turning the area into a tourist spot, and a hotel-restaurant. \r Inside the tunnel are statues of Japanese soldiers and fake cages for prisoners. At the time we visited, the tunnel was cut short by a gate. They were renovating the other part of the tunnel then, probably placing more Japanese soldier replicas. Stalactites are starting to form inside the tunnel."
	},
	{
		"User": "B_112",
		"Location": "Quezon City, Philippines",
		"DateofReview": "November 7, 2011",
		"ReviewTitle": "Japanese Tunnel",
		"Review": "Not quite what I expected. Short tunnel tour. Basic information on how tunnel was discovered. Guide was unable to answer other questions outside of his usual spiel."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 30, 2011",
		"ReviewTitle": "Historical place in Davao",
		"Review": "This is a historical place in Davao and must be preserved. The owner developed it and now it has a hotel and restaurant and swimming pool. It also has function rooms for groups or special occasions. The place is clean. There's a P50 entrance fee for a guided tour inside the cave."
	},
	{
		"User": "codad1946",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 5, 2011",
		"ReviewTitle": "Should be upgraded",
		"Review": "I was looking forward to visiting this place because I live in Davao but had never been. It was good, but I was disappointed that they had not made more of it - probably a funding problem or lack of will, who knows.\r I thought there would be a museum attached to it, but apparently everything had been removed to a downtown museum, so that was a disappointment too, though to store the stuff at this site would probably have been expensive to do regarding air con, security etc.\r I think they should open more of the tunnel, even though it is a home for pythons apparently(!) as it goes some 30k according to the guide I seem to remember. They should map it out and give out a guide book or sheet to show where it goes/went and what is at the other end and why. Come on guys, do more with it like this and tracing Japanese and Filipino survivors if there were any etc etc."
	},
	{
		"User": "trondolav",
		"Location": "Finnoy, Norway",
		"DateofReview": "April 29, 2011",
		"ReviewTitle": "can be better",
		"Review": "japanese tunnel is worth a visit, but wish that the owners made ​​more out of place, it has the potential to do so much more out of it."
	},
	{
		"User": "Sui_Lai",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 28, 2011",
		"ReviewTitle": "Perfect beauty",
		"Review": "Even if I was a local native here in Davao, it was my first time to visit Japanese Tunnel. I fell in love immediately with the place because of its perfect beauty. I was searching for a reception of our wedding when I remembered Japanese Tunnel and it so happened that it's nearer than having it at downtown areas. The name itself captured my eyes because the theme of our wedding was sakura (means cherry blossom. Cherry blossoms is prominent in Japan). Because I personally attended all our wedding details - from invitations, giveaways and cake - they were all cherry blossom inspired. Anyway, we took their wedding package which wasnot so expensive. The package includes food for 100pax, overnight stay and free pool passes. The rooms that we had stayed was nice with the view of their pool below. The food was great and their staff were accommodating and friendly. It was memorable and wonderful experience for me."
	},
	{
		"User": "thedude_888",
		"Location": "Budd Lake, New Jersey",
		"DateofReview": "March 14, 2011",
		"ReviewTitle": "Worth going to",
		"Review": "This is living history. You actually get to go into the tunnel and walk around to see how the soldiers lived etc. There are very few WWII places that you can actually walk into and see for yourself. Davao is off the beaten path; if this were in Manila, everybody would of heard of it. If you are in Davao, this is a must see for history buffs. Plus, like a previous review stated, a nice break from the heat. It's at least 20 degrees cooler in there."
	},
	{
		"User": "ccduckie",
		"Location": "Victoria, Canada",
		"DateofReview": "December 8, 2010",
		"ReviewTitle": "Pretty Cool!",
		"Review": "I liked this attraction for a couple of reasons - \r First of all, yes it is a bit kitschy... there are statues of Japanese soldiers, a 'wishing well,' even a Buddha! I really had fun exploring the tunnel. I hate the heat, and it was such a nice cool place to be on a sunny day. The tour guide was a bit overly friendly, and tried to up sell us on a meal at the restaurant or a stay at the pool, but I didn't mind. If I had known there was a pool, I would have planned to stay the day there! They also have hotel rooms available, and it seemed like a nice option to stay for a night. If I had visitors in Davao I would definitely take them here for a day or a half-day."
	},
	{
		"User": "USA",
		"Location": "USA",
		"DateofReview": "July 23, 2008",
		"ReviewTitle": "Japanese Tunnel worth a LOOK",
		"Review": "The tour was short and the guide did not have alot of information. We would stop at one wing of the tunnel and he would say this is where the command center was, this is where they kept supplies. not much information.\r \r The tour cost me 50 pesos per adult, the family that took me said that they seen that I was an American so charged me more. At any rate it was worth $1.25 US just to look it over. The hotel looked very nice and had a nice pool and landscape with flowers. I would have stayed there over night but had alread booked another place."
	}
]
