[
	{
		"User": "Chris P",
		"Location": " ",
		"DateofReview": "March 21, 2018",
		"ReviewTitle": "I Love Samal.",
		"Review": "A must stop when on the island. This is the beach that has the I Love Samal Island sign.Has a bathroom right on the beach ."
	},
	{
		"User": "Peter T",
		"Location": " ",
		"DateofReview": "December 11, 2017",
		"ReviewTitle": "A good place to relax for a very affordable price",
		"Review": "You can get to the resort from Sasa Wharf, Ride a ferry for 10 pesos and the ferry will dock at Babak Ferry terminal, Ride a habal to Kaputian beach and you can enjoy their fine sand beach for an entrance fee of 25 pesos....More"
	},
	{
		"User": "UsapangGala",
		"Location": "Pasig, Philippines",
		"DateofReview": "October 18, 2017",
		"ReviewTitle": "Fits to its name",
		"Review": "The sand is white and the water is clear. The view on the way to this place is also amazing. There are restrooms in the area, but don't expect too much because it is not that clean. You may buy swimming gears on the vicinity...More"
	},
	{
		"User": "Richee Genesis T",
		"Location": " ",
		"DateofReview": "October 10, 2017",
		"ReviewTitle": "Nice place for relaxation.",
		"Review": "The entrance was only P10 which is really cheap. The sand was fine. The sea was also nice except for there are sea urchins hidden so be cautious! The CR's were dirty."
	},
	{
		"User": "pancit_canton",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "October 9, 2017",
		"ReviewTitle": "I love it",
		"Review": "We came here around lunch time and you would expect the place to be really really hot but its not. I walk barefooted but I didn't feel any burn on my sole. It's windy here which is great and the water is crystal clear. The...More"
	},
	{
		"User": "queenmary28",
		"Location": "Pagadian City, Philippines",
		"DateofReview": "September 12, 2017",
		"ReviewTitle": "Christmas vacation",
		"Review": "It is an amazing place! White sand and seems like crystal clear water. A good place to have a vacation with your friends and family."
	},
	{
		"User": "Maricar F",
		"Location": " ",
		"DateofReview": "September 5, 2017",
		"ReviewTitle": "Value for money",
		"Review": "Been here 3 times already. The water is clean only in the morning especially if high tide. Best to do is to plan your trip by googling the tides chart so you'll know if when will be high tide in Kaputian. The beach becomes dirty...More"
	},
	{
		"User": "Tom G",
		"Location": " ",
		"DateofReview": "June 28, 2017",
		"ReviewTitle": "Great beach day out",
		"Review": "This beach is a beautiful tropical paradise, the water is pleasant and the beach is not crowded at all. Great for having lechon and a feast. There are lovely island huts to sit in, or lie on the beach. Highly recommend for very cheap price....More"
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 22, 2017",
		"ReviewTitle": "Beautiful beach",
		"Review": "Try to go there on a weekday off season. Then you have the best chance not having to watch people t growing their garbage and making noise. In any case you should wear bathing shoes."
	},
	{
		"User": "IceQueen2013",
		"Location": "San Francisco, California",
		"DateofReview": "January 15, 2017",
		"ReviewTitle": "Kaputian Beach Park",
		"Review": "Beach was okay, but there's a deep drop from the beach line so be sure to watch your children when swimming, they might wade too far into the drop and drown easily. Also, there's some strong currents by the drop, so generally not safe for...More"
	},
	{
		"User": "macasaetchris",
		"Location": "Makati, Philippines",
		"DateofReview": "December 14, 2016",
		"ReviewTitle": "Your average white sand beach",
		"Review": "Entrance fee: 10 pesos per head\r Good: \r 1. Water - Clear \r 2. A place where you can celebrate with friends and family\r 3. Local stores are available just outside the beach area\r 4. White sand\r \r Bad:\r 1. Can get crowded and loud during weekends (People singing videoke, drinking and playing games) Not a great place if you want some quite time \r 2. There are some bottles lying around the beach area and also in some parts of the swimming area. \r 3. Lots of sea urchins (wear aqua shoes!)\r \r I wish their LGU help clean and maintain this place. "
	},
	{
		"User": "77Raine27",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "September 8, 2016",
		"ReviewTitle": "Nice Beach",
		"Review": "Went there to see the white beach. Compared to the beaches in Panglao and Bantayan, these 2 are well-maintained. Needs cleaning on the shoreline. Did not dare to swim."
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "great beach.",
		"Review": "can be seen from isla reta beach. white sand and calm waters and long shoreline. there's no boat though from isla reta to kaputian beach(or maybe you have to rent a whole boat) affordable entrance fees."
	},
	{
		"User": "Munky08",
		"Location": "Pasig, Philippines",
		"DateofReview": "June 1, 2016",
		"ReviewTitle": "Nice sand but too crowded",
		"Review": "The sand is indeed nice but since this beach is open to the public, it gets a bit crowded during summer."
	},
	{
		"User": "Angela M",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 12, 2016",
		"ReviewTitle": "Well maintained",
		"Review": "Clean. well-maintained. Cheap entrance fee. Very nice shore line. Its fine, powdery sand really represents its name \"Kaputian\" which means \"whiteness\" or \"white\"."
	},
	{
		"User": "Alex39662",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 4, 2016",
		"ReviewTitle": "Beach better have my money.",
		"Review": "The Kaputian shoreline has a great view of nature with white sand beaches and is home for several marine creatures such as the dugong (sea cow). This beach better have my money. The fine white sand beach will surely make you stay longer (or live there forever). Its a place you must not (ever) miss."
	},
	{
		"User": "Kates A",
		"Location": "Cavite City, Philippines",
		"DateofReview": "February 1, 2016",
		"ReviewTitle": "Will come back",
		"Review": "During low tide, it reveals a good stretch of powdery sand. I like it here. It can be dirty though after a storm."
	},
	{
		"User": "Angel B",
		"Location": " ",
		"DateofReview": "November 28, 2015",
		"ReviewTitle": "Great coastline.",
		"Review": "This place is not too crowded and this place is good for relaxation. This also fits for people on a budget, it is budget friendly but the place is really great..."
	},
	{
		"User": "Vince M",
		"Location": " ",
		"DateofReview": "September 24, 2015",
		"ReviewTitle": "Cheapest White Sand Beach Experience",
		"Review": "It may take an hour to get there from mainland Davao City but it's really worth it. Enjoy a beach side camp out and the fresh catch early in the morning."
	},
	{
		"User": "Jigz N",
		"Location": " ",
		"DateofReview": "September 1, 2015",
		"ReviewTitle": "Just a good beach",
		"Review": "Not a spectacular anymore due to over crowding and people not being discipline plus poor governance. Known to be great before. I hope they restore the beauty of samal coastal are"
	},
	{
		"User": "Richthof R",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 8, 2015",
		"ReviewTitle": "kaputian waters",
		"Review": "It a great pleasure for Skin Diving, Snorkeling and Scuba diving. where the crystal glass waters gave out its amazing underwater view from shore and vast oceans wonders underneath it, Very accessible to commuters and travelers by car, Bike or Boat. It's a nice gateaway"
	},
	{
		"User": "markbenjamin",
		"Location": "Baguio, Philippines",
		"DateofReview": "July 23, 2015",
		"ReviewTitle": "Semi White Sand Beach",
		"Review": "The beach has \"semi white sand\". Nothing really special aside from that. It has a lot of dead corals and trash. If the government and community will help hand in hand to make this place better it can really compete to the other beaches in...More"
	},
	{
		"User": "KingRegis",
		"Location": "Marikina, Philippines",
		"DateofReview": "June 20, 2015",
		"ReviewTitle": "Cheap Entrance, Clear Waters",
		"Review": "The Kaputian Beach is a government run beach. Entrance is just P10 a person. Huts can be rented for P100. Do not expect for a Super Clean beach. The water here is clear and clean even though it is beside a ferry terminal. The beach...More"
	},
	{
		"User": "JustJyv",
		"Location": "Makati, Philippines",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "Affordable White Beach Destination",
		"Review": "Samal Island is just an hour away from downtown Davao City and you have 2 options to go there. One is by boat which is via Sta. Ana Port (takes 50 mins) which will take you directly to Kaputian port. 2nd is via Sasa Wharf...More"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 27, 2015",
		"ReviewTitle": "its ok",
		"Review": "the beach is pretty clean. the enterance fee is low. there is very little coral to see. a lot of sea urgins. it is better to rent a banka and go to talicud"
	},
	{
		"User": "islandtravelph",
		"Location": "Taguig City, Philippines",
		"DateofReview": "April 9, 2015",
		"ReviewTitle": "relaxing, peaceful white beach in samal island",
		"Review": "relaxing view, nice white beach but other parts are deep so you have to be very careful while swimming. nipa huts are for rent but this is part of our tour with the hotel so could not say how much. great stay in samal but...More"
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "January 13, 2015",
		"ReviewTitle": "Favorite Hang-out Place",
		"Review": "I just recently moved from Manila to Davao and so far, among the places that I've been to... This is my favorite hang-out place... Why? It's just 1 hour away from the city and you will be relaxed with the ambience and strong wind in...More"
	},
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "October 5, 2014",
		"ReviewTitle": "Beautiful white beach but be careful",
		"Review": "Kaputian beach, Samal Island is accessed from the road running parallel to it via a turnstile where a small admission fee is payable. It is possible to rent beach huts, which are in fairly good condition, not far from the water's edge. The beach is...More"
	}
]
