[
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "March 4, 2018",
		"ReviewTitle": "Just dropped by here after our Overview trip",
		"Review": "Fresh air and lots of space to go around. This is not really well kept compared to the other mountain resort nearby. Our first time here just curious how is it in Loleng's/"
	},
	{
		"User": "Ging A",
		"Location": " ",
		"DateofReview": "October 5, 2017",
		"ReviewTitle": "Terrible!!!",
		"Review": "Difficult to find any staff around and the pool is too dirty. We drove for 2hrs just to get there paid the entrance then we saw the pool and hurriedly decided to go home. Total waste of time, this should not be at Trip Advisor."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "August 30, 2016",
		"ReviewTitle": "Not Much To Do",
		"Review": "If you are not into swimming, there is not much to do. One thing which is nice is the air is clean and fresh being in the mountains. A little disappointed with the food and so glad the family could at least swim. Probably wouldn't...More"
	},
	{
		"User": "777Luis51777",
		"Location": "Boston, Massachusetts",
		"DateofReview": "June 17, 2016",
		"ReviewTitle": "Lonely haven!",
		"Review": "a quiet place to stay. a nice place for family bonding and nature lover as well. better if you bring your own foods if you're planning to stay longer. can go hiking around the area. not a best place but i enjoyed my stay with...More"
	},
	{
		"User": "Aphio1925",
		"Location": "United Kingdom",
		"DateofReview": "May 21, 2016",
		"ReviewTitle": "Relaxing",
		"Review": "A good place to eat , relax and unwind. Children can play in the playground with the pigeons. Can see the City view from the top of the restaurant"
	},
	{
		"User": "Tins C",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "February 27, 2016",
		"ReviewTitle": "a resort in the mountain",
		"Review": "i like the climate, cool and green. the attraction of friendly doves who loves to play with the visitors. food are not so good but the place is excellent."
	},
	{
		"User": "rey m",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 22, 2015",
		"ReviewTitle": "nothing much",
		"Review": "There's nothing much to see in this resort, really. A couple of pine trees, grassy lawn, a basketball court, a not well maintained pond, a small playground, a couple of cottages that are good for an overnight stay, and that's just it. Your more than...More"
	},
	{
		"User": "Laking D",
		"Location": " ",
		"DateofReview": "December 14, 2015",
		"ReviewTitle": "Perfect for children",
		"Review": "Were here yesterday with my son and daughter, and I could say this place is perfect for children's cause it's not crowded and the playing ground is wide for children to enjoy. My son enjoy's dove's flock while giving them food. and by the way...More"
	},
	{
		"User": "Sunkissedguy",
		"Location": "Makati, Philippines",
		"DateofReview": "December 11, 2015",
		"ReviewTitle": "It target the masses",
		"Review": "If you want a better place to be in just go to Eden Nature Park, this place is overpriced relative to its quality."
	},
	{
		"User": "dorabelladc",
		"Location": " ",
		"DateofReview": "September 24, 2015",
		"ReviewTitle": "500 pesos to plug in our rice cooker.",
		"Review": "the place is not well maintained though. it is a nice location to have picnic , feed doves and have a dip in their cool pool, away from the bustling city life for a while. however, there are not much facilities.. like ,, the tables...More"
	},
	{
		"User": "Richthof R",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 26, 2015",
		"ReviewTitle": "team building in nature park",
		"Review": "Away from the city pollution and into the heart of nature. Where peace will take it's another form of Joy, Where you can spend time with a love one hiking and embracing the cold breeze in the morning and a little bit of dew in the experience. So perfect for family and friends and even couple who would love the privacy"
	},
	{
		"User": "iamatopmodel",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 18, 2015",
		"ReviewTitle": "Needs more improvement",
		"Review": "Dont get me wrong, i like the fact that it's clean and you get to enjoy the cool breeze with lush greeneries. I brought my car with me and i had a difficulty maneuvering because the road inside the property wasn't paved well. Sometimes one driver is obliged to stop in the middle of the sloped road just to let the other vehicle pass first."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "Mountain retreat",
		"Review": "It may not have as many attractions and activities compared to other mountain resorts but that's the charm differentiates Loleng's. Here, you can have more conversations and bonding moments with your loved ones while enjoying the cool mountain air or dipping in the cold spring-fed pool ."
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 23, 2015",
		"ReviewTitle": "price update",
		"Review": "My colleagues in the Homeowner's Association are planning to conduct a team building activity. I thought Loleng's is an ideal place. When you get a cottage for an overnight stay, everything is free as it is already included in the overnight stay. Since we're just having a day tour, entrance fee is P80.00 per person and another P80.00 for pool use."
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 24, 2015",
		"ReviewTitle": "great location but the food",
		"Review": "the location, bungalows and atmosphere is super. the food is medium and a lot is out of stock. but the staff is super friendly"
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "February 28, 2015",
		"ReviewTitle": "Unwind and forget your stress",
		"Review": "There are not many places in Davao and its surroundings where to relax and unwind and forget daily stress situations. Loleng's Mountain Spring Resort is a must visit, if you think you need to escape from your daily stress."
	},
	{
		"User": "batgurls",
		"Location": "metro manila",
		"DateofReview": "May 22, 2014",
		"ReviewTitle": "taking the day off at Eden Nature Park",
		"Review": "This is a late post. May 2013, while on a business trip in Davao we took the day tour package being offered by Eden Nature Park. The package was inclusive of a guided tour around the resort & buffet lunch for P520. In batches , the 16 seater open sided shuttle equipped with piped in sounds of nature & tribal drums took us around the well maintained & protected man-made forest. We passed by the greenhouse & herb garden, the nature trails, mini zoo of wild deer, the cottages and plantation of durian, marang & mangosteen trees. There was a quick stop at a vast wild garden of rare& lush foliage of flowering plants. Next stop was the Tinubdan cultural park, an open museum showcasing the rich cultural inheritance of southern Philippines. Young lumads (indigenous people of Davao) clad in their native costumes entertained us through a mini cultural show of song, dance, and playing of native drums & gongs. Lastly, we were brought to the ecotourism village with a spectacular view of Davao Gulf by the sprawling ampitheater of green grass. Overall , the leisure tour was very educational in 3 dimension. We tried one of their outdoor activity after the 2hr tour - the zipline! For P150, the 2way ride on top of pine trees was sooo smooth & fun :) No whiplash, unlike in Boracay. Restrooms are clean. Capping the day was the sumptuous & delicious buffet lunch. Simply superb because it is all natural & healthy, fresh from the farm. Really love their overflowing salad bar, grilled fish & pasta."
	},
	{
		"User": "Dibyne",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 20, 2014",
		"ReviewTitle": "Nice mountain park plus cold swimming pool",
		"Review": "Cool place for short vacation or day trips. Located in Eden, the weather here is a lot colder than in the downtown area. you can do a lot of things in this resort such as hiking, boating, biking, and even teambuilding activities."
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 9, 2013",
		"ReviewTitle": "perfect to spend quality time with the family",
		"Review": "I used to bring my family in the beach. We wanted something different this time around so I thought of looking for a place where it could be a \"first\" to my family. I thought of a mountain resort then. I didn't have any idea of what Loleng's would be like until we got there.\r \r The travel was just about a quarter of an hour from the city of Davao. From Toril proper, we drove our way up to the mountains for about 20 minutes. From the main entrance of Loleng's, we had to drive through a rough winding road. \r \r We got a family cottage. It has a small receiving room with a small TV, a dining area with a six seater round dining table, a small kitchen with a 2-burner gas stove, a small refrigerator and kitchen utensils. The cottage has one big bedroom with three beds.There are bigger cottages and a dormitory for big number of guests. One thing nice with the cottage we took was, it has a veranda where we had a good view of the place and the swimming pool.\r \r  Nice thing also is that the resort do not charge corkage on the food guests bring. The kitchen is equipt with utensils from pots to plates so we don't need to make orders in the restaurant. We brought food for 2 days so we prepared our food in our tiny kitchen That was big savings for us. There was also a grilling station near the cottages.\r \r We enjoyed the swimming pool a lot because spring water flows continously from the mountains, water is so cool, clear and clean. Excess water goes down to a manmade pond where guests can enjoy boating. There is also a children's playground and picnic tables. White doves are everywhere in the restaurant, I enjoyed seeing the birds together with my kids in the playground.\r \r I think the place is perfect during the Holy week. One can really get to meditate and pray as the place also have a chapel and a big cross is found on top of the hill.It's a perfect place to spend the Holy Week.\r \r Only, we retired early to our cottages when night falls as there were lots of insects. That was understandable as we were in the woods. Another thing my family and I enjoyed was having\r breakfast in the cottage veranda and waited for the sun to come up. It was amazingly beautiful.One can really enjoy a good view of nature.Marvelous.\r \r However, the place would be excellent if it is maintained well especially the pond, the boats and likewise the docking area. The staff are nice and can easily be requested for assistance. \r \r For travelers who would like to take a cab, the staff can call a taxi to pick you up in the cottage and bring you back to the city."
	}
]
