[
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 9, 2017",
		"ReviewTitle": "NEAT TEMPLE",
		"Review": "We stopped quick on our way to another place and it was neat to see. The guard will allow you in the building but you have to be quiet and take your shoes off before you can enter the temple. We got a lot of video and a few pics. If you are in the area it's worth a look."
	},
	{
		"User": "Ana L",
		"Location": "Pasay",
		"DateofReview": "July 24, 2017",
		"ReviewTitle": "Lon Wa Temple aka Sakya",
		"Review": "its also known as Temple of the Dragon, tho i think its more popular with the name Sakya. It's a chinese school located in Cabaguio, Davao. \r Fortunately during our visit, \"ate\" one of its caretakers welcomed us and gave us a tour of the 4 chapels inside the temple. \r it was such a solemn visit and an amazing glimpse of the buddhist culture."
	},
	{
		"User": "Charisse S",
		"Location": " ",
		"DateofReview": "February 25, 2017",
		"ReviewTitle": "Nice place for quick snaps",
		"Review": "Just to add in your itinerary, from the Croc Park take the side trip in the Lon Wa Temple and appreciate the architectural structure"
	},
	{
		"User": "Stuart K",
		"Location": "Kent, United Kingdom",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "temple",
		"Review": "it was very quiet ,but very nice ,its small but alot to see ,will go back again,its far away from most things but worth the travel"
	},
	{
		"User": "Mark w",
		"Location": " ",
		"DateofReview": "January 12, 2017",
		"ReviewTitle": "Great for a quick side-trip !",
		"Review": "We were not really sure to have this place be visited when we went to Davao. But to our surprise, this should be in your list! People are here are very accommodating. Worthy of your time!"
	},
	{
		"User": "77Raine27",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "September 9, 2016",
		"ReviewTitle": "Picture Perfect",
		"Review": "Nothing really special bout this place. It is just a Buddhist temple. They say it is one of the biggest one in the country. It also has a school at the back of the temple. Pictureque!"
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "August 30, 2016",
		"ReviewTitle": "Beautiful Buddhist Temple",
		"Review": "A small but extremely beautiful Temple. I personally love temples and this one is absolutely lovely. I spent time meditating and completely enjoyed my relaxing visit. Take the time the talk with the monks - worth every moment."
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "very solemn place",
		"Review": "its a very solemn place. have not stayed there long, but its a good place to pray. someone in chrage is also very patient to tour us around"
	},
	{
		"User": "Gromzzzz",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "June 20, 2016",
		"ReviewTitle": "Small but solemn place",
		"Review": "Lon Wa temple provides an insight on another religion. Appreciate the articulate woodwork. Our group had the opportunity to explore inside the temple. Lucky that we were allowed inside."
	},
	{
		"User": "Heri s",
		"Location": "blitar",
		"DateofReview": "March 23, 2016",
		"ReviewTitle": "Just simple place to have a look",
		"Review": "Nothing much to say about this place. It was a temple :) When we went there a bunch of people was praying. Since I was already in Davao I decided to visit this place."
	},
	{
		"User": "Graziosa C",
		"Location": "Luzon, Philippines",
		"DateofReview": "March 20, 2016",
		"ReviewTitle": "Solemn place",
		"Review": "Just simple place to have a look, we only allow to take picture at front, not sure to entrance inside temple or not since not try yet, but good architec, just here for fun tour ..."
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"DateofReview": "February 19, 2016",
		"ReviewTitle": "fantastic wood work",
		"Review": "The place is nice especially the vew. its very accessible for everyone to go to this place and the entrance is free.you got a chance to light their candle and make a wish to their Buddah"
	},
	{
		"User": "tezzag397",
		"Location": "Egremont, United Kingdom",
		"DateofReview": "February 11, 2016",
		"ReviewTitle": "A temple of calm",
		"Review": "let me take pictures thru out. even gave me a pamphlet on the life of Buddha. quite and peaceful place"
	},
	{
		"User": "palmerlaura",
		"Location": " ",
		"DateofReview": "December 24, 2015",
		"ReviewTitle": "Budist temple in Davao",
		"Review": "I am not a religious person but I do find Buddhist temples to be calm and peaceful and Lon Wa is no exception. If you like to meditate this is the ideal place. The building is very well kept, clean and tidy with beautiful wooden...More"
	},
	{
		"User": "LanzSister",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": "Even is not a very common religion in the Philippines, you can find some budist temples. Is not a busy place, as locals don't usually visit it, and tourist some times don't know about it. I was there last april and someone from the staff...More"
	},
	{
		"User": "Ormoc",
		"Location": "Ormoc",
		"DateofReview": "December 8, 2015",
		"ReviewTitle": "Haven for Meditation",
		"Review": "Very Nice Place I Want to Meditate always"
	},
	{
		"User": "RicomeetsBhebs",
		"Location": "Bulacan Province, Philippines",
		"DateofReview": "July 25, 2015",
		"ReviewTitle": "Solemn Place",
		"Review": "A bit hidden. One ride away from city proper. Plenty of wood carvings on the wall better not miss it. The Thousand Hand Buddha is so majestic. Don't forget to light an incense and make a wish. There is a small shop selling buddhist beads and bracelets and other items but quite expensive."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Philippines",
		"DateofReview": "July 8, 2015",
		"ReviewTitle": "Very accessible by public transportation",
		"Review": "I never see a temple before. Only just in movies. I am surprised that Davao has a Buddhist temple. The temple is small, the monks there are so friendly. They are not strict. They allowed us to take some pictures of their Gods statue. This temple is very accessible even by the public transportation. I think tourists must definitely visit this place. "
	},
	{
		"User": "James G",
		"Location": "Davao City",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "Yes, there's a Buddhist temple here",
		"Review": "Davao is not exactly know for religious landmarks that's why it's a surprise that there's actually Buddhist temple here. It may not be as grand as temples in other places but it has its own charm, and the Buddhist monks and staff are always friendly."
	},
	{
		"User": "KlausDORING",
		"Location": "Manila, Philippines",
		"DateofReview": "April 16, 2015",
		"ReviewTitle": "Lovely & Peaceful Temple",
		"Review": "I'm a fan of temples. I'm serious. I was glad that we were the only people touring and praying at the temple by the time we went there. The Buddha figures and other Chinese deities are gorgeous. The wooden carvings on the door and walls are intricate and beautiful.\r \r I love every part of it. The nice kuya who happens to be a security personnel there and a tour-guide, gave us plenty of time to visit and pray at each section of the temple. You can actually take photos here more freely as compared to other temples.\r \r It's a nice place to visit (and pray to), let the serene feel of the place calm you and keep you deep in words. I hope this would be in your list of to-go-to when in Davao."
	},
	{
		"User": "ingmar b",
		"Location": "Davao City",
		"DateofReview": "April 16, 2015",
		"ReviewTitle": "Not only just a temple",
		"Review": "One can't compare it with other Buddhist temples. Sure.But, I felt touched because of the amazing friendliness of the monks. Very different then in Cebu."
	},
	{
		"User": "Roseann G",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 24, 2015",
		"ReviewTitle": "great place for tourists",
		"Review": "the temple is small but gorgeous, the monks are super friendly and interested in you. the place is very unique in davao so go see it."
	},
	{
		"User": "superVeee09",
		"Location": "Calamba, Laguna, Philippines",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Just a temple.",
		"Review": "I've only been to 2 temples, one in cebu and in davao. Compared to cebu, the buddhist temple in davao is not that strict. You can just take pictures of their \"gods\" statue inside which is forbidden in cebu buddhist temple. It is also a bit small. We can even go inside wearing shorts. "
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": "Amsterdam",
		"DateofReview": "January 12, 2015",
		"ReviewTitle": "Buddhist Temple",
		"Review": "A serene place to contemplate. A well organized and well maintained area where caretakers managed to handle the visitors and let them feel the place as a place of worship and for the tourist as well."
	},
	{
		"User": "SimonDabbs",
		"Location": " ",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "2nd Visit",
		"Review": "My first visit was back in 2012. It was fun because there were a lot of people who are curious to do what the Chinese people are doing in the temple. There's a person who will assist you on how they are doing their rituals,...More"
	},
	{
		"User": "Alan Y",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "October 3, 2014",
		"ReviewTitle": "Genuine taste of Bhuddist culture",
		"Review": "I have now shown two separate sets of friends around this well-maintained temple tastefully built in the 1960s. I find a warm welcome at the temple. The caretakers trust visitors to wander around the precincts of the temple in silence, to reflect and contemplate. This...More"
	},
	{
		"User": "Leonardo L",
		"Location": "Petaluma, California",
		"DateofReview": "September 21, 2014",
		"ReviewTitle": "Serenity",
		"Review": "Nothing to do here except gaze at the Buddha in the front shrine, or (my favorite) Avolakiteshvara in the back, and meditate. That's enough."
	},
	{
		"User": "nav795",
		"Location": " ",
		"DateofReview": "June 18, 2014",
		"ReviewTitle": "It's okay ",
		"Review": "It's a Buddhist temple. You can pray. It's nice and quite. Good for have a break and do some meditation"
	},
	{
		"User": "MelP160",
		"Location": "Manila, Philippines",
		"DateofReview": "May 14, 2014",
		"ReviewTitle": "Quiet, interesting place",
		"Review": "The temple is well maintained and gives a good glimpse of Buddhist ways of prayer and worship. The prayer rooms are accessible, thanks to the security guard who enthusiastically acts as a guide. Wood carvings on walls and posts are well preserved and show good...More"
	},
	{
		"User": "Ulysses R",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 5, 2014",
		"ReviewTitle": "Serene Glimpse into practice of Buddhism",
		"Review": "Before stepping into the property. Stand just outside the gate and stay long enough to catch the scent of the yellow fire tree. Its a rare and delightful breath of flowers in hot and humid Davao. Just inside the driveway, visitors are welcomed by the...More"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Jewett City, Connecticut",
		"DateofReview": "December 14, 2013",
		"ReviewTitle": "Nice Place",
		"Review": "This is a nice place to visit if you never been to a Buddhist temple. I am not a Buddhist but wanted to see what a Buddhist temple looked like. There is no charge to get inside. They just ask for a donation. Our tour guide was the security guard. He showed us the different areas of the temple and was very happy to take pictures of us if we asked. I would definitely recommend this place if in Davao City."
	},
	{
		"User": "xChaLeex",
		"Location": "Davao City",
		"DateofReview": "December 5, 2013",
		"ReviewTitle": "Temple in the city",
		"Review": "A temple visit is the least u expect to do in Davao, a place of know for nature and its colorful native culture. Lon Wa Temple lets guest have a glimpse of the city's diversity. It's not as grand as those in Bangkok but it has its own charm."
	},
	{
		"User": "Reimmak",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 6, 2013",
		"ReviewTitle": "Rare attraction",
		"Review": "The Temple is a rare attraction you won't see often in other places. It is located in Cabaguio St., just ask the jeepneys or tricycle to get you there. There is on duty guard to welcome you and brief the relevance of this place. Entering the temple is the Buddha with koi fish in the pond. Inside is the large Buddha and depending on your visit you may see Buddhist (or whatever) chanting and doing their rituals. There are also place like prayer room in a counterpart of Catholic as adoration chapel where they lay and lit incense to a god I think is Shiva. There is also store for Buddhist charms and bracelets.\r \r Very unique experience. The fee is free or you can donate a minimal amount."
	},
	{
		"User": "kalboHastings",
		"Location": "Marikina, Philippines",
		"DateofReview": "July 29, 2013",
		"ReviewTitle": "Free Tour",
		"Review": "They are renovating when we came but its still fun to see these kinds of temple. It feels like you are really in their country experiencing their culture and history. You can only go to the shrine and up to the second floor. Remember to remove your shoes or slippers. Visiting the temple is free so kindly give something if you can, plus the security guard is very accommodating. "
	},
	{
		"User": "Chris d",
		"Location": "Hastings",
		"DateofReview": "July 18, 2013",
		"ReviewTitle": "Tranquil",
		"Review": "I felt at peace here. such beauty & tranquility. The guard was really helpful although he preferred to speak with my wife rather than in English BUT I just soaked in the atmosphere & serenity."
	},
	{
		"User": "nasmej11",
		"Location": " ",
		"DateofReview": "July 1, 2013",
		"ReviewTitle": "A place for worship",
		"Review": "We were greeted by the guard who toured us around, telling us where the altars are, where we can take pictures. The main altar was spacious and has shakyamuni buddha. There's a smaller altar on the 2nd floor where you can light some incense. Materials for divination are here as well. There's also a small shop where you can buy amulets, small statues, prayer beads etc. this is place for worship so proper etiquette must be observed. The atmosphere was peaceful and the tenants were friendly."
	},
	{
		"User": "sheng4",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "March 31, 2013",
		"ReviewTitle": "small buddhist temple",
		"Review": "Lon Wa temple is a small Buddhist temple.The entrance is free. The guard at the entrance is very knowledgeable because he had been working there for 25 years. Take the the chance to make him as your default tour guide. Lastly, dress appropriately."
	},
	{
		"User": "ccduckie",
		"Location": "davao ccity",
		"DateofReview": "January 10, 2012",
		"ReviewTitle": "interesting",
		"Review": "way to know more.....................................................................................................................................and mysteries behind it."
	}
]
