[
	{
		"User": "Amani C",
		"Location": "Caloocan, Philippines",
		"DateofReview": "March 1, 2018",
		"ReviewTitle": "fruit pasalubong",
		"Review": "affordable prices and easy to find as its located outside Magsaysay Park and in front of Chinatown Arc along Magsaysay Avenue."
	},
	{
		"User": "Graziosa C",
		"Location": "Luzon, Philippines",
		"DateofReview": "January 26, 2018",
		"ReviewTitle": "ordinary",
		"Review": "Fruits are not that sweet and fresh as expected. but cheaper that any fruit stand. If you want pomelo chooe - Gloden Fruit and If you want durian and mangosteen choose this place"
	},
	{
		"User": "roymksh23",
		"Location": "Makati, Philippines",
		"DateofReview": "June 6, 2017",
		"ReviewTitle": "I Love Fruits",
		"Review": "Hi Travelers and Readers, Good Day! I would like to showcase my city to the world. If you happens to be visiting in Davao City. Please visit Magsaysay Fruit Stand. This is in front of the China Town in Davao City. The place sells many...More"
	},
	{
		"User": "Marianit M",
		"Location": "Sweden",
		"DateofReview": "June 6, 2017",
		"ReviewTitle": "Never skip!!",
		"Review": "I love durian! I've been eating durian since I was a kid. I even ate a durian straight from it's tree in the forests! LOL And here, you can have fresh durian fruits with other cousin fruits of durian like \"marang\" etc.. Eat like a...More"
	},
	{
		"User": "Norm H",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "June 5, 2017",
		"ReviewTitle": "You can skip this one....",
		"Review": "We thought, Local Fruits! Great! But truthfully, you'll do better at the local Robinson's Market or SM Market. We strolled the length and everything was dirty and grungy. Bummer!"
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "April 11, 2017",
		"ReviewTitle": "Durian heaven ",
		"Review": "Durian will be available all year round (cheaper when it's in season). You can also eat marang, somewhat similar to jackfruit. Try going through the stalls, although the they are priced similarly, it's best to choose which ones look (and ironically smell) good for you....More"
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 22, 2017",
		"ReviewTitle": "Beautiful and strange",
		"Review": "These stores offer Dorian, Pomelo and Mangosteen. Plus some products from these fruits. These fruit stands are identical. You have no idea where to buy, there is just no difference between them. Strange thing. Maybe some day one started there and with time the others...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "December 28, 2016",
		"ReviewTitle": "Exploring!",
		"Review": "Local fruit stalls are seen along the road but all close to the Magsaysay Park. We enjoyed the adventure. Fruits are available in season or not but we found it here."
	},
	{
		"User": "backpackingfoodieph",
		"Location": "Cainta, Philippines",
		"DateofReview": "December 9, 2016",
		"ReviewTitle": "Davao' Signature",
		"Review": "You will really feel that you're in Davao when you do your Fruit Marketing in Magsaysay. They have lots Durian Fruit stands and varieties of fruits like mangosteen, marang, pomelo and local snacks that you came bring back home for your family and friends."
	},
	{
		"User": "Christine F",
		"Location": " ",
		"DateofReview": "October 27, 2016",
		"ReviewTitle": "Affordable Price",
		"Review": "Hte price of the fruits are cheaper than Bankerohan. However, the packaging is not that good especially if you are boarding in a plane."
	},
	{
		"User": "Janna Michelle B",
		"Location": " ",
		"DateofReview": "October 23, 2016",
		"ReviewTitle": "Craving for fruits? No problem",
		"Review": "If you are visiting Davao City, Magsaysay Park is a place to be.\r It is place in the city where you can buy and eat different fruits. The fruits usually sold in this place are mangosteen, durian, lanzones and langka. However, the prices of these fruits depend on their season. If the fruit is said to be \"in season\", then the price might be lower than those times when it is not in season."
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "lots of fruits especially durian and mangosteen",
		"Review": "went there during kadayawan festival and the fruits are overflowing. affordable and fresh too. they are located just right outside the magsaysay park area, in front of the chinatown arc. there's a big label so it's easy to spot it. and the smell of fruits will lead you there for sure."
	},
	{
		"User": "Erin M",
		"Location": "Manila, Philippines",
		"DateofReview": "August 21, 2016",
		"ReviewTitle": "Typical Tourist Place",
		"Review": "I've tried a couple of markets here in Davao for the fruits I have to bring back home and Magsaysay Park was the most commonly recommended one. Finally got to try it on my trip now, unfortunately though, this is my least favorite place. Not sure if it's because of the crowd or the \"tourist trap\" vibe it gives out. There are a few who beg for money and a couple of jewelry sellers bugging you to buy their goods. They also dont seem too knowledgable on packaging the fruits for a flight back to Manila. If you want to shop in peace and get the complete packaging for your fruits (esp. Durians), i would suggest to go to Bankerohan instead. Also, I thought the durians i got were a steal already but my driver told me i could have gotten it cheaper elsewhere (Bankerohan ). But at least i finally got to go there. "
	},
	{
		"User": "Dale C",
		"Location": " ",
		"DateofReview": "July 30, 2016",
		"ReviewTitle": "Different choices",
		"Review": "Went to this place to eat their durian. This place has a lot of fruits and different local delicacies to choose from."
	},
	{
		"User": "Lawrence A",
		"Location": "Quezon City, Philippines",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "Pasalubong",
		"Review": "It was in this place that I first tasted Durian. And it was delicious. There's also a park nearby where you and your friends can stroll."
	},
	{
		"User": "daveholden",
		"Location": "Lake Forest, California",
		"DateofReview": "May 29, 2016",
		"ReviewTitle": "You will love all of the fruit choices!",
		"Review": "The fruit here in Mindanao is spectacular and these fruit stands represent the best of the best! You can find anything you would like here and try some new fruits that you have never tried before."
	},
	{
		"User": "SherwinJoseph",
		"Location": "Luzon, Philippines",
		"DateofReview": "April 15, 2016",
		"ReviewTitle": "Fruits and local tastes",
		"Review": "Magsaysay Ave in Davao City will delight Durian lovers. There are fruit and food stalls along the avenue. You have choices. \r \r Fruits available are mangosteen, durian, and other fruits in season. \r This place is recommended for fruit lovers. Surely, you'll find something to eat. \r \r Also, there are restaurant where you can dine. "
	},
	{
		"User": "kenlovekona",
		"Location": "Captain Cook, Hawaii",
		"DateofReview": "March 18, 2016",
		"ReviewTitle": "great experience",
		"Review": "Great experience even for the most experience tropical fruit expert. (It's my job). There are a few things too be careful of. There are many many beggars and usually the stall keepers will shoo them away but becareful when you put things down. Do not be afraid to try durian. There are many types and not al smell bad. Try pummelo, the ancestor of the grapefruit. Enjoy from 630 in the monring to avoid crowds and traffic."
	},
	{
		"User": "edinstk",
		"Location": "California",
		"DateofReview": "January 26, 2016",
		"ReviewTitle": "Durian a new a different experience!",
		"Review": "Local Fruit in abundance: Langka, Pomelo, Rubatan, Lanzones. Recommend early morning arrival to try Durian. Amazing to watch staff open up a Durian in seconds. I didn't find the smell at all difficult but the texture, color, mushiness, makes it an experience to try. I found the fruit to actually be flavorful just don't look at it. The smell of durian in the later part of the day however a bit arresting."
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "January 23, 2016",
		"ReviewTitle": "I eat this",
		"Review": "I eat this thing, and it's not so bad at all You should try this ;) They really have a lot of this , i forgot the name how they call that. By the way enjoy."
	},
	{
		"User": "David B",
		"Location": "Pasay",
		"DateofReview": "January 10, 2016",
		"ReviewTitle": "touristy, but a must-try",
		"Review": "if you love durian, then you don't need any convincing to try this. coke paired with durian while traffic buzzes behind you is something one must experience in davao. if you don't like durian, then perhaps a sampling of the different vareties might convince you otherwise. ask for the yellow cob and arancilla varieties"
	},
	{
		"User": "daveholden",
		"Location": "Lake Forest, California",
		"DateofReview": "October 29, 2015",
		"ReviewTitle": "Unbelievable fruits to see! ",
		"Review": "This is really worth experiencing for the sheer delight of seeing all the strange and exotic fruits! It is extremely popular with the locals and offers tremendous deals ..."
	},
	{
		"User": "Malou B",
		"Location": "Quezon City",
		"DateofReview": "September 10, 2015",
		"ReviewTitle": "Local fruits galore",
		"Review": "This is the place to taste local fruits like durian, marang, mangosteen. The prices are reasonable. There are tables and chairs for you to enjoy the fruits and plastic gloves and napkins to use for durian. Drinks are also served."
	},
	{
		"User": "Quezon City",
		"Location": "Quezon City",
		"DateofReview": "September 5, 2015",
		"ReviewTitle": "Native fruits galore",
		"Review": "The fruits in season in September are durian, mangosteen and rambutan. The pomelo are plentiful but not as sweet. Durian comes in 3 varieties and are cheap (ranging from P30-45); mangosteen (P30 for not so ripe and P40-45 which are dark in color). We ate durian in the place which provides tissue and plastic gloves if you do not want your hands to smell durian. Drinks are also served. There are plastic chairs and tables. A good time to eat durian is after dinner when there are fewer people. We watched a truckload of durian being distributed to the stalls. Since the stalls are beside the road, there are children beggars who approach the customers and are driven away by the stall owners. Smoking is definitely not allowed unless you want to pay a fine of P10,000 ($200)."
	}
]
