[
	{
		"User": "MissGlobeTrotter24",
		"Location": "Ruswil, Switzerland",
		"DateofReview": "3 days ago",
		"ReviewTitle": "Low standard of animal wellfare",
		"Review": "Malagos prides itself in being a nature park, a place to get away from the hassle of city life. My friends and I wanted to have a nice day trip here at Malagos and relive the wonder of being in nature. Sadly though, the park is not well kept at all. A lot of the free facilities in the park are starting to rust and cannot be used properly. Ponds are full of algae so you can barely see the fish. Garbage was in the ponds and on the walkways.\r \r In the horse stables, we saw horses that had a thick rope or towel tied beneath them that seemed to hinder them from sitting or laying down. I am no horse expert but that definitely did not seem comfortable and being forced to stand the whole time.. well.. And I don`t believe the horses were being readied for a Kalesa ride since there was no one around. \r \r Same thing was observed with the well-known albino Carabao. The Carabao was tied to a pole with a Kalesa secured to it`s back. This was at around 12.00 noon. There was no water insight and it was really, really hot. And since it`s an Albino Carabao, its leather skin has none of the natural sun protection other Carabaos have... Also, I don`t understand why it had to be secured to the Kalesa when no one was waiting for a Kalesa ride. It seemed that the wooden structure on it`s shoulders was heavy - even if Carabaos are animals that are used to working, I don`t think they should be tied to Kalesas in the heat of the sun at noon time :(\r \r All in all, we were all very disappointed. Please take better care of your animals and their surroundings."
	},
	{
		"User": "Lovely Anne G",
		"Location": " ",
		"DateofReview": "1 week ago",
		"ReviewTitle": "A Place Called Sanctuary",
		"Review": "We had fun strolling and seeing the animals. We've seen other breed of animals that are not found here in Philippines. But sadly, we weren't able to see other breeds of birds because of the avian flu issue. But it's ok though. Better be safe than sorry. That macau in the picture below is now my baby's friend it's really friendly and playful. Don't forget to visit their Chocolate Museum. Their ice cream is a piece of heaven.\r \r It really is a sanctuary for enjoyment, adventure and peace."
	},
	{
		"User": "Karen N",
		"Location": " ",
		"DateofReview": "1 week ago",
		"ReviewTitle": "Very nice place",
		"Review": "The place is great for kids, there are a lot to see and activities for children. Great photo opportunity. "
	},
	{
		"User": "Dr_Bingcarlos",
		"Location": "Quezon City, Philippines",
		"DateofReview": "2 weeks ago",
		"ReviewTitle": "Very realxing!",
		"Review": "It has been years since my last visit and I was pleasantly surprised with all the improvements done in the place. I particularly loved the Chocolate Museum (and the chocolate products)! Also loved the baked goodies coming out of their kitchen!"
	},
	{
		"User": "Maze M",
		"Location": " ",
		"DateofReview": "3 weeks ago",
		"ReviewTitle": "Good Enough",
		"Review": "Malagos Garden Resort is a place for family bonding activities. It was an hour trip from the city of Davao to the resort. It was around 4pm when we got there and still paid the entrance fee. The main reason why we went there was for the Chocolate Museum. It was a walking trip in the whole venue. I liked the fact that kids would really enjoy the facilities made for them. What I didn't like was the hot weather when we went there. Since we didn't bring an umbrella, I was hiding under all the possible shade available while we were going to the Chocolate Museum. Overall, it is a good place for families."
	},
	{
		"User": "mmil094",
		"Location": "Christchurch, New Zealand",
		"DateofReview": "3 weeks ago",
		"ReviewTitle": "Pricey entrance fee not as advertised",
		"Review": "I came with my family to pay a visit to the chocolate cafe on site after having read I could get into the cafe without paying for the whole resort, but paying a lesser fee. Given there were ten of us they could have made the fee back a few times over by having us into the cafe where we would likely have bough meals. But they refused to budge or give a group discount. Given the general poverty in the Philippines, and the fact they were advertising it as a place to showcase local produce, I would have thought there would have been more affordable options for locals hoping to visit."
	},
	{
		"User": "Carina d",
		"Location": "Philippines",
		"DateofReview": "3 weeks ago",
		"ReviewTitle": "Worth a vist when in DAVAO.....",
		"Review": "Have been to this place a number of times (being a Davao resident) but since the last two visits last year and the year before that where we took some Filipino balikbayan friends - was pleased with all the changes in the place. They've added some stuff that makes the place so Instagram-worthy and \"in\" with the times. Of course, you would not miss out on the orchids, the plants, their birds and animals as their \"basic attractions.\" \r Have not seen their \"bird show\" lately as the last time we were there, it was raining so there was no show. But it is worthy to watch, too, if you happen to visit on Sundays. It is a MUST! \r \r My TIP: If you want to have a good buffet lunch - visit during weekends and holidays where it is being offered, although a weekday is also nice but food is \"ala carte.\" Buffet fare has a good selection from salads to soups to the main dishes and desserts Worth the price of P650 which includes the entrance fee. Plus, the staff at the restaurant are really warm and friendly. Good customer service! \r Don't forget to go to the \"Malagos Chocolate Museum\" and try for yourself how these award-winning chocolates are being made. Nice & unique experience! We brought home our very “own-made chocolates\" in boxes.Yummy! \r \r If you have the time when in Davao, go visit this place - be prepared to walk around and take a lot of pictures. Plus bring a huge appetite! Enjoy! :)"
	},
	{
		"User": "small-skiing-mole",
		"Location": "South East England",
		"DateofReview": "4 weeks ago",
		"ReviewTitle": "Beautiful gardens, cute animal show, excellent buffet lunch, friendly staff",
		"Review": "Visited for lunch with Filipino friends living in Davao. First impressions were excellent, beautiful entrance hall, friendly staff, attractive gardens. The buffet hall is also nice - spacious, clean and cool with live entertainment, traditional music and dancing. The food is excellent, lots of local dishes to choose from, loads of fruit too. I would advise you to miss breakfast, so that you can make the most of the \"all you can eat\" offer! The chocolate museum is very interesting and worth a visit. There are some hands on things to do, but it is mostly displays and information about cocoa growing and chocolate manufacturing - as you would expect! We wandered through the beautiful gardens, sat on the swings and watched the animal encounter show, which is 15 minutes of fun aimed at children, but enjoyable for all, as long as you like birds!\r \r All in all, a great place to go as a special treat, but definitely skip breakfast if you go for the buffet lunch!"
	},
	{
		"User": "ChenaVi14",
		"Location": "Davao City, Philippines",
		"DateofReview": "4 weeks ago",
		"ReviewTitle": "Make your own chocolate",
		"Review": "Malagos chocolate is known for its international award in the United Kingdom. The place recently started a \"make your own chocolate\". For only 450 pesos per person (no sharing, by the way), the customer can already make 200 grams of his or her own version of Malagos chocolate topped with his or her chosen toppings. This is a great ideal bonding activity with the family."
	},
	{
		"User": "Cancun, Mexico",
		"Location": "Cancun, Mexico",
		"DateofReview": "5 weeks ago",
		"ReviewTitle": "FAR.",
		"Review": "The place is very far from the city, so if you plan to go here, I suggest that you rent a car or arrange a car service. The lunch buffet was great, the food were really good. As per the activities, there are really not a lot of things to do. Can tour the whole place in 2 to 3 hours max."
	},
	{
		"User": "rracarr",
		"Location": " ",
		"DateofReview": "March 11, 2018",
		"ReviewTitle": "Holy Week ",
		"Review": "Open po ba kayo ngayong Holy Week March 28 to April 1? My family is planning to visit Davao durinh that time. Thank you. "
	},
	{
		"User": "Mhina1021",
		"Location": "Pasig, Philippines",
		"DateofReview": "March 3, 2018",
		"ReviewTitle": "Switzerland of Mindanao",
		"Review": "If you're looking for a good place to just dine and enjoy chocolates, this is the best place for you when in Davao. Food? Delicious. A bit pricey but worth it. You can splurge a little bit for their infamous chocolates as well. "
	},
	{
		"User": "Amani C",
		"Location": "Caloocan, Philippines",
		"DateofReview": "March 1, 2018",
		"ReviewTitle": "worth the travel",
		"Review": "Super fun and good for all ages. A wide garden resort that everyone esp for families will love. I think its an hour drive from the city, but definitely worth the travel."
	},
	{
		"User": "doctorfoxtrot",
		"Location": "Manila Philippines",
		"DateofReview": "February 17, 2018",
		"ReviewTitle": "Dont Miss out on the Food products",
		"Review": "Good place to stay for some photo ops . But we are not able to linger much longer since we are pressed for time. But must do here is buying the cheese , and chocolates for they are cheaper here compared to other outlets ."
	},
	{
		"User": "Farhan N",
		"Location": "Kuching, Malaysia",
		"DateofReview": "February 8, 2018",
		"ReviewTitle": "under rated!",
		"Review": "this place is so under rated & under promoted...they have chocolate museum inside & parks with varieties of unique figurine &statues for photos..its a pity that we can only be here for short visit due to time constraint...this garden can definitely par to Eden park"
	},
	{
		"User": "Glimzerlyn T",
		"Location": " ",
		"DateofReview": "February 7, 2018",
		"ReviewTitle": "Best Chocolate ever! ",
		"Review": "We bought chocolate and wine here and had a snack they have some of the best chocolate in the world here highly recommend you get some."
	},
	{
		"User": "looklikecris",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "January 29, 2018",
		"ReviewTitle": "Nature and chocolates!",
		"Review": "At first I was hesitant because of the entrance fee which costs 300 for adults and 150 for kids 3 above, but I was glad I did explore the place. It was a good place for the whole family. My kids enjoyed feeding the birds and fishes. \r \r You must go before 10.30 am for the bird show. We still have a great time though. My kids learned a lot about animals, plants and chocolates! They have a chocolate museum where you can make your own chocolate.\r \r Lastly, they also serve eat all you can buffet from 11am -2pm. It was very good and you won't regret it."
	},
	{
		"User": "ymalih",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 24, 2018",
		"ReviewTitle": "Back to Being Child...",
		"Review": "This place is more than a resort. This place has zoo, interesting playground, butterfly garden, swimming pool and chocolate museum.\r \r It was really a quick visit and we missed a lot of places here. But we love the chocolate and icecream that we bought from the chocolate factory.\r \r To be honest, I already forgot some of the details in the museum because the kid inside of me awaken in this place. And I keep on asking... Where is Willy Wonka? I think I could spend all days playing here."
	},
	{
		"User": "Celeste N",
		"Location": " ",
		"DateofReview": "January 23, 2018",
		"ReviewTitle": "A place for nature and chocolate lovers ",
		"Review": "Malagos Garden used to be just a nature stop but now it has evolved into a nature and food stop. The opening of the Chocolate Museum has provided a twist to what it can offer : learning about the history of the chocolate, its preparation from bean to bar and, of course, tasting and eating! A stroll outside the museum definitely provides the relaxing feel of nature. "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 8, 2018",
		"ReviewTitle": "The best Chocolate ice cream in Davao! ",
		"Review": "Malagos Garden Resort is home to the country’s 1st chocolate museum. You get to watch, experience and learn the “tree to bar” experience of internationally awarded Malagos chocolates. Before exiting the chocolate museum, you’ll pass through the Cafe where I had the best chocolate ice cream ever! The Tablea ice cream is thick & creamy - packed with authentic chocolate goodness. It is only being sold here in Malagos Garden Resort. So if you’re craving for this addictive treat, you have to travel far and pay the resort’s entrance fee just to get in the cafe. I hope that this would be more accessible to patrons in the near future. "
	},
	{
		"User": "christine t",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 4, 2018",
		"ReviewTitle": "Nice Place",
		"Review": "Yummy foods, nice place and friendly staff. Though the food and their items are a bit pricey. But the vegetables they serve are yummy."
	},
	{
		"User": "Amy A",
		"Location": "Ithaca, New York",
		"DateofReview": "January 2, 2018",
		"ReviewTitle": "Great place to relax",
		"Review": "This is a great place to get away from busy lives. Green space with restaurant, museums and displays. Nicely maintained gardens with native plants"
	},
	{
		"User": "Helen C",
		"Location": " ",
		"DateofReview": "December 30, 2017",
		"ReviewTitle": "Suroy suroy",
		"Review": "Lots of things to see and do. Carabao ride not worth it. Chocolate a must. Best to stay overnight aa there are so many activities"
	},
	{
		"User": "joann c",
		"Location": " ",
		"DateofReview": "December 29, 2017",
		"ReviewTitle": "Not impressed ",
		"Review": "I guess I have higher expectations. I was looking forward for a nice view view over looking davao. We paid $600 per person for a lunch buffet. The choices are not impressive. The bbq was cooked indoors, the smoke filled the hall. We smell like bbq when we got out of there. Not all activities are free. "
	},
	{
		"User": "MeowPaws",
		"Location": "Kuala Lumpur, Malaysia",
		"DateofReview": "December 22, 2017",
		"ReviewTitle": "Good Place for Photoshoots",
		"Review": "The place is a big garden run by a chocolate manufacturer. It'd be a nice venue for a photoshoot; but be sure to spray on some insect repellant. The chocolate ice cream was yummy!"
	},
	{
		"User": "Christine D",
		"Location": " ",
		"DateofReview": "December 19, 2017",
		"ReviewTitle": "Very Nature oriented",
		"Review": "This is a great place to do family bonding especially with your teenagers:)to relax and to explore.\r Nature wellness is superb,they have the butterfly interaction and birds too.a museum and different outdoor activities."
	},
	{
		"User": "Marlyn S",
		"Location": "Qc",
		"DateofReview": "December 11, 2017",
		"ReviewTitle": "Loved their chocolate",
		"Review": "Nice place. Good for picture taking. Had lunch here. Food was okey. Their chocolate was really good. Bought some. "
	},
	{
		"User": "Chrisshipp",
		"Location": "Southampton, United Kingdom",
		"DateofReview": "December 4, 2017",
		"ReviewTitle": "Avoid this dengue & malaria trap!",
		"Review": "Widespread planting of Bromeliads despite government health advice creates this mosquito ridden trap.\r This as well as “nickel & diming” practices, prices rising mysteriously from dining room to payment at front desk and broken promises to refund or waive excess unexpected charges means if you do go ahead and book, read EVERYTHING at least twice and get EVERYTHING agreed in writing first. Do NOT trust these people! Some of the worst practices I have had the misfortune to encounter over the past 2 decades. I for one will not be going anywhere near this place again!"
	},
	{
		"User": "RaffySun61",
		"Location": "Makati, Philippines",
		"DateofReview": "November 12, 2017",
		"ReviewTitle": "They Should Clean Up More.",
		"Review": "Place is nice and for a younger more active crowd so they should look into providing activities and attractions for an older set.\r \r The chocolate museum was very interesting but their chocolates sooo expensive.\r \r Place looked unkempt and tired. The restaurant is a bit pricey and the food small portion and nothing great. \r \r We enjoyed feeding the birds but they sell the tiny birdseeds so expensive P10 for 10 tiny seeds hehehe Ripoff... gone in 10 seconds when the cute lovebirds come to eat them off your hands so we spent a good P120...\r \r Hard to get to as it is quite a distance from the city and we paid P800 for a taxi to take us there and then waited for a long time for a taxi to take us back."
	},
	{
		"User": "Ringo T",
		"Location": " ",
		"DateofReview": "October 21, 2017",
		"ReviewTitle": "Best Chocolate Ice Cream",
		"Review": "I found the best chocolate ice cream best paired with coco nibs and mint. A must try when you drop by their chocolate factory. The museum showcased different tools and innovations about the production of chocolates. The lunch buffet was not good though. Pretty basic and not tasty. It was plain. The butterfly sanctuary was a good sight with many great species. "
	},
	{
		"User": "Raf O",
		"Location": "Philippines",
		"DateofReview": "October 20, 2017",
		"ReviewTitle": "Worth visiting this place",
		"Review": "Very well organized, clean and friendly staffs. Cacao chocolate is a must here. The birds, butterflies and other animals are beautiful. It's a nice and relaxing place to visit. We didn't stay at their hotel but it looks good...maybe next visit"
	},
	{
		"User": "pastelprism",
		"Location": "Manila, Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Blanca's a Charm",
		"Review": "We went here after our trip from Eden. It is a well-maintained property, given how difficult it is maintaining a garden. Someone who loves nature will definitely enjoy here. It was raining when we went here, so we weren't able to fully enjoy as it would require a lot of walking. An alternative that we got was to ride a \"karitela\" (cart) being pulled by their white carabao Blanca, who is a charm. We opted not to go down anymore for photos as our legs were tired already from our previous activity. Their restaurant has a good list in the menu, but didn't try anymore because we had lunch already. Getting their chocolates is a must. We just find the place a bit expensive because besides their entrance fee, additional activities like the carabao ride, etc. have additional costs. We definitely recommend Malagos as a must-see whenever you visit Davao."
	},
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "October 15, 2017",
		"ReviewTitle": "Tranquil garden setting",
		"Review": "Malagos is really known for its chocolate, but has the added bonus of having its chocolate making factory in the midst of this garden. The bird dome is definitely worth a visit, so is the chocolate factory. You can even make your own chocolate at varying shapes for P50.00. Entrance fee is P200 per person. You can eat at their cafe - if you wish. Or even stay for the night. I did find their ice cream quite expensive though - P48 for one scoop!"
	},
	{
		"User": "joar380",
		"Location": "Manila, Philippines",
		"DateofReview": "September 24, 2017",
		"ReviewTitle": "Enjoying the nature at its best",
		"Review": "If you are in Davao City. Dont forget to include this as part of your itinerary. You can take a cab from Davao City to Malagos but be prepared to add a lil cash on top of the metered fare ( its a bit far, around 45 mins away and the cab has no passenger in going back to Davao ) Lets say metered fare is 550. adding 300 is not bad enough. or if you want you can take a van to malagos ( just ask the friendly Davaoneos how to get their, its way cheaper )\r \r The entrance is 550Pesos that includes a lunch buffet so I suggest going their in the morning so you have plenty of time touring the entire garden. From the butterfly garden to the aviary and a lot more. They will give you a map and there are staff around the corner so feel free to explore. Then around 2pm I suggest you go to their Chocolate factory to experience your make your own chocolate theme, its 450 per 200grams of make your own chocolate session with apron, gloves, hair net plus you can bring your chocolate afterwards. \r \r Dont forget to try their dark chocolate as pasalubong \"souvenir\"for your friends and family. Its one of the best locally produced chocolates in the world. Dont forget to take pictures of course. Enjoy"
	},
	{
		"User": "I_Am_Gretchen",
		"Location": "Manila",
		"DateofReview": "September 6, 2017",
		"ReviewTitle": "A lot of activities to choose from, staff are helpful",
		"Review": "We were surprise with their exhibits. Its a good place for kids to learn about nature and they can play too. One day won't be enough for the kids.\r \r Their lunch buffet though... they have more people manning the buffet than the food. Their pineapples are super sweet. Vegetables are really fresh! Go for the fruits for dessert than the pastries."
	},
	{
		"User": "Mark Andrew A",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 6, 2017",
		"ReviewTitle": "Awesome experience",
		"Review": "Malagos was really worth the road trip. The Entrance fee of 550 was really worth it since it already includes a lunch buffet. The buffet was really sulit. Must try the chocolate making also."
	},
	{
		"User": "jonalber2",
		"Location": "Singapore, Singapore",
		"DateofReview": "September 5, 2017",
		"ReviewTitle": "Like a kid once more!",
		"Review": "I highly recommend this place for families with kids, or people who'd like to feel young again! They've got a really neat science-themed playground. A chocolate museum. And of course, a chocolate laboratory where you can make your own chocolate (and take it home!). One must try the tablea ice cream with suman (sticky rice)---to die for <3"
	},
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "August 14, 2017",
		"ReviewTitle": "It's an OK place to visit, with great chocolate",
		"Review": "The main reason I wanted to visit was to check out the chocolate museum. This was quite good, and the bar of 65% cocoa chocolate was very good indeed. But as a place to visit, I found it a little disappointing. It is badly laid out and poorly signposted. Much of the park is orientated towards children's activities, and there was not much botanical information given for the plant enthusiast."
	},
	{
		"User": "Amy S",
		"Location": " ",
		"DateofReview": "August 13, 2017",
		"ReviewTitle": "MOTHER NATURE IN MALAGOS!",
		"Review": "If you are looking for a beautiful place to visit where Mother Nature shows its heavenly beauty, try visiting Malagos Garden in the outskirts of Davao City. Everything is what you'll see about Mother Nature....the sound, smell and looks..."
	},
	{
		"User": "Tarlac",
		"Location": "Tarlac",
		"DateofReview": "August 5, 2017",
		"ReviewTitle": "To See and Taste First Hand Their World Famous Chocolate",
		"Review": "Our family of 2 adults and 2 kids were brought here by our relatives in Davao. The place have changed tremendously since the last time I went. Actually, the main reason we came is to see and taste their world-acclaimed chocolate. The Entrance Fee though was quite steep for the few attractions inside the resort. The entrance fee should have included already the use of all the facilities inside, but instead you have to pay for each of the kid game activities inside. The kids though loved the fun activities (at the expense of the parents). The Chocolate Museum was nice and very educational. We tried doing our own chocolate molds which was something new. And the best part of Malagos, is their really delicious chocolate, especially the 65% (don't buy the 85% dark chocolate - it is very bitter). Their chocolate is really world class, but sad to say, also has a world class tag price."
	},
	{
		"User": "Gerardo R",
		"Location": "Quezon City, Philippines",
		"DateofReview": "August 2, 2017",
		"ReviewTitle": "Rainy day at the resort",
		"Review": "Umbrellas were provided as it was raining at the resort. We enjoyed the Butterfly Sanctuary at the resort. The buffet was lunch was not that good. We also visited the chocolate factory at the resort."
	},
	{
		"User": "tianneXtianne",
		"Location": " ",
		"DateofReview": "July 30, 2017",
		"ReviewTitle": "Educational day at Malagos",
		"Review": "We came here during lunch time after visiting Philippine Eagle Center, which is just a 15pesos-motorcycle ride away. Malagos Garden Resort is located in the highway so it's easy to spot going to PEC.\r Entrance fee is P200 and you can tour the resort and take lots of instagram-able pictures. i only hoped that they waived the entrance fee for us since we ate at the resort cafe, more of a \"consumable\" entrance fee, as a suggestion..\r This resort has lots of activities for the whole family and you can make your own customized chocolates here. i enjoyed my 2.5hours here, especially in the bird-feeding dome.. i hope to return here and bring my pamangkins on my next davao trip."
	},
	{
		"User": "Ana L",
		"Location": "Pasay",
		"DateofReview": "July 24, 2017",
		"ReviewTitle": "a very chocolatey adventure",
		"Review": "commuting to here from davao city was quire a challenge. we took 2 jeepney, a van and a tricycle just to get here. travel time from city proper is more or less 2.5 hours depending on traffic conditions. \r entrance fee is at P200, which would allow you to take a walking tour inside the resort and the chocolate museum. please do check their website for the schedule of their shuttle tour. \r there are a lots of activities to choose from, bird watching, trekking, swimming. i think they have divided it into intellectual. physical etc. \r the chocolate museum was the highlight if the tour. it tells you the story of how chocolates were made. you can also DIY your own chocolates and choose from a variety of crunch to add to your chocolate, price is at P450 for 200 grams of chocolate.\r to relax, you can try their chocolate eh and suman."
	},
	{
		"User": "Shalom G",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "July 21, 2017",
		"ReviewTitle": "So Far, A Satisfying Makeover",
		"Review": "Yes, I say the makeover is satisfying because it's now far from the old garden resort it used to be. I so love the cutie lovebirds that were trained to feed from guests' hands...The experience was so ticklish and yet so exhilarating. Next, I loved wandering around the butterfly sanctuary - they were all there, those impeccably colored flying things, so lovable you just want them all on your hand!\r \r The best part of the tour was the chocolate-tasting. We had a fill of their best choco cupcakes, so delightful like no other..Super delicious; and the chocolate bars - so delicate they just melt on your mouth. Indeed, MLG has lived up to their name of makers of the best chocolate in the Philippines. Kudos!"
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "July 15, 2017",
		"ReviewTitle": "Various activities",
		"Review": "Getting there - we took a jeep to Bankerohan then an L3 van to Calinan then motor taxi to Malagos. \r (It's worth the long ride)\r We had lunch at the cafe (absolutely loved the seafood kare-kare) \r \r We decided to walk the route instead of joining the tour since we would be able to go at our own pace and get a lot of photo ops. \r \r I think the highlight would be the bird feeding, animal petting and the chocolatier part of Malagos. The stroll was made even better because of the beautiful landscaping and gardening, you can really tell great talent and patience was done in decorating the place. I'd suggest you take at least 3 hours to go around the area and enjoy the sites. "
	},
	{
		"User": "Anne P",
		"Location": " ",
		"DateofReview": "July 5, 2017",
		"ReviewTitle": "Only go here for Chocolate",
		"Review": "I think the entrance fee is pricey and it is sad that you cannot dine to the restaurant without paying the entrance fee. it would be good if they have that option. we ended just buying chocolate which tastes really good."
	},
	{
		"User": "Snob_Belly",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "June 17, 2017",
		"ReviewTitle": "Fun! Had it not been too hot, we would have stayed longer!",
		"Review": "Fun! Had it not been too hot, we would have stayed longer! \r \r Since I was 8, we go to malagos on weekends. But I haven't been here in a while and so much has changed. I'm happy about the chocolate museum. I hope they expand further and they get more popular. "
	},
	{
		"User": "Jerrilyn B",
		"Location": " ",
		"DateofReview": "June 10, 2017",
		"ReviewTitle": "A Wonderland!",
		"Review": "Upon entering you can already notice that the place was very good. Their lobby was huge and stylish. Then they will ask you if you will avail their buffet lunch.Then you will pay for the entrance fee then they will give the map.\r \r Upon seeing the map,Wow! so many attraction to visit. We only have 1hour for this tour, but it the place was very huge especially when you were just walking, because that time shuttle service was not available. so our planned 1 hr visit bacame more or less 2 and half hrs :D.\r \r Malagos has a landscaped garden of assorted tropical plants, century-old Durian and other fruit bearing trees, rare orchids, palms and other native ornamental plants; a Bird Park, a Butterfly Sanctuary; and a host of other wildlife species. They also have different recreational activities like Sky Walker,Fly wire,Kids outdoor,Skate Park,horse back riding,chocolate museum <3 <3 <3 and a lot more! with corresponding fee of course.\r \r If your into puzzle or mind games, visit the noah's deck you'll surely enjoy it :)\r \r Over all , i got very tired but really worth it! It was such a huge place 1hr is not enought for this place. Add more time to your itenerary when you go here if you really want to visit and enjoy every place of malagos :)"
	},
	{
		"User": "Niel D",
		"Location": " ",
		"DateofReview": "June 5, 2017",
		"ReviewTitle": "Worth the visit",
		"Review": "Even if its an hour away. Great to spend a whole they in. Entrance plus lunch buffet was good value at p550/$11 approx. Chocolate museum was similar to what you would find in developed countries, and kids would enjoy the playgrounds and obstacle courses / sky walks. "
	},
	{
		"User": "Zendy F",
		"Location": " ",
		"DateofReview": "May 26, 2017",
		"ReviewTitle": "It was Upgraded ",
		"Review": "Malagos is one of the famous tourist spots in Davao. Travel time is almost 2 hours if it is traffic from downtown area. It is child friendly place and they have this newly opened chocolate museum which allows visitors to see large chocolate stuffs and history of the local chocolates made from cocoa that is originally from davao. The entire museum is filled with the aroma of chocolate that makes you convince to eat chocolate right away. It is the best thing to see if you go to malagos. The rest of the resort are kinda boring and the garden is not well maintained. I love the activity area which is like a playground for adults. They have weird swings that all ages will enjoy. Another thing is that they have a pool that children will definitely have fun with it."
	},
	{
		"User": "Luke T",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "May 19, 2017",
		"ReviewTitle": "My wife enjoyed the visit here.",
		"Review": "We had our lunch here and had heavy rain, so we did not see much of the place. the food was not that good nor was the service of the resort, plus parking in not on site. I would not recommend it."
	},
	{
		"User": "Ram_B1969",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 6, 2017",
		"ReviewTitle": "Big and Full of Surprises",
		"Review": "A little far from the city proper but it's worth the trip. If you just plan to visit and not stay overnight, then try to save 3 hours or longer for you to explore and fully enjoy the place. I was there with my family, composed of adults, teens and toddler and everyone enjoyed. But I can also imagine exploring the place alone and still have fun. There's too much to see and maybe do, if you're the type who wants to really experience what they offer. A lot of surprises as you move from one area to another. It's such a big place with lots of different stuff to enjoy, so if you don't really like one area Im sure you can eventually discover something or some place that you'd love."
	},
	{
		"User": "elviep2014",
		"Location": " ",
		"DateofReview": "May 5, 2017",
		"ReviewTitle": "Just ok.",
		"Review": "Quite far from the city centre. It is on the way to the Philippine Eagle Center. The cab driver that we tried to get wouldn't take us there unless we pay a flat rate of Php 800 one way so we decided to rent a van from our hotel for a day tour.They have a small swimming pool which is available for day use, a small chocolate museum. The restaurant's pastry sampler and drinks are quite pricey. "
	},
	{
		"User": "JanaK123",
		"Location": "Penang Island, Malaysia",
		"DateofReview": "April 30, 2017",
		"ReviewTitle": "Beautiful, Quiet",
		"Review": "I enjoyed our short visit to Malagos. Plants and flowers were beautiful. My favorite, though, was the bird petting area. In a huge aviary that we could walk in, parakeets, cockatiels, and love birds flew freely and were not afraid of us b/c they knew we'd hold birdseed in our hands for them to eat. So fun! I also enjoyed the bigger birds in cages in the same area. One of them talked and so we had a little \"chat\"."
	},
	{
		"User": "Roxane M",
		"Location": " ",
		"DateofReview": "April 28, 2017",
		"ReviewTitle": "Exploring Malagos Garden",
		"Review": "Very beautiful landscape, noteworthy activity to do is bird feeding. Very delicious chocolate ice cream, the best choco in the country so far. Nice to visit again."
	},
	{
		"User": "iPesky",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 11, 2017",
		"ReviewTitle": "Just had luch",
		"Review": "I have been here a number of times for the past couple of years. Whenever i have visitors from other cities, i always take them here as one of our stops. \r There are a lot of thing to see and do in Malagos garden, there's a bird show on some weekends, their new attraction which is a chocolate museum, different structured arts, playground for kids, swimming pool, cafe and restaurant. \r Last time we were here was a Sunday for lunch. Usually, i don't have any qualms with their buffet but that time was a bit disappointing. We arrived around 12:30 and it seems like the buffet already ran out of food. It would take a couple minutes before the refills would come in but tue dissapointing thing about this was the choice of food for their menu. \r \r Pancit\r Spaghetti\r Okoy\r Fried chicken in lemon butter sauce\r Vegetable stir-fried\r Barbeque fish on stick\r Barbequed tomato & onion\r Iced tea\r Pineapple juice\r Water\r Brownies\r \r Maybe i missed 1 or two for the desert but this was it. For 450/head? Disappointing! Dont worry i'll be back with my kids cos this was one out of three times we've eaten there. My advise - be consistent please. "
	},
	{
		"User": "jedainz",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 6, 2017",
		"ReviewTitle": "Great activities for families especially little kids",
		"Review": "We especially liked the bird feeding dome. The petting zoo was great but it reeked with the smell of manure. It wasn't very presentable. The chocolate museum was also a great feat.\r \r Four stars because they need to improve their food. We went their past 12:30 pm and the buffet table was empty except for pancit. With a company that boasts of exceptional cheeses and high quality cocoa products, I expected better on the food and service. \r \r Another comment is that their amenities are all great. However, they lack people to assist on what to do and how to use the interactive activities. They need more people to attend to customers."
	},
	{
		"User": "Aurora M",
		"Location": " ",
		"DateofReview": "March 30, 2017",
		"ReviewTitle": "Nice place",
		"Review": "We went there that time raining. The place is nice. They have a cocoa but we cant buy because its expensive."
	},
	{
		"User": "paulapple",
		"Location": "england",
		"DateofReview": "March 24, 2017",
		"ReviewTitle": "Well developed ",
		"Review": "First visited 12 years ago since been heavily developed. Interesting with a wide variety of things to see and do. New chocolate museum a bit jumbled but interesting. Disappointed the winery not open but well worth a visit "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 11, 2017",
		"ReviewTitle": "Good place for the kids😊",
		"Review": "I brought my kids here for the 1st time even if we are only from Davao.They were so happy with all the animals they saw. They enjoyed the bird feeding, the science discovery area, the butterfly sanctuary, the zoo (farm animals). I highly recommend this place for parents with young children..you can just do the walking tour yourselves---good for the health plus it's tipid pa. Maybe for those with toddlers you can bring stroller so if they get tired you won't be carrying them throughout the walk. A must-see is also the chocolate museum. It's the first in the Philippines, something we can enjoy and truly be proud of. We were not able to tour the whole resort as it was already late in the afternoon when we arrived but we are planning to stay overnight next time as the kids really enjoyed the place. "
	},
	{
		"User": "Märijoice Angel... G",
		"Location": " ",
		"DateofReview": "March 4, 2017",
		"ReviewTitle": "Highlight of my Birthday Eve ;)",
		"Review": "Came here for their signature chocolates and cheese, and I tell you - magnifique! \r The place is just wonderful."
	},
	{
		"User": "JongLee",
		"Location": "Manila, Philippines",
		"DateofReview": "March 1, 2017",
		"ReviewTitle": "Why do they charge P200?",
		"Review": "Really. Why? \r \r We ordered food at their restaurant. We spent about P500 for 4 people. Took a small walk. Why is this worth P200 for the entrance fee? It's not even a very expansive garden. Oh and when we were there, there was no chocolate available. There were a few bags of unsweetened chocolate. That was it. Selection is larger in other places. This is supposed to be the factory. It doesn't make sense.\r \r Museum was still closed but we got to take a peek. Looks promising. The P200 maybe justifiable once this opens. Maybe. \r \r For now, you can skip this."
	},
	{
		"User": "Jeiel1987",
		"Location": " ",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "Great! Great! Great!",
		"Review": "One of the highlights of our Davao vacation. The place is amazing. Lots of things to see. I suggest getting a guide at the front desk before entering so they can explain each area of the resort (plus they can take photos of you hehe). The staff are very friendly. The Chocolate Museum opens in March so that's one thing I'm looking forward to seeing when I go back to Davao. There's a petting zoo, butterfly sanctuary and bird feeding area as well which are all awesome. I highly recommend going here if you're planning a trip to Davao."
	},
	{
		"User": "Milany A",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 5, 2017",
		"ReviewTitle": "Good place to chill!",
		"Review": "Good place to chill. The cool breeze is such a turn-on, so relaxing. Their butterfly sanctuary is kinda majestic. All in all, not a bad place for a day's getaway."
	},
	{
		"User": "Rogue0531",
		"Location": "Manila, Philippines",
		"DateofReview": "January 1, 2017",
		"ReviewTitle": "Good place to visit with family & friends",
		"Review": "Had the time of our life at the bird feeding area as flocks of birds fly to you to feed. In other aviaries, these birds can rarely be touched and in here, they themselves will come to you. Good experience for young & old alike :)"
	},
	{
		"User": "RenatoPinoyExplorer",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "December 21, 2016",
		"ReviewTitle": "Well maintained but no guide in sight",
		"Review": "After visiting the Eden Nature park and Philippine Eagle Center why not visit another nature park. It was getting late when we visited but it was still worth it the place was well maintained but unfortunately no one was around to explain or tour us around. we just rely on what we read around the park. My daughter wanted to the try the sky walking and other activities but no one was around. We went to the butterfly dome again since my daughter is really fascinated by them but no one was there as compared to the Eden nature park. No one approach us from the restaurant if we wanted to try the chocolate drink that was famous for but no one wanted to upsale all we got was stare. Luckily our guide told us to buy chocolates so we can personally taste it at home instead."
	},
	{
		"User": "Gali_Valiente",
		"Location": "Manila, Philippines",
		"DateofReview": "December 1, 2016",
		"ReviewTitle": "Nature retreat that is worth an entire day to visit",
		"Review": "If you love nature with the serenity of a sprawling complex of well maintained nature then this place is worth a visit for you might spend an entire day here. You do notice that years have been invested to carefully shape this place to where it is now. It is also home to an award winning Malagos Chocolate that can match the quality of other black chocolates around the world. They do have accommodations if you want to stay overnight. Of all the places I've been in Davao, this is #2 with #1 being the Philippine Eagle Center (which happens to be less than a kilometer from Malagos Garden Resort)."
	},
	{
		"User": "tonitanch",
		"Location": "Manila",
		"DateofReview": "November 20, 2016",
		"ReviewTitle": "lovely, serene garden",
		"Review": "We visited this coming from The Eagle Center mainly to buy the Malagos chocolates and cheeses. It is a garden with lots of interesting activities but with pockets of quiet corners if one would just want to have some peace and quiet. Worth visiting. Of course, the chocolates are very very good, as well as the Blush cheese that I got. "
	},
	{
		"User": "maeanndrea",
		"Location": " ",
		"DateofReview": "November 12, 2016",
		"ReviewTitle": "Good, but not enough",
		"Review": "Soooo expensive, entrance fee, plus swimming, sky walking, kalesa ride uuggrrhh! Almost everything and dont have much animals to watch to. Not worth for a 100 peso tour"
	},
	{
		"User": "tito u",
		"Location": " ",
		"DateofReview": "November 11, 2016",
		"ReviewTitle": "Memorable visit to happy birds",
		"Review": "This is a spacious resort with cottages with ethnic motif, trees, plants, restaurant with ingeniously prepared food, and happy birds perched on handler's shoulders as part of the Welcoming Committee to arriving guests. The resort owners are also into conservation of different bird species and upgrading of their cafe's menu from native goat cheese and tropical fruit wine. They even train small, medium-sized and large birds for beautiful exhibitions to every one in Davao to enjoy. Sometimes, they bring these lively and bird-friendly shows to other parts of the Philippines. It's truly a joy to be at Malagos Resort! "
	},
	{
		"User": "Abbie M",
		"Location": "Pasig, Philippines",
		"DateofReview": "November 2, 2016",
		"ReviewTitle": "Best chocolates in town",
		"Review": "The place is huge with lots of fun activities for people of all ages. Everything going we ordered for lunch in their restaurant/cafe tasted really good. We ordered lechon kawali, twice-cooked adobo, pinakbet, pork binagoongan. The chocolate freeze and the desserts, chocolate panna cota & chocolate molten lava, were to die for. They have their own chocolate farm/ factory & they make the best chocolates this side of the planet."
	},
	{
		"User": "ARNET12",
		"Location": "Toronto, Canada",
		"DateofReview": "October 18, 2016",
		"ReviewTitle": "Run down",
		"Review": "It's expensive and dirty. Lot of ants in the washroom. The sheets are old and stinky though the surrounding is beautiful, nice plants.. Not worth staying for the night."
	},
	{
		"User": "calorie_dg",
		"Location": " ",
		"DateofReview": "October 12, 2016",
		"ReviewTitle": "Mlahos Garden Resort",
		"Review": "This place is perfect for family. This place makes the world famous and award winning Malagos chocolate. But this place doesnt offer only chocolate the Malagos Garden Resort is also a place to relax, learn and wnjoy woth friends, family and couples and like me a solo traveller. You can see the attractions inaude with your p100 entrance fee and you can do the petring zoo, feed birds, get inside a butterfly garden, a bird show on weekends and eat. There are seats with different themes you can relax and for p160 you can have a taste of thw world famous Malagos Chocolate 65% pure, they also have 75%. Getting there? ride van or jeep to Calinan, then ask your driver to drop you off to motorcycles going to Malagos Garden Resort, there are no habal habal passing there so I sggest rent it and go there, pair your Malagos Garden trip with the Ph Eagle Center as they have the same way getting there. "
	},
	{
		"User": "lambourne717",
		"Location": "Brisbane, Australia",
		"DateofReview": "October 6, 2016",
		"ReviewTitle": "Only if your visiting the Eagle centre",
		"Review": "Maybe it would be better if you visited on a Sunday when the main show is on A chocolate museum and winery is being built.\r \r Staff were disinterested and it was poorly signed. Not all resorts are the same, only 500m from the entrance to the eagle centre "
	},
	{
		"User": "oindu_des_Alpes",
		"Location": "Iloilo City",
		"DateofReview": "October 6, 2016",
		"ReviewTitle": "Learning about birds, nature and chocolate",
		"Review": "This should be one of the best family outing location for a day in Davao. The bird show on Sundays is a must. The visit to the farm and the explanations about cacao and chocolate manufacturing very enlightening (Malagos manufactures what is most probably the best chocolate in the Philippines). The resort is currently experiencing improvement (pool, new chef in the kitchen, chocolate museum) which will undoubtedly make it even more attractive and worthwhile as the whole philosophy of environment protection and sustainable natural production transpires during what should be a fun family visit. You can even extend your visit and spend overnight in one of the comfortable and well equipped villas of the resort."
	},
	{
		"User": "IvanCortez",
		"Location": "Davao",
		"DateofReview": "October 5, 2016",
		"ReviewTitle": "Interesting place for nature lovers",
		"Review": "Imaging eating something pick fresh from the Gardens. seeing butterflies, birds, and other fauna, orchids, other flora and ornaments, playground for kids and the young at heart, \r \r I love this place--- they make the best goat cheese in the world. Eat it in malagos at a cheaper price or enjoy it in fancy paris restos at a price many times over"
	},
	{
		"User": "Weiss W",
		"Location": "Singapore, Singapore",
		"DateofReview": "September 17, 2016",
		"ReviewTitle": "Manages garden resort ",
		"Review": "Perfect place to renew your vows..perfect place to find yourself. \r Great food! \r Great ambiance! \r Great scenery! \r Love the chocolates too;)\r You can smell chocolate around:-) "
	},
	{
		"User": "Tom M",
		"Location": "Camden, New South Wales, Australia",
		"DateofReview": "September 11, 2016",
		"ReviewTitle": "Birds...",
		"Review": "Malagos wasn't too bad but it is under mass construction at the moment. We went to the birds sanctuary which is located in the park which was great. They have monkeys and many other animals to look at."
	},
	{
		"User": "AlixSisters",
		"Location": " ",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "Under construction ",
		"Review": "We were only able to see the Butterfly Sanctuary. We had fun there. The rest of the resort is under construction.\r \r Service at the restaurant was upsetting esp. when you have a hungry, cranky senior and teenage boys with you. Food took forever to serve bec we noticed it was served to the other tables. Food was also served in long intervals. Hope they can address this concern. \r \r Will still go back when the resort is fully operational again."
	},
	{
		"User": "Victoria",
		"Location": "Victoria",
		"DateofReview": "August 21, 2016",
		"ReviewTitle": "Just opened View Deck Cafe is exceptionally good food and service...",
		"Review": "While the facility is still undergoing major renovations, it is beautiful with well-informed staff happy to share their knowledge of their excellent chocolate, as well as everything else I pointed at and asked questions about.\r \r Gorgeous gardens will soon be augmented by a modern chocolate museum. This is a go-to spot I am looking forward to returning to."
	},
	{
		"User": "Jucelle Francis D",
		"Location": " ",
		"DateofReview": "August 17, 2016",
		"ReviewTitle": "\"Sanctuary\"",
		"Review": "It's been a long time when I last visited Malagos Garden Resort but still the happiness and memories I had there remains fresh in me..The place is fit when u want to be relaxed and wanted a peace of mind. The butterfly sanctuary was very amazing and u can learn there the any kind of butterfly species. Must be Davao's Pride."
	},
	{
		"User": "tanyalou",
		"Location": "Manila, Philippines",
		"DateofReview": "August 10, 2016",
		"ReviewTitle": "Relaxing Escape",
		"Review": "Malagos Garden Resort is a nice place to have lunch and unwind. The place has a lot of activities for recreation. They have team building venues that can be fun for groups. The food you can order for sharing at their own restaurant. Must try is their tablea panna cotta. "
	},
	{
		"User": "Mark F",
		"Location": "Philippines",
		"DateofReview": "July 31, 2016",
		"ReviewTitle": "Not so happy tummy",
		"Review": "Buffet Lunch at Malagos Farm: The buffet selection: 3 items in the main area-- pancit bihon, chopsuey, and pork something (similar to pork binagoongan). Then there is also a supposedly grilled area where they serve chopped barbeque chicken and fish fillet/ finger, but the chicken was already cold and lonely. I didnt know that there is a green salad, as it was consumed and had to ask staff to replenish. The fruit platter, which is limited to sliced pineapple and watermelon, was bothered by flies as there were no staff to shoo them away. We were supposedly hungry but our appetite suddenly became lame. Was probably had higher expectations since it is in Malagos, but lunch buffet was forgettable -- in terms of taste, quality, and overall appearance."
	},
	{
		"User": "Jay S",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 26, 2016",
		"ReviewTitle": "Underrated And A Quiet Gem",
		"Review": "Malagos is one of the oldest resorts in Davao. Back then when people would stay in Davao to enjoy resorts (now, they often go to the nearby island called Samal), people would visit here a lot. People still go here but it's usually at the end of the list of places to go.\r \r However, the place is great for nature-loving people on a budget. When I say \"on the budget\", I mean that if you want to see animals, enjoy nature, do sports and similar activities without paying thousands in pesos, this is the place to go. Basically, your admission fee is already worth it just being able to walk around, explore and see your children enjoy the scenery.\r \r This place is a must-visit if you simply want to enjoy a relaxing time in nature."
	},
	{
		"User": "cbusain",
		"Location": " ",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "Butterfly and bird feeding Saved the day",
		"Review": "It was bird feeding time when we arrived , and it was really fun and stress relieving. Butterfly sanctuary was also one good highlight of the visit."
	},
	{
		"User": "shaofalcis",
		"Location": "manila",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "Bird Show is still good but place showing its age and poor maintenance",
		"Review": "Really takes a lot of funding to maintain a resort and Malagos Garden Resort is showing its age. It's still good to drop by and visit and support since they take care of a lot of birds and animals. Their shows are still good, buffet food average. Make sure to bring home their world famous hot chocolate tableas and chocolates."
	},
	{
		"User": "Hồng Anh N",
		"Location": " ",
		"DateofReview": "July 15, 2016",
		"ReviewTitle": "Lovely nature garden",
		"Review": "Nice place for family and friends to enjoy and relax because its very tranquil and peaceful. Quite nice food and chocolate and goat cheese are the best one. You can also buy them as souvernir. There are also playing yard for the kids with lots of sport: soccer, badminton, volleyball, pingpong.. Also have comfortable place to relax, The butterfly garden is no beautiful and interesting"
	},
	{
		"User": "Jona A",
		"Location": " ",
		"DateofReview": "July 10, 2016",
		"ReviewTitle": "Under renovation until August 2016",
		"Review": "We went thru hell to get here (long story) and got a little heartbroken to find out theres no dark chocolate available to buy when we get there. We ate at their restaurant and tried their famous chocolate drink (it was heavenly). The food is okey, the staff are awesome. We didnt get the chance to explore the entire place as we needed to go back to the city right away. I think the place is going to be more beautiful after the renovation. Still too bad that there is really nothing to buy when we get there but the chocolate drink healed our crushed hearts so all is well. "
	},
	{
		"User": "coppermine909",
		"Location": "Koronadal, Philippines",
		"DateofReview": "July 10, 2016",
		"ReviewTitle": "Great for family visit",
		"Review": "Nice place to stay.. close to nature and very peaceful. Kids learned a lot about nature. Highly recommended!"
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "July 8, 2016",
		"ReviewTitle": "For Chocoholics!",
		"Review": "We came here to check the fuzz about Malagos chocolate and we were mind blown! Do not leave this place without trying their chocolate. \r \r Their day tour fee is PhP100 for adults and Php80 for kids which includes the entrance fee, access to their gardens, butterfly sanctuary, and aviary where you can feed the birds (a sure hit with kids). We went there on a Tuesday so they didn't have the bird show. \r \r We spend most of our time in their restaurant. Ordered the Malagos hot chocolate which was just heavenly. We also tried their churros, Filipino breakfast, and pancakes. All were simply delicious! They even gave a free sampling of their new panacotta made with Malagos chocolate. It was so good!\r \r Restaurant staff are friendly and the manager was very nice and helpful.\r \r We spent so much time eating in their restaurant that we only spent about an hour touring the compound. My daughter enjoyed feeding the birds in their aviary. The rest of the place (butterfly sanctuary and gardens) are just so-so. \r \r I recommend dropping by this place for the food after a tour of the Philippine Eagle Center. We loved Malagos chocolate so much we took home a few bags of the chocolate."
	},
	{
		"User": "Leah E",
		"Location": "Tacloban, Philippines",
		"DateofReview": "July 3, 2016",
		"ReviewTitle": "For orchid lovers and organic farming enthusiasts",
		"Review": "The place to have the chocolate which won the coveted title of being the second producer of best tasting chocolate drink in the WORLD. The place propagates the famous Waling-Waling Orchid and also serves chocolate drinks."
	},
	{
		"User": "joyyyemano",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "June 27, 2016",
		"ReviewTitle": "Highway robbery! Take your precious time and money elsewhere!",
		"Review": "Our weary selves made sure to do a quick detour in Malagos Garden Resort during our drive back to Cagayan de Oro via Buda just to buy chocolates and cheeses to take home for our friends and families. What was disheartening was they did not...More"
	},
	{
		"User": "babynyl",
		"Location": "Manila, Philippines",
		"DateofReview": "June 26, 2016",
		"ReviewTitle": "Under Renovation! No advise on the website",
		"Review": "Just went there this week and we didn't see anything as it is under renovation, no orchids, no show.. nothing! I hope you will put information on your website that you are under renovation so that guest dont need to travel from the city and...More"
	},
	{
		"User": "Aveeno1991",
		"Location": "Manila, Philippines",
		"DateofReview": "June 16, 2016",
		"ReviewTitle": "Go for the cheese...and dark chocolates",
		"Review": "My wonderful breakfast at Cafe Marco at the Marco Polo hotel in Davao introduced me to cheese from Malagos. I asked the most helpful wait chef from where they source their good selection of cheese and was told of a place in Agdao and Canilan....More"
	},
	{
		"User": "astroknots",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "June 12, 2016",
		"ReviewTitle": "lovely",
		"Review": "This is place is fantastic. There was construction going on when I went (June 2016) but it didn't really bother me in the slightest. The bird aviary was amazing (got to feed birds right out of my hand!). This place is great for kids and...More"
	},
	{
		"User": "AGMMAC",
		"Location": "Pasig, Philippines",
		"DateofReview": "June 6, 2016",
		"ReviewTitle": "Under renovation",
		"Review": "This place is currently under renovation so as of the moment, not a good place to visit. The vicinity is very big. We had hot Choco at the Koi Restaurant. The hot Choco was delicious but the cleanliness (or lack of it) really turned me...More"
	},
	{
		"User": "Aphio1925",
		"Location": "United Kingdom",
		"DateofReview": "May 21, 2016",
		"ReviewTitle": "Love it",
		"Review": "Nature, nature, nature...So quiet and very relaxing away from the hustles and bustles of the city..."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 18, 2016",
		"ReviewTitle": "Striving for Excellence!",
		"Review": "I first went to Malagos in the 90s on my first trip to Davao. What I remembered were the orchids and the swimming pool. Now 20 years later, it is a well developed resort but no longer a profusion of orchids. A must attend is...More"
	},
	{
		"User": "Veness Ehrn G",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 16, 2016",
		"ReviewTitle": "Great Escape!!!",
		"Review": "I was here during my college trip. My last attendance was with my family. My nephew and niece loved feeding the birds. iIts very suitable for educational tour and a great escape from the noise of the city."
	},
	{
		"User": "23hershey",
		"Location": " ",
		"DateofReview": "May 4, 2016",
		"ReviewTitle": "Nature!!",
		"Review": "Watched the Bird show and it was amazing!!! The kids and the grown ups enjoyed it so much! Have butterfly sanctuary too! Kalesa Ride, Buffet, and aa mini Zoo too!! Make sure to bting mosquito repellant!"
	},
	{
		"User": "BES711",
		"Location": "Luzon, Philippines",
		"DateofReview": "April 29, 2016",
		"ReviewTitle": "Bad way of doing business",
		"Review": "Even if you just want to eat since this is closest to Davao Eagle, they will charge you an entrance fee. They will say that it will be deducted if you choose from their set menu which really a bad meal combination which is very limited. Tourists are ready to spend but they do not want to be taken advantage of"
	},
	{
		"User": "tolentinomaldex",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "March 19, 2016",
		"ReviewTitle": "Garden Resort",
		"Review": "My stay in Malagos Garden Resort is very relaxing with its green environment surrounded by biodiversity."
	},
	{
		"User": "thenavigator8",
		"Location": "Manila, Philippines",
		"DateofReview": "March 15, 2016",
		"ReviewTitle": "Not well maintained facilities",
		"Review": "You can sort of have a team building here but the facilities are not well maintained. They charge you for a fee but the activities that you can do inside is limited. Buy malagos chocolate for P150."
	},
	{
		"User": "Dexter M",
		"Location": " ",
		"DateofReview": "March 2, 2016",
		"ReviewTitle": "Having fun while appreciating nature",
		"Review": "Operating hour is until 5:00 pm only. No available guide will accompany you around, do it on your own like we did.\r \r Kids would love the place. Activities like animal close encounter, bird feeding, visit butterfly sanctuary (catch, wish and release), playground, tree houses, swing, aviary, arts/sculptures, etc.\r \r The place is ideal for teambuilding activities. They also have cottages for overnight, a restaurant, function halls, hidden gardens & orchid forest.\r \r Entrance fee of 100/head, about 32 kms away from downtown, an hour and 11 mins drive. Its the same way going to Philippine Eagle Centre, so better drop by, and appreciate nature while having fun.. just like a kid again."
	},
	{
		"User": "raisa513",
		"Location": "Zamboanga City, Philippines",
		"DateofReview": "November 22, 2015",
		"ReviewTitle": "“Great place for team building and R & R”",
		"Review": "Malagos is a great place for people who like rest and relaxation. They also did a good job accommodating a big group of 80 people for a team building activity for four days. Everybody was friendly and hospitable. \r The place itself is a beautiful garden with lots of sights, walk around and have some exercise, the air is fresh. One nice attraction is the chocolate factory and beautiful creatures like ostrich, peacocks and pony. There's also a petting zoo for kids. It's really a nice place for vacation to reflect and recuperate. \r The place is known for calesa rides (horse drawn carriage) and they make their own cheese and chocolates which are such a great catch! Walking past the chocolate factory, the aroma of chocolate hangs in the air, so yummy! There's an orchid garden across the street. It's a great place to stay in if you want peace and quiet."
	},
	{
		"User": "Tet C",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "November 17, 2015",
		"ReviewTitle": "Side trip only, nothing special",
		"Review": "We visited Malagos when we went to visit the Philippine Eagle center. You'll pass by this place on your left side going to the eagle center.\r \r We paid the entrance fee, P80 per adult. But when we got inside, there was really nothing special about the place. Its just a big garden. Nothing really special.\r \r The petting zoo/ aviary zoo is non existent. It's well kept but there were only a handful of animals which didn't even interest my kids.\r \r I highly recommend their unsweetened chocolate tablet, locally known as tablea. Its P160 per pouch and its really good. I also bought their dark chocolate and fruit wine. All of which can be bought at the entrance. You don't need to go inside the garden and pay any fee."
	},
	{
		"User": "jed1017",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "October 29, 2015",
		"ReviewTitle": "Place is nice",
		"Review": "It is a resort but has a huge garden. There are also some butterfly sanctuaries but some of them aren't maintained. There were some playgrounds and tree-houses. The place is peaceful and nice.\r \r We were not able to avail their buffet because some foreigners have already booked the place. Their à la carte was expensive. Food was just ok. Their salad was good though.\r \r Overall, the place is worth to visit."
	},
	{
		"User": "Darci A",
		"Location": " ",
		"DateofReview": "October 20, 2015",
		"ReviewTitle": "lacked proper maintenance",
		"Review": "the place is huge and there are a lot of activities which you can do. the set lunch is also good, especially the fish steak.\r \r they need to improve on having additional staff to do the tour, or at least give a schedule. when we arrived, we were told that we just have to inform the restaurant staff if we want a tour of the place. so after eating, we advised them, but they said that the staff doing the tour just passed by (touring a family), and we have to wait around 30 minutes. because we still had places to go to, we just wandered by ourselves.\r \r the petting zoo and other animals also need maintenance as some of the animals looked poorly groomed. :("
	},
	{
		"User": "Phoebe D",
		"Location": "Iligan, Philippines",
		"DateofReview": "October 16, 2015",
		"ReviewTitle": "Trip to nature.",
		"Review": "I've been here with my cousins in Davao and this is such a wondrous place if you want to spend time with nature."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 2, 2015",
		"ReviewTitle": "Closer with nature :)",
		"Review": "If you want a place where you can relax and be with nature, Malagos Garden Resort is a place to be. You can have a tour inside, they have a butterfly and bird sanctuary, a playground, a pool and a feel of nature. They also conduct bird shows. :)\r \r But since the place has been a bit old already, it may need maintenance ;)\r \r Overall, the place can make you calm and relaxed. :)"
	},
	{
		"User": "Vince M",
		"Location": " ",
		"DateofReview": "September 20, 2015",
		"ReviewTitle": "Go for chocs!",
		"Review": "They have the organically prepared pure chocolate which earned a name international recognition. It is a must try besides seeing their beautiful gardens and their animals."
	},
	{
		"User": "Anna May V",
		"Location": "Pasig, Philippines",
		"DateofReview": "September 19, 2015",
		"ReviewTitle": "Best Hot Chocolate in the Planet",
		"Review": "What an incredible place- feast your eyes on various Puentespina flowers showcased (including the endemic Waling waling), a profusion of blooms and various flora landscaped magnificently throughout. The air is breezy and paths are wide. There is a pool and play area as well. The...More"
	},
	{
		"User": "bulakbol76",
		"Location": "Cebu City, Philippines",
		"DateofReview": "September 14, 2015",
		"ReviewTitle": "needs upkeep but still worth a visit",
		"Review": "it is a bit obvious that the resort has seen better days. enjoyed our mini tour of the cacao trees and the processing areas to make chocolate--very educational. walking on the grounds is very interesting due to the various labelled plants, flowers and bushes around...More"
	},
	{
		"User": "286joya",
		"Location": "Makati, Philippines",
		"DateofReview": "August 24, 2015",
		"ReviewTitle": "Not worth it",
		"Review": "My friends and i went there on the weekend of Kadayawan 2015. We arrived at around 1:30pm after visiting the Philippine Eagle Center. Receptionist was quite cold and kept repeating the P100 entrance. We asked about thh cheese and she said there was none. Upon...More"
	},
	{
		"User": "Stella S",
		"Location": " ",
		"DateofReview": "August 5, 2015",
		"ReviewTitle": "Beautiful ",
		"Review": "Beautiful garden, fresh food, delicious chocolate drinks. I loved Malagos garden resort, i came here with my visitor from a different country and we enjoyed davao's nature"
	},
	{
		"User": "Dioneli S",
		"Location": "Iloilo City, Iloilo City, Philippines",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "Maybe next time...",
		"Review": "We were looking forward to visiting this place but underestimated travel time and arrived 15mins before 5PM, which is their closing time. Would have wanted to still pay the entrance and explore the resort till closing but the receptionist wont accept us. Only allowed us...More"
	},
	{
		"User": "BriDex",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 29, 2015",
		"ReviewTitle": "Lovely retreat, and the place to indulge in Malagos Chocolates!",
		"Review": "Located in the city's highlands, this resort offers peace and relaxation to city dwellers and travelers. Tropical flora and fauna abound in this huge estate owned by the Puentespinas. A cacao / cocoa farm is also located here. Did a shoot for a national magazine...More"
	},
	{
		"User": "Richthof R",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 26, 2015",
		"ReviewTitle": "nature park",
		"Review": "If you want to go home away from home where there is a peaceful ambiance, affordable price and with their nature wonders and best. this is where I will go to where coffee will taste a great with the love one at hand"
	},
	{
		"User": "adianau",
		"Location": "Philippines",
		"DateofReview": "July 9, 2015",
		"ReviewTitle": "coffee, sweets and zen meets",
		"Review": "This place is a relaxation place and serves the best coffee and chocolate not just in town but also offshore. The Philippine Cheese-making Place can also be found. A resort where you can enjoy nature, and can held special events or occasions."
	},
	{
		"User": "Angeles City, Philippines",
		"Location": "Angeles City, Philippines",
		"DateofReview": "July 2, 2015",
		"ReviewTitle": "Unforgettable Malasugui Steak",
		"Review": "We went here for a day tour, unfortunately, it was raining so we opted to just have plated lunch instead. The course was worth P275, it includes salad, soup, bread and butter, main course and dessert. The food was good. I ordered the Fish (Malasugui)...More"
	},
	{
		"User": "Jose M",
		"Location": "Manila, Philippines",
		"DateofReview": "June 29, 2015",
		"ReviewTitle": "Great garden. Nice restaurant",
		"Review": "It's a great place to relax and vege out. Huge garden to stroll around and check out sculptures displayed around the property. They have a bird show in the afternoons. Check prior to going for the schedules as it is a long drive from Davao downtown area. They serve pastas and home made chocolate in their small restaurant. But their star products are their cheeses! Various goat and sheep varieties. Some are aged. Do note they are on the high side, but very good!"
	},
	{
		"User": "JEmmanuelLasPinas",
		"Location": "Las Pinas",
		"DateofReview": "June 29, 2015",
		"ReviewTitle": "Excellent nature place",
		"Review": "There is much to see, enjoy and experience. The lush surroundings and the fresh clean air makes it very relaxing. Walk about or stroll around - it is a really place to visit."
	},
	{
		"User": "travelwise2010",
		"Location": "Manila, Philippines",
		"DateofReview": "June 27, 2015",
		"ReviewTitle": "Loved their chocolates!",
		"Review": "We initially came for the flowers but ended up bringing home chocolates. Loved their cocoa. It was more expensive than the ones you find in the marketplace but then its all about the taste so it was really no contest. \r They have cheese too and they are also good but its the chocolates that I would really come back for."
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "June 20, 2015",
		"ReviewTitle": "Dine and enjoy nature",
		"Review": "If you love nature and you wish to enjoy good dishes, then visit Malagos. Amazing: the really well trained staff. But why only average? Maintenance of the surroundings could be much better. Sayang."
	},
	{
		"User": "vardkeem",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "June 18, 2015",
		"ReviewTitle": "delapidated garden, but great restaurant",
		"Review": "PROS highly recommended bird feeding experience accomodating staff in their restaurant, fast service CONS -their garden is not maintained well -only few remain in their butterfly sanctuary"
	},
	{
		"User": "Elliot P",
		"Location": "Caloundra, Australia",
		"DateofReview": "June 17, 2015",
		"ReviewTitle": "Bird show!",
		"Review": "The bird show is great. Good range of animals throughout the gardens.. hedgehogs! Has a sweet butterfly enclosure too ☺"
	},
	{
		"User": "AndreiSabang",
		"Location": "Cebu City, Cebu City, Philippines",
		"DateofReview": "June 17, 2015",
		"ReviewTitle": "Exotic Birds",
		"Review": "Place had a team building activity when we went for a visit thus we could not really enjoy it that much. The bird show was not available so we just went to see the birds in their cages. There were some unusual birds there that made the trip worthwhile. The butterfly area though is not that impressive. We did not buy their chocolate though which is one of our big regret as we could not find it anywhere."
	},
	{
		"User": "virmen",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "sight seeing",
		"Review": "sight seeing with a group will be good. taking pictures, jumping shoot and etc. avoid picking of flowers going to the cliffs and etc,"
	},
	{
		"User": "wenlong3788",
		"Location": "Bacolod, Philippines",
		"DateofReview": "May 10, 2015",
		"ReviewTitle": "Average resort with nice bird feeding experience",
		"Review": "The resort was small and average. Not much flowers when we visited. The one activity that made us enjoy the most was the bird feeding at the dome. You are given dawa seeds and love birds and cockatiels come flying, landing on your palm and starts eating them. Very entertaining. The butterfly sanctuary was a bit boring, no fancy coloured butterflies, only one kind (black and white) was there.\r \r Their native chocolate drink is really good, very fine and creamy."
	},
	{
		"User": "Margaret River, Australia",
		"Location": "Margaret River, Australia",
		"DateofReview": "April 24, 2015",
		"ReviewTitle": "Fantastic Chocolate",
		"Review": "Had a tour of the cacao nursery and preparation area with the staff and was very impressed by the operation, as well as the chocolate that is being produced by this sustainable and well thought out company. Kudos to all involved and well worth the drive up from town."
	},
	{
		"User": "Marie M",
		"Location": " ",
		"DateofReview": "April 6, 2015",
		"ReviewTitle": "a quiet hideaway",
		"Review": "Stayed here a number of times for a series of seminar. Accommodation is very basic, they make sure they clean the rooms and change the towels daily or as requested. Rooms are old, bathroom is kinda scary, it may need some renovations.\r \r Food is great. Ambiance is very nice fr nature lovers like me. I like the peace and quiet here. This place is good for a day tour, or maybe a night out as well."
	},
	{
		"User": "KIKO597",
		"Location": "Manila, Philippines",
		"DateofReview": "March 30, 2015",
		"ReviewTitle": "Maybe Not the Right Time to Visit",
		"Review": "We visited Malagos Garden in combination with the Philippine Eagle Center. If your group can't catch-up lunch in the city, BETTER TAKE IT HERE. Get the lunch and entrance fee package; we're glad we did because the food is good.\r We we're not able to go to their garden due to lack of time and was informed that plants are not in bloom. What we did then was to experience bird-feeding (in our hands), visit the \"petting place\" where peacock, ostrich chickens, and a statue with their mates. The preserved butterfly section had outdated style with no lights; the live butterfly garden with relatively few species, is just okay.\r We enjoyed the food served; we also loved the furniture and fixtures setting of hard wood plus the ethnic music recording being played. We we're able to buy some dark chocolates produced by the place which was good.\r \r Tip: Call this attraction when will the garden be in bloom to time your visit."
	},
	{
		"User": "Dibyne",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 26, 2015",
		"ReviewTitle": "Good for family or friends outing",
		"Review": "The place has a concept of garden, mini zoo, resort, and restaurant. It is ideal for outing activities because it various facilities, including a swimming pool. The restaurant sells the famous malagos cheese and dark chocolate. Small and medium size companies may also hold company activities in this venue."
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 25, 2015",
		"ReviewTitle": "this used to be better.",
		"Review": "i have been coming in this place for 5 years. and it used to be way better. the owner should maintain the place better. still in combination with the eagle resort that is just 1 km away a good combination"
	},
	{
		"User": "jen_x7280",
		"Location": "San Mateo, Rizal, Philippines",
		"DateofReview": "March 17, 2015",
		"ReviewTitle": "Cheese and Honey haven",
		"Review": "They have varieties of flowers but what i was attracted more is on their organic produce of honey and goat cheese! they have lots of selection for flavors in cheese though it is a bit pricey but cheaper than the price at Rustan's. Their organic honey is the best. I cant wait to get more when we come back!"
	},
	{
		"User": "gkfg139",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 16, 2015",
		"ReviewTitle": "A satisfying experience",
		"Review": "We went there last September, and it was calm. There were so many trees in that area, and you could go up in one of their tree houses. They have a restaurant, and a live bird show for kids."
	},
	{
		"User": "RoeBut",
		"Location": "Antwerp, Belgium",
		"DateofReview": "March 14, 2015",
		"ReviewTitle": "ok",
		"Review": "nice garden, needs some work to be top again, the butterfly garden had less butterflys then there were outside"
	},
	{
		"User": "TayNayNak",
		"Location": "Luzon, Philippines",
		"DateofReview": "March 1, 2015",
		"ReviewTitle": "Love the wide open space",
		"Review": "We availed the lunch package (entrance fee+ lunch). When we visited, there was nothing much to do, which was just okay with us since we just wanted to walk around and have lunch. \r The lunch served was more than what we expected. It was a full meal...salad, bread+butter, main course, dessert and choice of drink. The service at the restaurant was just excellent. The only downside, they didn't have enough supply of their famous Malagos chocolates for purchase. I had to buy at the airport, which turned out to be more exoensive. Room for improvement also is their customer service at the entrance. Since they probably know that most visitors are tourists, they could at least explain the different activities available for guests, instead of just showing different areas of the resort in the map they provide. Mind you, when we went there wasnt that much visitors and the resort staff at the resort entrance were just chit chatting with each other, they could have used this time to explain to guests how to best maximize the visit at the resort. "
	},
	{
		"User": "Albert A",
		"Location": "Quezon City, Philippines",
		"DateofReview": "February 23, 2015",
		"ReviewTitle": "Wine and Cheese Tasting",
		"Review": "The hosts were very accommodating. After opening a bottle of their wine product that was apparently affected by chill storage, they replaced it and shared stories on how their place came about. Delicious hard and soft cheese were served which made our night!"
	},
	{
		"User": "Manila, Manila, Philippines",
		"Location": "Manila, Manila, Philippines",
		"DateofReview": "January 3, 2015",
		"ReviewTitle": "Its just a garden",
		"Review": "It was not a very colorful garden, mostly greens, nothing spectacular about it. We went on a weekday and there was nothing going on. We paid to just walk around. Not worth the curiosity and much more the travel!"
	},
	{
		"User": "mrjsimon",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "December 21, 2014",
		"ReviewTitle": "do something to improve the place",
		"Review": "Not a must visit place, not worth the long trip. it was a waste of time and money really. The food was food that it. The garden was poorly maintained. The only thing that I somehow enjoyed was the bird show, nothing more. \r \r To management, please please please, do something to improve the place."
	},
	{
		"User": "Jackie C",
		"Location": " ",
		"DateofReview": "December 16, 2014",
		"ReviewTitle": "Interactive birds",
		"Review": "If you have been to the Philippine Eagle Center, this is just a few minutes drive and good as your next stop. Advise is to come here on sundays because they have the interactive bird show where audience can participate. You can also buy good goat's cheeze and chocolate tablea here "
	},
	{
		"User": "khuyentuong",
		"Location": "Ho Chi Minh City, Vietnam",
		"DateofReview": "November 30, 2014",
		"ReviewTitle": "Haven't entered the resort. Information isn't clear",
		"Review": "I travelled from Davao city and reached there 3:13pm last Nov 21.\r \r I'm just after the horseback riding there and unfortunately, it's NOT available after 3pm. So I decided to not enter the resort.\r \r Yes, it was my fault to not ask them in advance about the availability of that service.\r \r But, they also didn't inform about it on your website."
	},
	{
		"User": "darlynn1925",
		"Location": "Jackson, Tennessee",
		"DateofReview": "October 24, 2014",
		"ReviewTitle": "Dont go...",
		"Review": "Do not waste time and money, its just a garden nothing special... better go to nearby Eagle Center. Disappointed."
	},
	{
		"User": "FilipinoAdventurer",
		"Location": " ",
		"DateofReview": "October 13, 2014",
		"ReviewTitle": "Waling Waling Orchids And A Lot More",
		"Review": "The Malagos Garden Resort is a vast and diverse tourist attraction. \r \r At the entrance, we were greeted by warm, polite, friendly and accommodating Davaoeños which displays authentic Filipino hospitality. \r \r Upon entering the resort, we were welcomed by numerous \"Waling Waling Orchids\" amazingly colored greenish yellow,pink and white. These types of orchids can only be found in the Philippines specifically in the Mindanao provinces of Davao, Cotabato, and Zamboanga. It is considered \"Queen of Philippine Flowers\" and also one of the Philippine's national flowers along with the Sampaguita which is a part of the Jasmine flower family that is cultivated for teas and fragrances. Grapefruit and mango trees shelters the orchids from the elements. \r \r Apart from the wonderful assortment of flowers exhibited at the Malagos Garden Resort, there is also a butterfly sanctuary that has a diverse kinds of butterflies. \r \r The resort has a bird park with a variety of species like the Palawan Peacock Pheasant, the Mindanao Tarictic Hornbill, Umbrella Cockatoos, Victoria Crowned Pigeons and others. Some of birds even performs and interacts with visitors.\r \r It also has a Petting Zoo which houses donkeys, miniature horses, goats, sheep and other farm animals. Horse back riding and Calesa ride are also available. \r \r The place is adorned by art pieces of renowned Philippine National Artist for Sculpture who is the Father of Modern Philippine Sculpture none other than Napoleon Abueva. \r \r Malagos Garden Resort has there food outlets. The first is the Roberto's Garden Restaurant which offers Davao and other Filipino delights. The second is the View Deck Café and Grill which is of the al fresco type dining. Lastly, the Koi Café for quick snacks while touring the Philippines enormous resort. \r \r If you want to relax in the tranquil cool mountain breeze of Malagos Garden Resort. Guest can avail a wide range of room accommodations.\r \r Other amenities and facilities of Malagos Garden Resort includes billiards table, table tennis, darts, giant chess board, courts for badminton, basketball and volleyball as well as swimming facilities. \r \r There's a gift shop for souvenirs and food items that have ingredients that are sourced inside the resort. \r \r Location wise, Malagos Garden Resort is adjacent to other wonderful attractions of Davao such as the Philippine Eagle Center and Eden Park.\r \r If ever you have time to go Davao, make a point to visit these three Davao points of interest and other great attractions of the city and province of Davao. \r \r The diversity of Davao in terms of tourist spots and attractions makes it one of my favorite places to go to in the Philippines. "
	},
	{
		"User": "dodesha",
		"Location": "Seoul, South Korea",
		"DateofReview": "October 1, 2014",
		"ReviewTitle": "great bird show",
		"Review": "the bird show is must-see if u plan on coming. bring your camera too for pictures in this nice place"
	},
	{
		"User": "TravelBug1469",
		"Location": "Manila, Philippines",
		"DateofReview": "September 24, 2014",
		"ReviewTitle": "Commune with Nature",
		"Review": "Flowers, birds, and butterflies collected and taken cared of in landscaped garden within a vast organic farmland added with horse-back riding, children's playground, outdoor sports and indoor games, swimming pool, plus accommodation cottages and restaurants is all about Malagos Garden Resort. It was used to be known as the home of Waling-waling in Davao, wherein the world-renowned Vanda Sanderiana orchid otherwise known as \"Queen of Flowers\" in the Philippines grew in abundance in various species. Ladies and kids may love what I found ordinary. The colorful birds at the aviary plus the interactive bird show at the amphitheater saved the day for me. If you're into quiet, relaxing interaction with nature then come to Malagos Garden Resort.\r Located just few meters before the Philippine Eagle Center, you can get back here after the tour of PEC in time for lunch. You can either stay long at Malagos - by camping or in an expensive cottage - or go back to Davao City in the afternoon. Another option is to visit Eden Nature Resort in nearby Toril (before lunch time for day-tour) or in the afternoon for overnight accommodation and tour before heading back to Davao."
	},
	{
		"User": "Alan Y",
		"Location": "Petaluma, California",
		"DateofReview": "September 21, 2014",
		"ReviewTitle": "For the birds",
		"Review": "This is right next to the Philippine Eagle Center, so you can combine your \"wilderness\" exposure with something more civilized. Otherwise, it's a long way to go for nothing particularly unique.\r \r The nice great food other reviewers mentioned was not here today. Only one cafe was open, and the menu was pretty basic.\r \r Looks like there are lots of activities for kids; fortunately (for me) there weren't any here today, so it was nice and quiet. \r \r I liked the walk-through aviary with lots of colorful birds."
	},
	{
		"User": "davao_dude",
		"Location": "Davao City",
		"DateofReview": "September 7, 2014",
		"ReviewTitle": "Best interactive bird show",
		"Review": "The best thing about this resort is no longer the orchids as it used to have years back. The resort runs a 45-minute bird interactive show which talks about the need to preserve the environment for bird species and other animals to survive. The tour includes a decent buffet meal for just php275 per person. "
	},
	{
		"User": "Davao del Sur Province, Philippines",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "August 4, 2014",
		"ReviewTitle": "Nature park",
		"Review": "We visited here last year. The place is big and if you're a nature lover you'll love the place. It's very relaxing there, you'll enjoy. They also offer chocolate bars they made from their cacao farm-yummy! Love the place!"
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 6, 2014",
		"ReviewTitle": "A lot better on weekend visits",
		"Review": "My family and I had an overnight stay at Malagos a couple of years ago. I found the place so fascinating during our first visit. Being a nature lover, I admired everything that was in the park. The plants, the different orchids, the flowers, they’re all so beautiful. The park itself offers a good place for a quality family bonding. There are different caged animals like a zoo and one amazing experience is getting to feed the birds in the birds dome. There is also a butterfly sanctuary that is equally fascinating. The best thing my children enjoyed most was the bird show. Very intelligent birds, I must say. It is likewise very educational for children.\r \r We stayed overnight on our first visit. Malagos have several cottages that would house guests at very reasonable price. The package price already includes free entrance fee, free use of the swimming pool and free buffet breakfast. and free entrance at the bird show. I must again admit, they cook good food. Dining in their restaurant offers an excellent ambiance,fresh air, cold wind, and a beautiful sight of the Koi fish in its surroundings.\r \r Just lately, I noticed the place was not as exciting as we first visited it. I realized that maybe the perfect time to visit Malagos is during weekends as the management offers a bird show, food is served in the restaurant, and birds are so many in the birds dome Unlike on the weekdays when we visited. I found the place so dull, seems like nobody's around to assist guests."
	},
	{
		"User": "Anna L",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "June 17, 2014",
		"ReviewTitle": "fresh haven...",
		"Review": "cant forget the milk (fresh) along the road going to malagos. it was quiet a taste and cheap. plus when you purchase the milk you are helping the cooperative and the members are young farmer... \r malagos has a great amenities.. food tastes well...and fare prices. u cant hear buzzling horn sounds but bird chirping... would love to visit again"
	},
	{
		"User": "lifegifts",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 28, 2014",
		"ReviewTitle": "great place to go",
		"Review": "This is a great place to go with families. Nice trees and plants as well as well maintained animals. What attracts me most is its wild yet clean and safe set up. I hate well manicured and concrete jungle parks and this park is a complete opposite. I also love the freedom they give to guests, i hate guards looking over all my actions and especially interaction with nature. \r \r I recommend this place to all ages, just be ready for the insects including mosquitos and possible allergens. These are just part of nature though and should be welcome with caution."
	},
	{
		"User": "GraceSanJuan",
		"Location": "San Juan",
		"DateofReview": "May 15, 2014",
		"ReviewTitle": "See the great Eagle",
		"Review": "The Haribon was devouring his prey-looks like a rabbit. His wings look so majestic. Must punish hunters who kill these eagles"
	},
	{
		"User": "nav795",
		"Location": "Manila, Philippines",
		"DateofReview": "May 14, 2014",
		"ReviewTitle": "Nothing much to see",
		"Review": "We came to the Resort for some sightseeing and lunch. A guide was provided and brought visitors to the aviary and then the different cages where they keep peacocks, chicken, and ponies. And then on to the butterfly cage. There's plenty of greenery in the Resort but nothing striking.\r \r Except for the aviary which I found interesting because if you have a clutchful of bird seeds, the parakeets fly to your palms and help themselves to the seeds. Apart from this experience, I found nothing unique or special in the Resort. If a visitor skips the Resort, I don't think he'll miss something.\r \r I couldn't comment on the bird show they run here, as our group was at the Resort when this show wasn't available."
	},
	{
		"User": "Jeremy N",
		"Location": "Dover, Delaware",
		"DateofReview": "February 26, 2014",
		"ReviewTitle": "Great bird show!",
		"Review": "They have a bird show every Sunday morning that is really awesome. Thats the day to go if you wanna visit this place. The rest of the park was just ok and the animals in the petting zoo were in poor condition and very unclean. However, the birds in the bird show were well kept and trained. "
	},
	{
		"User": "bryanmills",
		"Location": "Paris, France",
		"DateofReview": "February 19, 2014",
		"ReviewTitle": "nice and entertaining birdshow",
		"Review": "This place is much better maintained than its neighbour philippines eagle center.\r Entrance fee is 125p\r Birdshow at 10.30am is really entertaining and you can take free pictures with the birds at the end of the show\r Service at the restaurant was slow and food ridiculously small.\r Beware of mosquitos!"
	},
	{
		"User": "Sona Bella L",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 18, 2014",
		"ReviewTitle": "ganda! relaxing!",
		"Review": "a beautiful place and a very good place to relax,unwind from the city's noise. they have rooms,cottages,a pool,u can play basketball,soccer or any larong pambata,they serve caterings services from their restaurant."
	},
	{
		"User": "trainerstone",
		"Location": "Philippines via Chicago",
		"DateofReview": "February 17, 2014",
		"ReviewTitle": "Disgusting",
		"Review": "Worthless trip far from the city, there were sad animals in cages, a petting zoo with animals covered in feces and bugs, the worst butterfly sanctuary i've ever seen. Don't waste your time."
	},
	{
		"User": "Quezon City, Philippines",
		"Location": "Quezon City, Philippines",
		"DateofReview": "February 11, 2014",
		"ReviewTitle": "Fun for the kids!",
		"Review": "Our family visited the park on Sunday, when there is a scheduled bird show at 1030am. The show runs for 45mins. It is very nice for our Philippine standard. Because the venue is not too full, we are able to sit up close the stage where the action is. I was able to get great shots of the birds being featured. \r \r My children both interacted with the host of the show. He is very good and knowledgeable. The bird show is about caring for the environment so the birds performed tricks like waste segregation, disaster awareness, and sports too. \r \r The bonus is after the show you are able to have a close encounter with the birds - you can take pictures with them, hold them in your arm or shoulder, and feed them with your hands.\r \r The park also have a big space for the children to run, poles and a 3-storey wooden tower to climb at and have a great view of the park. There are also slides and swings. You can also have a short horse-back riding or ride one with wagon for a fee.\r \r They have good buffet for lunch which is not quite expensive to include in the ticket entrance. The seat capacity is limited so you have to reserve early in case there are lots of people. I enjoyed their olive oil garden salad, and my favorite lumpia shanghai with rice. The barbeque pork was a bit hard for my friends. \r \r At their coffee shop, you have to try their 65% dark chocolate bar (one of the first I saw here made in the Philippines which is packed life Lindt and Ghirardelli) and also their hot cocoa. \r \r After visiting this place, you can go and visit the Philippine Eagle Center which is just a short drive away."
	},
	{
		"User": "Leland_DLC",
		"Location": "Manila",
		"DateofReview": "January 3, 2014",
		"ReviewTitle": "Good side trip",
		"Review": "Dropped by here after going to the Philippine Eagle Center and we're glad we did. Read somewhere that the food wasn't good which was generally true but the mango crepe wasn't bad at all. What we liked most about this place were the animals. There was an aviary where you could feed birds off your hand. And there were petting stations where they had all sorts of animals including horses and sheep. They also had rabbits, chickens (some interesting looking chickens!), and an aviary including ostriches. Good to bring kids here.\r \r Wanted to go around some more but we got rained out. Philippine Eagle + Malagos is a 4-star combination that makes a 1 hour trip from downtown worth it."
	},
	{
		"User": "magharmon",
		"Location": "Manchester, New Hampshire, United States",
		"DateofReview": "December 28, 2013",
		"ReviewTitle": "Overpriced and doesn't live up to the hype",
		"Review": "We reserved 2 cottages for our group of 15 and the rooms were spacious but that was probably the highlight of the room. Bathroom was really in bad shape. Toilet situation can only be described in one word....DISGUSTING!\r \r Breakfast was ok but nothing to write home about. They will nickle and dime you, so be wary of what you ask for.\r \r We did get to walk around the grounds and the plants and flowers were well maintained. Saw some animals and as others mentioned, they did look a bit malnourished.\r \r There was one good thing we did experience though. The bird feeding was pretty cool. Even fed the duck they had by hand. To top it off, we even hand fed the fish in the man made pond. I will suggest that you clean your hands thoroughly because I did get infected by some bug the following days that required a hospital visit and antibiotics! \r \r Unfortunately we did not get to see the bird show or do anything else there because of our disappointment with the resort."
	},
	{
		"User": "dagol",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "November 30, 2013",
		"ReviewTitle": "A Beautiful park and active Cacao farm",
		"Review": "Spent 4 nights there as extra time to await the passage of the tropical storm that followed shortly after Monster storm Yolanda/Haiyan. \r It is located at about 300m above sealevel and the air in the Gardens are very fresh. As a nature lover and garden enthusiast there is much to study and learn from.\r  It is a pleasure just to walk among the trees and plants and watch the layouts.\r They also have a quite big Cacao farm which is very professionally run and guests can ask for a tour .\r Their nursery sells high quality seedling of various Cacao varieties under the Puntespina label . Puntespina is big in flowers as well.\r \r They have a bird garden area but this seemed a bit run down.\r \r The place is also a good starting point for a visit the Philippine Eagle park which is nearby and for further exploration of the Calinan and Baguio area.\r \r Had a room the in the Medenilla complex. Room was average with average value for the money.\r The TV wih cable connection was on the common balcony outside the complex.\r No Wi-Fi other than in the lobby area which was a bit away from the cottages and complexes and even there it is not particularly good, so a good place to concentrate on natur.\r They have a service that pick you up and drive you around the area .\r The complementary breakfast and other meals were served at various location depending where you stay ,but was good and so was the service.\r Very good ambience and will be back there another time."
	},
	{
		"User": "Addicted2Asia",
		"Location": "USA",
		"DateofReview": "October 7, 2013",
		"ReviewTitle": "Love it, But AVOID the resturaunt!",
		"Review": "A wonderful place to spend the day. I combined the trip with a visit to the Philippine Eagle Center. Lots of wildlife, flowers and butterflies on display. Well maintained paths. Plenty for kids to do and see. Nice and quiet on the day I was there. After a couple hours it started raining, so we had to cut our trip short.\r \r The place is especially good if you have young kids.\r \r They prohibit bringing in your own food, so I would recommend eating before you arrive. Everything we ordered was WAY overcooked and cold when it got to the table. We were a group of six. Awful food!\r \r They have rooms for rent also, starting at 3,400 PHP, but we did not examine them while we were there.\r \r Will go there again, on a full stomach!"
	},
	{
		"User": "Nancy B",
		"Location": "Makati, Philippines",
		"DateofReview": "September 27, 2013",
		"ReviewTitle": "Enjoy Bird feeding here",
		"Review": "We went to Malagos on a weekday in the last week of August, in the afternoon but we were told at that time that no guide is available. so we just help our selves in the garden. I am expecting to see a lot of orchids here, but its very disappointing bec very few and little orchids were there, however there are still nice plants in the garden although the garden is not very well maintained. This is also a nice venue for garden wedding. There's a small coi pond. The aviary is not that very much interesting to see but guests can still enjoy bird feeding. One staff of Malagos showed up at the Aviary, after a while, she is gone. Ostrich, goat, and some few animals can be seen here as well. We did not check the restaurant as we don't have much time anymore. Nobody informed us about their other facilities or services as if they don't need any business. If you are new in Davao and have limited time, you can skip this, just go to Samal Island and enjoy the beach."
	},
	{
		"User": "elianj",
		"Location": "Philippines",
		"DateofReview": "September 5, 2013",
		"ReviewTitle": "For the love of Flowers!",
		"Review": "I didn't stay in their hotel so I can't make a review about their hotel facilities.I didn't try their restaurant too so I can't comment on it.I went there because a good friend of mine told me it's has a nice garden and animal farm and I was satisfied with the flower garden.The orchids were in bloom and some other flowering plants.They have a nursery and flower shop.You can buy plantlet for a reasonable price.I love the flowers but the animals looks sick,maybe parasite stricken especially the ostrich.The butterfly garden was not good as well.I wasn't impressed at all....As what I've said I went there for the flowers and I was satisfied with it."
	},
	{
		"User": "BobSATWA",
		"Location": "DXB",
		"DateofReview": "July 27, 2013",
		"ReviewTitle": "Wake Up Malagos!",
		"Review": "This really was 'Fawlty Towers - Philippino Style!' Overpriced and inedible food! Dirty Rooms! No Hot Water! Security 'Patted- Down' my kids, just to make sure they were not bringing-in food! This place really is a 'Missed Opportunitý!' Evidently it is run by someone who once worked in a hotel! - A not a very good one at that! - Even the local Philippinos laughed at us when we told them where we were staying!"
	},
	{
		"User": "Nhu_Phuong",
		"Location": "Ho Chi Minh City, Vietnam",
		"DateofReview": "June 20, 2013",
		"ReviewTitle": "A great place to teach your children to love the environment!",
		"Review": "I have not stayed in the resort but only visited the bird park. \r The place is very refreshing and quite a nice change after a city tour. \r The best time to visit the place is on Sundays. They have a bird show every Sunday morning which is hosted by the owner of the place. The show teaches the children to love the environment and protect the birds, especially the Philippines' eagles, but in a very entertaining way. That is also another great characteristics of Filipinos. They are just so much fun and creative in their way of education. \r The entrance fee is 250 PhP/person and cheaper for kids if I'm not mistaken. \r It's a paradise for those who love taking photos :)) You can't just help yourself because the surrounding is just so beautiful!"
	},
	{
		"User": "TerMac84",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 26, 2013",
		"ReviewTitle": "Nature tripping in Malagos",
		"Review": "The Resort is so beautiful with facilities set in a natural environment. It has classy rooms, single detached cottages and backpacker dorms that can accommodate groups of various sizes. There are also camping facilities in Malagos. This place is perfect for families, friends and corporate events. My honey and I with some friends stayed in one cottage and had a memorable weekend there.\r Davao City is becoming a very popular and safe tourist destination. And for one-day tourists, you have the option to join in a tour called \"Adto Ta Sa Malagos\" ! This is inclusive of transfers, entrance to the park, Lunch, and a guided Tour that brings you around the large and beautiful Malagos Garden Resort, see and observe monkey-eating eagles, enjoy the flora and fauna at the Philippine Eagle Center and see other places. My sweetheart and I will take our relatives from the USA to this day-tour when they visit us during their summer break in July.\r You will appreciate the beauty of nature and also learn from it, when you visit Malagos Garden Resort. Highly recommend you guys visit this place....and it is so affordable!"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 7, 2013",
		"ReviewTitle": "What Happened???",
		"Review": "We went to Malagos Gardens Resort two years ago and had a great time,Everything was clean and orderly,lots of animals,displays where maintained and plenty of staff to guide customers.\r So we decided to spend our family day,Sunday,May 5 at Malogos Gardens and we where saddened by what we saw. First we could not enjoy the Sunday buffet {our fault as we showed up at 11:30am} so we would have to eat at the restaurant,err don't do that,food sucked and was way over priced.Better of to take your own food and have a little picnic in the parking lot.\r Where have all the animals gone?? Many look like they have parasite problem especially the ostriches and turkeys. The viticulture display was just deplorable,looked like it has had no attention for a long time,on display was in pieces and filled with ants,definitely no worms there.\r Overall,we where very disappointed and i think other are too as the only people we saw where drawn to the breakfast buffet,there was next to no one else in the part. We go to leave,having to pass through the main entrance and here is some dude laid back in a chain with his feet on the desk,nice impression to leave on tourist there bud.\r I would think that Sat and Sun would be money days for such a place as Malogos gardens,looks like it is a loosing proposition now.Very sad !! \r PS the bathrooms in the customer parking lot,well,just don't go there."
	},
	{
		"User": "docferry",
		"Location": "Manila, Philippines",
		"DateofReview": "March 25, 2013",
		"ReviewTitle": "A vast array of flora",
		"Review": "The place has all the variety of flora like orchids, dendrobiums, and even dragon fruit. Davao is fertile for all kinds of flowers."
	},
	{
		"User": "466Neo",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 17, 2013",
		"ReviewTitle": "A peaceful clean resort",
		"Review": "I really enjoyed Malagos for 5 days so did my family, its a very peaceful place to relax and there restaurant has decent prices and ok food. The whole garden is very clean and the plants well maintained. But i do also need to point...More"
	},
	{
		"User": "Elrod13",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "January 28, 2013",
		"ReviewTitle": "Orchids & Butterflies",
		"Review": "Took a day visit of the property and enjoyed the few orchids that were in bloom and the butterfly exhibit. Location is on the way to the Eagle Center and recommend a stop on the way up or back."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "December 6, 2012",
		"ReviewTitle": "A very nice place to commune with nature",
		"Review": "Be there for a day tour or stay overnight whichever pleased you. But for us we stayed overnight also to visit the Philippine Eagle Center. The two places are just so close that if you like, you can walk for a kilometer. The garden resort...More"
	},
	{
		"User": "domsfel",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 20, 2012",
		"ReviewTitle": "Malagos garden resort a good place to experience new.",
		"Review": "Malagos Garden Resort is one of the most frequented destinations in Davao City. Malagos Garden Resort is a nature retreat for the whole family. ... If you are a nature lover, they have landscaped gardens with different trees and flowers."
	},
	{
		"User": "Sheryl Rose C",
		"Location": "General Santos City, General Santos, Philippines",
		"DateofReview": "November 8, 2012",
		"ReviewTitle": "a very good place",
		"Review": "the place is very advisable to visit specially if you have children with you or if you are in an educational field trip. because they set a side a time to have a lecture in the different kinds of animals that they have. the place...More"
	},
	{
		"User": "travelogue823",
		"Location": "manila",
		"DateofReview": "October 27, 2012",
		"ReviewTitle": "A pity they don't maintain the sculptures of National Artist Napoleon Abueva",
		"Review": "Birds: ok. Plants: ok. Other animals: need extra care and upkeep. But here's the ultimate critique: The Malagos Garden Resort management has some explaining to do. How come the 20+ works of National Artist Napoleon Abueva, scattered around the park, are so poorly maintained that...More"
	},
	{
		"User": "santi331",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 7, 2012",
		"ReviewTitle": "Malagos Garden Resort",
		"Review": "After visiting the Eagle Center, go to its neighbor, Malagos Garden Resort. They serve great food and their own cheese. The Garden itself is huge and there are lots to do for children. Go to the Butterfly Pavilion. And dont forget to visit the Orchid...More"
	},
	{
		"User": "Broadbband G",
		"Location": "Manila",
		"DateofReview": "August 28, 2012",
		"ReviewTitle": "Nice hideaway but...",
		"Review": "Pros: 1) Good for kids and family; strolling the grounds was fun 2) Friendly and helpful staff 3) Good playground, lots of other activities to do (horse-back riding, bird watching and feeding, etc). 4) Great collection of animals that the children really loved. 5) Free...More"
	},
	{
		"User": "Taguig City, Philippines",
		"Location": "Taguig City, Philippines",
		"DateofReview": "July 22, 2012",
		"ReviewTitle": "Green, Artsy, and Educational!",
		"Review": "The place is very lush and green. Napoleon Abueva's artworks are displayed everywhere. Bird show led by Doc Bo was very educational and entertaining. I think they only have it every Sunday. Make sure you buy the famous bignay wine for P300+. Entrance fee including...More"
	},
	{
		"User": "AustralianJake",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 15, 2012",
		"ReviewTitle": "A quiet picturesque get away!",
		"Review": "Hi all, we stayed here a week or so ago as we were operating int he area. I have stayed here before or just breezed through to order lunch with friends. The food is good but the service is very very slow. You'd die of thirst or hunger of you didn't rush them. The staff are good, well groomed polite and very accommodating to your requests.\r The area is perfectly maintained and being a green thumb I can appreciate their efforts and thank them for it. It's a well thought out and appointed little resort in a safe and peaceful area of Calinan. \r A great little get away that when you close your eyes and listen to the abundant sounds of nature, you can transcend to any mountainous area of the globe. I like that a lot. The menu is good but could do with a change every 3 months to keep it lively, well priced for the area and having Mastercard facility is great.\r Heaps of things for kids of all ages and a solace for a good bottle of red and a cheese, crackers and fruit platter for mum and dad in any one of the numerous private seating areas across the property. \r There's a drop off area right in front of the entrance steps and heaps of secure guarded and fenced parking across the road. The accommodation is clean with hot and cold water in the showers with a verandah off each room. The air-con is COLD for those that love living in a freezer like I do. \r If you dont like the air-con then there's a nice breeze off the verandah that compliments the mountain creek that flows at the rear of the property. \r This creek is fresh drinkable water and has been landscaped so you can sit on the side on the soft grass with a snack and talk about nothing or just listen to the water. \r \r There's more to this place than meets the eye or what I have written, what you need to do is find out for yourself. Would I recommend a stay here? Absolutely, will I be back there, you bet!!"
	},
	{
		"User": "Mercedita M",
		"Location": "Manila",
		"DateofReview": "June 14, 2012",
		"ReviewTitle": "Drove all the way for nothing",
		"Review": "The place is a big garden but not a very well maintained one. It is in a state of disarray since not many people were visiting so the upkeep is suffering. It was a mistake driving all the way and paying a 100 bucks for nothing."
	},
	{
		"User": "DocTotoy",
		"Location": "Iloilo City",
		"DateofReview": "May 29, 2012",
		"ReviewTitle": "A Family Friendly Place to stay in",
		"Review": "The place is not as large as other garden resorts, but the staff is very helpful and everything is conveniently situated walking distance from everything.\r \r The food is nothing spectacular but is worth the price that they sell it at. The Bird Show is something you shouldn't miss when you go to this garden."
	},
	{
		"User": "bracomo",
		"Location": "davao",
		"DateofReview": "May 29, 2012",
		"ReviewTitle": "Very educational...",
		"Review": "Malagos Garden Resort is a nice place especially for kids since it is very educational. The animal show is also entertaining and fun. Nice place and nice food too. I love the goat's milk there especially the blueberry flavored milk. Would definitely bring friends over"
	},
	{
		"User": "LolaGo1",
		"Location": "Washington DC, District of Columbia",
		"DateofReview": "May 25, 2012",
		"ReviewTitle": "MALAGOS, GARDEN OR RESORT?",
		"Review": "Malagos Garden Resort is much smaller compared to the Eden Nature Park. Using various themes, Malagos Gardens are \"separated\" by several themes - butterfly, Noah's Arc, orchids, etc. They also have two restaurants where one can buy their meals.\r \r Located across the street is the other part of the Garden where one can buy plants for sale. \r \r Join a group tour to visit the Malagos Garden Resort, and other tour sites of Davao such as the Eagle Center, Japanese Tunnel, and Crocodile Park. These sites are far from the center of the city. Rates ranged from PHP 2,500 to PHP 3, 000.00 for vehicles that can accommodate 1-6 passengers."
	},
	{
		"User": "inabear",
		"Location": "Laguna Province, Philippines",
		"DateofReview": "May 11, 2012",
		"ReviewTitle": "Beautiful and Natural",
		"Review": "We loved Malagos Garden Resort. We were only there for a day trip, and it was too bad our children were tired and sleepy. If there were a place where they could have taken a nap, we would have stayed longer. I would have loved for them to make the most of the horseback riding, petting zoo and kiddie ziplines. They did jump on the trampoline, ride the horse-drawn carriage, climb up the tree house and my daughter especially loved the butterfly sanctuary where she read all about the butterflies and saw them up close.\r \r The food at the cafe was also very very good. We will definitely come back."
	},
	{
		"User": "mzzyap8",
		"Location": "Philippines",
		"DateofReview": "April 23, 2012",
		"ReviewTitle": "Good show, Doctor Bo!!!",
		"Review": "It takes 45 minutes to an hour to drive to Malagos Garden Resort from Davao City town proper. To maximize your trip, do your best to get there before the Bird Show begins at 10:30AM Sunday. Note: it's quite a walk from the entrance all the way to the venue for the actual bird show. The garden entrance fee costs 125 pesos which includes the bird show. We were glad we opted for the entrance fee with buffet lunch---at 275 pesos per person, we thoroughly enjoyed the surprisingly good food:) Doctor Bo (very knowledgeable veterinarian) runs the hour-long Bird Show which is both informative and entertaining. You may take pictures with wonderful birds after the show. And there are lots of nooks and crannies in this graden to find and explore, like large chess pieces, pleasant swings, etc.etc. There's a store opposite the buffet hall where you can buy Durian Jam, Honey, Brown eggs, Goat cheese, and ice cream at decent prices. It certainly was worth the effort to come here!"
	},
	{
		"User": "boypad",
		"Location": "Asia",
		"DateofReview": "April 21, 2012",
		"ReviewTitle": "Perfect shot for your memorable event",
		"Review": "The place is so serene and quite. I like the way they arrange their garden and scenic spot. Its reminds me something abroad (Botanical Garden at Singapore). What I enjoy most is their butterfly farm and butterfly museum. I didn't know that we have a variety of those beautiful species and only endemic to Philippines. Wish we had check-in at that place but instead only take their day tour package."
	},
	{
		"User": "Ponchit_gardenworx",
		"Location": "Davao City",
		"DateofReview": "April 10, 2012",
		"ReviewTitle": "you must see these place",
		"Review": "Very spacious, carefully planned, good and comfy accommodations, interesting menu and many special deli items, great variety and healthy birds and animals. excellent landscape with a very good collection of plants. Very well thought of bird show"
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "March 23, 2012",
		"ReviewTitle": "awesome installation art and cheeses!",
		"Review": "two things set malagos apart from other mountain resorts:\r 1. napoleon abueva works - this guy is a national artist. so it is quite awesome to see a lot of his work outside of a museum, installed all over the resort.\r 2. cheeses - malagos makes awesome local cheeses. really delicious at reasonable rates."
	},
	{
		"User": "NortiusMaximus",
		"Location": "Melbourne, Australia",
		"DateofReview": "March 7, 2012",
		"ReviewTitle": "Relaxing",
		"Review": "Very relaxing environment. Rooms comfortable and spacious. Plenty of room to wander and explore."
	},
	{
		"User": "istop4streetfood",
		"Location": "Manila, Philippines",
		"DateofReview": "January 17, 2012",
		"ReviewTitle": "needs improvement",
		"Review": "this is a really beautiful place, except i think it needs an upgrade to its run down condition. the rooms weren't thoroughly cleaned... breakfast took like an hour to serve - and was incomplete :( the bird show was great though... the host was very...More"
	},
	{
		"User": "FilOzdvo",
		"Location": "Sydney",
		"DateofReview": "January 6, 2012",
		"ReviewTitle": "nice place",
		"Review": "My kids love this place they enjoyed the horse carraige ride, love the butterfly sanctuary."
	},
	{
		"User": "alan b",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "November 27, 2011",
		"ReviewTitle": "good food fantastic view",
		"Review": "the food is very fresh one of the best places I have eaten, very affordable and the best restaurant view in asia"
	},
	{
		"User": "B_112",
		"Location": "Quezon City, Philippines",
		"DateofReview": "November 7, 2011",
		"ReviewTitle": "Malagos Garden Resort",
		"Review": "Very enjoyable tour around the resort. Collection of plants very impressive. Feeding the birds, goose and duck was a first for me and very good interactive program for children. Getting near the ostrich and horse was an unforgettable experience."
	},
	{
		"User": "Detcabmd",
		"Location": "Madrid, Spain",
		"DateofReview": "August 31, 2011",
		"ReviewTitle": "It's the Bird show!",
		"Review": "The bird show was cool! It was an hour of education and fun. The birds were really the main attraction. There were parrots, chickens, hawks and ostriches. They served a lunch buffet. The food is not exceptional but very filling. They have a make your...More"
	},
	{
		"User": "trondolav",
		"Location": "Finnoy, Norway",
		"DateofReview": "June 30, 2011",
		"ReviewTitle": "a great day",
		"Review": "malagos garden resort is a pleasant place to take the family to. a lot of wonderful plants and birds. malagos also has a good restaurant and a swimming pool. location suitable for a day trip, can also be combined with a visit to the Philippine...More"
	},
	{
		"User": "Cj M",
		"Location": "Vancouver, Canada",
		"DateofReview": "October 3, 2010",
		"ReviewTitle": "The Dancing Ostrich (Live)",
		"Review": "We went to this Malagos Garden Resort as recommended by my niece, Grace and Donny Lim on Sep 1, 2010. We were not disappointed because we saw all kinds of orchids, plants, trees, butterfly and other attractions. Although some of these attractions similar to what...More"
	},
	{
		"User": "michellesantos",
		"Location": "Bostwick, Florida",
		"DateofReview": "April 23, 2010",
		"ReviewTitle": "I love the bird show and butterfly sanctuary",
		"Review": "I love going back to this place. At the start we watched a bird show then after that we roamed around the Malagos Garden Resort. After how many hours of taking pictures and sightseeing, we stopped by to eat. I love mangosteen and rambutan. Its...More"
	},
	{
		"User": "New York City, New York",
		"Location": "New York City, New York",
		"DateofReview": "October 3, 2009",
		"ReviewTitle": "Tourist Trap",
		"Review": "Went for lunch, which I thought would be a nice one since this is a farm! We were offered a fixed menu (uninteresting choices). When we got to the restaurant, we found out that there was a more extensive menu with more choices. I guess...More"
	},
	{
		"User": "eniale_dvo",
		"Location": "Davao",
		"DateofReview": "April 11, 2009",
		"ReviewTitle": "2 star resort!",
		"Review": "We stayed there for a night during good friday. \r \r First of all, the parking space was terrible, we had to park across the street and bring again our luggage back on the other side of the highway where the lobby is located. \r \r Secondly, the rooms/cottages need MAJOR renovation. They were outdated and the facilities are poor (tiny t.v. WITHOUT cable, no fridge--they charge an additional cost if you want to have one in your room). The bathroom was ugly too, and right now the only word I can think of describe it is eww. \r \r Next to it, the restaurant were we dined in (Koi Cafe) had so many flies and when we got there they didn't even had a menu! We had to wait for them to pick-up a copy from their other restaurant (near the lobby). Food choices were limited and the food we chose wasn't even available! A plus for them though was the ostrich salpicao with mashed potatoes on the side and malagos fried rice. \r \r Lastly, the resort had very very poor maintenance, some attractions didn't even had a standby employee or assigned person to facilitate guests (e.g. petting zoo--kids wanted to pet the miniature horse but unfortunately no one was there to supervise). The \"main\" attraction of the place which were waling-waling and orchids were limited and non-existent. Some of the grasses need to be trimmed so we can actually walk on it.\r \r In conclusion, although it is a cheap alternative for a resort, the management really should consider renovating the place and actually maintaining some of their amenities in order to attract more tourists and locals."
	},
	{
		"User": "charlycat9",
		"Location": "Hong Kong",
		"DateofReview": "May 7, 2008",
		"ReviewTitle": "Stay in the City!",
		"Review": "My boyfriend and I have just returned to HK after a week in the Philippines, during which we spent 3 days and 2 nights in Davao at the Malagos Garden Resort. Our aim in Davao was to visit the Philippine Eagle Foundation research facility, and we were informed that Malagos is the only hotel in the area close to the PEF camp, so that's where we stayed.\r \r Let me say at the beginning that if you plan to do or see anything else in Davao other than the Philippine Eagle camp, then it's best to stay elsewhere. Malagos Garden is approximately an hour's drive from the city, which in a taxi will cost you P350 each way. The Philippine Eagle camp, a 10-minute drive from Malagos, and which is definitely worth a visit, can be seen in a single day-trip from the city; this leaves you other options for things to do in Davao before and after you've seen the PEF facilities, as there is really nothing, zero, zilch around that area other than the PEF. (Good for the eagles, not so good for visitors looking for stuff to do & see!)\r \r As for the hotel itself ... it's a rip-off. It seems it has come under new management (the daughter of the owner runs it now) and they seem intent to squeeze every last peso from everyone who walks through their shabby doors. The place has massive grounds around it, having been a farm in a past life apparently. The gardens however have that look of being unkempt and overgrown. Their \"butterfly garden\" is a series of small netted enclosures with more overgrown plants and, as far as we could tell, only one species of butterfly in them. There is, however, an abandoned shack with an ancient, unstocked bar that looks like no one has used it in 20 years, containing someone's large collection of preserved and mounted butterflies. Not exactly our idea of a butterfly garden.\r \r When we first tried to book our room online, we inquired about airport pick-up and they said that one-way airport transfer was P2500. That price was more than the cost of one night's stay (P2400 for a \"Multi-Family Cottage Room\"), which rather surprised us. I sent an email to our contact at the Philippine Eagle Foundation asking how much a cab from the airport normally costs and they put it as coming between P300-P500. We then cancelled the airport transfer arrangement and took a cab to the hotel which by meter came up to P345. Malagos was prepared to charge us over 5 times the going rate! That left a bad taste in our mouths, but we were still prepared to keep an open mind at this point.\r \r The hotel insists on checking inside the bags of everyone who comes in, day visitors (who still pay P100/person for the privilege of walking around the grounds) and staying guests alike. When we arrived it was 7pm and the main entrance had been closed for the day. The night guard let us in through a side entrance and as we waited for the transport to take us to the room, he asked to check inside our bags. We complied, thinking that this was a security measure, like those taken most places in the Philippines, to prevent acts of terrorism. As the guard poked through the contents of our bag, he asked if we had any food in it. Puzzled, we said no. He immediately waved us through then. \"Is that what you were looking for? Food?\" I asked, incredulous. He said yes. Having been in parks in bear countries where it's dangerous to have food lying around, I asked if it was to protect us from wildlife. No, he said, it just wasn't allowed to bring any food inside because there was a restaurant within the premises! We were shocked at this policy, but we found out the next day that they were quite serious about it as when we returned from the PEF we had a couple of pomelos that we'd bought from a roadside stand. Both the guard and the guy behind the desk at reception initially wouldn't let us take them back to our room with us! I asked if they actually had pomelo at their restaurant, and they said no. So why couldn't we take our pomelo in, considering they couldn't sell it to us even if they wanted to? I demanded to see the manager, but after a quick phone call the reception guy said the manager \"would allow it this time\". Their policy is even more ridiculous considering how poorly-stocked their restaurant is. They have no fresh milk (only non-dairy creamer for coffee), a very limited selection of drinks and snacks, several items we tried to order off the menu were not available (including coconut - bizarre considering the compound had scores of coconut trees with visibly-ready coconuts!), and heaven help the poor soul who gets peckish after 8pm because the restaurant closes at 8 o'clock.\r \r The room we got was run-down, dark and monastic, with a single crucifix on the wall and nothing else. But the A/C worked and it was clean, at least, except for the closet which was dank and smelled of mold. We kept all our clothes in our suitcase. The room sleeps four, with pull-out mattresses under the twin beds, so if four of you are staying in one room I guess the cost of it evens out at P600 per person. For a couple at P1200 per person though, it's definitely not worth it, even with breakfast included (the breakfast is pretty basic anyway, nothing to write home about).\r \r The staff seem friendly enough, and seem mostly embarrassed and apologetic at management policies. Mostly.\r \r Another thing to watch out for is booking a cab to take you back to the airport. We asked the front desk to arrange a taxi to drive us to the airport, but instead they arranged for a private car with a guy who apparently runs city tours of Davao. We found this out when we rang reception the morning of our departure and were told the price for the car to the airport was P600. We asked why, when the metered rate on the way in was under P400? They said that was what the guy charged. That's when we found out it was a private car. We immediately cancelled that booking (to the very obvious consternation of the reception guy) and arranged for a taxi. It's not that we were being tight, (despite the meter coming to just below P400 on both our taxi rides to and from the airport, we gave our drivers P500 anyway) but we resented the feeling that we were being milked for every last cent they could get from us. \r \r So the upshot is: stay in the city, where you have a wider choice of hotels and activities, and just do a day-trip to the Philippine Eagle facilities. The Crown Recency have the same room rate as Malagos Gardens, and they're a proper hotel!"
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"DateofReview": "May 4, 2008",
		"ReviewTitle": "Cheap, filling lunch and attractive gardens",
		"Review": "My friends and I used the resort for lunch after visiting the Philippine Eagle Centre which is close by.\r \r The resort has a small entrance fee. Its gardens are pleasant and apparently set on 12 hectares though we only walked a small portion of them.\r \r There is an interactive bird show on Sundays at 1030 but we missed it by two hours. \r \r The butterfly sanctuary was pleasant although just a little run down. We only saw two or three differently coloured butterfly species: a few of each, and none were overly spectacular or irridescent.\r \r Service in the restaurant was slow but the bill for a couple of refreshing iced teas each and a filling main chicken dish with rice came to only P2000 for four, or about A$22, so no one could complain.\r \r I could not see any sign of what some sites claim is accommodation but perhaps I looked in the wrong part of the resort.\r \r Our taxi driver waited happily while we ate."
	},
	{
		"User": "manila",
		"Location": "manila",
		"DateofReview": "December 17, 2007",
		"ReviewTitle": "The Garden Resort",
		"Review": "This is the first time in my life that i stayed in a garden resort. Malagos resort is a different experience for me. In this resort, there's a bird sanctuary, garden-filled park, lots of trees and other plants i never heard of, there's tons of fish ponds in the resort, you will see different kinds of ducks and birds roaming around the resort. The food is very good. You can buy fish, meat and veggies in the market and you can ask the resort to cook it for you. Room are not so good but its very cheap and comfortable. The people in the resort is very friendly. Overall, the place is fine, its not so luxurious, the place looks old but clean. There's also a pool and a gift shop."
	}
]
