[
	{
		"User": "EmppuL",
		"Location": "Helsinki",
		"DateofReview": "4 weeks ago",
		"ReviewTitle": "Fun at the slide",
		"Review": "I really enjoyed the slide. I wasent keen on jumping and snorkelling was average. But the slide fun was worth of 200 pesos."
	},
	{
		"User": "gellie e",
		"Location": " ",
		"DateofReview": "February 8, 2018",
		"ReviewTitle": "ADRENALINE RUSH",
		"Review": "I've been here last 2014 and my experienced was great they offer a lot of water activities like snorkeling, water blob, giant slide, diving board,jet ski and also the canopy walk , there services is quiet good and also their rooms are okay and the...More"
	},
	{
		"User": "Jonet Sheen C",
		"Location": " ",
		"DateofReview": "February 8, 2018",
		"ReviewTitle": "A nice place in Samal",
		"Review": "I am attracted to the resort itself because of the good services that the resort offers also, the resort is clean and well managed you can’t see any trash anywhere inside the resort and the staff are very accommodating. If you’re an adventurous person then...More"
	},
	{
		"User": "Rhea Mae B",
		"Location": " ",
		"DateofReview": "January 19, 2018",
		"ReviewTitle": "adrenaline rush",
		"Review": "slides,waterblob,canopy walk,diving board,etc.is set on this resort to give you an adrenaline rush.the place was safe because you cannot swim without lifevest,lifeguards are also their to watch over.their Johnny's ride was so exciting,you can see the perfect view of Mt.Apo."
	},
	{
		"User": "jgayongorsa",
		"Location": " ",
		"DateofReview": "October 28, 2017",
		"ReviewTitle": "Aquafun Indeed",
		"Review": "Best place for water activities. you would enjoy their giant slide, waterblob, snorkeling, divingboard and canopy walk. good for all ages and their lifeguards will keep you feel safe. the water is clean and clear."
	},
	{
		"User": "Aya K",
		"Location": " ",
		"DateofReview": "September 10, 2017",
		"ReviewTitle": "A little creepy place without people...",
		"Review": "We viisited the place on a weekday, so there were not so many people in the resort. I think it's nice only for a day tour as youbcan inly do the massive blob thing and the slides. The climb/hike up to the top of the...More"
	},
	{
		"User": "Ruby D",
		"Location": " ",
		"DateofReview": "August 29, 2017",
		"ReviewTitle": "Perfect water activities",
		"Review": "The place is stress reliever,the ambiance is super good very relaxing.. il definitely recommend this to my friends.Had so much fun and enjoyed the water activities, Johnny's ride,giant slide,banana boat .jet ski and water blob."
	},
	{
		"User": "Rhea Mae B",
		"Location": " ",
		"DateofReview": "August 25, 2017",
		"ReviewTitle": "adventure to the max!!!",
		"Review": "the place was so perfect in terms of adventure,you will enjoy a lot specially to thier slides and waterblob!"
	},
	{
		"User": "_chaluy_010491",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 25, 2017",
		"ReviewTitle": "Perfect place for adventure and water sports activities!",
		"Review": "Giant waterslide, waterblob, diving board, snorkeling and diving are the best and a must try activities in maxima! The place is cool and very relaxing. We really enjoyed our stay at the resort. Definitely we will come back!"
	},
	{
		"User": "Jane O",
		"Location": " ",
		"DateofReview": "August 25, 2017",
		"ReviewTitle": "YOLO Experience . :)",
		"Review": "Best place for people looking for adventure. :) Had so much fun with the giant slide, and i feel safe because life guards are always on sight. :) great job. more powers to the management."
	},
	{
		"User": "Cza C",
		"Location": " ",
		"DateofReview": "July 28, 2017",
		"ReviewTitle": "The place is boring",
		"Review": "I was expecting a bit more good customer service .... the people there helping the customers with the safety jackets are choosy in helping people... they are rude , catcalling people. The place , you can't even expect a decent food to be served in this place everything is expensive!"
	},
	{
		"User": "Jose Victor M",
		"Location": " ",
		"DateofReview": "May 31, 2017",
		"ReviewTitle": "For thrill seekers but food is overpriced",
		"Review": "We went here for a day trip to try out their highlight attractions such as the Tarp Slide and we also saw that there was a Dive Board for those who have the courage to try it. I was kinda sad that they do not have the Water Blob anymore. You can go here to have a change of setting from the usual activities offered in Samal and seek that thrill of enjoying a water park.\r \r Going down the actual resort you have to take a hydraulic ride for safety of the guests. Don't worry as this is just the mundane part of the location before heading down to their attractions. There are a few marshals to attend to guests as there aren't a lot of rides that need assistance.\r \r There was also a dining area with some hammocks which was a plus for those who have a penchant for that. My only gripe is the inflated prices of the snacks. You could opt to make this an afternoon visit so you have already taken your lunch to avoid the pain of spending a pretty penny for overpriced food."
	},
	{
		"User": "ALventureBlogs",
		"Location": "Quezon City, Philippines",
		"DateofReview": "May 28, 2017",
		"ReviewTitle": "Cool Slide but we didn't feel welcome",
		"Review": "Giant cool slide but the sliding time is limited! But it was fun! My slippers fell out on the water while we're enjoying the walk on the steps. The staff didn't help us to get it even if we tried to ask for their help. :("
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"DateofReview": "February 10, 2017",
		"ReviewTitle": "Excellent snorkelling off Samal Island - this is not in Davao City",
		"Review": "This attraction is on Samal island, not in Davao City. I have asked TA to correct the map location and listing.\r \r I hired a tricycle for an expensive P1500 day tour that included Maxima.\r \r Make sure you go to 'Maxima resort' and not the 'house' as we initially did.\r \r There is a funicular to take one down almost to sea level. General admission is P300 but my driver was free.\r \r The snorkelling off the pier was terrific. Many varieties of fish, including some medium sized pelagics. I especially enjoyed the Harlequin fish.\r \r Staff were pleasant: I had a satisfactory light meal at the restaurant.\r \r On weekdays the forest canopy walk is not open.\r \r The good snorkelling alone made this a worthwhile visit.\r \r It is not suitable for the disabled as there are steps in a few places, including down to the pier."
	},
	{
		"User": "Pilnas",
		"Location": "Vienna, Austria",
		"DateofReview": "February 7, 2017",
		"ReviewTitle": "Terrible experience ",
		"Review": "Terrible and boring place. The only fun thing there is the slide. There is really nothing else to do there. The blob is closed because it is dangerous. Other activities are overpcied. Unfriendly and lazy staff. One guy was laying on the table and watching basketball on tv. Security guard was playing clash of clans on his cellphone. We stayed only for 2 hours and then we left.\r \r We were planning to do diving there but changed our mind last minute because of the unprofessional attitude of the guy who wanted to take us for diving. \r \r Definitely not worth it. If you decide to go there forget about diving if you want to come back alive cause the guy definitely does not have a proper licence or diving training."
	},
	{
		"User": "Jelle V",
		"Location": " ",
		"DateofReview": "January 21, 2017",
		"ReviewTitle": "a Day Tour in Maxima Aqua Fun",
		"Review": "Me and my best friend went there for a day tour. It's Php 300.00 per person. It was so worth it. The big slide is so fun! It was kinda gloomy when we went there but we enjoyed our stay there. :) It's one of the must-see and must-try in Samal Island."
	},
	{
		"User": "Anonymous36271",
		"Location": " ",
		"DateofReview": "January 16, 2017",
		"ReviewTitle": "WORST PLACE EVER!!!!!!",
		"Review": "Don't go here!!!!! Bd customer service!!!! No manners!!! Worst vacation ever!!! Beach is not suitable for swimming! Waste of money!!!! tHE PEOPLE HERE WHO assist the customers SHOULD GET FIRED! They are rude!!!! Much better to go to pearl farm!!!!! They don't have decent place to let the customers cook their food! Be warned!"
	},
	{
		"User": "JackybCanete",
		"Location": " ",
		"DateofReview": "January 6, 2017",
		"ReviewTitle": "Adventure awaits in Maxima!",
		"Review": "If you are looking for an awesome adventure, I suggest t visit this place in Samal.\r \r An experience that I can't forget as their slide is really long and terrifyingly fun! I surely would recommend this\r place especially for people who are looking for awesome adventures and great memories!\r \r I find their price reasonable as well. "
	},
	{
		"User": "Lei S",
		"Location": " ",
		"DateofReview": "December 3, 2016",
		"ReviewTitle": "Worst resort i've ever visited! 😡Waste of money!",
		"Review": "Super overpriced! No shampoo, no soap and you will even use salt water to bathe! Toilets are unclean and no resort staff who could assist you during night time, only security guard on duty will entertain your queries. The room has insects and unclean with lizard's poop, windows are \"native lanay blinds\" only. We don't have blanket on our room and we even have to complain and ask for blankets. To our surprise, they would charge us for blankets. Only one shower with fresh water to use and it is located in open area. So girls are struggling to bathe because guests, staff and men working to repair the slide are just around and free to watch while we take a shower. As for breakfast, we extremely got annoyed before we finally got our order. All our orders are not available. This is the worst experience i ever had checking in a resort. Nothing extravagant and all waste of money!"
	},
	{
		"User": "Katikuykuy",
		"Location": "Dasmarinas City, Philippines",
		"DateofReview": "November 30, 2016",
		"ReviewTitle": "Good Time",
		"Review": "Went here in Nov 2015 We were just here for a day trip, I think just 5 hours. I love the giant tarpaulin slide and the blob. Comfort rooms are not that clean, we just went back to our hotel to wash up."
	},
	{
		"User": "ativnes",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 24, 2016",
		"ReviewTitle": "Great for Fun and Adventure",
		"Review": "Great experience for an adventure and having fun together with my family's and friend's, worth to try."
	},
	{
		"User": "Carmina E",
		"Location": "Manila",
		"DateofReview": "November 21, 2016",
		"ReviewTitle": "For water loving folks",
		"Review": "IF you are the type to enjoy water sports such as very high water slides and other water inspired sports activities, you will enjoy this resort in Samal Island which is about a twenty minute ferry boat ride from Sasa Pier in Davao City."
	},
	{
		"User": "Pio S",
		"Location": " ",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "The great example of Pinoy Ingenuity",
		"Review": "Who would have thought that a tarp can be converted to a mega slide? Wow. A cheap but exciting experience in this resort. The No corkage fee is the best part of their policies. For spontaneous gatherings of Family and friends."
	},
	{
		"User": "Anjeanette R",
		"Location": " ",
		"DateofReview": "October 20, 2016",
		"ReviewTitle": "Great!",
		"Review": "Been Here with my boyfriend for about 2 or 3 years ago, but still it is amazing as it was back then :D"
	},
	{
		"User": "MediciBoy",
		"Location": " ",
		"DateofReview": "October 4, 2016",
		"ReviewTitle": "Water fun",
		"Review": "If you are fond of water activities, this is one of those do not miss attractions. They also have a short canopy walk attraction however you will not be allowed to proceed if you are still wet from doing the water activity. Better do the...More"
	},
	{
		"User": "PrettyAngel2014",
		"Location": "Doha, Qatar",
		"DateofReview": "September 25, 2016",
		"ReviewTitle": "Fun under the sun",
		"Review": "This is actually a nice place for adventure people as the water and sea is spectacular. You will not be able to step on a white sand beach instead you'll be zipping and sliding over a 150 ft deep water. Summer suits best for groups....More"
	},
	{
		"User": "Dael L",
		"Location": " ",
		"DateofReview": "August 22, 2016",
		"ReviewTitle": "Activities = perfect, accommodation = needs improvement",
		"Review": "Very accommodating ferry crew and welcoming staff. Very affordable. You can choose to rent an aircon room, non aircon room, or just setup your tent, or just sleep in their hammock. Food is great. You can also order ahead of time so they can prepare...More"
	},
	{
		"User": "marco v",
		"Location": " ",
		"DateofReview": "August 12, 2016",
		"ReviewTitle": "not so much fun",
		"Review": "Very long walk down not so much fun when you come down paid and want to dive in for snorkling that you are only allowed to do so with life jacket on so we got a refund and walked back up the 200 stairs"
	},
	{
		"User": "Dale C",
		"Location": " ",
		"DateofReview": "July 30, 2016",
		"ReviewTitle": "Fun",
		"Review": "I enjoyed their slide and activities. Definitely a very fun place because of the many water activities to do."
	},
	{
		"User": "shaofalcis",
		"Location": "manila",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "A must - Slide down the ocean!",
		"Review": "Habal-habal from Chemas was P150/person roundtrip. Entrance was P400/head and it was worth it if only to slide down once or twice to the ocean! Didn't have enough guts to jump off the diving board but the slide is okay since there's water to help...More"
	},
	{
		"User": "virstud",
		"Location": "Caloocan",
		"DateofReview": "July 14, 2016",
		"ReviewTitle": "Resort for the longest slide",
		"Review": "This resort is located near Hagimit Falls. Going down the resort requires a free ride on the Johnny's ride. This is a downhill/uphill ride to the resort and entrance. Don't worry as the ride is very slow. The resort does not have swimming pool nor a beach front. It has its own pier though and the water is so deep that swimming would require life vest.\r This is ideal for young hearts who are not afraid to try their longest slide ever dropping to the sea. If you want to try the canopy walk, it is required that you are wearing dry clothes, so do the canopy walk first before diving to the sea."
	},
	{
		"User": "JMHerald",
		"Location": " ",
		"DateofReview": "July 10, 2016",
		"ReviewTitle": "Exciting attraction. Unfriendly staff.",
		"Review": "The water slide is indeed fun. It's exhausting, but you'll definitely take another slide after. However, personnel assigned to slide is not friendly. The resort is also a good place to snorkel. Food is too pricey compared to its serving. Restroom is not clean.\r \r Also, you can charter a boat from Maxima Resort to Talicud Island. Great way to explore Davao on a tight schedule."
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "June 20, 2016",
		"ReviewTitle": "Never again!",
		"Review": "Maxima Aqua Fun is indeed not to be recommended. Very little staff and - of course! - an impossible service. Dirty comfort rooms."
	},
	{
		"User": "Ericson L",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 31, 2016",
		"ReviewTitle": "Maximum adventure... for adults only",
		"Review": "Maxima Aqua Fun offers a unique beach experience to family and friends. It is not the usual sanded beach that we use to spend. They have their giant slide and their water blob that I think designed for adults. Anyways. The view of the waterfront is stunning. And they have a strict policy in using life jackets where it is a must while their is a waiver that needs to be signed if you do not wanted to use a life jacket. I commend their efforts for guest safety.\r \r Their food is amazing. It is worth your pay. However. The service crew at the canteen is not that friendly. The only staff that is friendly are those assigned in their facilities (like their lifeguards, staff at the johnnys ride and their water slide, staff at the picture booth and staff at the canopy walk). \r \r Their canopy walk is also the best. I hope the facility is open on weekday basis as well to cater visitors on these days. Also, I hope they could offer one more canopy walk facility to cater the huge number of guest who wanted to walk the wooden bridge.\r \r Overall, it is a great place to chill yourself away from the busy life in the city."
	},
	{
		"User": "Jean K",
		"Location": " ",
		"DateofReview": "May 28, 2016",
		"ReviewTitle": "Not worth the money and the travel",
		"Review": "The entrance fee is 300php, inclusive of canopy walk, blob and slides. We made sure of this at the entrance. But then when we got inside we cant use the canopy walk, and the blob!! The toilets and washroom were the same as they were years ago, and unclean, and still salt water! It was not aquafun at all."
	},
	{
		"User": "Pulahanes",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "May 23, 2016",
		"ReviewTitle": "Awful experience in Maxima Aqua Fun",
		"Review": "The place stinks, the shower rooms and toilets are slimy, the place for meals are all swarming with flies ! Don't they have cleaners? There were nothing of those shown on TV which I expected to find. It was just a horrible experience."
	},
	{
		"User": "Pietro B",
		"Location": " ",
		"DateofReview": "May 8, 2016",
		"ReviewTitle": "Waste of time",
		"Review": "Both slides were shut which is why we went there. Food is rubbish. No beach to chill on. Great place for families of filos that want to bring their own food and relax by a rocky coastline. Otherwise wouldn't waste any time there"
	},
	{
		"User": "Julmar L",
		"Location": " ",
		"DateofReview": "April 27, 2016",
		"ReviewTitle": "Fun place",
		"Review": "Love the slide, diving board... They may have added new features now so it can be more exciting.. Great with friends, not really for family with smaller kids."
	},
	{
		"User": "Dimple S",
		"Location": " ",
		"DateofReview": "April 21, 2016",
		"ReviewTitle": "Exhilirating Slide!",
		"Review": "A half-day trip here would be enough for me. It was a nerve-wracking, once or twice-is-enough-ride. I was just a bit disappointed that the water blob wasn't in operation (that is actually what I was looking forward to). \r The other half of the day maybe spent in Hagimit Falls, especially to wash off the saltiness from your body (the shower water in Maxima is also salty).\r All-in-all, it was fun!\r \r Btw, I hate that Johnny's ride.. it's deceiving..hehe.. you'll find out on your own^^"
	},
	{
		"User": "Mariel G",
		"Location": "Baliuag, Philippines",
		"DateofReview": "March 15, 2016",
		"ReviewTitle": "Exciting!!!",
		"Review": "We did slide in their Giant Slide. I was very afraid to do this slide since I don't know how to swim. Yet, we conquered it since we are wearing their life jackets. We even held our gopro while doing the slide."
	},
	{
		"User": "TreverHue",
		"Location": "Antipolo City, Philippines",
		"DateofReview": "March 5, 2016",
		"ReviewTitle": "Maxima Aqua Fun",
		"Review": "I had a quick visit in Samal island, we were not able to roam around the entire Island but visiting this leisure haven suffice everything, our quick glimpse of Samal was really unforgettable. During our visit we weren't able to try the canopy walk since they only operate the facility during the weekends yet we enjoyed sliding down the giant slide and jumping over the water blob. The place is perfect for family and group outing, surely everyone would enjoy the unique activities Maxima has to offer."
	},
	{
		"User": "Tins C",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "February 27, 2016",
		"ReviewTitle": "aqua adventure",
		"Review": "the longest slide, a breathtaking adventure, it's a place for those who love thrills and excitement."
	},
	{
		"User": "Herbie A",
		"Location": " ",
		"DateofReview": "February 16, 2016",
		"ReviewTitle": "Maxima Slide",
		"Review": "Pros:\r 1. The slide is really enjoyable.\r 2. Air conditioned villas\r 3. Nice view of Mt. Apo\r 4. Hagimit falls is relatively near\r \r Cons:\r 1. The washroom is separated from the villlas.\r 2. Limited food options.\r 3. The water depth can be scary to others.\r \r When going to Maxima, I recommend bringing your own food and water. I think they can also cater backpackers (you can camp out and bring your own food). To summarize, I'm not entirely disappointed about the place since I really like the slide but I'm not too crazy about the place either."
	},
	{
		"User": "Angela M",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 12, 2016",
		"ReviewTitle": "Stoked!!",
		"Review": "When in Samal, make sure to go to Maxima Aqua and I swear you will enjoy! the 300/head fee is already inclusive of the life vest rental, unlimited giant pool slide and cliffboard jump. for the thrill-seekers, dropping by is a must! 👊🏼"
	},
	{
		"User": "Justin S",
		"Location": " ",
		"DateofReview": "February 12, 2016",
		"ReviewTitle": "Almost disapointed",
		"Review": "My girl was looking forward to go to blujazz since she went there years ago and she really enjoyed it. Sadly it is under renovation (I think) so the place was messy. Luckily there is this tour for 3 tourist destination promo, one of these 3 is Maxima Aqua fun.\r \r We only tried the slide and it was a stress reliever. You'll only think of surviving the slide lol. \r The food was nice but a little expensive. You can bring your own food and no charges."
	},
	{
		"User": "togetherWetravel8814",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 1, 2016",
		"ReviewTitle": "perfect for adventure",
		"Review": "It's a good resort for adults as you can enjoy the deep blue sea. I have been to other resorts but I don't like that they didn't allow us to go to the deep so this resort is good for us. Maybe not so good with kids because there is just a little shore, and most seen on low tide only. But for adults that loves fun, it's really good."
	},
	{
		"User": "Christine Joy M",
		"Location": " ",
		"DateofReview": "January 28, 2016",
		"ReviewTitle": "For the adventurers out there ",
		"Review": "This place is perfect for good swimmers and people who are looking for a little adventure. It was my first time to try that long slide wearing a life jacket (everybody is required to wear one before you are allowed to try the activities ), the diving board even if i don't know how to dive LoL and jump on that giant thing (i forgot what it's called). I just wish we could've gone earlier to maximize our time."
	},
	{
		"User": "marissany",
		"Location": "New York City, New York",
		"DateofReview": "January 16, 2016",
		"ReviewTitle": "Needs maintenance",
		"Review": "We came here as part of our Island Hopping. The staff didn't know we were coming and where asking for entrance fee. Our boat captain told them it was already paid for as part of our package and since they didn't know we were coming there was no food cooked for us so we have to wait for 45-50 minutes. It would have been nice if we can use the slide while waiting for our food to be cooked but the safety crew were on break till 1pm so we can't use it for an hour. We arrived around 12 noon. The food that they prepared was good for 6 people but it was a lot that it can feed about 10 people. The food was good and it was worth the wait. The slide was fun. Swimming and snorkeling were also fun with lots of underwater sea life."
	},
	{
		"User": "pixiedust010",
		"Location": "Singapore, Singapore",
		"DateofReview": "December 25, 2015",
		"ReviewTitle": "Not for suitable for kids",
		"Review": "It's an adventure for adults but not friendly for kids. There's no beach shore for kids to play and swim safely. The water is so deep you can't swim without life jacket. The corals are so sharp nobody is safe for cuts. You must be very careful on the steps as they are covered with moss and could be slippery. In the end we just had our lunch and move to other beach for kids to swim. Waste of time and money."
	},
	{
		"User": "fatimoir",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "December 23, 2015",
		"ReviewTitle": "7/10 - Good!",
		"Review": "I ended with a bloody toe while swimming in the ocean (with a life jacket on because it's a must)because of the reefs underwater. Besides that, it was a very fun experience. I hope for an emphasis on safety and the like."
	},
	{
		"User": "Ken Marius F",
		"Location": " ",
		"DateofReview": "December 21, 2015",
		"ReviewTitle": "Crap do not go here",
		"Review": "U cant be near the wather. Unless u ware a lifjacket and an old and out datet one at that. In the west they baned these lifejackets because there a death trap. Crappy sevice and over priced. Do not go there."
	},
	{
		"User": "Bree F",
		"Location": "Italy",
		"DateofReview": "December 18, 2015",
		"ReviewTitle": "A sweet adventure :)",
		"Review": "Me and my boyfriend went to Samal with no specific resort destination. The tricycle driver recommended us a lot of places and at the end we decided to try the Maxima Aqua Fun. It was uncrowded and very quite when we arrived. Only few people...More"
	},
	{
		"User": "Veness Ehrn G",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 11, 2015",
		"ReviewTitle": "AQUA_FUN THE BEST!",
		"Review": "(Nov. 1, 2013) the Fun and adventure still lingering in me. We marked our 3rd Anniversary in here. We took the bus going penaplata from magsaysay park and a \"habal2x\" (a big motor bike) a total of an hour ride. They have a comfortable Accommodation...More"
	},
	{
		"User": "calub m",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "December 2, 2015",
		"ReviewTitle": "Adrenaline Rush",
		"Review": "If you are looking for a place wherein you can scream your voice out and something that will make you feel alive. This is the perfect place to be! I cannot forget the first time i slide from the 30-40m long slide. i thought i...More"
	},
	{
		"User": "Nickate N",
		"Location": " ",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "\" Snorkeling its was great fun\"",
		"Review": "Its a deep and nice beach resort and you will be having fun with your family. Clear and clean water , u can see a lots of fish and slide going down . Its a great time to get bonding with our family and friends...More"
	},
	{
		"User": "Reizl C",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 22, 2015",
		"ReviewTitle": "Not for the peace and quiet person.",
		"Review": "No shore, no fun. You just cannot do a simple walk or a quiet time on the shore. Well that's for me. But if you like trying their tarpaulin slide that plunges you into the ocean deep, this is your spot. :)"
	},
	{
		"User": "LoviAlterado",
		"Location": "Pasig, Philippines",
		"DateofReview": "October 13, 2015",
		"ReviewTitle": "Worst attraction ever!!",
		"Review": "We went here expecting it was child friendly but we were completely wrong. We are exploring Samal Island and then the tricycle driver told us that this was the most visited. We were DISAPPOINTED since the place was full of rocks so meaning my 3...More"
	},
	{
		"User": "AndyJ74",
		"Location": "Gold Coast",
		"DateofReview": "September 30, 2015",
		"ReviewTitle": "Not maximum fun as the name may suggest",
		"Review": "When seeing promotional material on Maxima Aqua Fun, it has 2 water slides, one is quite long. It also showed a large water balloon where someone jumps on one end sending another person flying in the air and into the water. Unfortunately, both the long...More"
	},
	{
		"User": "drialexie",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 24, 2015",
		"ReviewTitle": "Good for group swimming activities. :)",
		"Review": "The place is about an hour ride from Sta. Ana Wharf. The giant slide is enjoyable as well as the water blob! :) When we went there, only one slide was available. I think this is good if you are with your group of friends....More"
	},
	{
		"User": "Vince M",
		"Location": " ",
		"DateofReview": "September 20, 2015",
		"ReviewTitle": "Calm and clear waters",
		"Review": "Take a boat from Sta. Ana pier by chartering or by going with the public. You will enjoy great plunges in their clear waters."
	},
	{
		"User": "Anna May V",
		"Location": "Pasig, Philippines",
		"DateofReview": "September 19, 2015",
		"ReviewTitle": "Limited Attraction",
		"Review": "Maxima is not easy to get to, and lots of flights of steep stairs to climb back up and descend.\r \r It has very limited attractions- a giant slide is only good once or twice, then the newness of the experience wears off. Entrance at 200++, every other activity is extra. \r \r Diving is only for certified divers, the area is not a swimming area, and at low tide even banana boating and other activities are not available."
	},
	{
		"User": "Nelle258",
		"Location": "Quezon, Philippines",
		"DateofReview": "September 15, 2015",
		"ReviewTitle": "Disappointing",
		"Review": "For the entrance fee I paid I at least expect a decent washroom and a tap water in the faucet instead of salty water.\r \r Slide: Thrilling for the first try but boring on the second.\r Dive: Nothing special to me. Just a diving board.\r Snorkeling: Don't expect to see nemo. LOL.\r Canopy: If your not scared of heights, its a meh.\r \r Tip: Wear long sleeves if you plan on enjoying the slide. 3 of us in our group had a cut on our elbows. (I'm thinking its because of the friction from the tarpaulin.)"
	},
	{
		"User": "jessicasY6091HN",
		"Location": " ",
		"DateofReview": "September 14, 2015",
		"ReviewTitle": "I highly recommend",
		"Review": "This place is good but if u r plannin to bring kids, like young kids, i would stop you\r Cause since its not a beach\r What u do is just jump and slide\r Im afraid u might not be able to take care of ur little one\r But with friends ive been here sooooo many times and i love this place much"
	},
	{
		"User": "partyoung",
		"Location": "Hong Kong, China",
		"DateofReview": "September 13, 2015",
		"ReviewTitle": "whew...",
		"Review": "What a slide. This place is really for the young & courageous people. They have a lot of outdoor activities. They have hanging bridge, the tarp slide, diving spots... The water is very clear. The kids really enjoyed everything"
	},
	{
		"User": "julietteBacolod",
		"Location": "Manila, Philippines",
		"DateofReview": "September 3, 2015",
		"ReviewTitle": "not for me... it's a fad, very expensive!!!!",
		"Review": "Quite far from Samal jump-off coz we even have top pass by the Pearl Farm. I find it expensive there is the food and a little bit inconvenienced that we have to secure a waiver before taking the slide and jumping off a tower straight to an inflatable floating over the sea. The slide is made of plastic material that they have to pour water every time you slide to ease up the friction. My elbow touched a not so wet part of the slide that it really hurt me so bad."
	},
	{
		"User": "Maldita2013",
		"Location": "Brighton, United Kingdom",
		"DateofReview": "September 3, 2015",
		"ReviewTitle": "Fun",
		"Review": "It needs improvement with the facilities especially toilets and changing rooms. My son enjoyed the giant slide."
	},
	{
		"User": "moshiyana",
		"Location": "San Fernando La Union, Philippines",
		"DateofReview": "September 1, 2015",
		"ReviewTitle": "Giant Water Slide!",
		"Review": "I am not sure how to get here using public transport because we used a car of my friend who is from Davao and boarded a barge. When we arrived in Samal Island, we drove to Maxima Aquafun. Oh before you finally reach it, there will be someone who will ask you to pay an environmental fee (P20 each if I remember it right). The place is a beauty. Be prepared to walk down through a plight of steep stairs because the place is like a cliff. We ordered food there (won't surely dent your pockets, food in Davao is generally affordable) and played games in the table we rented. After that, we went to try their major attraction, which is the water slide. We put our life vest, which is very helpful for non-swimmers like me. There is someone whom you can ask to take your picture while in the slide and trust me, he can take a damn good picture of you screaming your lungs out. Hehe. The slide leads you to the dark blue beach which is about 100 meters deep (according to the staff) but your life vest will take you on the surface in no time. After that, you can swim back again to the shore and take another plunge!"
	},
	{
		"User": "Arianne S",
		"Location": " ",
		"DateofReview": "August 31, 2015",
		"ReviewTitle": "Adventure",
		"Review": "This place was nice for a little adventure. When you're there, the slide is definely a must-try. The food is quite expensive however."
	},
	{
		"User": "JEmmanuelLasPinas",
		"Location": "Las Pinas",
		"DateofReview": "August 31, 2015",
		"ReviewTitle": "Lots of fun",
		"Review": "If you enjoy the ocean - this is the place for you. There are slides that will take you for a plunge into the deep blue. Food is OK."
	},
	{
		"User": "realsheenamae",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 26, 2015",
		"ReviewTitle": "Be Fit to Enjoy",
		"Review": "Be sure to be physically fit if you visit this place. You have to walk more than a 100 stepladder to come near the sea. The restaurant is almost useless, so bring as much food as you can. However, water sports is available in this resort."
	},
	{
		"User": "betsy_kikay",
		"Location": "Legazpi, Philippines",
		"DateofReview": "August 22, 2015",
		"ReviewTitle": "lots of fun fun fun!",
		"Review": "Went here with my girl friends less than 5 years ago for a day trip due to time constraint. \r We were able to travel, the local way... rode a ferry then a habal habal (simply a motorcycle backride).\r Loved the slide... it was super fun fun fun! they also have a small canopy walk / hanging bridge,\r facilities were very basic that time. few selections on food... \r I just hated the stairs, got lots of them but hey... this is normal!\r This was the highlight of our Davao Trip... would love to come back"
	},
	{
		"User": "Madelaine M",
		"Location": " ",
		"DateofReview": "August 22, 2015",
		"ReviewTitle": "Fun and cool place to be!",
		"Review": "when I first arrive at the resort, it was love at first sight! Love the clear water! the activities of the resort is memorable! that slide highlights it the most!"
	},
	{
		"User": "Billois_M",
		"Location": "Charly-Sur-Marne, France",
		"DateofReview": "August 9, 2015",
		"ReviewTitle": "cool slides",
		"Review": "i really like maxima with their slides at first i was afraid to try but then its so cool..clearwater and its nice u cannot swim without safety jacket.we did enjoy there.the only thing is the place coz we need to go down in the hill and for the old person it will be too tired for them to go down but we really enjoy it"
	},
	{
		"User": "JM G",
		"Location": "Manila, Philippines",
		"DateofReview": "July 22, 2015",
		"ReviewTitle": "Rush into the Sea",
		"Review": "This place is heaven for those who have adventurous spirits. I didn't expect that I'd have enough courage to try out their slide but since I was already there I just put on my brave face and went for it (although I almost backed out). And I did not expect that I'd have so much fun. The feeling of sliding and then that time where you wait till you hit the waters is very exciting. They also have other activities that involves heights but for me the slide is the number one thing you should try when you visit Maxima."
	},
	{
		"User": "Anonymous-Itchy-Feet",
		"Location": "Folsom, California",
		"DateofReview": "July 4, 2015",
		"ReviewTitle": "For people who like swimming in the deep",
		"Review": "This is not your typical beach resort because it doesn't have any beach... Instead, it is situated upon a cliff and there are two ways down, either through a slide or going on their ramp. Life vests are free and provided by the resort. Views are great. They also offer other activities aside from swimming."
	},
	{
		"User": "wyn0817",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 18, 2015",
		"ReviewTitle": "Needs improvements",
		"Review": "It's a place for adventure seekers and who were born with aquatic genes. The resort doesn't have a shoreline. They provide life jackets which is mandatory for all guests. They have their own ferry boat which you could take at Sta. Ana Wharf. Entrance fee is less than 500 pesos (forgot exact price). They also have rooms for overnight guests."
	},
	{
		"User": "Ella E",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 16, 2015",
		"ReviewTitle": "The best summer destination!!!!",
		"Review": "Full of fun and excitement!!! The longest slide I tried in my life! Would really make your summer the most memorable one!!!"
	},
	{
		"User": "Nece Jean T",
		"Location": " ",
		"DateofReview": "April 22, 2015",
		"ReviewTitle": "Cool water adventures",
		"Review": "Maxima could be one of the best resorts in Samal Island. The water adventures were fun and affordable. I remember having adrenaline rush as I go flying with the water blob..and the slide...it was amazing...go enjoy the view of the island also while riding the banana boat. :) "
	},
	{
		"User": "Dee D",
		"Location": "Digos City, Philippines",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Fun!!!",
		"Review": "It was a tiring yet a fun-filled day during our stay at Maxima.. Everyone in the family had a great stay even my aunts from abroad. We'll surely go back this summer!!!"
	},
	{
		"User": "Mef-mef Ü",
		"Location": " ",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Happy na Birthday pa.",
		"Review": "Celebrated my 21st birthday with my friends in Maxima. Entrance fee is only 150php if students. Bring your school ID with you to avail their promo. Perfect place to bond with your family and friends. I tried the giant slide for nth times. I will visit this place again and again. "
	},
	{
		"User": "jen_x7280",
		"Location": "San Mateo, Rizal, Philippines",
		"DateofReview": "March 17, 2015",
		"ReviewTitle": "Deep waters",
		"Review": "the slide is fun, you have to try it at least ones. You cant swim without life vest unless you are an excellent swimmer. The water is too deep and the ocean is as clear as the skies! They have outdoor activities but we did not get to try it. You have to trek a few meters to the entrance and it was hard when the rain was pouring and the soil was slippery. "
	},
	{
		"User": "Honeynjf",
		"Location": "Perth, Australia",
		"DateofReview": "February 17, 2015",
		"ReviewTitle": "Good but....",
		"Review": "This is a good attraction but defiantly don't go expecting first class facilities (it is a developing country after all). The slides are okay and the turtles in the net are so cute. The banana boat was great fun! However there are LOTS of steps and they are kind of slippery and dangerous (I fell down and grazed myself). Defiantly not suitable for people with limited mobility."
	},
	{
		"User": "Tor Erling M",
		"Location": " ",
		"DateofReview": "December 31, 2014",
		"ReviewTitle": "Dirty place",
		"Review": "Big waves and much crap in the water. And too little with masks and snorkels. And dangerous sharp rock on the shore."
	},
	{
		"User": "virmen",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "December 10, 2014",
		"ReviewTitle": "fun extreme fun",
		"Review": "So blessed that we have amenities i this place we dont need to travel in luzon... wow thankswow wow wow.... hold your breath"
	},
	{
		"User": "Chrnzke",
		"Location": "Makati",
		"DateofReview": "December 2, 2014",
		"ReviewTitle": "Maxima",
		"Review": "REMINDER: This is not a beach. It is a very good place. It has a very long slide. Has a water blob. We visited weekdays so we are unlucky we are unable to try the canopy overview."
	},
	{
		"User": "Angelo B",
		"Location": " ",
		"DateofReview": "November 3, 2014",
		"ReviewTitle": "We had fun but.. ",
		"Review": "Don't visit during the weekdays because most of the adventure activities are not available, on the other hand, you'll have the place all to yourselves."
	},
	{
		"User": "Jelleinne J",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "September 16, 2014",
		"ReviewTitle": "Been here 4 times and I still like it",
		"Review": "I have been here 4 times with 4 different sets of friends and I have a great time everytime. That's how much I like this place. :-) \r \r Entrance fee is 250php, inclusive of the canopy walk, water blob, and unlimited use of the 2 tarpaulin slides. You are also allowed to snorkel their in house reef and jump on their diving platforms. The canopy walk and the water blob are available only on weekends so we weren't able to experience them. Even with the closed attractions, there were still enough activities to keep us occupied. \r \r The food from their restaurant is pretty expensive so it's better to bring packed meals or buy raw food from the market and just grill it once at the resort."
	},
	{
		"User": "hopper28",
		"Location": "Cagayan de Oro, Cagayan de Oro, Philippines",
		"DateofReview": "September 3, 2014",
		"ReviewTitle": "adrenaline rush adventure",
		"Review": "maxima aqua is a resort thats full of adventure, as what their name suggests, MAXIMA. anyhow, when u reach the area, one would seem to ask where & how they put up their very large slide. that was a whole lot of fun experience. the slide is, i think, made of 20m long tarp. so when you slide, you would have to hold your breath and close your eyes in like 20-30seconds before reaching the sea, just imagine that kind of feeling. ;)\r the also have a jumping/diving board area wherein you will land onto a very big pillow-like salababida. haha!, I did not try to jump though because their was a group of college students who took over the facility. but overall, I enjoyed watching them as they simultaneously hop on the pillow and saw their companion hop from the pillow. :D"
	},
	{
		"User": "Aileen T",
		"Location": "Caloocan, Philippines",
		"DateofReview": "September 2, 2014",
		"ReviewTitle": "High price poor place",
		"Review": "Everything have price,from entrance of Php250.You can ask for the picture on the giant slide but you'll pay Php60 without any heading for the name of the place.The cost of the 1.5 litter softdrinks is Php100 and additional P10 for the plastic cup.The tables that you stay don't have extra cost but the smell is not good.From our table I smell like their is a comfort room beside me. The comfort room is also not maintained. I'm strongly not recommend this place"
	},
	{
		"User": "QC, Phils",
		"Location": "QC, Phils",
		"DateofReview": "August 22, 2014",
		"ReviewTitle": "Best Time Ever!",
		"Review": "Amenities aside, we had a great time here. This is the place to be for adventure seekers with a giant slide leading to 30/50-ft deep sea waters and also a blob beside it. \r We will definitely come back!\r Note:\r - Not for the faint-hearted and those who just want to lounge by the beach. There is no shore here.\r - Amenities such as the restaurant and shower area need major overhauling. I cannot begin to describe the state of the shower area. If not for the giant slide and the blob, the resort would be a major fail."
	},
	{
		"User": "Tee T",
		"Location": " ",
		"DateofReview": "August 1, 2014",
		"ReviewTitle": "Awesome Maxima Waterslide",
		"Review": "The Maxima's Water-Slide reminded me of my young and dangerous youth days at the then \"Big Splash\" in Singapore...\r \r Sliding down Maxima's Water-Slide of 40 meters in length with a steep gradient gives you real adrenaline rush. The feeling of being cataputted into the air at the end of the slide give you a feeling of a skydiver with a 4 meter's \"free- fall\" drop into the water is the \"bonus\" adrenaline rush to finish off the adventure!!\r \r You Should Be Here!"
	},
	{
		"User": "sunmeixue",
		"Location": "Iloilo City",
		"DateofReview": "July 29, 2014",
		"ReviewTitle": "Adrenaline rush!",
		"Review": "If you're a kind of person who loves perking up your adrenaline, then try doing the steep slide that they have. It's really exciting and fun!"
	},
	{
		"User": "Val Anthony S",
		"Location": " ",
		"DateofReview": "July 11, 2014",
		"ReviewTitle": "Certified Tourist Trap",
		"Review": "Nice slide and water blob but after that, everything is either something you will hate or forget.\r \r Pro's:\r - Nice adventure trial\r - Try the giants slides and water blog.\r - Good spot for diving\r \r It is very clear in their ads that this is resort has no beach front.\r \r CON'S:\r - Food and beverage are very expensive!!!! More pricey than the regular hotel in Davao and even if you will compare it to the food on flight.\r - Extremely dirty toilet and bath. No hot water. Roaches in some area.\r - Entrance fee is too pricey for the services\r - Poor service of staff."
	},
	{
		"User": "AyetSalang",
		"Location": "Davao City",
		"DateofReview": "June 24, 2014",
		"ReviewTitle": "One of a kind water adventure spot worth your money",
		"Review": "Services get better each year. over Php200 admission fee. Fun slides and underwater photography offered. May be reached by boat from Sta. Ana wharf for roughly Php150 at a specified time in the morning. (2011)"
	},
	{
		"User": "Rexoy",
		"Location": "Davao",
		"DateofReview": "June 22, 2014",
		"ReviewTitle": "Be careful of the blob",
		"Review": "Entrance fee is too much if you are planning to just eat there. One attraction that should have a warning to users is the blob, where they jump from a height to an inflatable cushion on the water. To my knowledge there has been 2 victims, one suffered a fractured thigh bone that needed surgery! "
	},
	{
		"User": "EllaDG",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 26, 2014",
		"ReviewTitle": "Maxima equals fun",
		"Review": "I've been to this place several times already. I think it was the 6th if I remembered correctly. Yesterday, Jan. 25, 2014 we went there with my sister and brother in law who came all the way to manila to have a vacation here in Davao. If you are looking for something fun to do this is a perfect place for you. Maxima resort is located in samal island. It's a resort on the hill side of the mountain with giant slides leading to the sea. Take note they don't have a shoreline. To get there from Davao City, you can bring your own car and ride a barge. It would take approximately 15mins. to get to the island. From the wharf you will need to travel another 20 to 30 mins. to get to the resort. There's still an on-going road construction but all in all it's passable. The road leading to the main entrance is not cemented so it would be best to bring a four wheel drive especially if it's raining. For an entrance fee of 250 pesos, you can use their facilities such as the two giant slides, kayak, diving platform and canopy walk. We have not tried the kayak and canopy walk though. You can also swim and just snorkle to see their live corals and giant clams. Better to bring your own gears for hygenic purposes. Also, I am not sure if you can rent these in the resort. You can also do scuba diving at a cheap price of 800 pesos. You may also rent the banana boat at a minimal fee. Picnic table is free of charge. You can choose any vacant table. I believe you can bring your own food. We ordered our food from the restaurant. Service is slow thus better order like one to two hours ahead your scheduled meal time. Food is okay and reasonably priced. Flies and cats are everywhere so don't leave your food on the table without any cover or unattended. \r \r I recommend this place for kids and young adults who wants to have some fun. Not recommended for senior citizen or older people as you will need to climb up and down the steep stairs. Lower your expectations, this not a first class resort. Recommended for day tour only."
	},
	{
		"User": "Rizza223342",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 7, 2013",
		"ReviewTitle": "\"so adventurously fun...\"",
		"Review": "I was captivated by this place since it was showed in Pinoy Explorer of TV5 hosted by Aga Muhlach...since then i researched things about the place (the fun, the adventure, the water and the entrance fee of course) it was nov. 30 when I and my boyfriend decided to visit Maxima it was our first visit to the place and we found it fun and exciting. The slide, the water blop and the canopy walking adds the adventure and made more fun...I invite everyone to visit the place to experienced different kind of Aqua fun..."
	},
	{
		"User": "Runel Zeth R",
		"Location": "Bacolod CIty, Bacolod, Philippines",
		"DateofReview": "November 1, 2013",
		"ReviewTitle": "Slide for Life",
		"Review": "From Davao City we took the bargegoing to samal island, then from the Samal port we tried the Habal2x going to Maxima. At first I did not really appreciate the place because it was not that well developed specially the road entering the resort. But when i saw the giant slide and the magnificent view I said to my self I will really enjoy this. But during our lunch meal we ordered the fastest food that we taught could be cooked because we were so excited to try the slide. But our expectation were wrong, because we still waited for an hour just for our food..I waited for an hour just for a fried Milk Fish. And the one serving the food and managing it has a bad attitude. But i did not mind it because I want to enjoy my stay.... So after eating our lunch we tried the giant slide because for me it was my first time... And I tried it not just once but many times. But the problem is when i reach the water, small jelly fish are waiting for me. And those small kind of jelly fish are really itchy and the watcher said it was their season it is called dikya. But I really enjoyed my adventure... Giant slide is only in Samal Island. The Best!!!"
	},
	{
		"User": "coffeefreak",
		"Location": "Caloocan, Philippines",
		"DateofReview": "September 23, 2013",
		"ReviewTitle": "Apt name!",
		"Review": "This place is really all about aqua fun...and the entrance fee was worth every centavo! For 250, you can use the giant slide, kayak and canopy walk unlimited! The giant slide was fun but after drinking a mouthful of seawater, I didnt want to do it again. I didnt try the kayak and the canopy walk but I had loads of fun snorkeling after doing the slide\r \r Tip- allot half day to a whole day in this place if you like water activities- we weren't able to maximize them because of time constraint. "
	},
	{
		"User": "ShazSG",
		"Location": "Singapore",
		"DateofReview": "July 18, 2013",
		"ReviewTitle": "Awesome slides!",
		"Review": "Didn't see any foreigners there except myself but I still had tons of fun.\r \r The 2 slides were simple but fun. Sliding down the tube, only to fall one storey into the sea isn't something other water parks can afford. Conquer one's fear of heights and sea with the slides and jetty jump sites. \r \r Good clean fun for adults. Don't judge the environment, just indulge in the unique slides. Basic is good here as it keeps prices low, otherwise the fun might not worth the ticket price."
	},
	{
		"User": "Jenny Jean O",
		"Location": "Dasmarinas City, Philippines",
		"DateofReview": "June 16, 2013",
		"ReviewTitle": "Great Slide To Drive Your Fears!",
		"Review": "From afar it seems like an ordinary resort with a long side. The resort is no sand definitely because they explained to us the resort is within the coral area of the island. So the water level was expected to be deep..As in DEEP...its both exciting and you'll be very afraid like what I've d felt there especially in the slide where at the end of it it likes 80 feet deep but gladly they provided and strictly what us to wear our life jacket for our safety. :) Never miss a chance to try the diving board (which I refused because is so deep and very dark ) and the long slide made of a giant tarp (I've d tried it) worth to try , its a different feeling when you're in it but after it ..wow I made it you'll be proud of yourself.. Their food was ok and reasonable place. And since samal island boat are with limited time you'll be required to stay for a night and the cottage we've stayed was very nice although the comfort rooms are located above the cottages areas but no complained about it.. I had my shared bruised and a cut in my foot so I suggest to wear some aqua shoes that's the least the others can do. More improvements and go maxima! Adventure seekers must try this place!"
	},
	{
		"User": "Poochie Y",
		"Location": "Amasya, Aydin, Turkey",
		"DateofReview": "May 29, 2013",
		"ReviewTitle": "Lame Resort",
		"Review": "Totally lame resort with lame management! Plus you will go home with bruises. This is a no-sand resort! We availed of the misleading promo of maxima but the management just shrugged their shoulders on us! We totally went back to Davao City and spend the night there. Our first Samal experience was ruined by Maxima! I am giving this resort 1 million thumbs down! Not recommended to friends! The gruelling wait for the small boat also added to the dilemma. Never ever set foot on this resort! They dont do refunds either!"
	},
	{
		"User": "Yasima",
		"Location": " ",
		"DateofReview": "April 1, 2013",
		"ReviewTitle": "Too far",
		"Review": "It is too far too drive,the place is nice, but is not good if you have small children. It is to deep for little children to swim.too far from Davao city.for my experience is not worth all the trouble going there."
	},
	{
		"User": "nasmej11",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "March 31, 2013",
		"ReviewTitle": "dive your fears away!",
		"Review": "tables and chairs, unlimited slide on the giant tarp, diving on the wooden plank, bouncing up and down on the trampoline, use of life vest are all included in the 200 peso entrance fee. we got lucky though because while visiting the crocodile park, they give us a coupon for maxima aqua fun. 50% off for the entrance fee!"
	},
	{
		"User": "Joy Lynn B",
		"Location": "Makati, Philippines",
		"DateofReview": "March 15, 2013",
		"ReviewTitle": "Indeed it's fun in Maxima",
		"Review": "My friends and I had a good time here at Maxima Aqua Fun Resort. For only P200 entrance fee, you have the whole day to swim, snorkel, dive and slide. \r \r Our main purpose coming here is really to try their giant tarpaulin slide. And when we saw it, it was enormous! At first I had second thoughts about trying the slide, but I said to myself it's now or never. We were asked not to place our arms on either side but rather put it infront of us. Unfortunately, due to my nervousness, I mistakenly placed both my arms on both sides halfway down the slide, thus, my elbows got scratched and bruised. \r \r The slide was really long. Shouting while sliding helps a lot. Just the thought of dropping down the ocean (120 feet deep) was scary. However, with our life vest on and everything was so fast, you will immediately surface in the water. Apart from that, the lifeguard was there in the sea too assisting us so we feel safe.\r \r There is also a diving board where you can jump down. I have not tried it but I will when I come back someday. Overall, It was worth it!"
	},
	{
		"User": "vandalp",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "February 20, 2013",
		"ReviewTitle": "Its more fun in Maxima",
		"Review": "My husband and I really had a good time in this place.For a very affordable price of 200 pesos entrance fee including unlimited amenities was all worth it. We can do snorkeling whole day,dive and slide.To those people who will expect a very nice rooms,fancy bathroom facilities you can go to a 5 star hotel in Manila and to those people expect that this place a white beach then you go to Boracay. This place is in the middle of nowhere and people who loves natures, adventure,peace and serenity this place suits you."
	},
	{
		"User": "jetty t",
		"Location": "bacolod city",
		"DateofReview": "December 5, 2012",
		"ReviewTitle": "Fun!",
		"Review": "Giant slides, canopy walk, habal-habal.... adventure and fun. Food was great especially the spicy crocodile sisig... Good for family and group outing."
	},
	{
		"User": "Telai J",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 18, 2012",
		"ReviewTitle": "Bring out the adventurer in you!",
		"Review": "If you're looking for a more adventurous getaway, try Maxima in Samal Island. While they do not have a beach, they do have a lot of activities in store for everybody. My favorite would have to be the diving boards. While the slides are fun, the diving boards take a lot (and i do mean A LOT) of courage from those willing to risk it. It's only less than an hour away from Davao City, and their rates are reasonable. Plus the rest room are very clean!\r \r So the next time you visit Samal, don't forget to drop by Maxima!"
	},
	{
		"User": "djtravelbug",
		"Location": "Manila",
		"DateofReview": "October 31, 2012",
		"ReviewTitle": "Always one of my fave destinations in Davao",
		"Review": "Decent rates and alot of things to do.. Must try their slide, its a good experience.. They serve decent food and is just 30-45mins away from the city.. Has always been a highlight of my trips to Samal Island.. Will be back definitely!"
	},
	{
		"User": "lizl0ves2travel",
		"Location": "Manila, Philippines",
		"DateofReview": "October 26, 2012",
		"ReviewTitle": "Maximum Adventure",
		"Review": "I loved it here! The price is so worth it. I loved fun outdoor activities so I enjoyed it very much. The canopy walk with a little bit of tree-drop at the end was so thrilling. Yeah, i was a little bit scared but that's what adventure is all about, right? Then, the giant slide OMG. I'm scared of drowning because I don't know how to swim. But I really wanted to try it. So I tried it too. I was a little nervous but what the hell. I just did it haha. I was screaming on the 1st half of the slide but it was too long I just waited for myself to drop in the ocean. Felt good afterwards. Too bad we weren't able to do snorkeling because we arrived quite late already. Fun fun fun. Try it!"
	},
	{
		"User": "aki0618",
		"Location": "Manila, Philippines",
		"DateofReview": "October 1, 2012",
		"ReviewTitle": "for those who like adventure",
		"Review": "there are lots of activities you can enjoy in water or land. The cost is not that much. They also have a place you can stay if you want to spend the night"
	},
	{
		"User": "KarlaSingson",
		"Location": "Davao city, Philippines",
		"DateofReview": "September 30, 2012",
		"ReviewTitle": "Maximum Adventure at Maxima!",
		"Review": "Whenever I have friends who ask where the best Samal resort is, I always say it's Maxima. Here are a few reasons why: *there are a lot of activities! Surely boredom is not an option here. You can scuba dive, snorkel, experience their 2 giant...More"
	},
	{
		"User": "Perry H",
		"Location": "Cebu City, Cebu City, Philippines",
		"DateofReview": "September 20, 2012",
		"ReviewTitle": "Awesome Slide!",
		"Review": "Their giant tarpaulin slide is awesome! It was one hell of a slide. LOL. Nice place to do snorkeling. The do have diving spots too."
	},
	{
		"User": "anne_rainne",
		"Location": "Taguig City, Philippines",
		"DateofReview": "August 21, 2012",
		"ReviewTitle": "They won't help you! huhuhuhu",
		"Review": "The guide asked me not to put my hands of either side of the slide and just raise my arms. I kept screaming from the top but got tired of waiting for the end of the slide since it was long. I do not know...More"
	},
	{
		"User": "HALLYCS",
		"Location": "Quezon City",
		"DateofReview": "June 8, 2012",
		"ReviewTitle": "Giant Slide = Adrenaline Rush",
		"Review": "The resort's ferry boat took us at the resort. I was excited at first but I felt a bit disappointed when we arrived. I always thought there is a shoreline but to my dismay, there is none. The good thing is that they have billiard...More"
	},
	{
		"User": "vingaye p",
		"Location": "Quezon City, Philippines",
		"DateofReview": "May 31, 2012",
		"ReviewTitle": "Aqua FUN!",
		"Review": "It's a must visit if you are going to Samal Island. Their big slide gives you that adrenaline rush that's totally worth the tiring traverse and steep climb. However, their showers and toilets are not desirable."
	}
]
