[
	{
		"User": "jonsapon121",
		"Location": " ",
		"DateofReview": "March 5, 2018",
		"ReviewTitle": "Exactly what it says on the tin",
		"Review": "My family and I visit early February. And it is exactly what it is. Very interesting facts about bats. I do recommend this place if you have young kids. Be advised to bring a mask of some sorts."
	},
	{
		"User": "Peter T",
		"Location": " ",
		"DateofReview": "February 15, 2018",
		"ReviewTitle": "Well worth the trip! ",
		"Review": "We found the bat cave fascinating! After seeing this on National Geographic we had to visit this place! The bats start leaving the Cave around 6 pm. If you’re here in the daytime can still see the bats from four or five different openings. Would recommend bringing mosquito repellent as there was lots of mosquitoes due to the recent rains. "
	},
	{
		"User": "jgayongorsa",
		"Location": " ",
		"DateofReview": "December 11, 2017",
		"ReviewTitle": "Worth your 100 pesos",
		"Review": "Still a Guiness Title holder, the bat cave would offer you sightings of the 5 open caves that holds thousands of bats for 100 pesos. Although you wont be able to go inside the cave, you wont even dare going near the cave because of the stinky smell of their poop. \r \r The Tour guide is very nice too. "
	},
	{
		"User": "beaverrogers",
		"Location": "Ayer, Massachusetts",
		"DateofReview": "October 28, 2017",
		"ReviewTitle": "needs more development",
		"Review": "Upon hearing the phrase “bat cave”, i really thought that we could enter and explore the cave. these are just 5 open underground caves wherein you could take a picture only from the outside. you will need a long range camera to take a good shot of the fruit bats. they have a nice and welcoming tour guide. suggest they would develop the bamboo fences around the caves and fix and clean their comfort rooms. "
	},
	{
		"User": "UsapangGala",
		"Location": "Pasig, Philippines",
		"DateofReview": "October 20, 2017",
		"ReviewTitle": "cuite interesting",
		"Review": "cool, if you like critters. it has a very strong smell from the guano but you can deal with it. and it is cheap."
	},
	{
		"User": "pastelprism",
		"Location": "Manila, Philippines",
		"DateofReview": "October 17, 2017",
		"ReviewTitle": "Better to come here at dusk",
		"Review": "So our first stop in Samal Island was here at Monfort Bat Sanctuary, upon entering the premises you will meet a staff who collects the environmental fee on the area.\r \r By the way, we went there via a habal-habal (local term for the motorcycle used as public transport)\r \r You will pay P100 and after that the guide will introduce the place like, how was the place was discovered, why was it called Monfort bat cave and also a brief introduction about the facts regarding the main attraction--bats. \r \r What to expect?\r \r Other than the bats, also found in the cave were bayawak (monitor lizard) and yup... snakes. Consider yourself lucky if you see a bayawak inside the cave since it is rare that it goes near the opening of the sinkholes.\r \r You will see first the opening of the cave, then just a few climbs you will see the 4 sinkholes which will give you a bigger peek on what the cave looks like inside and how big is their colony.\r \r Best time to see the place? According to the guide, normally tourists would like to see the (I forgot the exact term) coming out of the bats and their formation. And this only takes place at.. just as i have mentioned... dusk (around 5-6 PM)\r \r Important to note also from the tour is their ecological importance and their relation to Durian."
	},
	{
		"User": "seedhunter",
		"Location": "Hyderabad, India",
		"DateofReview": "October 15, 2017",
		"ReviewTitle": "Nice to Know More About Bats",
		"Review": "It's our first time to see so many fruit bats up close and knowing about the different rooms they occupy (based on life cycle). The guide is nice, knowledgable and knows how to inject humor so you won't get bored. The trip was short and sweet, 30 mins is enough. Please note that the place has a certain stench that might not be appreciated by some so better bring a towel or something to cover your nose while going around. Make sure to include this place in your itinerary."
	},
	{
		"User": "Richee Genesis T",
		"Location": " ",
		"DateofReview": "October 13, 2017",
		"ReviewTitle": "Nature's miracle",
		"Review": "Visited this cave of fruit bats.Amazing colony in approx 75m long cave with five openings. You have to pay 100 Peso. Better to go in the evening 6-7pm to see bats swarm going out for foods. They are responsible for pollination of many fruits in the region like durian."
	},
	{
		"User": "Victorianlad",
		"Location": " ",
		"DateofReview": "October 10, 2017",
		"ReviewTitle": "P100 entrance not worthy",
		"Review": "They should lessen the P100 peso entrance because its quite expensive than the other attractions in samal. We only stayed there for 15 minutes because there was nothing really to see except for the bats yeah.\r \r Bring with you something to cover up your nose because the bat caves were really stinky. "
	},
	{
		"User": "pancit_canton",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "October 9, 2017",
		"ReviewTitle": "It's awesome",
		"Review": "I have never seen that many bats in my entire life. The guide was great, she spoke to us before we went to see the bats and its very informative and she's very smart and funny."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "August 11, 2017",
		"ReviewTitle": "the biggest colony of fruit bats",
		"Review": "It is situated northwest of the island of Samal. A secured area so that nobody will fall down to the deep cave below. Even at the mouth of the big hole or cave, millions of bats are seen like sticking to the sidings of the...More"
	},
	{
		"User": "Ronna V",
		"Location": " ",
		"DateofReview": "July 16, 2017",
		"ReviewTitle": "First time to see millions of bats !",
		"Review": "Arriving from davao i headed straight to samal island. \r My first stop is here at the monfort bat sanctuary .. \r Entrance fee is 100/head. \r When i arrived they just opened the park and am the only guest around that time so i had all the time to see and observed this little creatures.. \r They have 5 diff \" wards\" hahah \r 1. Entrance \r 2. Maternity ward\r 3.training ward - the most noisest ward \r 4. Male ward - \r 5. The oldies ward - the most quite ward of all and the most unpleasant smell \r \r I saw some birds its black color big one that fetch and hunt bats to eat . \r \r My tour guide also told me that when its feeding season..lots of snakes and bayawaks which are really big are inside that cave.. Oohhh thats scary... \r But luckily i didnt see any ... \r \r Nice place to see.. Why not drop by here when u hve hr samal tour "
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "July 15, 2017",
		"ReviewTitle": "Informative, interesting ",
		"Review": "I suggest you waiting for a guide (opens at 8am) so you'll get more substantial information. We've been to a lot of caves in the Philippines but nothing quite like this. Even though you can't enter the caves, it's pretty interesting. There's a lot of info around the area and they've preserved the site really well. It isn't a must-see place if you don't have a lot of time, but if you're in Samal for more than half a day, then it's a good stop. "
	},
	{
		"User": "Jose Victor M",
		"Location": " ",
		"DateofReview": "June 1, 2017",
		"ReviewTitle": "Quick informative side trip",
		"Review": "I put this into our itinerary since I don't know much about bats and to be honest I thought I can see and touch a bat up close like the one I experienced in Boracay . Contrary to my expectation we did not see one up close yet we saw a their habitat at a distance and had a guided tour around the cave premises. We also gained information about these creatures and the dedicated stewardship that the owner shows. \r \r It can be a quick side trip for those who want a break from the sea and beaches of Samal."
	},
	{
		"User": "Grace B",
		"Location": "Davao",
		"DateofReview": "May 22, 2017",
		"ReviewTitle": "Informative visit ",
		"Review": "My family had a chance to visit the Monfort Bat Sanctuary as one of the highlights of our inland tour in Samal. \r \r The Monfort Bat Sanctuary is one of the tourist attraction in Samal because it is the home of Geoffrey Rousette fruit bats. There are millions of these bats in one cave with several openings. \r \r We learned that it is the largest single colony of this kind of bats , which earned the place their Guinness World Record. Our guide informed us that these bats can reach as far as Bukidnon just to look for food at night but all of them always come back to this sanctuary in the morning. These bats eat the flowers of durian and other fruits and nectar. These bats are also the prey of crows and snakes. Dead bats are also eaten by the rats. \r \r The cave has several openings, the tour guide showed to us the big opening where mating usually happens and where they train their young. In another opening, we found mostly males while in another opening , the aged ( senior citizen , they said) are found. \r \r The entrance fee to this sanctuary is P 100.00 and you pay P 5.00 for environmental fee. \r \r Upon entering the place you can already hear the sound of the bats and smell their pungent odor. Visitors can wear masks upon entering the place. \r \r This place is worth a visit if you are in Samal Island. "
	},
	{
		"User": "Conie a",
		"Location": " ",
		"DateofReview": "April 3, 2017",
		"ReviewTitle": "Simple bat sanctuary ",
		"Review": "It's a simple bat sanctuary.If you appreciate bats then a visit here is worth it.Put a mosquito patch or apply an off lotion before coming here."
	},
	{
		"User": "Luchie Kin A",
		"Location": " ",
		"DateofReview": "March 27, 2017",
		"ReviewTitle": "Summer Samal Island Tour",
		"Review": "Hmmm It was an awesome experience to visit a place like Monfort Bat Cave.. But I know for most people it's diagusting and boring... Disgusting coz of the bad smell from the Bat's Cave. Boring coz of the place... But for me I find it very awesome to visit a place where you can see Millions of Bats and got a record in Guinness. Sad coz most Filipino don't know this wonderful place in our very own country."
	},
	{
		"User": "Liezl E",
		"Location": " ",
		"DateofReview": "March 20, 2017",
		"ReviewTitle": "Guide is very informative. Love the bat caves",
		"Review": "Our guide is very informative. Very educational. Love the bat caves. The smell did not bother me but my mom did. Overall nice place to visit."
	},
	{
		"User": "Jennelyn T",
		"Location": "San Jose del Monte, Philippines",
		"DateofReview": "February 20, 2017",
		"ReviewTitle": "Millions of fruit bats of all ages",
		"Review": "There are different \"caves\" called \"wards\" for male, female, the training school, the senior ward etc. So the bats are classified on those. Some pungent smell due to their droppings but its natural, I hope they can improve further the sanctuary so as to attract more tourist...And there's even a tour guide..."
	},
	{
		"User": "jan j",
		"Location": "makati city",
		"DateofReview": "February 14, 2017",
		"ReviewTitle": "Has the largest colony of fruit eating bats. Educational!",
		"Review": "I've been to other bat sancutary in other places her ein the Philippines but it is my first time to see this large colony of bats and volunteers here have a lot of information to share. Each sink hole is for a specific age group of bats and purpose... Mating Bat for mature bats which intends to mate or make new baby bats. No wonder you will see bats in pair :)\r \r There is a sink hole for mother bats to rear their young bats, while another one where you will see young bats training to fly and feed on their own. Each age group has a unique way of flying too.. Isn't that fun? knowing all these info while touring around. Not only that the entrance fee you pay Php100 (2usd) goes to the conservation of these bats, which also contributes in the propagation of fruit bearing trees in the province.\r So check this out!"
	},
	{
		"User": "Jelle V",
		"Location": "Melbourne, Australia",
		"DateofReview": "February 3, 2017",
		"ReviewTitle": "Interesting and educational",
		"Review": "This fruit bat colony costs P100 per person and is about 400 metres off the main road on a gravel track that in one place was steep. There are five caves where some of the claimed 2.5 million bats were visible including babies. The guano...More"
	},
	{
		"User": "macasaetchris",
		"Location": " ",
		"DateofReview": "January 21, 2017",
		"ReviewTitle": "Must See",
		"Review": "this is one of the highlights in Samal Island. the tour guide is quites knowledgeable about the bats. When you plan to get here, prepare a face mask or a handerchief because of the \"guano\" or bat poop. :)"
	},
	{
		"User": "Wreckxki",
		"Location": "Makati, Philippines",
		"DateofReview": "December 14, 2016",
		"ReviewTitle": "2.8 MILLION BAT IN ONE PLACE!",
		"Review": "Entrance fee is 100 per head Good: 1. Get to see some 2.8 million fruit bats in on place! No other place in the world can offer you that! 2. Protected area 3. Has tour guide Not so bad: 1.Be ready to smell their poop!...More"
	},
	{
		"User": "Marlita C",
		"Location": "Quezon City, Philippines",
		"DateofReview": "November 18, 2016",
		"ReviewTitle": "Educational Trip",
		"Review": "This was our first itinerary on our day tour in Samal Island. I have been to a lot of bat caves already but this was the most informative and I was really amazed how unique bats are. The tour guide explained really well how the...More"
	},
	{
		"User": "carolbernardoqbo",
		"Location": " ",
		"DateofReview": "October 19, 2016",
		"ReviewTitle": "Amazing",
		"Review": "I had goose bumps looking at all the millions of bats inside the cave. You cannot enter but you can watch the bats all upside down hanging from the cave. spend about 30 minutes there. They also recommend the sunset viweing when you see the...More"
	},
	{
		"User": "Whangs",
		"Location": "Pasig, Philippines",
		"DateofReview": "October 5, 2016",
		"ReviewTitle": "Stinky but Lovely and Educational",
		"Review": "This place is worth visiting. You'll be amazed to learn more on how the bat lives. The tour guides are also very friendly ready to accommodate your questions. The place stinks but that would be pretty obvious considering the number of bats that live there."
	},
	{
		"User": "77Raine27",
		"Location": "Manila, Philippines",
		"DateofReview": "September 19, 2016",
		"ReviewTitle": "Appreciate the Bat Life Cycle",
		"Review": "Very impressive to see people taking care of the bat species. See bat habitats up close. The place, of course, has a pungent smell due to the nitrogen from the guano droppings -- but who cares? Nice to see"
	},
	{
		"User": "marco v",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "September 8, 2016",
		"ReviewTitle": "Boring",
		"Review": "Had an inland tour of Samal. Went to MONTFORT SANCTUARY aka bat caves. The tour guide mentioned that they have biggest number of bats of the same species according to Guiness Book of world record. Nothing extraordinary. Find the place boring. Just saw the bats...More"
	},
	{
		"User": "Luzonita",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "August 4, 2016",
		"ReviewTitle": "Bats",
		"Review": "Cool to see more then 2.5 million bats. It is a nice place to visit tour guide is kind and really gives a lot of information.You can see them via big holes in the ground."
	},
	{
		"User": "Chortuguese",
		"Location": " ",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "In to the Batcave!",
		"Review": "Your Samal Island visit would not be complete without visiting the Montfort Bat Sanctuary. It's a holder of a Guinness World Record! + points > 2.5 million fruit bats > very witty and knowledgeable tour guide (forgot her name, but she is very witty and...More"
	},
	{
		"User": "Jona A",
		"Location": " ",
		"DateofReview": "July 10, 2016",
		"ReviewTitle": "2.5 Million bats - overwhelming but is a sight to behold",
		"Review": "Very knowleadgeable guide. It was a unique experience that I recommend eveyone to see. This is about 20mins away from the port. Hire a tricycle and haggle."
	},
	{
		"User": "Cecilia J",
		"Location": " ",
		"DateofReview": "June 26, 2016",
		"ReviewTitle": "Wow. Great place ",
		"Review": "Came here as I wanted to see how bats live and boy did I see. There are literally thousands of bats. It's really cool to see the caves and see the bats hanging there. The only thing some people won't lime is the smell. It's...More"
	},
	{
		"User": "Pietro B",
		"Location": " ",
		"DateofReview": "June 1, 2016",
		"ReviewTitle": "Plenty o' bats",
		"Review": "A very witty and knowledgeable guide made this trip memorable. She shared a lot of information about how these bats survive and their contribution to the eco-system. We also saw two very large lizards while observing the bats from afar."
	},
	{
		"User": "Chelsea S",
		"Location": " ",
		"DateofReview": "May 22, 2016",
		"ReviewTitle": "Bats galore...",
		"Review": "Fun trip to see the bats. Doesn't take much time and is very cool. There are several close areas where you can see them in broad daylight, many which are flitting around their area. I would had enjoyed seeing them take flight in the evening....More"
	},
	{
		"User": "vaneza_gonsalves",
		"Location": " ",
		"DateofReview": "May 15, 2016",
		"ReviewTitle": "Fascinating flying mammals protected in a well managed conservation site",
		"Review": "Despite the fact that we had gone to see the bats in this sanctuary many times before with family and friends, this was the first time we went for the night viewing. At 100 pesos each it was cheap. The guide was an enthusiastic lady...More"
	},
	{
		"User": "charmed497",
		"Location": " ",
		"DateofReview": "May 8, 2016",
		"ReviewTitle": "A must do",
		"Review": "Definitely worth seeing, well preserved Guinness world record holding destination. Doesn't smell as bad as I thought, need about half an hour to see everything. Very friendly people, the sunset tour would be awesome we only went during the day. If you're going to Samal...More"
	},
	{
		"User": "manila",
		"Location": " ",
		"DateofReview": "May 5, 2016",
		"ReviewTitle": "Incredible natural bat habitat",
		"Review": "Could not believe the enormity of the bat caves. If you are on Samal Island or near Davao, please make the trip to Monfort Bat Sanctuary. Very informed guides will educate you on the populations within the cave. When you go there, take in everything...More"
	},
	{
		"User": "April F",
		"Location": " ",
		"DateofReview": "March 23, 2016",
		"ReviewTitle": "I'm not sure though...",
		"Review": "We went there with my family as part of our tour c/o Paradise Island Beach Resort. The tour guide wasn't very informative at all, maybe because for a family of three, she thinks we wouldn't mind knowing nothing about it at all. We were the...More"
	},
	{
		"User": "Mariel G",
		"Location": " ",
		"DateofReview": "March 15, 2016",
		"ReviewTitle": "The only bat sanctuary in the Philippines",
		"Review": "This is our first stop in our itinerary in Davao. We rode the habal-habal to reach this place. The habal habal drivers already have their itinerary for us when we talked to them. This is their usual stop when taking their tour."
	},
	{
		"User": "Joy B",
		"Location": " ",
		"DateofReview": "March 7, 2016",
		"ReviewTitle": "Great side trip",
		"Review": "If you are staying in Samal and would like to have a jam packed day, try to include Monfort. They say its best to go there around 5Pm so you can see them fly. It was a very educational experience and you get to help...More"
	},
	{
		"User": "FrogBandit",
		"Location": " ",
		"DateofReview": "March 3, 2016",
		"ReviewTitle": "Also natural and amazing",
		"Review": "Seeing all those millions of fruits bats on their caves are amazing. They are so cute and harmless. But you have to consider their smell."
	},
	{
		"User": "Angela M",
		"Location": " ",
		"DateofReview": "March 2, 2016",
		"ReviewTitle": "Amazing number of bats",
		"Review": "Incredible number of bats in various cave openings. Extremely friendly and knowledgeable staff. You can't enter the caves due to the fumes and snakes but well worth the visit. A nice short down to the beach also."
	},
	{
		"User": "Justin S",
		"Location": " ",
		"DateofReview": "February 29, 2016",
		"ReviewTitle": "Love those bats! ❤😍",
		"Review": "Its nice to know that there are still people preserving the natural habitat of those bats.. and taking care of them..Our tour guide, I forgot her name, she is so witty, she really informed us about bats, and she is really nice.."
	},
	{
		"User": "vir n",
		"Location": " ",
		"DateofReview": "February 13, 2016",
		"ReviewTitle": "for the nature lover, this is a must",
		"Review": "I went while the bats were roosting and at sundown when the bat tornado was on the move. I found the bats very cute and charming. But the stench of ammonia is quite overpowering (though normal of a bat cave). With over 1.5 million fruit...More"
	},
	{
		"User": "Jake2014jake",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 4, 2016",
		"ReviewTitle": "An amazing attraction which is a Guinness World Record holder!",
		"Review": "Transportation in the island is through tricycles (motorcycle with sidecar) which is a tad expensive, or astride a motorcycle behind the driver, which is cheaper. There is an entrance fee of 100 pesos which goes to the maintenance of the place so don't be a...More"
	},
	{
		"User": "Peter19502013",
		"Location": "Davao",
		"DateofReview": "January 7, 2016",
		"ReviewTitle": "Interesting , fun and educational",
		"Review": "We have been twice. Last time there was an English speaking guide there which made it much more interesting ( of course) \r You do not enter the cave but watch thru big holes into the cave. \r You come quite close and can see the faces of the 2.7 million bats! There is nursery for baby bats and special area for old bats etc. At 6 PM o clock most of them leave for food and come back six hours later. To see them depart is very special site indeed.\r It is about 10 min from ferry boat and the road is good. "
	},
	{
		"User": "Morris Adelon A",
		"Location": "Davao",
		"DateofReview": "December 12, 2015",
		"ReviewTitle": "One of Samals Interesting Places ",
		"Review": "May do a quick visit when touring samal, learn something about the bats, see how numerous they are but be prepared for a short walk on uneven ground and some smelly experience"
	},
	{
		"User": "MarieMarc2014",
		"Location": "Los Angeles",
		"DateofReview": "December 8, 2015",
		"ReviewTitle": "Interesting Place to Vist, S Many Bats!",
		"Review": "This was part of a day tour I did out of the Hof Gorei resort. Very interesting place to visit and so many bats moving around within the caves. From what I have read you can actually arrange a visit at dusk to watch them fly out of the caves."
	},
	{
		"User": "Elmo B",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "December 2, 2015",
		"ReviewTitle": "Appreciation of Fruit Bats",
		"Review": "Fruit bats in davao is the main contributor of pollination of durian. Since Durian flower has specific time when it blooms it matches when the time the bat flies from the cave. You would not believe how they are being counted because they are too many. The tour guide explained everything in detail and makes us more interested about how the bats contributes to fruits and why fruits in davao are delicious."
	},
	{
		"User": "Mari B",
		"Location": " ",
		"DateofReview": "November 23, 2015",
		"ReviewTitle": "Bar Caves",
		"Review": "Trully a big colony of bats particularly fruit bat specie only. Learn more about bat habitat and its characteristics. See why Guinnes put this at its record."
	},
	{
		"User": "jed1017",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "November 23, 2015",
		"ReviewTitle": "World Record Place",
		"Review": "The bats gave me goose bumps as well as their smell. 😄 I just hope we visit a bit late in the afternoon to see the million of them going out of their cave.."
	},
	{
		"User": "motorbikerzss",
		"Location": "Manila, Philippines",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "Render Motorbike From Pearl Farm Resort To The Bat Caves",
		"Review": "Checked in at Pear Farm Resort down south of Samal Island, outside the gate are motorbikes waiting for tourists. For 2 hours one can visit the Monfort Bat Sanctuary at up North and some enough time to Hagimit Falls for 300 Pesos per head. \r Driver is provided negotiating through rough up and down terrain, passing through town and up to the mountains. From Pearl Farm is about 50 minutes. (If I drove that bike perhaps I would have run it in lesser time. it seems that they run is at a pace for some reason)\r \r Now The BAT Cave\r The Bat Caves are divided to 4 chambers group into several social divisions\r 1. Lovers Chamber\r This is where the mating happens. The male ones have swollen penises and copulating with the females in what it seemed a Dracula's embrace. Other males are flying around showing off their skills to attract females.\r \r 2. Training Chamber\r This is where the young ones are grouped. You will notice that most bats are small sizes and it seemed they are taught by a few bigger ones how to glide/fly.\r \r 3. Old Age chamber. \r This chamber holds the quiet ones, Very little movement and flying around.\r \r 4. Exit chamber\r This is the far end of the cave for entrance and exit. \r During dusk, a nice display choreographed flight are displayed by the bats. \r \r No food sold here. Bring water and umbrella. A 50 minute ride can burn you in the sun so protect yourself. \r \r A must attraction when you visit Samal Island. A few bat caves are in Palawan and other mountainous regions but nothing close to this. 2.5 Million bats and counting.\r They fly to Davao peninsula to the mountains feeding on fruits and insects during the night. They comeback the almost the dawn of the next day. A spectacular sight."
	},
	{
		"User": "Michael S",
		"Location": "Philippines",
		"DateofReview": "October 22, 2015",
		"ReviewTitle": "Ok, next stop please!",
		"Review": "For the cause of helping conserve this fruit bat cave sanctuary, an ocular of the millions of fruit bats, and the guano they excrete, it's worth the visit. Not for the squeamish. The stench sticks to the skin!"
	},
	{
		"User": "robmaghinang",
		"Location": " ",
		"DateofReview": "September 30, 2015",
		"ReviewTitle": "back to the batcave",
		"Review": "if like bats come here, espcially at dusk, when they come out, there are 5 cave entrances loaded with fruit bats"
	},
	{
		"User": "Ramon F",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "September 11, 2015",
		"ReviewTitle": "Lair of the bats - minus batman",
		"Review": "There are four cave openings connected to each other where up 2.5 million fruit bats lives and they tend to stay in some opening depending on their age and their hierarchy. The guide was very friendly and knowledgeable. However, there are only a few and...More"
	},
	{
		"User": "Stuart H",
		"Location": " ",
		"DateofReview": "September 5, 2015",
		"ReviewTitle": "Guide is great, amazing show during the night",
		"Review": "The fee is 100 for adults, 40 for children, you can come from 8a to 7p, but better take the 6p schedule, guide will take you to the cave, share with you about the history of it, and the bats activity, 6:30p youll see them...More"
	},
	{
		"User": "Vanessa G",
		"Location": " ",
		"DateofReview": "September 4, 2015",
		"ReviewTitle": "Bat cave visit",
		"Review": "A must to see, you get very close to the bats and view them looking into a series of open top caves. This was far better than I imagined."
	},
	{
		"User": "Jane A",
		"Location": "Manila, Philippines",
		"DateofReview": "September 2, 2015",
		"ReviewTitle": "Lots of Bats",
		"Review": "lots of bats and OK to experience one and wouldn't go back again. Bat poops is really smelly just FYI"
	},
	{
		"User": "Lablitaa",
		"Location": " ",
		"DateofReview": "August 31, 2015",
		"ReviewTitle": "2.5 Million Bats to see!",
		"Review": "It was an amazing experience to see all the 2.5 million Rousette bats at Monfort. The Sanctuary was recorded by Guinness Book of World Records 2010 as the largest single colony of this kind. Visitors can get an up close look at the Rousette Fruit...More"
	},
	{
		"User": "SimonDabbs",
		"Location": "Philippines",
		"DateofReview": "August 30, 2015",
		"ReviewTitle": "Interesting",
		"Review": "Traveled to Samal Island by ferry and took us 10 minutes. We rode by tricycle and the price range depends on how many places you would visit. We traveled almost 20 minutes to reach the place. 100php for entrance and there was a tour guide...More"
	},
	{
		"User": "tocksteinjohn",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "August 20, 2015",
		"ReviewTitle": "Be amazed by seeing more bats than you possibly imagine!",
		"Review": "We arrived just as it was getting dusk. We received a warm, enthusiastic welcome and were guided up the footpaths that lead to the fenced, chimney-like entrances to the caves, home to the bat colonies. We were not disappointed; once it got fairly dark, the...More"
	},
	{
		"User": "Audreeadjel",
		"Location": "Charly-Sur-Marne, France",
		"DateofReview": "August 9, 2015",
		"ReviewTitle": "Nice place to see in samal",
		"Review": "Im with my Family and we discover it together ,its nice place how all the bats are all together,it smells bad coz of their waste but it was amazing.only need to update the price coz in the internet the entrance was 25 pesos but when...More"
	},
	{
		"User": "John W",
		"Location": " ",
		"DateofReview": "August 5, 2015",
		"ReviewTitle": "Bat Cave",
		"Review": "Entrance is Php 100. Ate at the cashier guided as way to the cave, shes very hospitable, she explain everything about bats basically. \r \r Tips: there are many mosquito literally so buy some mosquito repellent before going here\r \r Be ready for foul smell of the poops of the bats \r \r The noise of the bat is okay "
	},
	{
		"User": "Vsevolod L",
		"Location": " ",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "Fascinating!",
		"Review": "The Monfort Bat Sanctuary is a very different kind of attraction. Visitors don't go inside the actual cave, as it would be too dangerous due to snakes and toxic gasses from the bats (!) but view the groups of bats from four different openings. \r \r The sheer number of bats is overwhelming, even though visitors only see a small portion. The sounds they make and their unique walking movement are interesting enough in themselves. \r \r The helpful guide told us that bats segregate their society into different groups. There is a mixed group, a maternity group (yes, really), a teenager group and an adult male group. They all behave differently. Beware - the adult male group stinks!\r \r This is all in a pleasant location with good views. Do take water though, as there isn't an aircon room in sight. Well worth a trip."
	},
	{
		"User": "Ferry A",
		"Location": " ",
		"DateofReview": "July 27, 2015",
		"ReviewTitle": "If you like bats",
		"Review": "The most expensive thing I went to in the Philippines, but I thought it was kind of worth it. Even though you don't do the cool stuff you expect, no walking in the cave or anything, I liked it. Observing thousands of bats was pretty cool."
	},
	{
		"User": "Dragon51",
		"Location": "San Mateo, Rizal, Philippines",
		"DateofReview": "June 30, 2015",
		"ReviewTitle": "Monfort Bat Cave is a wonderful creation!",
		"Review": "Fruit bats should be preserved since less bats less durian since durian pollinate at night.So thrilled to see millions of bats in different caves!"
	},
	{
		"User": "Glentoy",
		"Location": "Jersey, British Isles",
		"DateofReview": "June 30, 2015",
		"ReviewTitle": "Millions of Bats",
		"Review": "You can get up close to millions of bats. Fascinating and recommended. We did this as a tour from the hotel and they supplied a helpful 'guide' to stay with us during the duration. I was surprised they allowed flashlight photography as I thought this would disturb them, but I suppose they are meant to be near-blind ! "
	},
	{
		"User": "ANNann00",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 23, 2015",
		"ReviewTitle": "Bats overload!",
		"Review": "Samal is not just about white sand beaches. It is also home to millions of Geoffroy's rousette fruit bats. Monfort Bat Sanctuary is about less than an hour away from Davao City proper. When you visit the place you might want to go down the beach area. The view from the beachfront is spectacular. "
	},
	{
		"User": "Zendel1234",
		"Location": "Philippines",
		"DateofReview": "June 21, 2015",
		"ReviewTitle": "Ba-ba-ba-bats!",
		"Review": "Batman can be filmed here! I think they hold the Guinness record for having the largest number of bats in the world. I've also learned that bat poop is really expensive but they don't harvest it anymore since the bats will be disturbed. Some people might shrug off this place just because, but then, where else can you see bats so many as these? Also, the vanishing island can be seen from here."
	},
	{
		"User": "505chad",
		"Location": "Manila, Philippines",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "Educational",
		"Review": "it is a must see in Samal especially if you have school kids with you. You will have a clear understanding of life & nature. Congratulations to the founder, Mrs. Monfort a.k.a Bat Mama, you are amazing."
	},
	{
		"User": "Doug H",
		"Location": " ",
		"DateofReview": "May 5, 2015",
		"ReviewTitle": "sundown",
		"Review": "try to visit before sundown..you will see when they go out from the cave before finding some foods. they do echo location which is very amazing to observe. also try to spot the big snake they say which they found 10ft few years ago."
	},
	{
		"User": "ingmar b",
		"Location": " ",
		"DateofReview": "May 1, 2015",
		"ReviewTitle": "Amazing!",
		"Review": "If you find yourself on Samal Island, do yourself a favor and stop by the Monfort Bat Sanctuary. It can be a quick stop, but as far as I'm concerned, it's the coolest thing to see on Samal. I was amazed by the amount of bats here. Apparently, it's the largest colony of Rousette fruit bats in the world at 1.8 million. Definitely worth the trip."
	},
	{
		"User": "niquedejesus",
		"Location": " ",
		"DateofReview": "April 27, 2015",
		"ReviewTitle": "The most unique thing to do in samal",
		"Review": "I went here for a day tour and a night tour. I think the owner is a really good person since she could also make a resort from the primelocation. The staff is entertaining and its also free to go to the beach over there. i dont think that its expesnsive since this place has no funding so everything is paid by the enterance fee. And espescially the night tour is very wonderfull"
	},
	{
		"User": "Roseann G",
		"Location": " ",
		"DateofReview": "April 10, 2015",
		"ReviewTitle": "Magnificent sight to behold",
		"Review": "I have never seen anything like it. It was such a magnificent sight to behold! I can imagine Batman filming in these sink holes. It's truly breathtaking.\r \r Just like you I do not like going into bat caves, first of all it's dark, you can hardly see anything, it smells awfully awful and it can be scary. But this bat sanctuary is nothing like it. You do not have to brave a hole full of bats just to witness them up close, they are kept in large and deep sink holes where you can appreciate them while you're out in the open. You can still smell them yes, but you can always cover your nose and step away if you cannot take it anymore. There was a nice girl tour guide who showed us the sink holes, and patiently explained the details.\r \r Monfort Sanctuary also holds night tours when bats go out of their caves to eat fruits. Advance booking is required to join this tour. And according to the tour guide, the night tour guests are required to bring and use umbrellas because bats might poop on them.\r \r Entrance fee: Php 100 per head"
	},
	{
		"User": "katsparrow",
		"Location": " ",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Interesting but a bit expensive for the experience ",
		"Review": "Yes, it is interesting how you can see millions of bats inside the cave or sink holes, but for a short tour costing 100 per person, i think its too much. Just be careful on touching the railings around the sink holes or you may just have a touch of the bat poop. As for our visit, we did not gave our tour guide tip because we thought entrance was too much. "
	},
	{
		"User": "joy t",
		"Location": " ",
		"DateofReview": "March 17, 2015",
		"ReviewTitle": "Surprisingly Interesting",
		"Review": "We did not really expect to be drawn in by a bat sanctuary of all places. Our tour guide, Anna, was very informed and enthusiastic. She made the bats sound so fascinating that we came back for a moonrise viewing. At twilight, the bats rise out of the caves in a tornado fomation before heading out. It's amazing to see up close, and if you are spending the night at Samal island I highly recommend it."
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "March 2, 2015",
		"ReviewTitle": "awesome experience",
		"Review": "one girl gave us a tour . there are 4 openings and millions of bats live in those caves... you will learn a lot from this mammals and if your lucky you can also see snakes down the cave from the opening. \r you only have to pay 100. very near from paradise island. you can take habal-habal.."
	},
	{
		"User": "Chrnzke",
		"Location": " ",
		"DateofReview": "January 12, 2015",
		"ReviewTitle": "I'm proud it's here in PH",
		"Review": "The Monfort Bat Cave Sanctuary is a private property owned by Monfort Family. \r \r The entrance fee increased from 40Php to 100Php as they want to develop the place for tourist attraction purposes. \r \r 100Php is too much for viewing it but if you want to see it for yourself go waste 100Php. Anyway, it is the largest bat colony in the world and it's in Guinness Book of World's Record. \r \r You will see several tarpaulins with a lot of information about bats. This is a good place for those who wants to know more about bats and understanding them. \r \r Their guides are informative too. Some of their spiels are also the same on what you mostly see on the tarps. \r \r The locals say that it is best to go there at night because the bats will swarm all over the place and you will see the 2 Billion record they are claiming. The rest of the bats stay in the caves. \r \r Camera flash is discouraged. "
	},
	{
		"User": "avid_traveller_sg86",
		"Location": " ",
		"DateofReview": "December 2, 2014",
		"ReviewTitle": "Not so much",
		"Review": "What you see on the pictures in the internet is the same as what you'll see when you get there. Nothing more. Entrance is P100."
	},
	{
		"User": "TravelBug1469",
		"Location": "Singapore, Singapore",
		"DateofReview": "November 13, 2014",
		"ReviewTitle": "Lots of bats, nothing more",
		"Review": "Pay to enter parking lot, pay again to enter and see the overrated, small, smelly underground caves with lots of bats. Facilities are aweful. Too pricy. Place is meh.. Basically overrated. Not recommended."
	},
	{
		"User": "Veloce298",
		"Location": "Manila, Philippines",
		"DateofReview": "September 22, 2014",
		"ReviewTitle": "Guinness-Breaking Bats",
		"Review": "The bats that inhabit the caves in Monfort Conservation Park was said to have numbered to millions breaking the Guinness World Records. The bat sanctuary is a privately-owned property with natural caves conducive for survival and shelter of bats. Here they formed colonies of more than million individuals There are openings on top of the caves where visitors can watch how the bats are doing down under. \r Bats are nocturnal mammals capable of sustained flight, so that they sleep during day time and go out as hordes during night time in search of food. While about 70% of bats consume insects for survival, bats here were said to be fruit-eating bats going as far as the mainland of Mindanao before returning back to Monfort at dawn. Boring as it may seem, you can see those bats hanging upside down - one on top of another - making a thick wall of bats that darken the cave at day time. It was said that the best time to watch them is during early evening when bats start to move inside the cave and out to fly. While day tour at Monfort ends at 5 PM, interested guests may make arrangement with Monfort staff for a nigh visit."
	},
	{
		"User": "igmegalingan",
		"Location": "Makati, Philippines",
		"DateofReview": "September 21, 2014",
		"ReviewTitle": "Definitely go in the evening to see the bats flying",
		"Review": "We got there at 4.30 which was good as we saw the caves in the light then stayed until it got dark at 6pm.\r \r Once it gets dark the bats take off swirling around in a mass throng of movement and noise. The set up at the sanctuary is good with the cave entry holes fenced off and secured and they gave us torches to see into the cave as well as help our footing. \r \r We got the timing correct but if you are planning to be there late then call or SMS otherwise they close up at 5pm and go home. The daytime charge of php 100 goes up to php 200 for the night visit, but we thought it was well worth it. \r \r Guides, anna and Jodie, were friendly and enthusiastic and definitely wanted to show us the centre.\r \r All I all a good place to visit"
	},
	{
		"User": "hopper28",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 13, 2014",
		"ReviewTitle": "For close up pics either bring a long lens or Google",
		"Review": "If you have binoculars or a DSLR with a long lens you will get the optimum benefit of this place. You will need proper tools to see what those bats really look like and be able to take some worthwhile pictures of them home.\r \r For safety reason tourists can only look around the various openings around the cave and at the safety of daylight. The bats numbering in the millions according to estimates can easily overwhelm you should they wish it. The guide said there are night tours too. I wonder how that goes.\r \r But without said tools seeing all those bats together is still quite something. Just open your nose."
	},
	{
		"User": "nike0608",
		"Location": "Cagayan de Oro, Cagayan de Oro, Philippines",
		"DateofReview": "September 3, 2014",
		"ReviewTitle": "amazing",
		"Review": "i am totally appalled and amazed at what i saw.. the caves are so full of bats that they seem to sleep with the sun because the inner parts of the cave are already occupied. its a must-see creation"
	},
	{
		"User": "michaelnotmike",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "August 23, 2014",
		"ReviewTitle": "Educational",
		"Review": "Our tour guide is very knowledgeable given her experience. I did not know that the bat colony living in the cave has different rooms. Like, older bats stay in the darkest part of the cave whilst younger ones are staying near the entrance. The place smells of bat poop but I did not mind it. Simply breathtaking to be up close with bats in their natural habitat. "
	},
	{
		"User": "Richard C",
		"Location": " ",
		"DateofReview": "August 22, 2014",
		"ReviewTitle": "Bats, bats and more bats!",
		"Review": "The tour guides are very engaging. They can make the short tour very fun and engaging. Try to get a night tour. That is what I plan to do next time."
	},
	{
		"User": "Pinoy-Local-Tourist",
		"Location": " ",
		"DateofReview": "June 17, 2014",
		"ReviewTitle": "Bats all you want",
		"Review": "A great place to go to. lots of bats to see and caves. There is a distinct smell which is normal for bat caves. You won\"t need to enter the cave, you can see it from the top. The lady said around 5pm is a good time to see them fly out of the cave, surely a good experience. Bring some \"off lotion\" to keep the mosquitos off. Shorts, slippers and tshirt is enough to go here. Tour guide was very friendly and knowlegeable."
	},
	{
		"User": "Babis221",
		"Location": "Taguig City, Philippines",
		"DateofReview": "June 17, 2014",
		"ReviewTitle": "Entrance fee a rip-off",
		"Review": "I've been visiting this cave when it was still free, but it appears that its National Geographic exposure has instilled a opportunistic mindset on its owners/operators. The Php 150 entrance fee on top of the Php 5 environmental fee the city charges leaves a bad taste in the mouth. The guide told us that the fee used to be Php 40, so we can expect the fee to further escalate."
	},
	{
		"User": "Reyosabajr",
		"Location": "Manila, Philippines",
		"DateofReview": "May 28, 2014",
		"ReviewTitle": "Bats and more bats",
		"Review": "Samal island is about 20 minutes by boat from davao city; a short walk to the Monfort bat sanctuary then there is a 5 minute briefing by the helpful staff (with funny anecdotes from Ana, our designated guide for this visit) then a short walk...More"
	},
	{
		"User": "DON9260",
		"Location": "Paranaque, Philippines",
		"DateofReview": "April 7, 2014",
		"ReviewTitle": "Picturesque!",
		"Review": "It was a perfectly preserved bat colony....educational too. Our guide Anne....was so informative and helpful...and accommodating."
	},
	{
		"User": "summer q",
		"Location": "General Santos, Philippines",
		"DateofReview": "March 15, 2014",
		"ReviewTitle": "Samal trip",
		"Review": "the place is not that beautiful and attractive but the bats are amazing... one of a kind and a place that you must visit when you go to samal island"
	},
	{
		"User": "rfoz11",
		"Location": "Manila, Philippines",
		"DateofReview": "March 15, 2014",
		"ReviewTitle": "Worth a visit!",
		"Review": "i liked it because it's a world record and the staff are very accommodating.it's not too far from the center.just rent a motorcycle and you can reach the place.vanishing island can be seen from there."
	},
	{
		"User": "Kimberley_Chong",
		"Location": "Blacksburg, Virginia",
		"DateofReview": "March 6, 2014",
		"ReviewTitle": "Learned a lot about bats!",
		"Review": "We didn't know about this sanctuary until our island tour; we learned a lot about bats and their role in propagating that most sought-after but much too smelly fruit called Durian. Our guide was very knowledgeable and we were suitably impressed by the thousands of...More"
	},
	{
		"User": "Gerard N",
		"Location": "Kuala Lumpur, Malaysia",
		"DateofReview": "January 31, 2014",
		"ReviewTitle": "Rare experience with nature",
		"Review": "Helpful guide will tell you more about the Largest Fruit Bat Colony in the World upon entering. The entrance fee is 100P. The sink holes are amazingly unique and you can see the bats from up close. Try to head there before 4pm as the...More"
	},
	{
		"User": "belgianguy1",
		"Location": "Manila",
		"DateofReview": "November 25, 2013",
		"ReviewTitle": "1 bat. 2 bats. lots of bats!",
		"Review": "Great experience, it was my first time seeing bats but I didn't know that it was that many.. millions of them! Amazing! The guide was really good, Maria (around 9-10 year old girl) and we enjoyed talking to her. But I suggest not to wear...More"
	},
	{
		"User": "markis1md",
		"Location": "belgium",
		"DateofReview": "November 24, 2013",
		"ReviewTitle": "Something different",
		"Review": "Cool site! Never seen so many bats in one place You can get real close and observe them But the smell is overwhelming And a lot of mosquitoes too (don't the bats eat bugs?) Definitely worth the detour, something different!"
	},
	{
		"User": "Runel Zeth R",
		"Location": "epsom",
		"DateofReview": "November 12, 2013",
		"ReviewTitle": "Nature at its best",
		"Review": "Amazing, Awesome, this is nature at its best. I can not understand why many reviewers voiced that the time spent was short and the price they paid, guys ! this is nature.... if you want neon lights, candy stands and razzmatazz go to a theme...More"
	},
	{
		"User": "My26",
		"Location": " ",
		"DateofReview": "October 23, 2013",
		"ReviewTitle": "A lot of Bats!!",
		"Review": "There are really a lot of bats in this place, the best time to visit is when the sunset is near, or a night tour of the place, bring mosquito repellents for the mosquitoes!"
	},
	{
		"User": "Shei928",
		"Location": " ",
		"DateofReview": "September 14, 2013",
		"ReviewTitle": "Nice night tour",
		"Review": "I have been several times at the batcave. Last time we took the night tour. The night tour is 200/person with a minimum of 5 persons. If you are less then 5 then you have to pay for 5. The reason is that they dont have daily sunset tours. They will organize it for you with a tourguide. They will prepare flashlights and umbrellas in case of rain. The nice thing on sunset tour is that all bats leave their cave at sunset. They make formations above the cave. This show takes hours. Nice experience that everybody should try."
	},
	{
		"User": "Dean C",
		"Location": " ",
		"DateofReview": "September 11, 2013",
		"ReviewTitle": "Amazing experience!",
		"Review": "Entrance is for 100pax each. This trip was unplanned but it's great to see places that was featured in National Geographic and Guiness Book of Records."
	},
	{
		"User": "SusieSD",
		"Location": " ",
		"DateofReview": "September 10, 2013",
		"ReviewTitle": "2,5000 bats of Monfort Bat Sanctuary, Samal Island",
		"Review": "The bat cave was located on the other side of the island and it took us 30 minutes ride to get there. It was a good finale for the tour. The place was called Monfort Bat Sanctuary and it was listed in the Guinness world records as the largest colony of Geoffroys Roussette Fruit bats estimated at around 2,500,000,00 with two albino bats. Again we had to pay P100/head entrance fee but to me it was worth it.\r \r The bat sanctuary is home to the largest colony of fruit eating bats in the country. Going near the caves was already a challenge because of the strong smell of bat poop. There were five caves in that area and we enjoyed watching the bats fly and interact with each other. They looked like small rats with sharp teeth and wings.\r For more photos and videos of the MOnfort Bat Cave, Please visit: http://watwatworld.com/2013/09/10/discover-island-garden-city-of-samal-a-travel-guide-and-adventure/"
	},
	{
		"User": "Tiny M",
		"Location": " ",
		"DateofReview": "September 5, 2013",
		"ReviewTitle": "Interesting .. But once is enough!",
		"Review": "It was interesting to see so many bats in their natural habitat .. But that's about it! \r Since you've travelled so far, might as well see something unusual. But nothing much more to see or do. Wish they'd add more attractions to the site. The guides could use better training to engage the audience as well."
	},
	{
		"User": "DrVjWalden",
		"Location": " ",
		"DateofReview": "September 3, 2013",
		"ReviewTitle": "Bat Cave!",
		"Review": "Visitors to Davao should visit Samal Island for its beaches, and the bat caves! Over 2.8 million bats live in these caves and you can get up close to the mouths of the caves! \r \r I have taken pictures of the bats in Subic, and have seen the bats in Palawan. But these in Samal were just too many! Huge population enough to win a recognition from the Guiness Book of World Revords!\r \r The ferry ride was good. The roads were not the best. But the guide was funny, accommodating, and knowledgeable!\r \r I enjoyed the visit."
	},
	{
		"User": "MissKellyG",
		"Location": " ",
		"DateofReview": "July 8, 2013",
		"ReviewTitle": "Just like the movies!",
		"Review": "I have never seen anything like this place... MILLIONS of bats. Worth travelling to the Philippines just to see this amazing sight. RECOMMENDED!"
	},
	{
		"User": "DexterA",
		"Location": " ",
		"DateofReview": "June 15, 2013",
		"ReviewTitle": "Interesting",
		"Review": "The Monfort Bat Sanctuary was said to hold the Guinness World Record for the biggest bat colony. The cave holes show blackened walls from guano (bat droppings) and so much bats fighting for space to hold on to. \r \r The guide was friendly and funny. She explained to us the different kinds of bats inside the caves (younger to older). \r \r The only thing I disliked about the place was the smell of the bat caves especially when the wind blows towards you. But overall, it was an interesting trip."
	},
	{
		"User": "6452",
		"Location": " ",
		"DateofReview": "March 28, 2013",
		"ReviewTitle": "1 Million Bats",
		"Review": "nice area to learn about bats. Volunteer guides are available. wear shoes...a lot of ants crawling. Prepare to bring money because of the entrance fee. Your SLR will come in handy in this place."
	},
	{
		"User": "Glentoy",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 21, 2013",
		"ReviewTitle": "Interesting but there is really not much to do",
		"Review": "The place is accessible by public transport so that was really good. Guides and staff were friendly but there is really not much to see here aside from the millions of bats. We left the place in less than 30 minutes"
	},
	{
		"User": "Storyseamstress",
		"Location": "Philippines",
		"DateofReview": "March 11, 2013",
		"ReviewTitle": "Awesome sight",
		"Review": "Okay, it's true, you can smell the guano from the foot of the hill, but if you are deeply passionate about nature, you simply cannot miss this sight -- more than a million bats easily viewable from three unique cave openings. Bring a camera that can capture motion well and you might just photograph a bat in flight. Their cries, like shrill birdcalls, are otherworldy when standing mere meters away from them. Probably not an ideal attraction for just anyone, but for the right kind of person it is an exhilirating experience for all senses."
	},
	{
		"User": "arwen_31",
		"Location": "Vanderhoof, Canada",
		"DateofReview": "February 19, 2013",
		"ReviewTitle": "the way to visit Monfort colony",
		"Review": "I remember passing here in Samal to visit Monfort bat Colony- a place with 2.3 million fruit bats making them land in Guiness Book of World records"
	},
	{
		"User": "Andy B",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "January 19, 2013",
		"ReviewTitle": "15 minutes is enough",
		"Review": "aside from being a guiness world record holder, going on this place would only be worth if youre really interested in seeing a million bats or if you plan on studying them but other than that 15 minutes of touring the area would be enough. very nice and friendly guides. "
	},
	{
		"User": "EMIE M",
		"Location": "Cebu City, Philippines",
		"DateofReview": "December 7, 2012",
		"ReviewTitle": "very pretty",
		"Review": "everything sounds prefect for me,people very friends,helpful and the area is clean and iar fresh,Infinity pool very nice room is okay"
	},
	{
		"User": "wrkshy",
		"Location": "Manila, Philippines",
		"DateofReview": "December 2, 2012",
		"ReviewTitle": "Worth the Visit!",
		"Review": "Monfort Bat Sanctuary has 5 caves. Recently included in the Guinness Book of World Records as having the most fruit bats, around 2.5 million!\r Very interesting to watch the dog guarding the first bat cave. According to the guide, he stays there the whole day and eat bats 3x a day! I find it weird because he's so near the cave that the noise is deafening and it's stinky (tons of guano!)\r The first cave houses the young bats, the 2nd, the maternity cave, the 3rd & 4th cave, adult bats and the last cave, the senior bats (you'll know it's the last cave because it's the \"quietest\" cave).\r Go ahead and visit this place. It's worth the trip. If you're prone to mosquito bites, please put some OFF lotion.\r \r Entrance fee is at PHP100 per head. Tour guides are friendly and knowledgeable."
	},
	{
		"User": "anne_rainne",
		"Location": "Taguig City, Philippines",
		"DateofReview": "August 21, 2012",
		"ReviewTitle": "it smells =D",
		"Review": "I'm not very fond of animals so it was that so exciting for me. It smelled so filthy in the sanctuary which is of course normal given the numbers of bats there is."
	},
	{
		"User": "Pieter-Jan V",
		"Location": "Samal, Davao, Philippines",
		"DateofReview": "August 10, 2012",
		"ReviewTitle": "Nice to see",
		"Review": "Nice to see the worlds biggest nr of fruitbats in 1 cave. They have the world guinness book record. What i didnt like is the high entrance fee and after 10 mins you are done there. You cant stay longer then 10mins with these bats and the smell is horrible"
	},
	{
		"User": "Todd B",
		"Location": "Las Pinas City, Philippines",
		"DateofReview": "July 13, 2012",
		"ReviewTitle": "The REAL Bat Cave!",
		"Review": "The place is home to several million bats (if I read the sign correctly). We didn't get to go there at sunset, when the bats leave the caves for the evening, but there were still quite active flying around and making noise inside the cave. You are able to approach several entrances to the caves and find yourself within 10 to 12 feet of the bats. Quite and interesting experience but not something I would do again. If you've seen it once, that's enough."
	},
	{
		"User": "Joseph Thomas B",
		"Location": "Vienna, Austria",
		"DateofReview": "May 18, 2012",
		"ReviewTitle": "World record",
		"Review": "just be aware of dirts, make sure to carry umbrella or wear rain coat. the emergence night tour is just a nature you must not missed."
	},
	{
		"User": "rpacute",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 12, 2012",
		"ReviewTitle": "A wonder of nature",
		"Review": "I went here with my parents and family friends (all of the are senior citizens). Honestly, we have very little expectation of the place and complained about the relatively high entrance fee. But when we got in, the place was fascinating and well worth it. In fact, I would not mind paying a bit more if the money will go to the preservation of the place.\r \r The guide and the receptionist are very nice to us. They also honor senior citizen discounts.\r \r I would not mind returning and recommending this to friends. A must fee in Samal."
	},
	{
		"User": "Pierre C",
		"Location": "Cebu City, Philippines",
		"DateofReview": "April 26, 2012",
		"ReviewTitle": "If you never saw one",
		"Review": "I thought initially that we would go inside a cave but you are simply looking at the cave from few holes spread on top of an hill. Impressive though. Think about it. How have Guiness done to calculate that there was 1,800,000 bats into it in 2006 and more than 2,500,000 now? The local guides will take the time to answer all your questions and between others, to describe how bats are responsible of the huge number of duryan trees in the Davao area. I have been told that the best time to go there is at sunset when the bats are leaving to feed themselves. We have been there in the afternoon and if it is fun to see the bat walls, it is not dynamic a lot. There is a fee to visit the site but they found a way to add an entering fee when there is nothing else to do than to look at the bat cave. Can they not combine their fees on a single ticket?"
	},
	{
		"User": "Sui_Lai",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 14, 2012",
		"ReviewTitle": "Monfort Bat Sanctuary",
		"Review": "It was my first time to visit a bat sanctuary and not just an ordinary one. It was a beautifuly scenery (just don't smell too much, hehe). I was captivated by the place's history and the different kinds of bats. I liked it very much."
	},
	{
		"User": "irah_luiese",
		"Location": "davao city",
		"DateofReview": "February 29, 2012",
		"ReviewTitle": "Monfort Bat Sanctuary nice thing to discover",
		"Review": "The Monfort Bat Sanctuary\r \r I heard a lot of stories about Monfort Bat Sanctuary (Bat Cave for short)\r And have had read some news/reports about largest known colony of the species in the world (bat colony). The bats all live in a single cave – guests aren’t allowed to enter.but they can peer over bamboo railings into any of five openings where the seething masses of sleeping fruit bats can be seen coating the cave walls.\r \r At first I ddnt know that the biggest colony spices can be found here in Philippines thou I’m a Pilipina and I just known it recently (as I don’t go out often cuz of my nature)\r But I don’t want to miss my chance to see them ..soo when my Bf asked me for some tourist spot I recommend him this Bat Sanctuary. (I mean why not dba?)\r \r But when we got there (that’s was 4-5 months ago I guess?) I was amazed! They’re really to many. (I mean WOW).it confuse me..”how did those resident scientist notice or know their counts?\r \r Well anyway I did asked them..and our tour guide said that they have this machine that help them to counts all of em ;)\r \r Some of this Bats are pregnant\r So... if before they are 1.8M then expect it now to be more than that\r as female bats were almost continuously pregnant.\r \r And if you notice on the pics Its really kinda Dark inside\r \r I also found out that Male Bat's \"pee\" is more stinky than female Bat.. (peace guys)\r \r Alright that is my experience on this Nice Creature and would love to go back there again one day ;)"
	},
	{
		"User": "gogo_mariz",
		"Location": "Manila, Philippines",
		"DateofReview": "February 29, 2012",
		"ReviewTitle": "great for nature enthusiasts and tourists :)",
		"Review": "To go here from manila/ cebu, you will need to book a flight to Davao City. From Davao, you can go to Island Garden of Samal by riding on a barge (sasa wharf) around p10-15. When you're in Samal, there are motor bikes willing to drive you to the Monfort bat caves probably for p20-50? per person. You can also rent out a whole jeepney but that will cost you extra.\r \r The best time to go here is during sunset when all the bats fly out of the cave. I have to warn you--- the bats are noisy and the smell is nasty (sweet smelling urine???) but it's all part of the experience, if you ask me. The cave isn't cove-like. It's more like an underground cave. You'll know what I mean when you visit. \r \r My cousins and I went there around 6pm. It was dark already. The entrance fee costs extra for night viewing but it was worth it. The bat population was so thick, the walls of the caves were packed with bats. There were also plenty of bats going out of the cave.\r \r The same cave was features in the Local TV channel (ABSCBN's kuya kim show) and is recognized all over the world. \r \r If you go here with your own car or if you're the adventurous sort, do stop by their falls. I forgot the name. You can probably ask the locals about it. The falls have several pool pockets that have crystal clear waters. Entrance fee is probably around p20? It's 15-30 minutes from the bat cave. I'm not really sure, it's been a while. Don't hesitate to ask for directions. The locals are really friendly and helpful. :)\r \r happy trip!"
	},
	{
		"User": "himselfetc",
		"Location": "Belfast",
		"DateofReview": "February 10, 2012",
		"ReviewTitle": "Bats Bats Bats",
		"Review": "Go see the bat sanctuary. It's a wonder of the world."
	},
	{
		"User": "lily p",
		"Location": "Makati, Philippines",
		"DateofReview": "February 3, 2012",
		"ReviewTitle": "Guiness World Record holder",
		"Review": "The Montfort Bat Cave is a Guiness World Record holder of the largest colony of fruit eating bats in the world. \r When we went there, they were charging P100 per head as entrance fee. The girl from the gate told us that this is just temporary as they are collecting funds to further improve area."
	},
	{
		"User": "OWSI",
		"Location": "Luzon, Philippines",
		"DateofReview": "January 28, 2012",
		"ReviewTitle": "More fun in the Philippines",
		"Review": "Awesome display of nature, a must see in Davao and Samal."
	},
	{
		"User": "ccduckie",
		"Location": "Victoria, Canada",
		"DateofReview": "January 6, 2012",
		"ReviewTitle": "Bats are a must - see",
		"Review": "It was really neat to see the bats, and we walked down to the water and got a local fisherman to take us to the vanishing island while we were there!"
	},
	{
		"User": "japanagogo",
		"Location": "Hong Kong, China",
		"DateofReview": "January 1, 2012",
		"ReviewTitle": "Guano!",
		"Review": "I arrived at Monfort Bat Sanctuary on the back of a motorcycle, so the dirt road going in was a bit bumpy. But once we got past the road and into the venue, it turned out to be a pretty decent place. Approximately 1.8 million Geoffrey's Rousette Fruit Bats make their home here, and believe me, it's smelly! There are about 5 cave openings, providing for several different angles from which to take good pictures. They even had a few T-shirts available for sale! Stock was very limited though.\r Good for a 30 minute stay and a chance to see an abundance of sleeping bats (unless you go around 6-7pm, when the bats emerge from their cave...). Still smelly though."
	},
	{
		"User": "sunshine36NewDelhi",
		"Location": "Shanghai, China",
		"DateofReview": "October 31, 2011",
		"ReviewTitle": "Tons of bats:) ie 1.5 million",
		"Review": "Interesting to see so many bats in one place. Never saw anything like that before."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 4, 2011",
		"ReviewTitle": "Bats changed me",
		"Review": "When I was a small kid, I was so afraid of bats. Watching the film Dracula with his transformation to a bat lingers in my mind each time I see bat/s. But after visiting the Monfort Bat Cave and knowing how helpful they are in our environment and nature, especially in the pollination of durian flowers in Davao City, my mind has changed - my evil concept on bats changed.\r \r Try to visit this place and you will see the Guinness Record holder."
	}
]
