[
	{
		"User": "Nancy A",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Once is enough",
		"Review": "It was 33 years ago that I bravely climbed Mt Apo with my husband and best-friends......I did say once is enough because maybe I might not be fit to climb it again....I'll be turning 60 years old next year....BUT the experience is breath taking and when you reached the top, it's like heaven is near......I love the feeling even though I know I have fears in height......speechless, breathless and silence was felt when I was there.....go try it when you're still young.....its here in Davao City, Philippines ....this is where our President is from......the year was April,1984(not November 2016)"
	},
	{
		"User": "Hershel B",
		"Location": " ",
		"DateofReview": "October 3, 2017",
		"ReviewTitle": "Bad roads and traffic.",
		"Review": "It was a long ride over rough roads to a mediocre destination. I would not go back nor advise my friends to go."
	},
	{
		"User": "Christy A",
		"Location": " ",
		"DateofReview": "September 1, 2017",
		"ReviewTitle": "View at the summit",
		"Review": "Mt. Apo is the highest mountain in the Philippines. That is why I took the challenge to climb to the summit. It has an amazing view as you look down the island of Mindanao. It relieves exhaustion and the energy you have exerted during the trek. Totally an incredible experience!"
	},
	{
		"User": "Sheilzy1972",
		"Location": "Melbourne",
		"DateofReview": "March 27, 2017",
		"ReviewTitle": "highest peak",
		"Review": "it was great to see Mount apo up close and personal - the highest peak in the Philippines\r was a long drive though and hard to get there\r you need to go with someone who has experience driving around the mountain\r it was cloudy though later part of the day due to rain\r but we were able to have a glimpse of this beauty\r worth a trip and we had a great volcano experience at the end of the day"
	},
	{
		"User": "buboypogi",
		"Location": "Manila, Philippines",
		"DateofReview": "March 24, 2017",
		"ReviewTitle": "Climbing the highest peak in the Philippines",
		"Review": "One of the hardest yet so fascinating mountain we ever had. We didn't reach the peak on our first day but still managed to finish the entire trek for 2 days."
	},
	{
		"User": "tito u",
		"Location": " ",
		"DateofReview": "November 11, 2016",
		"ReviewTitle": "Scary looking mountain",
		"Review": "There are many beautiful mountains including volcanoes in the Philippines, this tallest mountain in the archipelago looks horrible from afar. \r As one nears its foot and starts trekking, trash abound along the way. Trees are also cut as firewood. Government and private stakeholders should not only promote and promote; market and market but most imperative to communicate responsible, ethical, sustainable and inclusive development to all concerned whether visitors and locals"
	},
	{
		"User": "Maia_0515",
		"Location": "Davao City",
		"DateofReview": "November 3, 2016",
		"ReviewTitle": "Mindanao's highest peak...",
		"Review": "I have not reached the top of Mt. Apo though but yeah i did reach its foot and stayed in some quaint places nearby where you can see its beauty in the early morning sunshine and even during a misty morning..."
	},
	{
		"User": "Dharzie",
		"Location": "Manila",
		"DateofReview": "October 26, 2016",
		"ReviewTitle": "Mt. Apo",
		"Review": "Mt. Apo is a must visit place in Mindanao. This mountain bears beautiful and amazing flora and fauna."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "August 30, 2016",
		"ReviewTitle": "Majestic",
		"Review": "Love looking at Mt Apo and how if you keep watching, it slowly changes colours. When the clouds shroud it, it looks quite awe-inspiring, if not mystical, and takes you to another world. Like Bora Bora, this Mountain is simply Majestic."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "The only super beautiful and majestic mountain in Mindanao, Mt. Apo.",
		"Review": "I was wondering why it was called Mt. Apo, which sound more masculine, instead of Mt. Christine or Mt. Sarah as more fitting name for that highest , beautiful and majestic mountain with a beautiful sleeping beauty lady formation around the city of Davao, with the head, neckline and with two breasts line formation, which could be clearly outline in the early morning and in the afternoon just before sunset when the clouds that blanketed her will depart and I love the scene which I used to see in the morning upon getting up and in the afternoon before sunset , so beautiful and I love it, gazing from my residence at Deca Home Resorts and Residences in the valley of upper Mintal, Davao city. My eldest daughter Ms. Ivy Lovella M. Rosalejos, a registered nurse and NLEX passer already residing in Manila and my youngest son Mark Dave, a University of Mindanao graduate has scaled it during the Holy week of 2014 and that was their most memorable time of their lives, to remember,ever. Come to the beautiful and peaceful city of Davao and secure a housing unit in Deca Homes Resort and residences where it is so visible and inspiring to see from moment to moment."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "The Tallest Mountain in the Philippines",
		"Review": "I have not climbed Mount Apo but I see the peak every morning from our balcony.\r If it is not shrouded by clouds, it is a glorious sight to behold. The closest I have been to it is going to Eden Nature Park on the next mountain Mount Talomo. My close friends have joined treks up the Mount Apo as they are young, athletic and fit! There are scheduled climbs up the volcano. Just last summer, a huge forest fire consumed hectares of trees due to the carelessness of some climbers, we were told, but also because there was a lack of rain this year. If you see Mount Apo on a clear day, you will think it is ice-capped as we thought as children. Actually, they are steam spewing along the top."
	},
	{
		"User": "trentvano",
		"Location": "tampa FL",
		"DateofReview": "April 7, 2016",
		"ReviewTitle": "Mount Apo is beautiful....hopefully they open it back up",
		"Review": "Hiking Mount Apo is like hiking to another world, with the jungle terrain, followed by climbing up boulders, followed by the summit where clouds constantly drift right towards you and engulf you. I hiked here over holy week when the fire started, although I never saw anything. \r \r Unfortunately, the Department of Environmental whatever of the Philippines thinks that it's their job to close down beautiful places instead of managing them so that they're available for the world to enjoy. This is currently true at Mount Apo (highest mountain in the country) and at Mount Hamiguitan (one of the few world heritage sites in the Philippines). \r \r The closure was due to a fire that affected less than 1% of the park and was likely caused either by locals or was natural. Worst case scenario, it was caused by a guide's negligence in allowing one of their guests to try to start a campfire, but I find this unlikely. \r \r Where is the money from the permit fees going? The busiest weekend of the year and the only people \"working\" I saw were volunteers walking around getting us to sign their sheets. How about regulating your beautiful lands by forcing the guides to be accountable for their guests trash by making the guides stamp their guest's permit numbers on the guest's paper items? How about acknowledging that the cost of the occasional small fire is better than the cost of neglecting the world and the citizens of the Philippines this beautiful park, neglecting the guides/porters of their jobs and neglecting the fact that their TAX money (and visitor permit fees) are the reason that this park even exists? \r \r Similar mismanagement by this country's government employees can be seen by the recent power outages at Manila airport costing passengers thousands of dollars and thousands of hours in lost productivity. The government official held responsible continues to hold his position despite similar demonstrations of incompetence in the past, receiving nothing more than a lecture from the president of the country. "
	},
	{
		"User": "Gracia M",
		"Location": "Cyberjaya, Malaysia",
		"DateofReview": "April 2, 2016",
		"ReviewTitle": "Should be the #1 thing to do in Davao",
		"Review": "I was privileged, along with Eastern Mountaineering Society, to hike it days before irresponsible hikers started a fire in the summit :( \r \r I hope every camper/hiker/tourist/traveler be not too selfish and irresponsible, and realize the consequences of his/her actions.\r \r Other info:\r The trail we took was Mandarangan-Magpet. Our registration was handled by Charlesons Travel and Tours, they were really accommodating, as well as the guides and porters."
	},
	{
		"User": "Rod20",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "March 23, 2016",
		"ReviewTitle": "Good family activity",
		"Review": "Our friends who live on their boat on Samal Island acted as our tour guides to get us up to the Mountain visitation center. The activities were organized and appeared save. I'd never seen bicycle riding on a high wire as an attraction before! The varied plant life was interesting. The tour guide did a good job of explaining the various interest areas. The food for lunch was very good and plentiful."
	},
	{
		"User": "Jason C",
		"Location": "Taguig City, Philippines",
		"DateofReview": "March 22, 2016",
		"ReviewTitle": "One of a kind experience, a must for all adventure hikers!",
		"Review": "It was a dream to stand atop the highest mountain in the Philippines, and the experience did not disappoint!\r \r We arrived in Davao City, and took vans to reach the town of Kapatagan, our jump-off point. This trip took about 5-6 hours. We then transferred to trucks (the roads were rough) to get to the village closes to the mountain; another two hours.\r \r The first day was a tough hike because we had to carry our own water. The water sources near the usual camp, Godi-godi, were dry and so we had to camp elsewhere that's nearer a stream. The second day was exciting as we assaulted the summit, and after about six hours from camp, we made it! Not everyone made it up, as the heat and altitude forced a couple of us down. \r The third day was devoted to packing up and heading back down to Davao City!\r \r Nights can be bitterly cold here though it's not so bad as the trees protected us from the wind. There are surprisingly very few annoying bugs but the constant unpredictability of the weather was bothersome. It was blistering hot one moment, and showering the next. \r \r Overall, Mt. Apo is a must for all adventure hikers due to its challenge and the stoke felt up there at the summit!"
	},
	{
		"User": "Pilipinong T",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "January 25, 2016",
		"ReviewTitle": "Foot of Mt. Apo is spectacular",
		"Review": "We only stayed at the foot of the Apo, and took a dip at the hot falls and mud pack. We hired a van in going to the place which can be reached from Davao airport within 3 hours. We believed that the mud pack from the lava of the volcano was mediciinal and that was true since our sore limbs were healed in an instant."
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "January 23, 2016",
		"ReviewTitle": "I love nature",
		"Review": "I can't say nothing bad about this place, because i love u too nature, and i enjoy here. Nice place and nice views of nature If you are near come here and enjoy"
	},
	{
		"User": "alewismclean",
		"Location": "Dundee",
		"DateofReview": "November 17, 2015",
		"ReviewTitle": "Challenging and beautiful ",
		"Review": "Climbed Apo with a Mt Apo Adventures (Albert Gabriel) as my guide. Great experience, definitely a challenge for those not used to mountain climbing but perfectly doable. Unfortunately the weather wasn't the best for us but stilk had a great time on the 4 day trek going up from the east and down to the west. "
	},
	{
		"User": "David T",
		"Location": "Gladstone, Australia",
		"DateofReview": "November 2, 2015",
		"ReviewTitle": "Trekking Mt Apo",
		"Review": "I trekked Mt Apo at the end of October 2015. This is a great trek, comparable to kinabalu, or Rinjani. We did 3 day 2 nights which is not too strenous, although day 3 is a 2000 metre descent, so make sure you have done some prior training, especially for your quads. The trek was organised by Albert Gabriel at Mt Apo adventures, and our guide was Roy plus one porter. There were 2 others in my group who had similar experience to me and were both great company. The trek is varied, through farmland, rain forest, big boulders which gives nice contrast. The weather on the summit was foggy, windy, some rain, and cold, so bring the right mountain clothing or you will be uncomfortable. The sleeping bags are not very warm. We also had breaks in the cloud to see sunset and sunrise, which was very good for the photography. If you enjoy mountain trekking this is a great trip, come prepared and enjoy the relatively unspoilt and still beautiful Mt Apo. "
	},
	{
		"User": "Texas",
		"Location": "Texas",
		"DateofReview": "October 10, 2015",
		"ReviewTitle": "Climbed to Mt Apo",
		"Review": "Amazing views, breath taking experience, It was difficult climb but worth doing it. Seeing the natural beauty of the Mountains, Boulders forest was wow feelings."
	},
	{
		"User": "Con c",
		"Location": " ",
		"DateofReview": "October 7, 2015",
		"ReviewTitle": "Mt Apo, clim the summit",
		"Review": "Nothing beats the experience of being with nature. It's like being in the movie \"Everest\" but in a rather small way and le4ss the snow and avalanche. It is just a pity that some clibers just litter the mountain along the way - it's probably cultural but it just doesn't fit. The last time I went here was in a chopper so I did not get to notice how the garbage that people throw had degraded the place."
	},
	{
		"User": "CheParacuelles",
		"Location": " ",
		"DateofReview": "August 25, 2015",
		"ReviewTitle": "great outdoor adventure",
		"Review": "it is an easy hike (not technical) and for sport / outdoor fans a great weekend opportunity. the landscape is interesting, mix of trees, vulcano stone, great view, rural farming villages and lake on the rimm. 3 dasy is for relaxed program, if somebody is doing regular running, 2 days up and down no problem. to have it convenient and safe i hired a local guide (albert gabriel) who did a great job in leading the tour and organising all around like tent, food, permit etc.. worth to carry up the mountain is the local sweet taste brandy - as it helps to warm up potential cool nights:)"
	},
	{
		"User": "JDC924",
		"Location": " ",
		"DateofReview": "August 9, 2015",
		"ReviewTitle": "Kapatagan-Kidapawan traverse Trail!",
		"Review": "It is worth the Trail. Fun because we are family who went up. It was really adventurous, as we left Davao Midnight. We droved with a Truck who brings Vegetable at Davao market in the Morning. We reach Kapatagan at around 4 am. Drink coffee and waited for our Porters to arrive. At 6 am, we started to march to a small village, passed through vegetable farms, were they are planting carrots, potatos and etc. We slept-over at Goody-goody camp, since we are very tired, at 3 pm we are already lying on our Tent.The next day, we started at 7am to reach the Peak. We walked through Boulders, the rocky side of Mt.Apo. It was hard but worth because we harvested a lot of Blueberries on the way. On the 3rd day was the hardest day as we passed through Lake Venado, we are walking more than 11 hours going down near the Kidapawan area. On the 4th day, we reach Kidapawan. We are lucky enough because it was not raining that time."
	},
	{
		"User": "P-len L",
		"Location": " ",
		"DateofReview": "July 2, 2015",
		"ReviewTitle": "Climbing Mt. Apo- the tallest mountain in the Philippines (Open for local and foreign tourist)",
		"Review": "If you are a professional climber or not, you can climb Mt. Apo if you have the thirst for adventures. My first climb in Mount Apo was on October 2010, it was a very unforgettable and amazing adventure I had with my co-workers. You can not explain the feeling you felt when you're on the top (the peak). It's all worth it (everything) and you enjoyed the vistas that God's shared with us. \r In my second time climbing Mt Apo was on April 2015 with some friends. It's a dream destination, away from the hassle and noisy city, just touching and feeling the mythical ambiance that Mount Apo shares with us.\r \r There's always a schedule climb to Mt Apo. Every October of every year as we call is \"OKTOTREK\" and during summer during \"HOLYWEEK\" period in the Philippines which mostly falls in the month of March or April.\r You can search in google some tour agencies which offers \"climb package to mount apo\"."
	},
	{
		"User": "Prash1234",
		"Location": " ",
		"DateofReview": "June 30, 2015",
		"ReviewTitle": "Dream Climb",
		"Review": "Nothing can compare to the feeling of exaltation when you're at the peak, looking at the sea of clouds, and the magnificent sunrise. It was all so surreal. It was so cold up there, but people in their layered clothing don't seem to mind. Just the feeling that you're at the peak gives you a different kind of high. It was all worth the 4-day trek, crossing rivers and open fields under the scorching summer heat. And I don't mind the blisters and the dead toenails for a prize . After all, not everyone gets the chance to set foot in the summit. The dead toenails will forever remind me that once in my lifetime I was able to conquer the country's highest peak. Overall, it was a trek of faith, for someone with asthma, pneumonia, and vertigo. Thank you, Lord ... I am truly blessed. And humbled."
	},
	{
		"User": "Jan B",
		"Location": " ",
		"DateofReview": "June 30, 2015",
		"ReviewTitle": "Majestic Mount Apo",
		"Review": "We had the most amazing view of Mt Apo at Barangay Kapatagan, Davao del Sur. We stayed overnight at the foggy Mt. Apo Highlands Resort and had a clear view of the mountain at 6:00 in the morning while sipping your civet coffee!"
	},
	{
		"User": "mwetmdb",
		"Location": " ",
		"DateofReview": "June 16, 2015",
		"ReviewTitle": "Mt Apo with Mt Apo Adventures",
		"Review": "In January 2014, I did a last minute trip to the Philippines and contacted Albert from Mt Apo Adventures. He was prompt to reply and very helpful with information. \r I did a 3D/2N trek. The first two days are pretty much relentless uphill walking all the way, with the highlight for me being the boulder field at the end of day 2. The views from the summit at sunrise makes the whole ordeal worth it. \r The guides and porters were very friendly. \r The food was more than adequate. If you are not used to eating a heavy bowl of steamed rice for lunch in the middle of a big uphill climb, I would recommend you bring some snacks/energy bars.\r It gets very cold at night. Everyone on our trip had a felt that the sleeping bags provided were not warm enough, despite layering on all the clothes they had. \r My last and main concern about this hike is the amount of rubbish dumped along the way, It seems that some tour groups do not bring their rubbish down but stash them out of sight. If you see that your tour company is doing this, please educate the guides/porters and report this to the company owner. The whole point of eco tourism is to help preserve the areas we travel to so that they can be enjoyed for generations to come,\r Overall, I would highly recommend Mt Apo Adventures."
	},
	{
		"User": "Kris_ianne",
		"Location": " ",
		"DateofReview": "June 12, 2015",
		"ReviewTitle": "hiking with friends",
		"Review": "we're from gensan and we planned to do hiking at the bottom of this mountain its really cold and i suggest to bring your own water (plenty of water) and a water proof jacket.. you dont want yourself being soaked-wet while feeling the coldness of the air around you."
	},
	{
		"User": "Davao City, Philippines",
		"Location": " ",
		"DateofReview": "June 2, 2015",
		"ReviewTitle": "Some facts to know when you intend to climb mount Apo",
		"Review": "You need a permit from the tourist office which is closed on saturday and sunday but go to the travel agency right across the bus station.They will help you even in the weekends. Tel 0922 800 93 83\r I did the Mandarangan route. Estimated climbing time to camp 1 1:35h, from there to camp 2 2:45h from there to camp 3(lake Venado) 3:15h from there to the top 3:30h. At lake Venado you can buy all the drinks and food you want. Prices are 3-times the normal price but considering the logistic to bring them up. There is also a big and nice camping area. Keep in mind that it can be cold at night. It was 9°C when I was there. You can also camp on a spot near the top but consider the temperature 4°C colder than at the lake.\r Trekking season is october and april but in fact you can go anytime. The climb is physically difficult but not technically. You cross the jungle and will be faced with mud, stones and slippery parts on the route. \r Price of a guide 1.000 and 500 for the porter. After some negociating my guide also was the porter, he carried some 15 kilo on his back. The tour is supposed to take 3 or 4 days but I started at 5:00h and I was at the top at 11:45h.I am 64 years old. So when you are in good condition the climb can easily be done in 2 days.\r For the record my guide was Robert S Eleccion , 0930 744 66 20"
	}
]
