[
	{
		"User": "Harlem Ray D",
		"Location": " ",
		"DateofReview": "September 10, 2017",
		"ReviewTitle": "Beginners Hiking",
		"Review": "As the title implies this trail is good for beginners. The mountain peek stands for about 580meters above ground. Most mountaineering groups in Davao take on the mountain as initial acceptance climb for its neophites. But be not under the impression that you'll take it on a stride. A good prior cardio work up will do you good. The trail stretches about 17kms. Thus if you take it on for a trail run you can be on top and back in 3hours more or less. I've known some who does it in less than 2hours. Or you can take a leasure walk up and have plenty of photos along the way, camp on top to feel the sun set and rise, more photos, and back down Samals white sand beaches. A special note, this mountain does not have a paved trail path and trail markers are few. So make sure to hire a guide. The locals are helpful and nice. "
	},
	{
		"User": "Leiann L",
		"Location": " ",
		"DateofReview": "March 2, 2017",
		"ReviewTitle": "Muat try but prepare yourself physically",
		"Review": "Very good view on top. A bit hard for a first timer but everything's worth it. I love the stops where the locals sell freshly-picked buko juice."
	},
	{
		"User": "Zylle P",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 3, 2016",
		"ReviewTitle": "back to the trail",
		"Review": "Its my 3rd time to climb this place, we took the night trail uphill. On the next day, its nice to feel the fresh air and to be one with nature..."
	},
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "February 9, 2016",
		"ReviewTitle": "Not hard to reach. Amazing views.",
		"Review": "It's best to have a guide to show you how to reach it. But with a 4WD vehicle it's possible to get very close to the top. Then it's an easy walk in. It claims to be open every Fri-Sat-Sun, but not always the case. But even if you are unlucky not to gain access to the very summit (private land), it's still worth it because of the amazing views from just outside the summit area."
	},
	{
		"User": "Kates A",
		"Location": "Cavite City, Philippines",
		"DateofReview": "January 26, 2016",
		"ReviewTitle": "Highest peak in Samal",
		"Review": "For hiking aficionados or views and mountain lovers, then don't miss this in your Samal visit.\r \r You can hire a local to be your guide. You can call it a minor trek and you will pass by fruit bearing trees in the first leg. It has trails and once you are near the peak, there is a house where you can camp and ask for water.\r \r Then after few minutes of walking you'll see a crack where you need pass across (picture posted). A wooden hanging house can be found, pass that and you'll reach a mini garden with huts.\r \r The peak is breathless. You will see a 360 view of Samal when you hike Mt Puting Bato. Depends on your capability, you can just complete this in less than 5 hours. Maybe 3 hours. \r \r Ask the locals around for the possible drop off points. The mountain is not commercialized yet. There is a trail in the other end where you would end up in Canibad Cove, another less visited place in Samal."
	}
]
