[
	{
		"User": "small-skiing-mole ",
		"Location": "South East England",
		"DateofReview": "3 weeks ago",
		"ReviewTitle": "MUST SEE! Learn about Davao's history & its indigenous people. Incredible staff",
		"Review": "Really enjoyed visit to this small museum established by Pres. Duterte's mother who wanted to inform and educate people about the 11 indigenous tribes in Davao City. This is only the start of the musuem, it continues with the history of the area, Spanish, Japanese and American influences and the establishment of the city. The displays and information are good and there are some interesting exhibits, but, to get the most out of your visit, talk to the staff who are knowledgeable and helpful. Currently there's an exhibition by a local painter on the top floor, which is also a must see as her work is superb!"
	},
	{
		"User": "Rodessa M ",
		"Location": "Davao City, Philippines",
		"DateofReview": "4 weeks ago",
		"ReviewTitle": "Amazing Davao",
		"Review": "Informative and educational place for everyone. It shows amazing glimpse of Davao history. Indeed,the Soul of a Great City!"
	},
	{
		"User": "BriDex ",
		"Location": "Caloocan, Philippines",
		"DateofReview": "March 4, 2018",
		"ReviewTitle": "Reliving Davao's Past",
		"Review": "The museum offers tourists and locals a flashback to Davao's rich history and reveals the makings of the region's melting-pot culture."
	},
	{
		"User": "Amani C ",
		"Location": " ",
		"DateofReview": "March 1, 2018",
		"ReviewTitle": "very informative guide and museum",
		"Review": "It's good to know the history of Davao, and the guide explained them very well. I wish I could take some photos but its not allowed inside, but totally understandable. Free entrance!"
	},
	{
		"User": "Kyle L ",
		"Location": "Iloilo City, Phils",
		"DateofReview": "February 24, 2018",
		"ReviewTitle": "It's a one stop story about Dabaw",
		"Review": "The staff who assisted me when i visited is very nice and accommodating she treated a tourist like me with a very warm welcome. i would definitely come back to this museum."
	},
	{
		"User": "rj_travelbug ",
		"Location": " ",
		"DateofReview": "January 31, 2018",
		"ReviewTitle": "Impressive",
		"Review": "We admire how the Davao government presented their culture and history. The guide (a tourism student) was proficient - we're impressed. The museum is clean and airconditioned. First city in the Phils. (That i've been to) that has a a good museum of its history. No entrance fee, and the guide won't accept any tip."
	},
	{
		"User": "Tor Erling M ",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 26, 2018",
		"ReviewTitle": "Easy and quiet place.",
		"Review": "A quiet place to to a round and watch the art. And the historie og philippine. And the Are good guide there"
	},
	{
		"User": "Greeg G ",
		"Location": "Manila, Philippines",
		"DateofReview": "December 22, 2017",
		"ReviewTitle": "Interesting",
		"Review": "Lots of interesting facts that you could take it from it and share with your friends about the history of Davao"
	},
	{
		"User": "redgotsohigh ",
		"Location": "Taguig City, Philippines",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "Educational",
		"Review": "This was our first stop during the City tour for a reason. This museum will give you insights as well as historical information about Davao. You'll be guided by a Student who provides you more facts about Davao. Very educational indeed!"
	},
	{
		"User": "anncheska ",
		"Location": "Taguig City, Phiippines",
		"DateofReview": "November 22, 2017",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Worth a visit",
		"Review": "Organized and educational. You can learn about Davao History and there is a souvenir shop that sells affordable stuff."
	},
	{
		"User": "Raf O ",
		"Location": "Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Historical...",
		"Review": "It's very nice to hear some historical information about Davao. It's free and they don't accept donation for good cause..the collection of arts and paintings is very informative about the place...people are very knowledgeable about their cultures and history."
	},
	{
		"User": "blessie ",
		"Location": "New Zealand",
		"DateofReview": "October 15, 2017",
		"ReviewTitle": "Interestin insight on the history of Davao.",
		"Review": "The place isn't that big in terms of museum size, but it does provide an interesting perspective on the history of Davao. I love the life-size photo of the President Duterte on the lobby. Good for photo shoots. The parking can be a problem here...More"
	},
	{
		"User": "Ringo T ",
		"Location": "Quezon",
		"DateofReview": "October 14, 2017",
		"ReviewTitle": "No Cameras Please",
		"Review": "The museum has a lot to offer when it comes to history. You can see the evolution of tribes, different tools used by our ancestors and the colorful culture. It also boasts intricate pieces of artwork. However, you’d better have a sharp memory otherwise you’re...More"
	},
	{
		"User": "Annalevs ",
		"Location": " ",
		"DateofReview": "September 26, 2017",
		"ReviewTitle": "Informative and Entertaining",
		"Review": "This is a must place to visit when you visit Davao. It is just located in the heart of the city near Davao City Hall. The place is also surrounded by different parks. There's no entrance/admission fee here and you will not be allowed to...More"
	},
	{
		"User": "sheli_cious ",
		"Location": "Koronadal, Philippines",
		"DateofReview": "September 5, 2017",
		"ReviewTitle": "DuhWow",
		"Review": "Visit this place when you a get a chance to visit Davao so you'll learn the History and the Duterte clan. The good thing here is the entrance is free and the tour guide do not accepts tip from you as in Totally Free! as...More"
	},
	{
		"User": "allan_y1965 ",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "September 2, 2017",
		"ReviewTitle": "history of davao city",
		"Review": "learn about the interesting history, cool and fun facts of the davao city. entrance is free and you would be entertained by a museum guide. they don't allow photos inside the exhibits though. they do allow photos on the entrance lobby and on the staircase....More"
	},
	{
		"User": "Mia P ",
		"Location": "General Santos, Philippines",
		"DateofReview": "August 29, 2017",
		"ReviewTitle": "Informative and Educational!",
		"Review": "This museum charges NO ADMISSION FEE! This is a very good project of Mayor Duterte (now, President Duterte). It's a museum which highlights the 11 ethnic groups of Davao. Culture is very much preserved here and you can really feel the staff's love for the...More"
	},
	{
		"User": "rainbowwarrior126 ",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 14, 2017",
		"ReviewTitle": "Davao City in a capsule",
		"Review": "Very educational. The visit enabled me to learn deeper what Davao City is, its early inhabitants, the people behind the success of the place."
	},
	{
		"User": "Jojo S ",
		"Location": " ",
		"DateofReview": "August 13, 2017",
		"ReviewTitle": "then and now",
		"Review": "you will be inform of the rich history of davao,the simpliest beginning of this progressive and peaceful city up to the recent..."
	},
	{
		"User": "Ronna V ",
		"Location": " ",
		"DateofReview": "July 26, 2017",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "A little bit Davao's History",
		"Review": "The museum is just at the back of osmena park and just a walking distance to my hotel.. I went here about 5 pm and no much people inside the small museum.. They dont charge any fee for entrance which is cool.. Had like 20...More"
	},
	{
		"User": "The_Nomad_11 ",
		"Location": "Melbourne, Australia",
		"DateofReview": "June 30, 2017",
		"ReviewTitle": "A history lesson",
		"Review": "I came here not knowing what to expect when I went through all the floors in this building I was surprised how good it was. We had a great tour guide who came with us from when we entered you could ask anything her knowledge was amazing the only thing that let the place down was you not allowed to take many photos in the gallery but all in all well worth a visit"
	},
	{
		"User": "Monica P ",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "May 27, 2017",
		"ReviewTitle": "I love the fact that it offers a free guided tour",
		"Review": "It's a small cozy museum and may not be advisable if you are not accustomed to big traveling groups as the guided tour can be too fast / wordy. 50% of the info are about the ruling political family. I like the painting at the lobby. Also, I love the no mobile rule. Makes people more appreciative."
	},
	{
		"User": "geekpacker ",
		"Location": "Pasig, Philippines",
		"DateofReview": "May 11, 2017",
		"ReviewTitle": "A good learning experience",
		"Review": "The place was simple, looks like am old house from the 60's. Entrance is free and very informative. Our guide was well knowleadgeable about the history of Davao. The place was clean and the items are well preserved.\r \r I recommend everyone to visit this museum when you come to Davao."
	},
	{
		"User": "UsapangGala ",
		"Location": "London",
		"DateofReview": "May 11, 2017",
		"ReviewTitle": "Showcases the story and beginnings of Davao",
		"Review": "Picture taking is not allowed inside but generally, it highlights the ethnic groups present in the city, there are dioramas to illustrate the lifestyle of these ethnic groups.\r \r As the tour guide said pictures were allowed before but because of one incident where an arrogant tourist posted a picture with a wrong caption (or maybe because of the comments too) that disrespected some indigenous group."
	},
	{
		"User": "travelbug47london ",
		"Location": "Quezon City, Philippines",
		"DateofReview": "May 10, 2017",
		"ReviewTitle": "A modest attempt to explain the history of Davao",
		"Review": "The free entrance comes at the price of having to be escorted by a work experience kid and not being able to go at your own pace. Moreover the only place to take a photo is in front of a vivid mural on the stair case.\r Left on my own or with a guide who could answer the most basic of questions, this little museum could have been interesting. They have a programme of temporary exhibitions in one room which gave a more interesting insight, in my case into the guerrilla campaign in 1945 in Mindanao.\r On a hot day it is a cool refuge but the museo is not well sign posted."
	},
	{
		"User": "MBDAce ",
		"Location": "Pangasinan, Philippines",
		"DateofReview": "May 4, 2017",
		"ReviewTitle": "NO ENTRANCE YET EXTREME KNOWLEDGE",
		"Review": "It is our last day in Davao City after the intensity 7 earthquake last Saturday morning. We are still going around to look for a few more travel agencies and we chance upon this place. It says NO ENTRANCE FEE, OPEN TO PUBLIC! It's almost lunch time so we tried it. Another best thing it came with a tour guide, we are thankful of Ebony. She not only features the beauty of Davao but also knows the culture. Salute to President Duterte and his mom for initiating that this museum to be free to the public and yet keeping it orderly."
	},
	{
		"User": "HanaCarrera ",
		"Location": "Munich, Germany",
		"DateofReview": "April 17, 2017",
		"ReviewTitle": "A little warm, but very informative and well-kept!",
		"Review": "I went here with my sister on March 2017. There is no entrance fee, and they even have guided tours in English for free! Our guide was an informative young woman wearing a hijab (this is the best way I could describe her since we did not catch her name). She covered everything there is to learn about Davao from pre-colonial times up to present. Picture-taking and camcording are restricted inside the exhibition rooms, but are allowed in the art gallery and with the big mosaic in the middle of the stairway. It was a nice way to spend a rainy afternoon, but it's not for little kids or those who have difficulty with using stairs."
	},
	{
		"User": "IchbinStego ",
		"Location": "Manila, Philippines",
		"DateofReview": "February 28, 2017",
		"ReviewTitle": "a very interesting little Museum",
		"Review": "I found the museum pretty interesting last year but the only problem I saw in the kind of rush that friendly lady wanted to push us through the rooms with its exhibits. Questions were not welcome at all. Also, the \"briefing\" and kind of menace, if I would take a photo inside, made me feel not really welcome. The guided tour was so fast that I had no time to look around. So I did ask for another round, but alone. I was allowed. Indeed a group that just started after us did overtake us with an even faster guide."
	},
	{
		"User": "bofordborres ",
		"Location": "San Jose del Monte, Philippines",
		"DateofReview": "February 22, 2017",
		"ReviewTitle": "Good place for educational trip",
		"Review": "It was a standard local museum. Educational. We would have appreciated it more if they broke the tour to two batch since we were a group of 50."
	},
	{
		"User": "Jennelyn T ",
		"Location": " ",
		"DateofReview": "February 20, 2017",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "A glimpse of Davao's history",
		"Review": "If you're on the city center, you can drop by at this museum, it's well-maintained, and that you would be able to know the summary of Davao's history, including its leaders. There's plenty of relics and artifacts from ancient Davao."
	},
	{
		"User": "Stuart K ",
		"Location": "Kent, United Kingdom",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "day out",
		"Review": "it was average but it was worth going there ,cost was good ,4 of us went ,it was raining that day so we went in"
	},
	{
		"User": "Mercy888 ",
		"Location": "Manila, Philippines",
		"DateofReview": "February 3, 2017",
		"ReviewTitle": "One of the best I've seen!",
		"Review": "We truly appreciated the guided tour of the museum. Our guide talks fast but we understand everything and she's open to answer all my silly questions. You need to visit this \"no-picture\" allowed museum to know everything about Davao's culture and history. Best of all:...More"
	},
	{
		"User": "Victorianlad ",
		"Location": "Melbourne, Australia",
		"DateofReview": "January 28, 2017",
		"ReviewTitle": "Free guided tour with great exhibits",
		"Review": "This free museum is open daily except Sundays. It is opposite Osmena Park. The male guide, 'Boboy', was excellent and explained the history of the five Davao tribes along with how today Davao is 85 per cent Christian (mostly catholic.) Displays were well curated and...More"
	},
	{
		"User": "evol68 ",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "January 20, 2017",
		"ReviewTitle": "No entrance fee; no picture taking inside",
		"Review": "Staff or volunteers here are helpful! Nica was our guide. Small museum but entrance is free so I didn't mind even if they did not allow picture taking inside the museum. Only picture we have is the same as everybody's, the one by the stairs."
	},
	{
		"User": "NinoLeeZhongPing ",
		"Location": "Makati, Philippines",
		"DateofReview": "December 31, 2016",
		"ReviewTitle": "Quick education on the region and the city of Davao",
		"Review": "This place shows hoe the region was established, its people, ethnicity, its evolution, and what it accomplished today. This museum also show, to certain extent, the heritage of the present president. Located at the back of goverment hall and within the vicinity of San Pedro...More"
	},
	{
		"User": "DonDan16 ",
		"Location": "Hamburg, Germany",
		"DateofReview": "December 21, 2016",
		"ReviewTitle": "Very intersting",
		"Review": "This gives lots of information about the City of Davao and the surroundings. It is indeed much history and lots of the tribal people. I will go there next time again, no question. I hope that the city of Davao will still have the good...More"
	},
	{
		"User": "piteraq1 ",
		"Location": "Melbourne, Australia",
		"DateofReview": "December 11, 2016",
		"ReviewTitle": "Great little Museum",
		"Review": "A fantastic Museum with some well presented information. Not Huge Not extensive but just enough to give you an insight into Davao and its History."
	},
	{
		"User": "dred69 ",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 9, 2016",
		"ReviewTitle": "Davao's History",
		"Review": "The Mother of President Rodrigo Duterte Nanay Soledad Roa Duterte is behind the creation of Museo Dabawenyo. She wants to preserved the history of Davao City and there you will see the photos of old davao del sur and how it transformed to be a...More"
	},
	{
		"User": "jblaza ",
		"Location": "Marikina, Philippines",
		"DateofReview": "December 7, 2016",
		"ReviewTitle": "Learn about the history of Davao City and its people",
		"Review": "The Museo Dabawenyo is located in the city center, very near the Davao Cathedral and Sangguniang Panlungsod ng Davao. Entrance to the two-storey museum is free. Despite being free, it is air-conditioned and there are guides who tour the guests along the displays and highlight...More"
	},
	{
		"User": "STCast25 ",
		"Location": "Kawit, Philippines",
		"DateofReview": "December 2, 2016",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "A Glimpse of Davao Culture and History",
		"Review": "The museum is housed in a converted old house. The collections were not that extensive. I appreciate, however, the attempt of the local government to present Davao's culture and history to its visitors. Best of all, entrance is free and there are guides per each...More"
	},
	{
		"User": "Maia_0515 ",
		"Location": "Davao City",
		"DateofReview": "November 3, 2016",
		"ReviewTitle": "Educational Destination",
		"Review": "I have been in this place twice but I do value the history of a Mindanaoan identity that this place has preserve for so many years..."
	},
	{
		"User": "Marie C ",
		"Location": "Philippines",
		"DateofReview": "October 27, 2016",
		"ReviewTitle": "Love Philippine Arts",
		"Review": "We visited here last month for school requirement. our visit was not just for a required trip but also for us to be more inspired. Yes, we did got many inspiring arts that will help us to work on our projects. More Philippine arts are...More"
	},
	{
		"User": "Jessica A ",
		"Location": "Philippines",
		"DateofReview": "October 22, 2016",
		"ReviewTitle": "Art Lovers",
		"Review": "If you love arts, you must visit here too. You can learn many things here and most of the time you can see the uniqueness of the arts."
	},
	{
		"User": "Chonna L ",
		"Location": "Philippines",
		"DateofReview": "October 22, 2016",
		"ReviewTitle": "Excellent Place",
		"Review": "This is one of the best museum I have visited and guess what, it's for free. You don't need to buy tickets or something just to see the Art gallery or the beauty of a museum in Davao. Thanks to the staffs who guided us."
	},
	{
		"User": "Kristela B ",
		"Location": "Manila, Philippines",
		"DateofReview": "October 21, 2016",
		"ReviewTitle": "Applause for this museum",
		"Review": "Thanks to the friendly and polite staffs here because they made our visit too good. They bring up the good vibes we needed because we were so tired from visiting different landmarks here at Davao. Thanks so much. Keep up the great work! :)"
	},
	{
		"User": "MediciBoy ",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "October 4, 2016",
		"ReviewTitle": "Friendly Staff",
		"Review": "First of all, this museum is for FREE. They will also provide you with a tour guide on your visit and they wouldn't take a tip even if you voluntarily offer it. It is also amazing the way they will help you on your way...More"
	},
	{
		"User": "77Raine27 ",
		"Location": " ",
		"DateofReview": "September 9, 2016",
		"ReviewTitle": "Interesting Museum",
		"Review": "Upon entering the place, you would see 2 life size standees of President Duterte. Posed with the 2. Mimicked the one with a clenched fist. Before you go up to the 2nd floor, there was huge colorful painting. This museum showed rich and diverse heritage...More"
	},
	{
		"User": "Ellen Laspobres F ",
		"Location": " ",
		"DateofReview": "September 5, 2016",
		"ReviewTitle": "getting to know the history of davao city",
		"Review": "the museum is quit small, only few artifacts. because most of them are donation of different datu or maharlika ( king and queen of the tribe) but when u heared the cultured history of davao, its very interesting and will captured your mind to hear...More"
	},
	{
		"User": "Jaycee I ",
		"Location": "Tagbilaran City, Philippines",
		"DateofReview": "August 27, 2016",
		"ReviewTitle": "Get To Know Davao In Less Than An Hour",
		"Review": "Basic history of Davao from the days local tribes thrives up to the current admin. Visit is for free so only a lazy traveler would not care to drop by. Plus, it is just right at the city center. Tip: it is always good to...More"
	},
	{
		"User": "Iyes M ",
		"Location": " ",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Free Mini History Class",
		"Review": "You get to get in for free and somebody could even tour you around the place if you're not from Davao. The last part of the tour is a gallery that they change everytime. After the tour, you'll even be given a map around of...More"
	},
	{
		"User": "musickaren ",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "great location and free entrance",
		"Review": "open from Mondays to Saturdays, 9am-6pm went there after watching kadayawan streetdance competition. photos are only allowed at the lobby. lots of artifacts and records about davao. security guard ans staff are friendly. Life-size Duterte boards are placed at the lobby."
	},
	{
		"User": "Lauro B ",
		"Location": "Manila, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "Davao Secret",
		"Review": "Visitors must ensure to drop by the Museo Dabawenyo to have a glimpse of the culture and history of the City. We were amazed by the rich culture of the city and the number of tribes in the city which seemed to have been assimilated...More"
	},
	{
		"User": "Momof7darlings ",
		"Location": "Paranaque, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "They could do better",
		"Review": "Davao city being a premier city could do more to improve in showcasing its history. I had expected a better curated museum, or at the very least a clean one. But what I saw were dusty and faded artifacts. there was a section devoted to...More"
	},
	{
		"User": "Eloiski S ",
		"Location": "Baguio, Philippines",
		"DateofReview": "August 21, 2016",
		"ReviewTitle": "great location, very accommodating personnel, fully air-conditioned , must-visit in Davao",
		"Review": "The place is a must- visit to understand Davao's humble beginnings ..very colorful rich history ..I envy the people of Davao for taking care of their past for the future generations. I do not mind coming back..."
	},
	{
		"User": "Alunsina L ",
		"Location": "Quezon City, Philippines",
		"DateofReview": "August 15, 2016",
		"ReviewTitle": "Davao history and Duterte",
		"Review": "The free museum tour is quite brisk - takes one from a room devoted to the peoples of Davao from various ethnolinguistic groups, to the foundation of Davao and Davao through colonial times, and through rooms dedicated to the modern Davao City. Particularly interesting are...More"
	},
	{
		"User": "Lawrence A ",
		"Location": "Quezon City, Philippines",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "So-so",
		"Review": "There are better museums in the country. Not much to see. Although I learned a lot about how Davao came about."
	},
	{
		"User": "virstud ",
		"Location": "Caloocan",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "Davao history",
		"Review": "This place is run by the local government so the tour is free. You get around 15 to 30 minutes quick tour about Davao City. The city and the people."
	},
	{
		"User": "rickyrose ",
		"Location": "pasay, philippines",
		"DateofReview": "July 4, 2016",
		"ReviewTitle": "Must visit",
		"Review": "Learn more about Davao City in this place. Admission is free and they have tour guides to assist all guests."
	},
	{
		"User": "Siobhan M ",
		"Location": "Luzon, Philippines",
		"DateofReview": "June 9, 2016",
		"ReviewTitle": "You must visit this place",
		"Review": "Free entrance! The staff here are super kind and well-educated on the history of Davao, and even Mindanao. The museum itself is small but filled with lots of great treasures that'll help you get to know the city better. Highlight is definitely the art exhibit...More"
	},
	{
		"User": "BES711 ",
		"Location": " ",
		"DateofReview": "April 29, 2016",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Great way to know Davao history",
		"Review": "Entrance is free of charge and they even give you a receipt should you decide to donate to them. Guided tours are given when you arrive and again, they do not accept tips after the tour. Great way to know where Davao City was formed...More"
	},
	{
		"User": "slazenger552 ",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 5, 2016",
		"ReviewTitle": "Interesting place of city history",
		"Review": "This museum is surprisingly interesting to visit. You will learn a lot of things about the city and its early inhabitants. There's a tour guide that would explain things inside. Only, picture-taking inside is not allowed."
	},
	{
		"User": "Christine M ",
		"Location": "Cagayan de Oro",
		"DateofReview": "March 25, 2016",
		"ReviewTitle": "Museo Dabawenyo: A must see tourist attraction --- not your typical \"boring\" museum",
		"Review": "My officemates and I had a great time exploring the museum and listening to the upbeat museum guide as she unravels the rich history and current events happening in Davao City. The guide was very accomodating, passionate and was very proud in sharing about Davao...More"
	},
	{
		"User": "Mariel G ",
		"Location": "Baliuag, Philippines",
		"DateofReview": "March 15, 2016",
		"ReviewTitle": "Worth visiting",
		"Review": "We can't take any pictures in this museum. But still we grabbed the chance to take a visit since we wanted to know more about Davao. The guide is very warm and explained very well the history of Davao City."
	},
	{
		"User": "larry0123 ",
		"Location": "Overland Park, Kansas",
		"DateofReview": "February 19, 2016",
		"ReviewTitle": "can not take pictures",
		"Review": "have to go and take tour. not worth it without tour. a plus for information about Davao and its mayor and the people of the whole island and there culture"
	},
	{
		"User": "Veness Ehrn G ",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 18, 2016",
		"ReviewTitle": "Peek to Davao's Oldest Culture andTribes",
		"Review": "Entering this place is like being brought back to an aged Davao. Museo Dabawenyo is very educational. Everyone could learn something more than what schools we attend to teaches."
	},
	{
		"User": "Angela M ",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 12, 2016",
		"ReviewTitle": "Davao history told.",
		"Review": "accessibility - very good entrance fee - zero. just go there and register a good place to visit if you want to know the history of Davao. Open to all. Note that taking of pictures inside the museum is not allowed."
	},
	{
		"User": "Jake2014jake ",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 2, 2016",
		"ReviewTitle": "A well maintained museum run by the local government.",
		"Review": "The museum is located in the city center and not difficult to find. Do not mistake this attraction for the Davao Museum, which is a different place. The museum is air-conditioned, and is very well maintained making visiting the place a pleasant experience. Entrance is...More"
	},
	{
		"User": "LanzSister ",
		"Location": "Ormoc",
		"DateofReview": "January 28, 2016",
		"ReviewTitle": "Davao Memoirs",
		"Review": "Entering this place is like reading the whole book with 1000 pages but compressed into 10. People who entertained visitors were very eloquent on the history of Davao. I love the ambiance also for it reflects how people of Davao made a history with a...More"
	},
	{
		"User": "Ralph S ",
		"Location": "San Antonio, Texas",
		"DateofReview": "January 14, 2016",
		"ReviewTitle": "Very interesting place!",
		"Review": "Great place to learn about the history of Davao. Also the best place I've found to buy souvenirs at a reasonable price. We are planning a trip back there very soon. Free admission."
	},
	{
		"User": "Zen A ",
		"Location": " ",
		"DateofReview": "January 6, 2016",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Taking Pictures Are Not Allowed Inside The Museum!",
		"Review": "Since we are new here in Davao, hubby and I decided to tour ourselves around the city. Friends recommended this place for us to know more about Davao's humble beginnings, pride and culture. Indeed, we learned a lot about Davao after the visit. If you...More"
	},
	{
		"User": "Cherie L ",
		"Location": "Shanghai, China",
		"DateofReview": "December 28, 2015",
		"ReviewTitle": "A great synopsis of Davao history and people",
		"Review": "A must and a good start of your visit and tour of Davao if you are interested the history and essence of Davao . It is free and comes with a guide."
	},
	{
		"User": "yolyg2015 ",
		"Location": "Marikina, Philippines",
		"DateofReview": "December 25, 2015",
		"ReviewTitle": "Museum in downtown Davao City",
		"Review": "Located right in the City, the museum offers a glimpse of Davao City and its history, its people and lots of info.. a place not only for tourists but for residents as well.."
	},
	{
		"User": "Laking D ",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 12, 2015",
		"ReviewTitle": "Free and Informative",
		"Review": "After my visit in this place, I am surprise how deep my place history are.... the tour guide was very approachable and smart."
	},
	{
		"User": "ingmar b ",
		"Location": "Manila, Philippines",
		"DateofReview": "December 2, 2015",
		"ReviewTitle": "great museum about the history of davao",
		"Review": "great museum about the history of davao. they have lots of photo's . the museum is convenienatlly located. the guides are pretty good. there is lots to see and to read"
	},
	{
		"User": "Elmo B ",
		"Location": "Singapore, Singapore",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "Davao Tribes Explained",
		"Review": "In case you like to know, here are the known tribes in Davao Magindanao, Tausug, Maranao, Sama , Ata, Tagabawa, Matigsalug, Obo Manuvu, Clata and Kagan Davao during Spanish Occupation, American Occupation, Japanese Occupation. Artifacts, photos, paintings, dresses and gowns Weapons and memorabilia and more"
	},
	{
		"User": "Felicia C ",
		"Location": "Pasig, Philippines",
		"DateofReview": "September 22, 2015",
		"ReviewTitle": "Interesting information provided on the 12 tribes!",
		"Review": "This museum was opened in 2006 and it provided information on the 12 tribes from Mindanao. Unfortunately, it was a rather small museum and it would have been great if more information was provided. Definitely a must-visit for those interested in the history of Davao...More"
	},
	{
		"User": "Anna May V ",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "September 20, 2015",
		"ReviewTitle": "Start With This Quick Stop",
		"Review": "Museo Dabawenyo opens at 9 AM, is free and makes for a good first stop because it provides context to many things yo will encounter as you tour Davao. It may also cause you to alter your itinerary a bit here and there. It has...More"
	},
	{
		"User": "robmaghinang ",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 15, 2015",
		"ReviewTitle": "Have a quick look at Davao City's ancient and political history.",
		"Review": "The Museo Dabawenyo is situated a few steps away from the City Council and City Hall. There is no fee and they don't ask for donations (or, at least, they didn't ask me or donations boxes are not present). The guide is always smiling and...More"
	},
	{
		"User": "Glentoy ",
		"Location": "Manila, Philippines",
		"DateofReview": "September 7, 2015",
		"ReviewTitle": "Historical and cultural tour",
		"Review": "If you are into historical finds, you should pay a visit to Museo Dabawenyo. It is labelled as a \"people's museum\" and its programs are geared towards better historical and cultural awareness, understanding and integration. It is located at Cor. A. Pichon and C.M. Recto...More"
	},
	{
		"User": "julietteBacolod ",
		"Location": " ",
		"DateofReview": "September 3, 2015",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Cultural visit!",
		"Review": "shows off the old Davao. Very attentive guide, picture taking not allowed inside. No entrance fee so if you have time, this place cannot be missed."
	},
	{
		"User": "GerlieUy ",
		"Location": "Negros Occidental, Philippines",
		"DateofReview": "August 26, 2015",
		"ReviewTitle": "Nice side trip",
		"Review": "just within the city center. This museum is a good place to drop by when doing a city tour. Friendly museum guides and well kept place."
	},
	{
		"User": "Tobin A ",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 23, 2015",
		"ReviewTitle": "At least go once to know more about Davao.",
		"Review": "This museum has very limited exhibits. There are no major exhibits here that showcase local and regional artists. There are also no major collections of art here. Needs improvement. Though.. visit once to get the history of Davao."
	},
	{
		"User": "Loislim ",
		"Location": "Manila, Philippines",
		"DateofReview": "August 22, 2015",
		"ReviewTitle": "learn about Davao culture and history",
		"Review": "For Kadayawan festival, decided to visit the museo. I walked around back of the Davao City Hall, a few meters along Magallanes St around the Bonifacio rotunda is a well-preserved colonial building. The museo has presentations of the different ethnic tribes of Davao, their culture...More"
	},
	{
		"User": "Than T ",
		"Location": "Iloilo City, Iloilo City, Philippines",
		"DateofReview": "August 13, 2015",
		"ReviewTitle": "Free to See and Learn Davao",
		"Review": "Surprisingly, I had a great visit to the museum! I never thought it comes free of charge, with a dedicated tour guide who's eloquent and well-versed, with ample things to see and learn. This is one of the must-sees for Davao trippers!"
	},
	{
		"User": "Dioneli S ",
		"Location": "Bulacan Province, Philippines",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "Check It Out, It's FREE!!!",
		"Review": "This is a two-storey govt museum situated at the back of Osmeña Park. Inside, you will get to see the 11 recognized ethnic tribes of Davao. There is also a wall describing the history of Davao City, and shelves filled with plaques and trophies awarded...More"
	},
	{
		"User": "Mark L ",
		"Location": " ",
		"DateofReview": "July 25, 2015",
		"ReviewTitle": "Rich in Culture and History",
		"Review": "Worth the time. Best place to start your Davao trip as they can hand you a city map with all attractions. Picture taking is only allowed outside with the Three Faces Painting but not upstairs. They said that someone put a wrong information in the...More"
	},
	{
		"User": "Jayson L ",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 17, 2015",
		"ReviewTitle": "History Lover",
		"Review": "Seeking the origin of Davao, knowing the people of Davao City. giving you all the information about the history of the city with some replicas and relics of Davao Ancestors. Open for weekdays. good for family bonding and children outings"
	},
	{
		"User": "Medy1950 ",
		"Location": " ",
		"DateofReview": "July 15, 2015",
		"ReviewTitle": "A Visit to Museo Dabawnyo to Understand the Davao Psyche",
		"Review": "To understand Davao better, you must take a quick trip to the Museo Davawenyo. It is a government run museum so no fees are charged. It is thankfully airconditioned to protect the displays which makes it comfortable to look around while the tour guide explains...More"
	},
	{
		"User": "Marklyn M ",
		"Location": "philippines",
		"DateofReview": "June 16, 2015",
		"ReviewTitle": "Support this great museum",
		"Review": "The museum admits free of charge and is well-maintained. You will be guided by qualified people. You will learn a lot about Davao and it's people. Don't miss this when you visit the city on foot."
	},
	{
		"User": "babyphilippines ",
		"Location": " ",
		"DateofReview": "June 14, 2015",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Educational tour",
		"Review": "Loved the tour around the Museum. The tour guide mentioned Davao City was the 4th placer as the safest city in the world in the year 2004 & 9th place in the year 2009, i knew that the only Woman Mayor in Davao City was...More"
	},
	{
		"User": "aziannegirl ",
		"Location": "San Francisco, California",
		"DateofReview": "May 8, 2015",
		"ReviewTitle": "Great museum",
		"Review": "The museum is free and comes with a free 45-minute narrated tour. It is one of the best tours I've had. Randy my tour guide was very knowledgeable, friendly, and helpful not only with the museum but with other places to see in Davao City. The museum is small enough to tour in 60 to 90 minutes. I highly recommend it even to Dabawenos!"
	},
	{
		"User": "James G ",
		"Location": "Manila, Philippines",
		"DateofReview": "April 16, 2015",
		"ReviewTitle": "Great Place to Learn About Davao!",
		"Review": "My title says it all, a great place to look into the colorful and awesome history of Davao. It's free! Also, the staff there are really nice and accommodating. The tour-guide is equipped with a jam-packed of Davao-knowledge so any question you ask will definitely be entertained well. A great place to pensively examine the past of Davao and its bright potential ahead."
	},
	{
		"User": "Lim P ",
		"Location": "Makati",
		"DateofReview": "April 12, 2015",
		"ReviewTitle": "Learn about Davao here!",
		"Review": "This is a place where yiu will learn about Davao's history and culture. If you are not interested in the history and culture, skip this place. No entrance fee and a guide will provide information on the history and culture of Davao. No photo taking is permitted when inside the museum (Don't understand why). We did the tour in less than 30 minutes as the guide appears to rushing us through."
	},
	{
		"User": "superVeee09 ",
		"Location": "Lucena City",
		"DateofReview": "March 10, 2015",
		"ReviewTitle": "historic",
		"Review": "a must visit to understand davao and the provinces that surrounds it. very informative. overall, I love davao. I love the smell of davao, smokefree and I feel safe."
	},
	{
		"User": "TayNayNak ",
		"Location": "Luzon, Philippines",
		"DateofReview": "March 1, 2015",
		"ReviewTitle": "The best way to learn about Davao's rich and colorful history!",
		"Review": "A must see in Davao City, it's free and guided tours are available, and the best way to learn about Davao's rich and colorful history."
	},
	{
		"User": "Honeynjf ",
		"Location": "Perth, Australia",
		"DateofReview": "February 17, 2015",
		"ReviewTitle": "Go if you enjoy history!",
		"Review": "This museum was free and gave a brief introduction to the fascinating history of Davao. If this sort of thing doesn't interest you don't go. I particularly enjoyed learning about the hill tribes. The tour guide spoke very good English as well. If I am being a bit picky there were several spelling errors on the sign but aside from that it is a good museum."
	},
	{
		"User": "MijnlieverdFH ",
		"Location": "Amsterdam",
		"DateofReview": "January 12, 2015",
		"ReviewTitle": "Davao Museums: free admission",
		"Review": "The best showcase about Davao and its historical and cultural background. Many things to learn about Davao's various tribes."
	},
	{
		"User": "AsanSiDiwaAtShiela ",
		"Location": "Lapu Lapu, Philippines",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "It's free admission",
		"Review": "Since it's free, don't expect too much... :) But even though it's free, there's always a tour guide who will educate you about Davao. If you love history, culture and arts, this is a place for you. :)"
	},
	{
		"User": "agigil ",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "December 10, 2014",
		"ReviewTitle": "History preserved",
		"Review": "I really appreciate that they're able to find out the history of the Dabawenyos. From the houses, the culture, the attire, the tools they use. Their tour guide is also very friendly."
	},
	{
		"User": "AbiBermudaFernandez ",
		"Location": " ",
		"DateofReview": "November 1, 2014",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Rich Culture of Davao",
		"Review": "Kudos for the City Government for coming up with this museum. You can learn so many things about the rich culture of Davao and their tribes. Two thumbs up."
	},
	{
		"User": "Capt Mark O ",
		"Location": "Hong Kong",
		"DateofReview": "October 12, 2014",
		"ReviewTitle": "Go if you have spare time",
		"Review": "The museum is neither good nor bad. It has most of the exhibits on the second floor. A lot of before and after pictures, and a lot of paintings by local artists. But it is not particularly interesting nor is it particularly informative about what Davao is now, or what its past was.\r \r I think the building is newly built on top of what was the site of the Court of First Instance.\r \r Go if you have extra time to spare, after the beach, wakeboarding, shopping in Aldevinco, or buying fruits in Bankerohan market.\r \r Entrance is free.0900-1800H Mon-Fri. Call to make sure (082) 222-6011"
	},
	{
		"User": "Pam B ",
		"Location": "Cebu City, Philippines",
		"DateofReview": "July 17, 2014",
		"ReviewTitle": "Great tour, plus it's free!",
		"Review": "One of the best things about going to the Museo Dabawenyo is that it costs you nothing. Well, except for the fare to get you to and from the museum. We were greeted by a friendly staff who helped us with our heavy backpacks. We asked them if there was any entrance fee and they said there was none, you just had to log your name in the visitor's list. According to the museum guide, it was the only one in the Philippines that did not charge visitors.\r \r The place is pretty packed with many cultural heritage and is a great learning place for those interested in Davao culture and history. It goes back through time, goes through its politics and there is also room for modern stuff like art.\r \r It is probably the best museum visit I have ever had in my entire life. I hope to bring my daughter there again, when she is much older and could understand the guide."
	},
	{
		"User": "Liza A ",
		"Location": "San Jose City",
		"DateofReview": "July 16, 2014",
		"ReviewTitle": "take pride of having a rich history and culture and traditions",
		"Review": "We can glean the history and culture of the Davao's 10 recognized tribes and Muslims.\r Traditional attires and crafts are displayed, along with the snippets of culture and the way the royal clans and soldiers lived which have been immortalized through their artilleries and ornaments that dated back several decades ago."
	},
	{
		"User": "slyvargas ",
		"Location": "Bacoor, Philippines",
		"DateofReview": "July 13, 2014",
		"ReviewTitle": "Dabaw",
		"Review": "This museum is well-maintained. It seems to perceive good governance over the city. To travellers, get a glimpse of Dabawenyo history through the place."
	},
	{
		"User": "Melody T ",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 21, 2014",
		"ReviewTitle": "Worthy to go",
		"Review": "It is free with air-conditioned rooms!!! It is worthy to go!! It is easy to go by a taxi because it is in the center of the city. If you go by driving, there are available parking spaces around that area."
	},
	{
		"User": "MelP160 ",
		"Location": "makati",
		"DateofReview": "May 5, 2014",
		"ReviewTitle": "Accessible and Free of Charge",
		"Review": "Its right in the center of the city proper and its free of charge. Drawback is that its only open Mondays to Fridays. The text in some areas are too long. But the section with the mannequins are cramped and do not have any text at all. So the presentation needs to be streamlined and made catchy."
	},
	{
		"User": "cristydti ",
		"Location": " ",
		"DateofReview": "April 30, 2014",
		"ReviewTitle": "very impressive",
		"Review": "I really love visiting museums everytime I travel and Davao has a very impressive museum...the house itself has wooden floors and according to the guide, it was a former courthouse.....every room has a story and every item is very interesting....."
	},
	{
		"User": "Ulysses R ",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 29, 2014",
		"ReviewTitle": "Wow!! DAVAO!!!",
		"Review": "I never knew where Davao got its name from, but not now...when I visited this museum. Its very educational. Never knew that Bagobo have different tribes as well as the Muslim who populated the area long before. It exceeded my expectations. The art gallery is what I enjoyed a lot, especially the masterpieces who won the contests. "
	},
	{
		"User": "Dibyne ",
		"Location": "Kuala Lumpur",
		"DateofReview": "March 20, 2014",
		"ReviewTitle": "rich with history",
		"Review": "Features the beginnings of Davao, its ethnicity, and the people behind its progress. Also, it featured different legacy of its leaders and the destruction during wars"
	},
	{
		"User": "Murphy-Hagunos ",
		"Location": " ",
		"DateofReview": "February 18, 2014",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "Very Small, But Interesting",
		"Review": "A small, cultural museum. And the price is right: free. \r Much of Davao's history is well displayed in this tiny museum. \r A very good collection showing many aspects of Davao. \r The free guide was knowledgeable and helpful. \r Unfortunately she hustled us through very quickly, and we did not have enough time to view the interesting artifacts and read the (sometimes lengthy) accompanying stories. \r Perhaps she feared that we would take photos that are allowed only in the lobby? \r However, we will return to this tiny museum and spend more time on our next visit. \r If you are into these kinds of anthropological displays, this little gem is worth a look-see."
	},
	{
		"User": "WanderLustDavao ",
		"Location": "Davao City",
		"DateofReview": "October 7, 2013",
		"ReviewTitle": "A Must Visit for travellers",
		"Review": "It may not be at par with other museums but Museo Dabawenyo has its own charm and ways of telling visitors the city's less known history. Philippine history is full of Luzon stories. Museo Dabawenyo will tell you the region and the city's evolution that can't be found in text books. Best of all, it's free/open to the public."
	},
	{
		"User": "Inanrehhernani ",
		"Location": "Cebu, Philippines",
		"DateofReview": "October 3, 2013",
		"ReviewTitle": "It speaks of Dabaw",
		"Review": "A must see for travellers who would want to know the history of the place. One would see the dreams and visions of the different tribal groups for Davao. There you would also know the accomplishments and feats of their leaders. Before going out to different places, drop by their and be grounded with their story"
	},
	{
		"User": "Wshkd ",
		"Location": "Jackson Heights, New York",
		"DateofReview": "September 9, 2013",
		"ReviewTitle": "Excellent History of Davao",
		"Review": "This small downtown museum is chock full of the history of Davao, its people, customs, heritage and government from inception to today.\r A small two story building with free admission. A museum guide will take you thru all the exhibits and give a detailed history and explanation of everything you see. \r A must see if you want to know Davao and its heritage.\r Highly recommended. "
	},
	{
		"User": "Laikz ",
		"Location": "Boracay, Philippines",
		"DateofReview": "August 21, 2013",
		"ReviewTitle": "Rich cultural history",
		"Review": "Showcases Davao's history and cultural heritage. Must visit when you're in Davao. Tour guides are friendly and the tour itself is very infromative."
	},
	{
		"User": "igga200 ",
		"Location": "dubai",
		"DateofReview": "August 3, 2013",
		"ReviewTitle": "well maintained",
		"Review": "since we were curious about davao we managed to find this small but well maintained museum in the city. the displays were very relevant and allowed us to have a historical knowledge about davao. the guide was also very accommodating & courteous so we liked that. there were some areas under renovation so we had a limited experience. but all in all it was a pleasant place to visit."
	},
	{
		"User": "shankaronline ",
		"Location": "Pasig, Philippines",
		"DateofReview": "June 20, 2013",
		"ReviewTitle": "Good but too small",
		"Review": "This is a fairly good museum though very small. It has two levels and exhibits a varied collection of artefacts, photos and models showing the evolution of Davao to its present time.\r Lighting could be better, as the middle portions of the halls are dark-ish, but the more than friendly guide made up for that with his excellent explanations.\r Of particular interest is a painting at the entrance made from spiky durian skin.\r Only things I didn't quite like were the lighting as I said earlier, the tiny premises and the fact that photography was not allowed at all inside the museum, even with out strobe.(flash)"
	},
	{
		"User": "mayapis ",
		"Location": "manila",
		"DateofReview": "May 8, 2013",
		"ReviewTitle": "Information on Davao and its history not available anywhere but here!",
		"Review": "For a museum run by the city government and with no admission fee, I was very pleasantly surprised to see how well organized it was and how well-informed our free tour guide Winnie was. Admittedly, it is small but there is enough content for a tourist to end up appreciating the city's history. I appreciated knowing more about the indigenous tribes, their culture and seeing a model of their dwellings. The city government should be congratulated for this beginning of a museum which Davao residents should be proud of and continue to support."
	},
	{
		"User": "Jennifer M ",
		"Location": "Vienna, Austria",
		"DateofReview": "November 16, 2012",
		"ReviewTitle": "the best place to know more of davao rich culture",
		"Review": "a well kept museum at the heart of the city. The place was well maintained with staffs that were very warm and welcoming"
	},
	{
		"User": "sleep00walker ",
		"Location": "Doha, Qatar",
		"DateofReview": "November 7, 2012",
		"ReviewTitle": "Mindanao life",
		"Review": "This is a rating for:\r Museo Dabawenyo: Museum of the people of Davao (The new museum) near Osmena Park\r Took a short visit during the Kadayan Festival and got a quite good impression about life in Mindanao in earlier times. Very good guides show you around and inform you not only about the history of Davao City but also rural life of Mindanao ethincal tribes. Enjoyed and will come again some other time."
	},
	{
		"User": "ilyn_03 ",
		"Location": " ",
		"DateofReview": "September 20, 2012",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": "nice and well maintained Museum",
		"Review": "Well it was just our quick stop, we spent like maybe 30-45 minutes in the museum. I must say that the way they were able to preserve the historical items inside was impressive, they were doing a good job on that, and they must keep it up. the only thing I could comment on was the lady that was assigned to guide us inside the museum. she just walked us around instead of providing us the necessary information she just let us roam on our own and read and see the entire place. It could have been nicer if she was enthusiastic and informative."
	},
	{
		"User": "buddymigs ",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "September 18, 2012",
		"ReviewTitle": "Small but informative",
		"Review": "When I first went to museo dabawenyo, it was still under repair. The museum is quite small (unlike museums in Manila), but packs many information for tourists and local students. Its a must that you visit Museo Dabawenyo when visiting Davao"
	},
	{
		"User": "anne_rainne ",
		"Location": "Taguig City, Philippines",
		"DateofReview": "August 21, 2012",
		"ReviewTitle": "respect",
		"Review": "I asked why I can't take pictures inside. The person in charge said there was a blogger who posted pictures and nasty comments about their museum that's why they prohibited taking pictures inside their museum. Respect people! Respect!"
	},
	{
		"User": "hlim34 ",
		"Location": "Manila, Philippines",
		"DateofReview": "July 14, 2012",
		"ReviewTitle": "knowledgeable staff",
		"Review": "the best about it is its free and the fact that the staffs are very knowledgeable about davao and its culture. lots of artifacts inside. they don't accept donations btw..."
	},
	{
		"User": "lenie ",
		"Location": "almere",
		"DateofReview": "July 8, 2012",
		"ReviewTitle": "very small museum",
		"Review": "when you have 10 minutes left of your vacation pass here, it is a very small museum in wich you are shown around, don,t expect you can look around yourself, because there is always somebody with saying don,t touch or don,t make pictures and so...More"
	},
	{
		"User": "mzzyap8 ",
		"Location": "Philippines",
		"DateofReview": "April 23, 2012",
		"ReviewTitle": "It's the museum guide that made it special:)",
		"Review": "There are definitely larger, older and more established museums than this, but the nice lady guide made it worthwhile. She patiently explained what we were looking at, considering it was our first time in Davao."
	},
	{
		"User": "judychristine ",
		"Location": "davao",
		"DateofReview": "February 11, 2012",
		"ReviewTitle": "informative and entertaining",
		"Review": "this has always been one of the places visited during field trips and indeed worth it.."
	},
	{
		"User": "Jo B ",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 6, 2012",
		"ReviewTitle": "komentaryo.....",
		"Review": "need more bigger space / congested! original Bagobo family name should be printed on, big Tarpolin pic not advisable for a small space , bigger art space, need a big garden space for functional art/performances ect......."
	},
	{
		"User": "Jojo I ",
		"Location": "davao ccity",
		"DateofReview": "January 10, 2012",
		"ReviewTitle": "thrown back to the past",
		"Review": "Interesting to hold some time and reflect on what's happening in the past and present arts.............................................................."
	},
	{
		"User": "B_112 ",
		"Location": "Quezon City, Philippines",
		"DateofReview": "November 7, 2011",
		"ReviewTitle": "Museo Dabawenyo",
		"Review": "Museum guide very helpful and accommodating. Space quite small though for the Davao history collection. Small literature for tourists would have been of help though."
	},
	{
		"User": "trondolav ",
		"Location": "Finnoy, Norway",
		"DateofReview": "April 29, 2011",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": " ",
		"Location": "",
		"DateofReview": "",
		"ReviewTitle": "exelent",
		"Review": "this museum focuses on the ethnic history and religion colonization by the Portuguese, Spaniards and Americans until their independence to the present day. museum has a rich selection of art from today's local artists. guiding takes about 1 hour, is completely free and is absolutely...More"
	}
]
