[
	{
		"User": "Kriszy T",
		"Location": "Paranaque, Philippines",
		"DateofReview": "January 29, 2018",
		"ReviewTitle": "Lazy afternoon",
		"Review": "Not really a must see but a good place if you just want to kill time. What I like about this place it has a lot of huge trees around so its relaxing and breezy compared to the Rizal park near by.\r \r It has a portion for kids play ground and a place for check / checkers players, there is also a place for seniors to hang out."
	},
	{
		"User": "folanke",
		"Location": "Philippines",
		"DateofReview": "January 1, 2018",
		"ReviewTitle": "Central escape...",
		"Review": "Ifyou need a quick escape, to sit down and relax for amo, then this is it right in the middle of the downtown...catch your breath and smell the roses, hahaha...oh wait, are there any!!? Nonetheless, adequate...and free..."
	},
	{
		"User": "Amy S",
		"Location": " ",
		"DateofReview": "November 8, 2017",
		"ReviewTitle": "OSMENA PARK FOR EVERYONE!",
		"Review": "The park is a stroll away from shopping streets of San Pedro and Claro M. Recto. If one is not interested to shop, Osmena Park is a perfect place to go to while waiting for the other person who went shopping."
	},
	{
		"User": "arielsanjose",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 28, 2017",
		"ReviewTitle": "A Park Near the Sangguniang Panglungsod, San Pedro Church and Police Station",
		"Review": "It is one of the accessible parks in downtown area. Compared before, this park has improved a lot. It is now fenced, lighted and ornamented. Toilets are also available. Cheap massages are also offered by licensed masseurs. Also, people gathered here to listened to a friendly religious debate. "
	},
	{
		"User": "Mercy888",
		"Location": "Manila, Philippines",
		"DateofReview": "February 3, 2017",
		"ReviewTitle": "Clean and cool",
		"Review": "I love walking around this park. Very clean and with so many plants and trees. Very relaxing and the students we met are very helpful with our inquiries."
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 22, 2017",
		"ReviewTitle": "It's green",
		"Review": "Nice park,nothing special about it. We picked up some Narra seeds but they didn't grow. This place is ok for a short rest. If you are near it, go there. Could be cleaner."
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "chill small park near city hall and san pedro cathedral and museo dabawenyo",
		"Review": "we went here to take pictures with the kadayawan streetdancers because this was their holding area. lots of trees so it was a comfortable place to stay despite the heat. there are vendors walking around offering some fingerfoods."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "August 21, 2016",
		"ReviewTitle": "Enjoyablr",
		"Review": "Nice small park in the hustle and bustle of the city. Nothing special and also was quite busy as Kadayawan Festival was on. Good for a nice relax."
	},
	{
		"User": "Justine F",
		"Location": " ",
		"DateofReview": "July 15, 2016",
		"ReviewTitle": "OSMENA PARK",
		"Review": "The OSMENA Park is infront of tneSan Pedro Cathedral and is adjacent the Sanggunian Ng Lungsod Ng Davao and the RIZAL Park. Also, it is just a walking distance from the Davao National Museum. The park is very Clean and well organized."
	},
	{
		"User": "Keno N",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 16, 2016",
		"ReviewTitle": "A few green places in downtown Davao",
		"Review": "When we retired to Davao City 3 years ago, the Osmena Park was overrun by manicurists, old men playing chess, and a lot of people just milling around to spend the day. Now it has been converted to a park for Senior Citizens. It's landscape is always maintained and it is generally quiet. It is closed at night unlike before where residents nearby and the homeless would sleep the night because it was cool even then. So it makes for a green place to rest after a visit to the Davao Museum just across the street!"
	},
	{
		"User": "daveholden",
		"Location": "Lake Forest, California",
		"DateofReview": "May 29, 2016",
		"ReviewTitle": "A nice little place to come and relax",
		"Review": "This park is well-kept and beautiful. You will be amazed at how much some lovely trees can cut down on the unbearable heat from direct sun. It has lots of beautiful trees and places to sit. A regular park that is done right."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 26, 2016",
		"ReviewTitle": "Small park but nice to relax",
		"Review": "This small park is located at city center. Though small, but there are lots of spectacles to see. Trees bring coolness to the place."
	},
	{
		"User": "Ralph S",
		"Location": "San Antonio, Texas",
		"DateofReview": "January 14, 2016",
		"ReviewTitle": "This park is across from City Hall!",
		"Review": "A nice place to take a walk. It's near the Magsaysay Fruit Market and China Town. Good place to people watch. Free admission."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "January 11, 2015",
		"ReviewTitle": "A place to rest until the offices open",
		"Review": "Shady place and a bit cooler. but still can get the fume from the vehicles. Nevertheless, it is a place to rest."
	},
	{
		"User": "alexarian",
		"Location": "Cebu City, Philippines",
		"DateofReview": "November 2, 2014",
		"ReviewTitle": "Regular park",
		"Review": "Just you regular downtown park. Disappointed that they no longer allow foot spas within the park. Nothing much to see here."
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 30, 2014",
		"ReviewTitle": "it will be a beautiful garden soon",
		"Review": "The park used to be a park where some locals just stay to play chess, do little peddling business. For months now, I have noticed that men are working and putting up a big and beautiful garden. I guess just before Christmas, it will really...More"
	},
	{
		"User": "TravelBug1469",
		"Location": "Manila, Philippines",
		"DateofReview": "September 24, 2014",
		"ReviewTitle": "Rest and Go",
		"Review": "A small park in the heart of downtown Davao, right in the corner of the busy CM Recto and San Pedro Streets, with nothing much to see but it is where you spend some time in between activities ... with bench and shades of trees...More"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "December 5, 2013",
		"ReviewTitle": "Local culture",
		"Review": "If you want to check out local life, this place is one those you can have a quick stopover. Its adjacent to Museo Dabawenyo, City Hall, City Council and San Pedro Cathedral. Cheap massage in \"outdoor spas\" are also available all day and night."
	}
]
