[
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "January 8, 2018",
		"ReviewTitle": "Cool, clear waters; fairly spectacular falls; can be a bit crowded.",
		"Review": "Visited on a Sunday and it was quite busy and crowded with local people. But it is a relatively unspoiled place, with several sizeable waterfalls, and worth the trip in the car. There are also some man-made swimming pools, fed by water from the falls. The road journey there is through beautiful rolling countryside and attractive rice-fields. Without a guide, you may need sat-nav to find it!"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "June 30, 2017",
		"ReviewTitle": "Clear clean waters",
		"Review": "It is only in less than half an hour from Tagum City to the municipality of New Corella Davao del Norte. It is very much known by the locals as you will be guided when you ask the direction to the waterfalls. \r \r You can feel nature's touch in this place. No sophistication. Just nature and you. Bring your own food and drinks. There is no restaurant around with minimal entrance fee."
	},
	{
		"User": "iamatopmodel",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 3, 2016",
		"ReviewTitle": "Cold and clean water",
		"Review": "We visited this place more than a year ago where the road was still undergoing rehabilitation. I'm giving it a high rating because of the whole experience. They don't offer good cottages nor is the area well maintained. But the fact that the water is cold and clean (I'm a waterfall and beach lover) and the air is fresh I have nothing else to complain about. This is like a 2-hour drive from Davao city."
	},
	{
		"User": "Glentoy",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 7, 2015",
		"ReviewTitle": "Clear water, accessible",
		"Review": "The Panas Waterfalls is a multi-tiered falls located about 10-20 minutes from the town proper of New Corella. It is one of the most visited eco-tourism sites in the province of Davao del Norte. It is about 2 hours away from Davao City.\r \r The water is so inviting that tourist would usually dip in its cold and clear water. It's a perfect place especially during summer season. A great place to bond with your family and friends."
	},
	{
		"User": "Jigz N",
		"Location": " ",
		"DateofReview": "August 6, 2015",
		"ReviewTitle": "You can enjoy here all day long!",
		"Review": "around year 2013 when I was here with friends. This place will surely satisfy you and as of today the road will surely be better. It will be a preference if you would like to stay and overnight but for me not really something I would do because a day's enjoyment on this place will do. \r \r they have a pool with fresh water that is a plus! and affordable entrance fee"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "New Corella's crowning glory",
		"Review": "Just 20 mins from Tagum, Panas Falls is a must visit if you're in the area. The falls has different pools and cascades that you can enjoy dipping. Surrounded by thick foliage, you can spend the entire morning or afternoon here, just relaxing and staying away from the blistering heat of the sun."
	},
	{
		"User": "Batangas City, Philippines",
		"Location": "Batangas City, Philippines",
		"DateofReview": "May 11, 2015",
		"ReviewTitle": "dont miss it!",
		"Review": "After the Palarong Pambansa, we wanted to visit a place where we can enjoy nature tripping so we rented a van bound to New Corella and visit the falls and hopefully one of its caves. \r \r There were a lot to see on our way there until we reached the small entrance, but since there was nobody around to ask, we opted to move on till we reached the exit. There they told us that we have to go back and enter on the other side so we will be able to see more of the eco park. But asking the others going out, they told us we could also see part of the falls there. So we proceeded even though we cannot see the higher part of the falls with a minimal fee of P 20.00. Its called \"Panas Eco-Cultural Park\" \r \r And lo! it was breath taking! There was a picnic place infront of the falls and the water, so clear! so cool! In short, everybody got wet! My daughter, whose fever subsided also went in! Couldn't resist after a hot week at the Tagum Sports Complex!\r \r Bring food and drinks for a short snack after bathing in the falls. The water was clean, nobody was able to take a shower after,but nobody felt itchy because we still had a city tour the rest of the day!\r \r Philippines has a lot of nature to offer, and Panas Falls is one of the sights you should not miss!"
	}
]
