[
	{
		"User": "rbecker72000",
		"Location": "Lenoir City, Tennessee",
		"DateofReview": "1 week ago",
		"ReviewTitle": "Great food, beautiful (but partitioned) beach, outstanding staff!",
		"Review": "Loved going to Paradise Island with my wife, her best friend and sister, and our adorable flower girl! We ate in the restaurant by the beach, and loved the seafood basket and soup but especially the fresh buco halo-halo-- which was incredible! I wish the beach had not been partitioned, but like the other beaches we saw on beautiful Samal Island, it deserves its great reputation for its beautiful white sand and water! Love the staff there, who accommodated us, along with the boat crew, while we made our way, late, back to the last ferry. On a day trip, the last ferry leaves at 5pm; important to keep that in mind!"
	},
	{
		"User": "Leah A",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "1 week ago",
		"ReviewTitle": "Lots to see and do...",
		"Review": "in this colorful resort with very good beach front. Rows upon rows of shaded tables near the beach for eating or just hanging around. And even with hundreds of people visiting at the same time, the place was kept amazingly orderly and clean.\r \r Even the bathrooms were super clean - there was an obvious effort exerted in maintaining the place.\r \r If you love the beach, then you can just laze around it. Or you can take a walk - there's a mini park with swings and seasaws; a mini zoo with quite a number of interesting animals and colorful birds on display.\r \r They have sports equipment for rent; and activities that guests can participate in like dancing or some games.\r \r All around the resort are trees, plants, colorful flowers. There was even a display of giant shell replicas for enthusiasts.\r \r Entrance fees are affordable. There is a variety of choices food-wise; they even have durian ice cream, mango pie, buko, etc. The souvenir shop is also worth checking out."
	},
	{
		"User": "cathybueno",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 23, 2018",
		"ReviewTitle": "Cleanest and most relaxing beach in Samal. Also the nearest from Davao!",
		"Review": "Even if there are lots of resort beaches emerging in Samal Island, Paradise Island Park and Beach Resort remains to be one of the cleanest, most relaxing and best resorts you can find in the island. Also, it’s the nearest beach from Davao, around 10-15 minutes boat ride (As of now the fare is 20 pesos for regular passengers and 15 pesos for senior citizens per way). Be welcomed by soothing island music played by veteran musicians at the resort’s entrance. Also, get to enjoy different Filipino and international cuisines at a reasonable price. But if you’re on a tight budget and wish to bring your own food, you may without paying for a corkage - just don’t bring whole lechon (whole pork roast) and carbonated/flavored/alcoholic drinks and the like to avoid paying fees. Also, you may bring bottled water - there’s no corkage for that. ☺️\r \r The entrance is 200 pesos per head. But I noticed that if you go in groups, they’re going to give you free consumable food vouchers or a resort ticket good for 2 persons (valid during off-peak season). \r \r Don’t expect Paradise Island Park to be a typical resort with pools and other fancy areas. But if you just want to relax and take a dip, this is the place to be. I and my family have been here several times already, and we always love Paradise!"
	},
	{
		"User": "Ardene Gay P",
		"Location": " ",
		"DateofReview": "February 10, 2018",
		"ReviewTitle": "Paradise it is!",
		"Review": "We have been going to Paradise for 16 years!\r Of course the price has gone up a lot during this time but it is just a few minutes boat ride from Davao a city of millions of people.\r What few people know is the great snorkeling there! You wouldn’t expect it being so close to a major shipping port and city. Just on the other side of the floating bamboo are well protected corals will lots of fish. You can snorkel for more than 500 yards. \r Last time we were there we spent about $50. On entry fees, breakfast, lunch and snacks during our eight hour stay. "
	},
	{
		"User": "MGoatK",
		"Location": "Cerritos, California",
		"DateofReview": "February 8, 2018",
		"ReviewTitle": "Satisfied",
		"Review": "I've been here thrice. And the last time we came here is where we spend the holy week. We stay here for 3 days and two nights. I lime the style their room. Each room with its own private veranda overlooking a manicured and fenced lawn. It's lime you're living in a small village. And one thing I also like is they offer reasonable price for their room and food."
	},
	{
		"User": "TuffyH1",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 13, 2018",
		"ReviewTitle": "Great beach resort",
		"Review": "This is my second time here, the first time was in 2000, and we had a great time AGAIN. The resort is secure- a security guard at the gate, one checking luggage, and another one \"eyeballed\" the guests of the cottages. The bellboys/staff were great, staff were always asking if you need anything, and everyone was courteous. \r The area for dining (right on the beach) had good food (most under P450/$5 per dish). The chicken dishes were a little lacking (due to very skinny chickens without much meat). There is also another area for snacks and ice cream (which was nice if you didn't want a sit-down meal). Nightly there was a very good live band, fire dancers, and a 5 minute fireworks show (maybe due to Christmas time). During the day, there was a circus act.\r There are a couple of stores; I wish I got more souvenirs, coz here I could have bought things with \"Samal Island\" on it (not just \"Davao\").\r For activities, there is a kiosk to book for many water sports, and we picked the banana boat. It was so much fun! Of course, the beach is open for use up to 7 pm to enjoy. We completely forgot about the kids' playground, bummer (on the other side of the resort).\r For relaxation, we booked massages for P500/hr each ($10/hr) person + tip, and it was heavenly. Our kids 12 and 9 yrs old, had massages too.\r For problems: Even though we had 4 people, they only give 2 bath towels (not just this resort, but pretty much every hotel in the Philippines). I guess they expect the kids to use the (2) hand towels. It tended to be pretty crowded, as it is a very popular destination for locals (due to the inexpensive day entrance fee plus the holidays). On the registration, it says you may not bring any food or drinks, but we were able to bypass this due to my son's nut allergy (but honestly, we had a lot of luggage and I don't think they would have confiscated anything at check-in).\r Overall, great experience, and inexpensive cottage rates (P3500/night, roughly $70/night). I would highly recommend because it has everything one needs, unlike other resorts on the island that have just the room/cottages, dining area, and the beach only."
	},
	{
		"User": "BenGillott",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "December 22, 2017",
		"ReviewTitle": "Great Find ",
		"Review": "Had been told about the place but we just never got around to going but kids had a long weekend so we made the trip. What a great place there was something for everyone rooms were comfortable lots for the kids to do we have two teenagers and a younger one all of them had things to do. The set up on the beach is great food is very good and the service is excellent. We will go back again only thing they don’t have is a pool but you can go without that the beach makes up for it. "
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 15, 2017",
		"ReviewTitle": "Not cheap, but worth it!",
		"Review": "Getting here is easy, just ask any taxi driver to take you to the Paradise Island private port which is directly across the water from the resort, only costs 20 PHP and is far easier than going across on the ferry and travelling down.\r Entrance fee is 200 PHP per person, even for young kids! \r Their are plenty of helpful staff around and they are very helpful and pleasant. There are BBQ areas for those on a budget and large restaurant areas along the beach front for those with deeper pockets.\r The food is not too expensive but certainly not cheap, however it is top quality, we ordered about 6-8 dishes and they were all excellent.\r \r We had heard from locals that when the tide is out the beach becomes muddy and the water is too far away to enjoy. We checked the tide times before choosing a day to go, I'd suggest this to be a top tip if you have had this problem.\r \r Lastly, the resort also has fantastic children's playground, kayaking and bird sanctuary area, toilet/shower facilities are the best I have seen in the Philippines.\r \r This is a fantastic place to spend a day when in Davao, if you want to spend the night, expect to pay about 4,000 PHP per night"
	},
	{
		"User": "Aya K",
		"Location": " ",
		"DateofReview": "November 6, 2017",
		"ReviewTitle": "USED TO BE BETTER",
		"Review": "The last time I was there with my wife it was better. The people were friendly and it was more like a family type place. Now the people are no where near as friendly and the resort staff just hoover over you and watch everything you do. one guy was playing with his baby son and one of the guys that just stairs at you went over like he was going to say something but did not. They also used to have good security now you could just walk through with what ever you want, the two guys barley looked at anyones stuff and I did not see ant security walking around. My younger daughter picked up some shells and a piece of rock that was on the beach; and the resort worker just kept watching it, the small rock on our table and then walked over and took it which was funny because this other worker was rakeing up the stuff and just throwing it away. I don't know what that was all about. We ended up just spending a couple of hours and left. We won't be back it's like they want your money and than you can hurry up and leave. They were doing this with everyone and it was just very strange."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "August 11, 2017",
		"ReviewTitle": "Intending a day swimming trip but decided to stay overnight.",
		"Review": "Sometime for safety sake when crossing the channel one has to decide to stay or not. the waves were high in the late afternoon in that time. We were lucky that there's an accommodation left for us. I liked it very much so i have to settle for another swim even if it is late in the afternoon. \r \r Anyway food and accommodation were more than what one expects. It gave me comfort and peace. I did get more photos at dusk and the view of the mainland too. Nice experience."
	},
	{
		"User": "streeteasy55",
		"Location": "New York City, New York",
		"DateofReview": "August 7, 2017",
		"ReviewTitle": "great day trip",
		"Review": "went for a day trip. The experience was beyond relaxing. Best for day trips and beach swimming. They actually have cottages/reservations for guests who want to spend the night in the resort. There is a 200php/pax entrance fee. The yhave their own boat to transfer people from mainland to the resort and vise versa. You have an option, to bring your own food and drinks ( but have to pay corkage for soda, and some food), or enjoy their delicious selections of menu for the right price. Great for friends and family. "
	},
	{
		"User": "darakwonxxxi",
		"Location": "Taguig City, Philippines",
		"DateofReview": "August 1, 2017",
		"ReviewTitle": "Simply AMAZING!",
		"Review": "What can I say?! They have friendly and smiling staff ready to attend to my grandma's needs every time. Their dedication to serve us better is beyond what we expected. Thank you so much. We enjoyed our stay. :) \r \r The place is very clean. Very well maintained. Plus they offer whole body massage at their Alima Spa.\r \r We have been visiting this well managed resort for about a decade and yet they continue to deliver good service time and time again. \r \r Kudos to the management and staff! We'll be back soon!"
	},
	{
		"User": "kimjaneec21",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 1, 2017",
		"ReviewTitle": "A place to relax.",
		"Review": "They have fine white sand that opt to be barefoot during our stay :) \r We stayed the whole day just chatting while enjoying their amazing food! They have Paella, sizzling sisig, calamares.... there's so many! Their durian coffee is a must! \r \r Highly recommended for those who want to unwind and be at peace."
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "July 15, 2017",
		"ReviewTitle": "Chill, beautiful view ",
		"Review": "Paradise beach is beautiful and easily accessible. You won't need to take the barge from Sasa wharf, there's a small boat exclusively for paradise beach guests that leave at a different location. We visited on a Saturday and enjoyed a live band upon entering in the morning and a show midday. \r \r Great for a day out away from the city. Beautiful view of Davao city and Mt. Apo at the back. "
	},
	{
		"User": "Yasoda D",
		"Location": "San Juan, Saint George, Trinidad and Tobago",
		"DateofReview": "July 7, 2017",
		"ReviewTitle": "Easy day trip to paradise",
		"Review": "It was very easy to get there...they have their own port near Sasa Wharf & it's only 15 pesos per person. Once you go there, the day visit pass is 200 pesos/person. The beach is not long but really well kept and there's a restaurant there with a variety of food options including vegetarian options. There's good bathroom facilities, a little bird zoo, a playground for kids & optional water sports. We went at lunch but wish we had gone earlier because the last boat leaves the island at 5pm. "
	},
	{
		"User": "deeignacio",
		"Location": " ",
		"DateofReview": "July 5, 2017",
		"ReviewTitle": "samal is a must when in davao",
		"Review": "so excited to be here that i didnt charge my phone and therefore wasnt able to take pictures. having a quick bite with the sea as a view is something else. trust me when i say you should be here. till next time samal and i'll buy power bank for sure"
	},
	{
		"User": "Princess Salvia G",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "June 22, 2017",
		"ReviewTitle": "Great place for family",
		"Review": "We really enjoyed our stay in this resort. Security is good, staff are well-trained and courteous, rooms are clean and have lots of water (there are some resorts who make you save water forcefully, but not this one ☺, lots of hot water for shower too) If they had a swimming pool this one's a winner. \r \r Food at their restaurant is great. They don't allow you to bring food inside but there's no need to bring food as they have a wide menu selection already. Entertainment during meals are great. On Saturday nights they have talented fire dancers and live band, and a guitar trio on mornings and lunch time. \r \r You can play beach volleyball, billiards, darts, giant chess at their entertainment center. My in laws enjoyed their banana boat ride. \r \r Beach is lovely but there are still some sharp corals lying around. There's still room for improvement on this one. \r \r We are a party of 10 and we all enjoyed our stay here. Highly recommended. Kudos to the management of this resort, keep it up! "
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "June 21, 2017",
		"ReviewTitle": "I been here with my girlfriend",
		"Review": "We visit this place few times, but something i need to tell. Once i swim here and then i saw dead dog in the water where i swim, so after what i saw then i say to myself i will never again go to swim here. In other hand place is ok, just if u are a white man, people on the beach will look at you as they saw the ghost. So be prepare on that. Kids even screaming saying to me \"You are so White\" :)"
	},
	{
		"User": "Mark I",
		"Location": "Leicester, England, United Kingdom",
		"DateofReview": "May 21, 2017",
		"ReviewTitle": "Most convenient Samal resort",
		"Review": "I have been coming here for quite a number of years.\r \r The main draw is that it is so convenient and quick to get to from Davao City. There is a parking area on the Davao side and the boats are very frequent.\r \r As for the resort itself, the food is reasonably priced though nothing special. In some ways the self catering area is better as it is less cramped, and there are things like sun loungers which oddly one doesn't have in the non-self-catering side, and a grilling area.\r \r For me the main pluses are convenience, reasonable price and most importantly CLEAN TOILETS AND SHOWERS!!! \r \r With the number of people, it can get rather busy, so if you want peace and quiet, I suggest you go elsewhere.\r \r Also worth pointing out to non-Filipinos who want to sunbathe - depending on the tide, most of the beach area is covered by a huge tarpaulin so if you want to sunbathe, this is not the best place.\r \r Overall, if you want somewhere exotic, this probably isn't the place for you, and there are plenty of other resorts on Samal/Talikod that are better in this respect; but the convenience is a draw, and I suppose there could be other concerns with going to more remote resorts, e.g. security."
	},
	{
		"User": "katehreena",
		"Location": "Cancun, Mexico",
		"DateofReview": "May 17, 2017",
		"ReviewTitle": "So so",
		"Review": "The photos is nothing in person. It was misleading. The food was okay, nothing special. The beach was so crowded. The only good thing is they have a direct pump boat from the resort to the city."
	},
	{
		"User": "Marianit M",
		"Location": "Sweden",
		"DateofReview": "May 16, 2017",
		"ReviewTitle": "Best friend vacation",
		"Review": "I've been a fan of this resort for so long already. I brought my brothers here, I even stayed couple of nights here with my husband, and I decided to bring my best friend here also. It is a very family-friendly resort and there's a...More"
	},
	{
		"User": "jdglyde",
		"Location": "Brisbane, Australia",
		"DateofReview": "May 4, 2017",
		"ReviewTitle": "Nice place",
		"Review": "Went to paradise beach with friends for the afternoon , Nice place be great for kids to swim and parents sit down lunch drinks and enjoy the view with pleasant back round music with band ,, Lot of water sports there snorkeling , jet ski...More"
	},
	{
		"User": "Roxy604",
		"Location": "Vancouver, Canada",
		"DateofReview": "April 27, 2017",
		"ReviewTitle": "This is a beach resort done RIGHT!",
		"Review": "This place is amazing. It’s a massive property. In it, they have – private parking, a mini aviary and zoo, playground, and the rooms are spread out in the property. There is a big outdoor, covered restaurant area divided into two – one with service,...More"
	},
	{
		"User": "mad2live",
		"Location": "St. John's, Canada",
		"DateofReview": "April 26, 2017",
		"ReviewTitle": "Prison Island",
		"Review": "The exorbitant prices and outrageous regulations governing every aspect of a guest's stay at this \"resort\" made it one of the worst holiday experiences of my life. We were greeted by soldiers with machine guns, who promptly searched all our things and demanded a 500peso...More"
	},
	{
		"User": "Cecile K",
		"Location": " ",
		"DateofReview": "April 5, 2017",
		"ReviewTitle": "One of the best! ",
		"Review": "We didnt expect, but it was one of the best family trips! Vanishing island was my favorite part 👌🏾 as well as the taklobo tour. Hope to be back soon to explore more of Davao 😊"
	},
	{
		"User": "felixbanting",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "March 30, 2017",
		"ReviewTitle": "My fave beach in Davao",
		"Review": "Been to Davao frequently, and everytime I go, i manage to sneak in a day or 2 just to chill at Paradise Island Beach resort. Very clean, great food, value for the money, great entertainment at all times, and most of all, staff very friendly....More"
	},
	{
		"User": "lindaeddie",
		"Location": "Ponte Vedra Beach, Florida",
		"DateofReview": "February 28, 2017",
		"ReviewTitle": "Paradise",
		"Review": "Beautiful, relaxing, private beach resort. Spacious rooms with a/c. There is an all day band, large assortment of food, friendly staff, free wifi, and handicap friendly."
	},
	{
		"User": "Rainbowtravelgirl",
		"Location": "Amsterdam, The Netherlands",
		"DateofReview": "February 21, 2017",
		"ReviewTitle": "Wow !",
		"Review": "Colorful ambiance. Fine beaches. Clean eating places. Gracious personnel. Good food. Very rustic provincial feeling. Love it here. A motor boat will bring you here for 15. pesos per person from the mainland. When in Davao City, taste a simple paradise here . It is...More"
	},
	{
		"User": "Yma C",
		"Location": " ",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "A real paradise",
		"Review": "Very clean beach resort. The food was great and I love that there was a band that provided beautiful music."
	},
	{
		"User": "Irene F",
		"Location": " ",
		"DateofReview": "February 5, 2017",
		"ReviewTitle": "pleasure amid a business trip",
		"Review": "we took a quick detour in samal island when we conducted a workshop last year in davao city. ferry took us only 15 minutes to get there and paid a measly entrance fee and we have the entire island park to explore.\r \r we combed the shore for as far as we could, took a short swim, did a mini-ocular of the amenities being offered, had a rush shower and grabbed a quick bite before heading back to our hotel around noon. it was the fastest fun nature adventure i did in my adult life."
	},
	{
		"User": "Rea S",
		"Location": " ",
		"DateofReview": "January 27, 2017",
		"ReviewTitle": "Great",
		"Review": "Amenities of this place never fails me. They have great staff that would accomodate your needs. Their beach is nice too. If you wanna go snorkelling, you can find different kinds of marine life and corals. You can also feed the fishes near their docks. Provided you have your own bread. Haha.. They also have a mini zoo and playground so children can play there. Havent tried their rooms yet though. Always on daytour when visiting this resort."
	},
	{
		"User": "Maria Gracia M",
		"Location": "Cainta Rizal",
		"DateofReview": "January 20, 2017",
		"ReviewTitle": "Will come back again!",
		"Review": "Well, we went here summer last year as we tour Davao City and the place is really wonderful. It was just a 10-15 minutes boat ride for a P15 fare and after that, you'll be there. The entrance fee is around P200 . We just had a day tour and took a dip and we're done. During morning (low tide) the water can go as low as heel level from the shore, and there's a line where you can only swim. You need to wear googles if you wanna go further for snorkling. There's an area where you can feed the fish and I think its enjoyable for kids. We haven't tried the food but it looks promising. The next time we come back, we will try to stay overnight so we can experience what the resort is about to offer. And yes, I think they are not too pricey. You can get a room for as low as P4k so its really worth it."
	},
	{
		"User": "thinkaround",
		"Location": " ",
		"DateofReview": "December 20, 2016",
		"ReviewTitle": "Its okay. ",
		"Review": "We went there for lunch and swimming. The food was okay, but not more. Staff was okay, it tought they were not really motivated. And they made it more touristic since we was there 2 years ago. Its ok to take a swim, to eat something, but we would never stay for a longer time there. "
	},
	{
		"User": "Samy N",
		"Location": " ",
		"DateofReview": "November 24, 2016",
		"ReviewTitle": "Day Dive ",
		"Review": "I've been there at June 2014 I do scuba diving from the beach exactly in front of the resort - Amazing corals and underwater life"
	},
	{
		"User": "tonyangbee",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 17, 2016",
		"ReviewTitle": "A very good place for beach bonding",
		"Review": "Our family usually comes here for quick weekend getaways. Not just because its less than 10 minutes from their port in davao but this place is affordable and relaxing. We even go there sometimes for breakfast and quick dip on the sea then go home before lunch. They also have good customer service and they keep the place clean. \r \r Aside from the beach, they also have a playground for the kids, a massage spa and you can also bisit their aviary (though there are also other animals there and not just birds). And during weekends there is a free carnival show at lunchtime for kids that even adults enjoy. You will also get serenaded by their oldies band while taking your meals and enjoy the fireworks at night time before hoing to sleep.\r \r The food in their resto is yummy to especially the paella If you're planning to go therr just for the day without bringing any food, you can stay there at their resto (with wifi!) but be sure to go there early so that you can have a table near the beach. You can also bring your own food there but with corkage ofcourse! If you wanna stay overnight, you can stay at their cottages (quite pricey and no hot shower there) and even request to have your meals at your room/cottage. Or you can choose the option of sleeping on a tent along the beach too.\r \r This resort also has a dive center and a dive spot infront of it. Do try it and meet the mermaid sitting on a big clam beneath.\r \r Do visit this place for alot of activities at a good price. A very good place for friends and family to bond, unwind and have fun."
	},
	{
		"User": "Hanzo_83",
		"Location": "Quezon City, Philippines",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "Clean, Spacious, Secure, Safe.",
		"Review": "The place is good for couple up to large groups. They cater to company events as well. Their beachfront is pretty secure, there are lifeguards and security guards roving the place all the time.\r \r The one thing they can improve on is the food. It's not that great. Too pricey as well. And you gotta pay for everything, even water, ice and the utensils."
	},
	{
		"User": "edikdak",
		"Location": "SJDM City",
		"DateofReview": "November 2, 2016",
		"ReviewTitle": "Once in a Paradise Island - Samal Isaland",
		"Review": "We liked the ferry / wharf terminal :D its our first time to ride the bardge, and its just P10 for making a transfer!!! Super ideal my kids loved it a lot!!!\r Upon arrival, we walked after the trycikel terminal and get a ride from a hablhabal (motorcykel for just P20/pax)\r Entrance is P200 with a very beautiful beach, nice food to each, very fresh!!!"
	},
	{
		"User": "Kjell L",
		"Location": " ",
		"DateofReview": "October 20, 2016",
		"ReviewTitle": "One of the best resorts in samal",
		"Review": "Been here so many times and always happy with service and rooms. The place have a good beach and keep it clean as rest of the resort. The employees is also the best I met in samal. Restaurant and room service is also good, life bands every day and night. But however the foods is not same class, don't miss understand you don't need go hungry to bed. The other thing there is there isn't pool, but plenty space for it. I always bring my friends from abroad here as first time visit."
	},
	{
		"User": "C W",
		"Location": "Melbourne, Australia",
		"DateofReview": "September 19, 2016",
		"ReviewTitle": "Paradise!",
		"Review": "I visited this beach when I stayed with family earlier this year and it was such a great day. There was so much going on at the resort with performances to keep the crowd entertained and the food from the cafe was delicious! I was one of only a few foreigners at the resort so it felt like a little piece of paradise that the world has still yet to discover."
	},
	{
		"User": "cheryl b",
		"Location": " ",
		"DateofReview": "September 8, 2016",
		"ReviewTitle": "Vacation",
		"Review": "Good and nice place... Nice cottages Nice view, Good security Can't wait to visit again soon this year"
	},
	{
		"User": "AER84",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "Brought a friend",
		"Review": "I always love going to Paradise Beach. It is literally 15 minutes away from the city. You can get the beach ambience and have fantastic food within minutes. It takes you away from the city noise. Kids will simply love going there to swim and...More"
	},
	{
		"User": "Darryl G",
		"Location": " ",
		"DateofReview": "August 10, 2016",
		"ReviewTitle": "Beach fun quick fix",
		"Review": "Whenever I need a quick fix for my urge to take a dip in the beach, this is the place I usually go. It's very accessible, no need to ride that stressful barge to get across samal island. Ferry is readily accessible and entrance is...More"
	},
	{
		"User": "rowena_morin",
		"Location": "Richmond Hill, Ontario",
		"DateofReview": "August 1, 2016",
		"ReviewTitle": "Average resort in Davao",
		"Review": "The only resort near Davao City, P1500 by taxi and free boat ride. If you need to stay away from the city for a day or less this is your option. It is still crowded and commercialized but water temperature is refreshing"
	},
	{
		"User": "Dale C",
		"Location": " ",
		"DateofReview": "July 30, 2016",
		"ReviewTitle": "Nice view",
		"Review": "This resort was recommended by many locals. I have to say that I was impressed by the cleanliness of the place. The water is nice and the view is great. Overall, I have to say that I liked my visit."
	},
	{
		"User": "Aiza E",
		"Location": "Antipolo City, Philippines",
		"DateofReview": "July 4, 2016",
		"ReviewTitle": "Nice resort",
		"Review": "The rooms are nice but because we're a group of 4 with a kid, we booked 2 rooms they don't have family room, the rooms are nice with basic amenities the hotel also has a mini zoo that the kids can enjoy, at night they...More"
	},
	{
		"User": "Me-ann M",
		"Location": " ",
		"DateofReview": "June 6, 2016",
		"ReviewTitle": "Superb Cleanliness and Very Warm Staff",
		"Review": "This is the best place to go when in Samal island!!! I am amazed on how the place is kept perfectly clean - all day! They even have flowers in side the room and the bathroom. The beach is also superb! You need not to...More"
	},
	{
		"User": "Mick B",
		"Location": "Southampton, United Kingdom",
		"DateofReview": "June 5, 2016",
		"ReviewTitle": "A great day out",
		"Review": "What a wonderful resort, very good food and drink at reasonable prices. Lovely grounds to have a stroll around, with a mini zoo. Beautiful beach, and entertainment throughout the day. They also have bungalows for longer stays."
	},
	{
		"User": "Jandrew G",
		"Location": " ",
		"DateofReview": "May 10, 2016",
		"ReviewTitle": "paradise island resort",
		"Review": "just 15min across davao. entrance P200/head..white sand, birds, crepe, halohalo, durian coffee.. cleanest beach iv been"
	},
	{
		"User": "Watercooled",
		"Location": " ",
		"DateofReview": "April 21, 2016",
		"ReviewTitle": "Weekend visit",
		"Review": "This is a busy resort beach. The service is exceptible and the food is very good but it is crowded and lacking anywhere to lounge. Lockers are available if your doing activities like jet ski or snorkel. The beach is a little ruff so bring...More"
	},
	{
		"User": "rossiel t",
		"Location": " ",
		"DateofReview": "April 19, 2016",
		"ReviewTitle": "Amazing Beach",
		"Review": "Pure white sand beach, great food,amazing band,relaxing and its a haven for anyone who wants to be alone or enjoy with friends..the one thing i didnt like is that when low tide comes the water evaporates...just go in the morning for the best experience.. ^_^"
	},
	{
		"User": "Cholo R",
		"Location": " ",
		"DateofReview": "March 8, 2016",
		"ReviewTitle": "⭐️��⛵️EXCELLENT⭐️⭐️⭐️⭐️⭐️",
		"Review": "This place is absolutely amazing. The friendly staff is out of this world. Very well maintained beach. The food is divine and live musicians serenading while you eat, a Golden buzzer. Definitely going back here. KUDOS to the management and staff."
	},
	{
		"User": "hyperhobbit07",
		"Location": "Santa Barbara, California",
		"DateofReview": "February 26, 2016",
		"ReviewTitle": "Beautiful place to unwind for a day",
		"Review": "The water is such a stunning shade of blue! There are tiny shells along the waters edge to collect and there is an assortment of casual food to eat at the picnic table by the water. It's a great afternoon getaway!"
	},
	{
		"User": "Jay S",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 25, 2016",
		"ReviewTitle": "Try This Place On Weekdays",
		"Review": "I love this resort but hate when it is packed. The benches are limited and space isnt exactly great so weekends and holidays are a nightmare. Spending a night here outdoors is a great experience too. Just watch out on the corkage fees on some...More"
	},
	{
		"User": "JELN24",
		"Location": "Makati, Philippines",
		"DateofReview": "February 17, 2016",
		"ReviewTitle": "Commercialized ",
		"Review": "Spent a night here with friends. This resort is probably better suited to family trips. The area is big enough, but there are way too many tables and chairs that it was difficult to go about the place. The food took a long time, as...More"
	},
	{
		"User": "GraceJ1",
		"Location": " ",
		"DateofReview": "February 10, 2016",
		"ReviewTitle": "Enjoying the beach ",
		"Review": "I Been in this place few times on of my favourite distenation for swimming with kids white sand very clean elagant resort affordable price very relaxing lots of games , theirs a garden like paradise with few animals , me and my mum had a...More"
	},
	{
		"User": "Mark J",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "February 9, 2016",
		"ReviewTitle": "Okay stay, but with one lingering doubt",
		"Review": "Paradise Island was okay. The room was comfy; the beach, pleasant; the restaurant entertainment, nice; and the food, good. Wasn't blown away by anything but it was worth a visit. Here's my main concern. I had paid for a premium room (3,900 php) but have...More"
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "February 8, 2016",
		"ReviewTitle": "I like Samal Island",
		"Review": "What bad can i say about Samal? Nothing at all I love Samal island . If you are in Davao believe me you should come to visit Samal and you will enjoy in every second being here."
	},
	{
		"User": "Sabrina T",
		"Location": " ",
		"DateofReview": "January 29, 2016",
		"ReviewTitle": "Surely it's a paradise <3",
		"Review": "I live in Davao City, from there you will ride any vehicle like jeep or taxi and the driver will drop you out in the the SASA Port. There were men who will assist you to carry your things as to wait for lantsa or...More"
	},
	{
		"User": "James G",
		"Location": " ",
		"DateofReview": "January 1, 2016",
		"ReviewTitle": "Equipped day resort with good food",
		"Review": "Visited Paradise Island 6-7 times over the past few years and it consistently provides decent food, clean facilities, cold beer and all at a fair price. Would recommend for a day or half day, but call ahead if u want to book a jetski...keeps catching...More"
	},
	{
		"User": "Paul E",
		"Location": "Cassadaga",
		"DateofReview": "December 25, 2015",
		"ReviewTitle": "My kind of paradise!",
		"Review": "Me and my fiancé went for a day visit here and I'm glad we did. Beautiful white sand, clear water, great little band that I couldn't stop listening to. Beautiful bird exhibit. Nice location for a romantic getaway, next time I may book a room in the resort. "
	},
	{
		"User": "pixiedust010",
		"Location": "Singapore, Singapore",
		"DateofReview": "December 25, 2015",
		"ReviewTitle": "All time fav getaway",
		"Review": "It's our family's favourite getaway from the buzzling city. The water is just right next to your feet, you can watch your kids play on the shore. Food is great although it's a bit expensive however its reasonable. The resort has mini zoo and playground. I hope they will add swimming pool soon."
	},
	{
		"User": "PauTheCarabao",
		"Location": "Makati, Philippines",
		"DateofReview": "November 20, 2015",
		"ReviewTitle": "Nice day trip to Paradise",
		"Review": "My friend and I went here on a whim, which was perfect because Paradise Island is so accessible from Davao city. \r \r We took a cab to the ferry station where a small boat leaves every 15-20 mins or so. The boatman waits for the boat to be filled with 10 passengers, but you can have it chartered for yourself for P150 like what we did (if you're a bit impatient like us lol). Anyway the point is the boat fare is cheap at P15 per person. \r \r Upon arrival at Paradise Island, we were greeted by musicians, which added to the ambiance. There's actually an entrance fee of P200, I honestly don't know what it's for because they didn't give us towels or anything; the island is basically just a strip of white sand with restaurants and tables. \r \r I don't want to say that it's exploitative, I understand that people need to earn money, however, I would've preferred that Paradise Island to be not as as commercialized and tourist-y. They even have outdoor grilling stations and an area of the beach is off limits exclusive for overnight guests only. \r \r The sand is white but a bit rocky, bring aqua socks if you can. But the water is clear, cool, and refreshing. Not bad. Not bad at all. "
	},
	{
		"User": "aeinosante",
		"Location": "Laguna Province, Philippines",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "Powdery soft sand",
		"Review": "The first thing I noticed and admired in this place is the powdery soft sand in their beach. Absence of rocks and crushed shells on the beach makes it very comfortable to walk on. Building sand sculptures is also easy with the very manageable sand. The swimming area is spacious and most of the beach side is covered with tarp roofing so you can enjoy the sand even in the high noon heat.\r This resort also have a lot of water activities such as kayaking, banana boat, jet skiing and a lot more. Billiard tables, ping pong, darts and giant chess are also available. Their restaurant has live band that sings beautiful songs while you eat. And at night, there are fire dancers and fire works display. A very nice experience overall, would definitely come back to this place."
	},
	{
		"User": "lanaval",
		"Location": "Manila, Philippines",
		"DateofReview": "November 16, 2015",
		"ReviewTitle": "Clear water",
		"Review": "We went here early in the morning for a swim. The water is so clear and safe for children and those who do not really swim well because it has installed floaters to warn swimmers of the deep part. The area is really big to accommodate large groups with sufficient restaurant tables and park areas to explore. Food can be ordered and eaten at the beach front tables. The shower areas are clean. It has its own boat station so going there and leaving is easy. The staff were also very helpful and friendly."
	},
	{
		"User": "Ottawa_uhl",
		"Location": "Ottawa, Canada",
		"DateofReview": "November 11, 2015",
		"ReviewTitle": "Paradise lost",
		"Review": "I don't want to be too hard on the current highly commercialized iteration of Paradise Island. My gang and I used to go there when it was called Rodriugez Beach, there was no admission, you brought your own beer, and if you were nice to the locals one of them would scale a coconut or papaya tree and set you up with fresh fruit. That was real paradise. \r Today's version is somewhat less idyllic, a bit over commercialized, but no doubt the place is a money maker. It still has the essential ingredients, of yesterday years a white sand beach and warm clear blue waters. But they have added infrastructure, toilets, a kitchen and hotel rooms. While I preferred the more austere and less populated beach of the past, it is still worth the bangka ride to Samal Island. A great place to enjoy the sun sea and sand. "
	},
	{
		"User": "RobandMaryJean",
		"Location": "Jerrabomberra",
		"DateofReview": "November 6, 2015",
		"ReviewTitle": "A favourite place to visit for our family",
		"Review": "We enjoy being able to eat good food on the beach while looking at Mt Apo, ships passing by and Davao's lights. There is plenty of choice with accommodation and service is always very good."
	},
	{
		"User": "msdawna",
		"Location": "Walnut Creek, California",
		"DateofReview": "October 9, 2015",
		"ReviewTitle": "Nice breakfast excursion",
		"Review": "Finished work at 9am and headed here for a relaxing breakfast/lunch. Good news that it was mid-week and not crowded at all. Understand from locals that it is packed on weekends. Food was fresh and delicious - especially the fish. Drinks were small and mostly lukewarm - but that's typical of this area. The bird sanctuary is very quiet and peaceful - could have taken a nap there - but had to get back to work. "
	},
	{
		"User": "Vince M",
		"Location": " ",
		"DateofReview": "September 24, 2015",
		"ReviewTitle": "Le Paradis!",
		"Review": "A wonderful haven just across the mainland Davao City. Full of amenities good for the whole family. It is just a place outside the city."
	},
	{
		"User": "bulakbol76",
		"Location": "Cebu City, Philippines",
		"DateofReview": "September 14, 2015",
		"ReviewTitle": "a surprise and a treat",
		"Review": "i was not expecting what a surprise and treat Paradise Island Park would be. very organized from the jump-off on Davao City side, the quick boat crossing, entry to the resort, and use of facilities. everything is very well thought of and organized, safety and order being on top of the priorities. every where is very clean, staff are very courteous and attentive. consequently, it was a very pleasant day trip and we enjoyed sitting on the benches and at the beach, swimming in the water, and eating our food. order took 45 minutes (they did warn us ahead), servings were generous and prices were reasonable. shower facilities are onsite, even swimwear and toys in case you forget yours. all you really need to bring is yourself and a readiness to have a good day."
	},
	{
		"User": "Jarjar20",
		"Location": "Manila, Philippines",
		"DateofReview": "September 1, 2015",
		"ReviewTitle": "Good",
		"Review": "We went on a day trip to have lunch and to check out the beach. It was a Sunday of a long weekend, and by the time we arrived at around 11am, there was still some good tables available. Food took some time before it was ready to serve, so please order early on. Same goes for the bill. Food was ok, with generous servings, and cost was reasonable. \r Children and adults have the same rate for entry into the resort. Bring towels because they don't have towels for those on a day trip (they have towels for sale at the souvenir shop). Restrooms were clean and had the minimum necessities. There were boat shuttles coming in and out of the resort every 15-30minutes or so. "
	},
	{
		"User": "Skingen",
		"Location": "Singapore",
		"DateofReview": "August 25, 2015",
		"ReviewTitle": "Great Get Away From Dusty and Jammed Davao Streets",
		"Review": "Great all day relaxing getaway from the busy streets of Davao City. Live music with different bands of great talents played all day from 11 AM. Good food served by very friendly staff - cold beers or any other drinks served. White sandy beach is great just a few meters away from the seating arrangements - water is good and appears clean with staff picking litter.\r Paradise Island provides ferry service between 5.30 AM and 5 PM the latest ferry leaving the island.\r Great concept - highly recommended day trips to the island if in Davao on business or leisure. "
	},
	{
		"User": "MrMBerman",
		"Location": "Manchester, United Kingdom",
		"DateofReview": "August 22, 2015",
		"ReviewTitle": "Truly a taste of Paradise!",
		"Review": "Aptly named Paradise Island as it doesn't disappoint....Beautiful as ever, safe for foreign tourists and the cottages are a must-try..."
	},
	{
		"User": "Gem M",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 31, 2015",
		"ReviewTitle": "Breakfast at Paradise Island in Samal Island, Davao",
		"Review": "A visit to Davao City is not complete without breakfast time at Paradise Island Resort just across the Davao Gulf. At 7am from downtown Davao City, we took a jeepney to Sasa (around 15pesos). Asked the driver to drop us off where we can take the banca (small outrigger boats) to Paradise Resort. There was a security guard manning the parking lot, he directed us to the bancas. We walked about 50 meters along a small canal by the fence of an oil depot towards the beach where the bancas are dispatched.\r The bancas can carry about 20 passengers and it costs 15 pesos per head to cross the channel. We had to walk the plank (ha ha that was fun) to get in and off the banca. Bancas had life jackets ready and the boatmen tell us to wear it. Some people didn't, cause they said, \"Samal is too near. If we get into an emergency, we can simply swim to the shore.\" But I wasn't taking any chances, my kids were with me.\r However, some life jackets had seen better days.\r The 15 minutes ride to the resort was nice and breezy. As we approached, we saw several flaglets waving in the wind as if welcoming us to Paradise!\r Entrance for daytour was 150pesos. \r The beach was white sand. The clear blue waters was shallow enough for the kids. I could just sit on the shore and let the small waves wash over me. Wading along the breakwaters, you see several small fishes swimming along. \r We brought our own breakfast so we got tables further down the beach. There was a restaurant area though. Tables had benches on each side and a lounging chair which the hubby claimed for himself the whole morning. Our beakfast was fried rice with boneless bangus, hotdogs, scrambled eggs with tomatoes and onions and some local rice cakes- puto, bibingka, and ripe mangoes. \r By 10am, the sun was getting too hot, so we rode a banca again back to the mainland of Davao City. It was a beautiful day in Paradise."
	},
	{
		"User": "dorabelladc",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 26, 2015",
		"ReviewTitle": "beach adventure with kids",
		"Review": "It is where you can be in the beach and enjoying water fun activities like, aqua bike , banana boat, jet skiing and also enjoying their nature trails with water animals, Land animals and flying animals too. where kids can enjoy play park and all of nature wonders and enjoying the beach pack all in one and it is just a 15 minute boat ride"
	},
	{
		"User": "KristleGoes",
		"Location": "Tel Aviv, Israel",
		"DateofReview": "July 22, 2015",
		"ReviewTitle": "Fun family day",
		"Review": "Not exactly Paradise but a great way to unwind and relax, took the whole family and a fun day was had by all. Great soft sandy beach, good facilities, tasty food and the best Pineapple juice ever! Not cheap but value for money."
	},
	{
		"User": "6452",
		"Location": "Makati, Philippines",
		"DateofReview": "July 10, 2015",
		"ReviewTitle": "Great",
		"Review": "What I love about the place is it's very accessible. Just a 10-15min boat ride from the mainland of Davao. The food was amazing plus the live band playing as the background adds a more relaxing ambiance. It's the nearest resort so expect a number of people when you visit. The beach is fine, nothing really special. But the ambiance is really great. Plus there's a lot of water activities that you can try :)"
	},
	{
		"User": "Davao City, Philippines",
		"Location": " ",
		"DateofReview": "July 3, 2015",
		"ReviewTitle": "quick escape from city life",
		"Review": "we went there to have lunch and their food surprised me.the taste was good for a reasonable price! plus the live band performing as we eat.fresh air.nice scenery.\r we arrived at 1pm and left by 4:30 pm.\r it was really a quick escape but it's worth it.\r and they accept credit cards too!!!!! :)))))))))))\r we had seafoods and buko salad. yum. :)"
	},
	{
		"User": "CdoLzl",
		"Location": "CDO",
		"DateofReview": "June 24, 2015",
		"ReviewTitle": "family vacay",
		"Review": "this is a very nice place for family vacation...not so expensive and offers more time to go noght swimming in the beach..the place is clean."
	},
	{
		"User": "redgoglac",
		"Location": "Welshpool, United Kingdom",
		"DateofReview": "June 15, 2015",
		"ReviewTitle": "A Trip To Paradsise Island Beach Resort in a Philippine Banca",
		"Review": "A banca is a traditional Philippine outrigger. (see video: https://www.youtube.com/watch?v=oSVOtDF5AS4) This boat trip from Davao to Samal Island is only 15 pesos each way. When we arrived we were serenaded by four Filipino troubadours. Great beach when the tide is in and you can either...More"
	},
	{
		"User": "Yecatsmh",
		"Location": "Pakenham, Australia",
		"DateofReview": "June 5, 2015",
		"ReviewTitle": "Paradise",
		"Review": "Absolutely beautiful place, Food great, pools and beaches all clean, bungalows over water need a bit of work but are still comfy. Lots to do."
	},
	{
		"User": "Crisel D",
		"Location": "toronto",
		"DateofReview": "May 13, 2015",
		"ReviewTitle": "highly recommended!",
		"Review": "excellent white sand beach, excellent staff, and they have a lot of boats to transport you back and forth to the island if needed. GOOD FOOD! I loved their halohalo and banana fritters. very reasonable price for the main course."
	},
	{
		"User": "Kate N",
		"Location": "Makati, Philippines",
		"DateofReview": "May 5, 2015",
		"ReviewTitle": "Need to return here",
		"Review": "Went here on a Sunday with family as early as 6am. It was good to be early as the place tends to be jampacked by the hour. If you want to swim, swim early as the tide gets low around 8-9am and returns around 2-3pm....More"
	},
	{
		"User": "tbose",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 23, 2015",
		"ReviewTitle": "Attention: The Manager",
		"Review": "I have no question with the place, amenities and the food. My only concern is the receptionist named Kim. She must be friendly and warm in accommodating inquiries and reservations. She must have a tone of respect not rude and dry in talking to a...More"
	},
	{
		"User": "supladitaTalaga",
		"Location": " ",
		"DateofReview": "April 22, 2015",
		"ReviewTitle": "Favorite beach resort when in Davao!",
		"Review": "We've been going here since I was in high school. The resort has come a long way from what it used to be. The cottages are comfortable and nice. The restaurant offers delicious food. There's a mini zoo and playground for the kids to enjoy....More"
	},
	{
		"User": "Patrick B",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 7, 2015",
		"ReviewTitle": "great for relaxing",
		"Review": "Been coming here since we were kids, and a lot has changed. But, the beach is still well maintained the water is still crystal clear and clean. Great for all types of water sports, the playground is a great place to hangout when it's low...More"
	},
	{
		"User": "ImeeAala",
		"Location": "Tagum City, Davao, Philippines",
		"DateofReview": "January 14, 2015",
		"ReviewTitle": "\"A MUST COMEBACK VISIT\"",
		"Review": "I was amazed of the big changes of this resort. We were here 3 years ago when my stepson had his short holiday. The place had a nice make over. We were nicely accommodated by their staff, and they even reminded us to avail of the discount for a senior citizen. I love the rooms cos we had slept well feeling the comfort as if we were sleeping on our own bed. We enjoyed the foods and the serenade while we were eating. Overall, we're satisfied of our short stay, and planned to celebrate our 30th wedding anniversary at this resort."
	},
	{
		"User": "RomanesinAsia",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 26, 2014",
		"ReviewTitle": "We keep going back",
		"Review": "Very convenient beach resort for a one day visit, or to stay overnight. We have done both. Wheter you just want to relax, listen to nice live music, or are into water activities, this is the perfect spot, and it is only a few minutes boat ride from their own Davao place, They keep the beach very clean, and most of the time (depends on tides), the water is pristine clear.\r Food is good, and the menu is very extensive, but be patient, because it takes more time than normal to be served. Seafood and paellas are our favorites. Try the fried fish.. and by the way, beers are always cold! Very good value."
	},
	{
		"User": "KL_Arnibal",
		"Location": "Panabo City, Philippines",
		"DateofReview": "November 16, 2014",
		"ReviewTitle": "Banana Boat experience",
		"Review": "Anyway, it was my first experience riding the Banana boat. First it was a slow ride just making sure we get used to our position on the boat. It was really COOL! Get to see a nice view of the Paradise beach and the sea. \r After a few while the driver of the Jet Ski Boat started to speed up and it started to get more fun. \r \r I could feel the wind as the speed increases. Then suddenly the driver took a tight turn and we're all like screaming like maniac as we hold on to the handle bars on the Banana boat with a great effort. We all failed and we literally flew off the Banana boat and splashed into the sea. \r \r Actually I was hoping to be thrown off the Banana boat again cause it was FUN. Finally, the ride ended and we have to get back to the shore for another group to ride. It was a reckless and crazy ride but it was AWESOME! I totally am into water sport activity! I LOVE IT."
	},
	{
		"User": "treeman52",
		"Location": "Syracuse",
		"DateofReview": "October 30, 2014",
		"ReviewTitle": "Very nice to stay",
		"Review": "This is a must for either a day or over night or over several nights. This is a very nice resort. Very clean and many things to do and see. They have scuba diving, snorkeling, small boats for the beach area and several other things to see and do. They are very attentive to guests wants and needs. The food is very good. This is nice for couples our families or even groups. Th prices are very reasonable. And it is nice to get away from Davao city life even it is for just 1 day. "
	},
	{
		"User": "gabbyxiu",
		"Location": "Surabaya, Jawa Timur, Indonesia",
		"DateofReview": "September 6, 2014",
		"ReviewTitle": "Amazing beach and beautiful in Philippines",
		"Review": "Firstly, I ride boat to Paradise Island. Thats on monday so have a few visitors. I paid 600PHP/person and enjoyed whole day in beach ^^.. nice place, have a traditional life music. This place is good for snorkling.. clean beach .. have a play ground for kids"
	},
	{
		"User": "marie grace d",
		"Location": "Manila, Philippines",
		"DateofReview": "July 14, 2014",
		"ReviewTitle": "child-friendly resort",
		"Review": "i rode with my dear friend and her 11 year old son in what we call, \"lantsa\" (boat) to samal island which is just a very short distance away (15mns or so,and for only P15.00/person) from the main island of davao city in davao del sur province in mindanao,philippines. \r \r from samal island pier,we rode a trycicle to one of the numerous resorts in the island, paradise island park & beach resort. they have a charming mini zoo inside and large garden with orchards. the place is wide enough for kids and adults as well to play around.they have long and wide hut for visitors to sit and enjoy their sumptous meal and yes,they have a good singing band as well. the sands along the shore line are okay though, when you enter the water make sure you wear your swimming sandals because of the sharp corals which is so uncomfortable and really painful to the feet."
	},
	{
		"User": "pipobeng",
		"Location": "Birmingham, United Kingdom",
		"DateofReview": "June 17, 2014",
		"ReviewTitle": "A day in paradise",
		"Review": "Its such a surprise. Went for a day to eat lunch and have a frolick in the water for a day. \r The place is very clean and well maintained. The food in the restaurant is excellent and the service is very good and attentive.\r The price is affordable too not too expensive.\r Keep it up well definitely spread the word."
	},
	{
		"User": "zooq",
		"Location": "Quezon City, Philippines",
		"DateofReview": "May 17, 2014",
		"ReviewTitle": "Lush Tropical Paradise",
		"Review": "One of the more well-known resorts in Davao is Paradise Resort located in Samal Island. To get there, we took a 15-minute boat ride from Sasa port. Upon arrival at the dock of the resort, we were welcomed by a staff and escorted to the reception counter located along the beach. The resort’s open-air restaurant is also along the same beach area so the beachfront area is rather reduced. \r \r The restaurant itself had a laid-back atmosphere with sand on your feet and live bands playing at night. The resort is popular for day tours and thus there’s usually a beehive of activity during weekends and holidays. \r \r The food in the restaurant was good and prices were reasonable. There was free Wi-Fi in the restaurant area. There was another section in the beachfront where the guests brought their own food – these were mostly the ones on day tours.\r \r The cottage areas were spacious and comfortable, located along well-paved walkways amidst lush landscaped gardens. One feels like one is in a tropical paradise surrounded by lush well-maintained greenery. It is a pleasant place to just laze around. One can opt to relax inside the room and watch any of the cable channels or take a dip in the beach or ride the kayak. \r \r There was a small aviary and mini zoo, a volleyball area, and kid’s playground. For those staying for more than a night and don’t want to swim, there are options for side trips to places like the Bat Cave and Hagimit Springs."
	}
]
