[
	{
		"User": "tsbSeattle",
		"Location": "Seattle",
		"DateofReview": "March 11, 2018",
		"ReviewTitle": "Meh....sad to say, but over rated i think....",
		"Review": "I really wanted to go here after reading other reviews, but other than pose for some pictures and a nice walk.... not much is here. I guess if you have small children this is the place to go and let them play, but I was bored in 5 minutes. So I guess a mixed feeling."
	},
	{
		"User": "leli G",
		"Location": " ",
		"DateofReview": "March 4, 2018",
		"ReviewTitle": "Cool place ",
		"Review": "We visit people’s park at around 1-2PM when we went inside the place is cool. We stayed for a while and let our son play in the playground its nice that they have this kind of place in Davao where people can just relax. And its nice that they maintained the place so clean. "
	},
	{
		"User": "Amani C",
		"Location": "Caloocan, Philippines",
		"DateofReview": "March 1, 2018",
		"ReviewTitle": "needs to be rennovated",
		"Review": "Good for a morning or night walk but seems like the park has more to offer but not maintained well esp for the lights at night which I think they should have added more. Looks old and needs some upgrading. Though its for free, I believe because there's nothing to do there we haven't stayed for more than 20 mins. We just literally walk around to check it out."
	},
	{
		"User": "jwillierlanzon",
		"Location": "Al Khobar, Saudi Arabia",
		"DateofReview": "February 1, 2018",
		"ReviewTitle": "Small park but well maintained, clean",
		"Review": "This park is a great and secure place for people to walk and avoid the fumes of jeepneys in the streets of Davao. Smoking is not allowed inside and there is a checkpoint in the entrance wherein bringing cigarettes, lighters, tobacco (maybe vape as well) are strictly prohibited and enforced. Good place to jog in the morning or on sunset."
	},
	{
		"User": "Tor Erling M",
		"Location": " ",
		"DateofReview": "January 26, 2018",
		"ReviewTitle": "nice to walk and relax",
		"Review": "relax place. and picnic place. also nice place for exercise in morning. romantic place in evening for couples"
	},
	{
		"User": "travel_l_love",
		"Location": "Vienna, Austria",
		"DateofReview": "January 21, 2018",
		"ReviewTitle": "Old and neglected beauty ",
		"Review": "This place had certainly seen much better times and should get back in focus from local authorities because it's a beauty in its core. \r It is obvious that maintenance badly failed, many points of interest are not on function anymore, dirty and damaged.\r The nature is amazing and despite the bad condition many people love to go there for relaxing, chatting and energizing.\r But its a dying beauty and needs to be missed awake with great efforts.\r \r You don't have so many places to go in Davao City , so better take care of the here before it falls totally apart."
	},
	{
		"User": "Patrick D",
		"Location": " ",
		"DateofReview": "January 21, 2018",
		"ReviewTitle": "Great",
		"Review": "Free to get in. Its a lovely park for the whole family to visit with friendly security. Its nice to go there during the day or at night."
	},
	{
		"User": "Kremenchuk, Ukraine",
		"Location": "Kremenchuk, Ukraine",
		"DateofReview": "January 4, 2018",
		"ReviewTitle": "Good park just in the center of Davao City",
		"Review": "Nice park with lots of trees from all around the world, some animals/birds and even waterfall. Like a small oasis in the concrete jungle of Davao. Very peaceful place. \r Good to go with friends, families and kids. Peoples park! Clean and tidy.\r Lots of people going there for sports activities like jogging or boxing classes.\r Good decorations for Christmas.\r Good to be there after busy streets."
	},
	{
		"User": "Agnes Grace T",
		"Location": " ",
		"DateofReview": "December 22, 2017",
		"ReviewTitle": "Clean and Green",
		"Review": "The place is really good for hang-out with friends, picnic with family and time for your self if you need to get out for a noisy surroundings. Aside from that, you're all secured because this area is within Davao City and we all know how secured Davao City is."
	},
	{
		"User": "Mehylander",
		"Location": "Morgantown, West Virginia",
		"DateofReview": "December 21, 2017",
		"ReviewTitle": "Nice city location",
		"Review": "This is a very nice family park with places to sit and socialize as well as many photo opportunities. It is free to get in and a very easy place to find."
	},
	{
		"User": "lchilcoat2000",
		"Location": "Dallas, Texas",
		"DateofReview": "December 16, 2017",
		"ReviewTitle": "What a fun and peaceful part Of Davao",
		"Review": "If your visit brings you to Davao its a pretty peaceful part of life here at Peoples Park .\r \r . Very enjoyable as you watch the children at play , adults doing yoga and dance exercise classes and special events are held here for various local groups .\r \r Truly , Proples Park embodies the spirit and caring of the citizens of Davao. \r \r Can walk or jog through the park which is heavily shaded with all local trees and a pretty koy pond to watch the fish . Various statues line the park which makes it a relaxing morning or afternoon .\r Admission is Free.\r \r Thumbs up , very enjoyable."
	},
	{
		"User": "PaangGala",
		"Location": "Zambia",
		"DateofReview": "December 6, 2017",
		"ReviewTitle": "refreshing after a day's tour",
		"Review": "its nice to see alot of people enjoy being in this park. you can see students and young people get together for a certain practise and nice to have witness them practise a choral song."
	},
	{
		"User": "edendarnaranggu",
		"Location": "Brunei-Muara District, Brunei Darussalam",
		"DateofReview": "December 5, 2017",
		"ReviewTitle": "With a peaceful places",
		"Review": "Walking with friend at the middle of the night with different lightning and police enforcer are all around the corner, so no worries with joy and laughter."
	},
	{
		"User": "redgotsohigh",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "Very nice park",
		"Review": "A very nice park in the heart of the city. You can go here to relax and just sit while enjoying the trees that provides fresh air. Very well maintained as you see people sweeping from time to time though they're somewhat rude because there was an instance they were sweeping my foot without even saying excuse. Nonetheless it was ok. It has Wifi too which is very fast."
	},
	{
		"User": "Jim P",
		"Location": " ",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "A Place or Get Frisked, Then Take a Relaxing Walk",
		"Review": "My wife is a Filipino and remembers going to this park before immigrating to the U.S. So, we went on our recent visit. Cops frisk you before you enter but they are cool about it. They are friendly. People jog there. It used to be an arboretum but the city let it go down hill. Now, it's just a nice place to take a walk. It has some of the largest city-type pigeons I ever saw strutting around the asphalt."
	},
	{
		"User": "Worcester, United Kingdom",
		"Location": "Worcester, United Kingdom",
		"DateofReview": "November 14, 2017",
		"ReviewTitle": "Relaxing in the city",
		"Review": "We went to peoples park out of curiosity amd i was quite surprised how peaceful it was.\r There were lots of people just milling around young and old alike not much to see but nice to spend time with the family, some nice structures and statues for photos and stuff.\r There is no entrance fee amd security is first class you are pated down on entry amd asked to leave lighters and matches at the entrance as there is a no smoking in public policy across the philippines.\r Oh its also disabled friendly . So if in Davao city go check it out just to take 5 from all the business of the city "
	},
	{
		"User": "vmdr90",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "November 11, 2017",
		"ReviewTitle": "See locals and tourist in this man made lungs in the city",
		"Review": "Local and tourist flock here to escape the hustle and bustle of Davao City. You find couples dating, young and old joggers , families strolling . Must visit for tourist to catch a glimpse of local life."
	},
	{
		"User": "Chris C",
		"Location": "Manila, Manila, Philippines",
		"DateofReview": "November 5, 2017",
		"ReviewTitle": "People's Park",
		"Review": "- visited November 2017 (morning) - no entrance fee - more or less 1 hour is sufficient to explore this place - good place for jogging and brisk walking - well maintained - interesting to note the species of plants and trees around too"
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "October 31, 2017",
		"ReviewTitle": "Nice place to visit.",
		"Review": "My family and i had a nice time walking around checking out the sculptures. My kids loved the giant eagle. If your in davao you should stop."
	},
	{
		"User": "Raf O",
		"Location": "Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Forest in the middle of the city",
		"Review": "Very safe place to run and exercise. Ambience is so relaxing because of the big trees. Also, there's so many entertaining sculptures for picture takings. People are friendly."
	},
	{
		"User": "pastelprism",
		"Location": "Manila, Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Lovely Park",
		"Review": "We arrived in Davao much earlier that the hotel's check-in time. So we left our stuff first at the hotel, then went straight to People's Park. We rode a jeep and went down Aldivinco area so we had to get a 'padyak' (bike) to bring...More"
	},
	{
		"User": "Nancy A",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "No Identity",
		"Review": "We love to see people happy.....we love to reach out.....no rich no poor, meeting in one place called \"People's Park\".....this is the place...... Safety is important, fear is not accepted....calmness is welcome......"
	},
	{
		"User": "rosalina b",
		"Location": "Houston, Texas",
		"DateofReview": "September 28, 2017",
		"ReviewTitle": "Early Morning Walk",
		"Review": "The place us safe, clean and has lots of big trees that provide shade. Early morning walks are best, and perchance you will see the Zumba enthusiasts moving to the upbeat music. Location is great."
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "September 17, 2017",
		"ReviewTitle": "An ordinary park..",
		"Review": "Nothing much to do here really. Maybe if you want to jog, or hang out with friends. But if you are a tourist with a hectic schedule, no need to put this in your must-sees"
	},
	{
		"User": "Aleksander A",
		"Location": " ",
		"DateofReview": "September 1, 2017",
		"ReviewTitle": "Park life",
		"Review": "If you want to step out of the busy streets down town, this is one of the places to go. People's Park is where locals go for their morning/evening jog, since it actually has nice running tracks circling the park. When I visited the park there where plenty of people in the park, everything from joggers to families. Go here for some relaxation, bring some food and drinks and just enjoy. "
	},
	{
		"User": "Kaye F",
		"Location": " ",
		"DateofReview": "August 29, 2017",
		"ReviewTitle": "Safe Park",
		"Review": "This is safe for every one even at night or early morning for joggers. Good for families and large group of friends to have some picnics."
	},
	{
		"User": "EphraimRenz",
		"Location": " ",
		"DateofReview": "August 27, 2017",
		"ReviewTitle": "Place to hang out",
		"Review": "Peoples park, park that you can hang out whit your friends. Last night was so amazing we have a change to meet more new friends. Safe to hang out nice people and good security."
	},
	{
		"User": "RheivenRei",
		"Location": " ",
		"DateofReview": "August 26, 2017",
		"ReviewTitle": "Healthy Jog",
		"Review": "The park is clean and well maintained, perfect for jogging!!! You acn also bring you children to play."
	},
	{
		"User": "Althea-CZ",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "August 21, 2017",
		"ReviewTitle": "Beautiful place and so colorful",
		"Review": "We visited it during the Kadayawan Festival. I haven't been back here for a long time and I was really amazed with its transformation. Nature, culture, and people mixed harmoniusly. Colorful Kadayawan decorations, landmarks and many trees at the heart of the city. Till my next trip, see you again Davao!"
	},
	{
		"User": "Larry C",
		"Location": " ",
		"DateofReview": "August 20, 2017",
		"ReviewTitle": "Great City Center Park",
		"Review": "Park is great for outdoor exercise and jogging and walking with many trees and garden areas Wonderful environment for relaxing and enjoying the outdoors in the middle of Davao Thumbs up great place to visit and enjoy the atmosphere and people of Davao"
	},
	{
		"User": "calorie_dg",
		"Location": " ",
		"DateofReview": "August 19, 2017",
		"ReviewTitle": "My favorite park.",
		"Review": "I would say that this is now my new favorite park. Located in the heart of the city, but once youre inside you wouldnt feel you are the city as it has lots of trees and the feel is much closer to nature."
	},
	{
		"User": "Vanessa D",
		"Location": " ",
		"DateofReview": "August 16, 2017",
		"ReviewTitle": "Strolling!!",
		"Review": "It's incredible that this place is here in davao. So calm, so peaceful, with fresh air, lots of trees and strolling or walking around the place just makes me feel great."
	},
	{
		"User": "Tony_King_Jr",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 9, 2017",
		"ReviewTitle": "No entrance fee",
		"Review": "If you are staying near the area and want a place to jog in the morning or just want to visit the park to unwind. The area is clean just be careful for pickpockets, yes the place is guarded but don't be so confident."
	},
	{
		"User": "Ronna V",
		"Location": " ",
		"DateofReview": "July 26, 2017",
		"ReviewTitle": "big park !",
		"Review": "I went there late afternoon about 5.30 and people are coming there maybe from work and some are from school... It was a huge park ..i saw lots of people.doing thier exercise and and some students are making thier dance practice and drama practice.. Its...More"
	},
	{
		"User": "Eves Jefferson S",
		"Location": " ",
		"DateofReview": "July 21, 2017",
		"ReviewTitle": "Huge park",
		"Review": "Its my first time visiting such a huge park. When you get there you can really see the Filipino culture. People with their families enjoying quality time together. And also theres lots of doves."
	},
	{
		"User": "Felix S",
		"Location": " ",
		"DateofReview": "July 19, 2017",
		"ReviewTitle": "Pigeons",
		"Review": "I'm not used to these kinds of places, I feel out of place in a good kind of way. I love pigeons but also I'm afraid of their poo. Lol, it feels relaxed here kids running around. Come to think think of it, it's a...More"
	},
	{
		"User": "Zoe P",
		"Location": " ",
		"DateofReview": "July 19, 2017",
		"ReviewTitle": "Central park",
		"Review": "I've always loved central park in new york, a place where I could jog, think and have picnics, somewhere in a city of stone and concrete a patch of green, hehe. And this is just like it. I'm not sure if they have it in...More"
	},
	{
		"User": "Sam R",
		"Location": " ",
		"DateofReview": "July 19, 2017",
		"ReviewTitle": "Clean",
		"Review": "In the age of interest, kids often neglect these kinds of places, but man I love this place. Great place to just walk around and get your stuff back together. Also a good family place. Gotta love the local government for keeping this place tidy"
	},
	{
		"User": "Rebecca R",
		"Location": " ",
		"DateofReview": "July 19, 2017",
		"ReviewTitle": "Amazing!!",
		"Review": "It's amazing how any busy city would have a place like this for its residents,, calm and serene. I remember when my dad would bring us to places like this every Sunday morning, just brings back a lot of fun childhood memories!"
	},
	{
		"User": "Nash I",
		"Location": " ",
		"DateofReview": "July 17, 2017",
		"ReviewTitle": "Nice park to visit",
		"Review": "The park was really clean, people were so deciplined, good place to unwind, you can still visit the place even if its a hot season since there's a lot of trees."
	},
	{
		"User": "Anne P",
		"Location": " ",
		"DateofReview": "July 5, 2017",
		"ReviewTitle": "Nothing much happening",
		"Review": "it's just a plain park with nothing much in it. But i think you can still try to visit if this is on the way or you are near the location since this is the main park of Davao City."
	},
	{
		"User": "The_Nomad_11",
		"Location": "Melbourne, Australia",
		"DateofReview": "June 30, 2017",
		"ReviewTitle": "Old Park",
		"Review": "As I walked around this park I had noticed it was a bit tired so many features of the past not working or just run down the heat of the day was eased by the old trees of which gave a lot of shade which...More"
	},
	{
		"User": "MG B",
		"Location": "Houston, Texas",
		"DateofReview": "June 18, 2017",
		"ReviewTitle": "love this park!",
		"Review": "some 20+ years ago, this used to be an empty, boring PTA oval. wow, i am impressed with the transformation. i love the colorful statues that depicts davao culture. i like the fact that they maintained the track field for anyone who would like to...More"
	},
	{
		"User": "Pia L",
		"Location": " ",
		"DateofReview": "June 17, 2017",
		"ReviewTitle": "Nice place",
		"Review": "Lovely park with picturesque views, very instagrammable, secure, good place to jog..don't forget to bring your camera especially for first timers like me, i would definitely go back to this place.."
	},
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 24, 2017",
		"ReviewTitle": "a breather in the city.",
		"Review": "this park located right at the back of the Apo View Hotel and right across Casa Leticia, the People's Park is a breather from the concrete jungle. This park used to be an empty sports arena, in the 70's we used to jog around the...More"
	},
	{
		"User": "Luke T",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "May 19, 2017",
		"ReviewTitle": "Great place for the family",
		"Review": "We enjoyed our visit but the kids had a wonderful time running and playing in the park. This is designed for kids and family. Very nice to see."
	},
	{
		"User": "Laurence John A",
		"Location": " ",
		"DateofReview": "May 17, 2017",
		"ReviewTitle": "Touring with visitors",
		"Review": "The place is very dirty the garden they offer is a mess and the garden near the lagon smells so disgusting smells pee!!! My visitors was so disappointed and went directly to exit. Bad city park."
	},
	{
		"User": "Sweden",
		"Location": "Sweden",
		"DateofReview": "May 16, 2017",
		"ReviewTitle": "Nice to walk around in",
		"Review": "Brought my best friend here during our 2 day vacation in Davao. Security is high, and cleanliness is very well. Lots of trees and flower around. Also lots of interesting statues around this park. We enjoyed taking photos around here. It is also near the...More"
	},
	{
		"User": "sweeetmum",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 1, 2017",
		"ReviewTitle": "If you want to get fit",
		"Review": "If you want to get fit, you may opt for a jog at this place. You can also leave your kids playing at the playground while you dont have to worry about them as the whole place is closely guarded."
	},
	{
		"User": "tailor1989",
		"Location": "Surat, India",
		"DateofReview": "April 26, 2017",
		"ReviewTitle": "People's Park",
		"Review": "I was here with few friends and we had great time taking pictures around the place. Its quite good and in between the city. Love those statues that they have inside the park and the fountain which was not working in the afternoon when i...More"
	},
	{
		"User": "Myra D",
		"Location": "Manila, Philippines",
		"DateofReview": "April 25, 2017",
		"ReviewTitle": "A Must Visit Place",
		"Review": "This is the place to be if you want to get a feel of local culture and meet some locals. I loved the cement sculptures by Kublai Millan, the trees, and the droves of pigeons flying from tree to tree."
	},
	{
		"User": "Loraine Ruth L",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 23, 2017",
		"ReviewTitle": "Relaxing place found at the heart of the city",
		"Review": "If you want to get relaxed and you're in the city, this is the best place to go to. You can usually meet locals here and even tourists. The park is filled with statues designed by a famous artist, benches, and trees/plants. There are also...More"
	},
	{
		"User": "arielsanjose",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 21, 2017",
		"ReviewTitle": "A GOOD PLACE TO DO JOGGING",
		"Review": "If you are a tourist in Davao City and you want a place to jog, then People's Park is the place. Before this place became a park, it was a track oval where most local athletes did their practice. When it was developed into a...More"
	},
	{
		"User": "reelrodcover",
		"Location": "Montgomery, Texas",
		"DateofReview": "April 15, 2017",
		"ReviewTitle": "Must visit for sure.",
		"Review": "Get to see and meet locals and enjoy all the different things to see. Very enjoyable and will visit again."
	},
	{
		"User": "BennieGS2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 11, 2017",
		"ReviewTitle": "Relaxing Site...",
		"Review": "This site is really good for young and old ones. Taking breath easily away from dusty roads. solemn place for dating, walking exercise and play like no other fun."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 11, 2017",
		"ReviewTitle": "Clean Park",
		"Review": "This park is good for jogging or just chillin with your love ones. The park is very clean and has a lot of greens."
	},
	{
		"User": "ofanoa",
		"Location": "Bondville, Vermont",
		"DateofReview": "March 29, 2017",
		"ReviewTitle": "Ok, kind a small",
		"Review": "Nice little park in the middle of downtown, could be bigger. Good to walk - stroll around. Nice plants could use grass"
	},
	{
		"User": "torkjell_11",
		"Location": "Bergen, Norway",
		"DateofReview": "March 25, 2017",
		"ReviewTitle": "Nice park",
		"Review": "People's Park in the heart of Davao is a nice park white grass or benches to sit down and just look at the life around you or have a picnic. There are a lot of nice flowers and trees in combination whit rounds and wather....More"
	},
	{
		"User": "paulapple",
		"Location": "england",
		"DateofReview": "March 24, 2017",
		"ReviewTitle": "Busy but restful ",
		"Review": "Visit in the cool of the afternoon. Have a stroll then get a seat and let the city come to you. Great people watching"
	},
	{
		"User": "ihateweatherspoons",
		"Location": "Warrington, United Kingdom",
		"DateofReview": "March 19, 2017",
		"ReviewTitle": "Run down.",
		"Review": "Nothing to see her except a few koi carp swimming around in a small pool.No fountain working. Just looks like an overgrown garden."
	},
	{
		"User": "Januspaggers",
		"Location": " ",
		"DateofReview": "March 14, 2017",
		"ReviewTitle": "Great place to unwind ",
		"Review": "You'll find plenty of people exercising around the around, a lot of statues (durian, eagle, etc) so it's a fun photo taking opportunity. But most of all, it's relaxing. Just take a seat at a bench and just enjoy the trees and doves flying about....More"
	},
	{
		"User": "gvanesplana0126",
		"Location": "Makati, Philippines",
		"DateofReview": "March 11, 2017",
		"ReviewTitle": "Relaxing!",
		"Review": "The place is really relaxing and the flock of pigeons inside the park are amusing! At the exit of the park, you'd find a pasalubong center where we scored inexpensive items like bags, purses, and key chains."
	},
	{
		"User": "costelmihaila80",
		"Location": "Vancouver, Canada",
		"DateofReview": "March 9, 2017",
		"ReviewTitle": "Nicely done",
		"Review": "Is a nice place.However,there is a bamboo shack by the restroom as yiu enter straight forward and the bottom is rotten so kind of danger to fall. Sane the roof doesn't seam great."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 8, 2017",
		"ReviewTitle": "Unfriendly for Dog Lovers",
		"Review": "We went to People's Park for a walk with our Little Jeya. She was as excited like us since it would be her first time in the People's Park, only to be disappointed. One of the vendors told us dogs were not allowed inside. We...More"
	},
	{
		"User": "Jennelyn T",
		"Location": "San Jose del Monte, Philippines",
		"DateofReview": "February 20, 2017",
		"ReviewTitle": "Activity area for all ages",
		"Review": "This place is great for biking, group dancing, or choreographing a dance for a class project, and for just chilling out."
	},
	{
		"User": "tom1941",
		"Location": "Philippines",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "Good place to people watch",
		"Review": "I have been many times in the late evening. It is always clean and I certainly feel safe there. Officers are always on duty. Visited by families and young couples. NIce place to relax. I say it reflects culture because you can see the Filipino...More"
	},
	{
		"User": "bhsceo",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "Entertainng Garden",
		"Review": "Most suitable for jogging,playing and amusement place in Davao.Many groups visiting the Park in the mornng and evening time. Nice to go with family for a joy & more activities."
	},
	{
		"User": "Stuart K",
		"Location": "Kent, United Kingdom",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "christmas",
		"Review": "i went there during the christmas period most of the trees had lights on ,it looked very nice ,it was easy to find and many places to eat nearby"
	},
	{
		"User": "Olav Tore B",
		"Location": " ",
		"DateofReview": "February 8, 2017",
		"ReviewTitle": "Very nice to vissit",
		"Review": "Near by the hotel Galleria, very nice to walk arround and relacse. I recommend a vissit to the park :-)"
	},
	{
		"User": "sinned04",
		"Location": "Vancouver, Canada",
		"DateofReview": "February 4, 2017",
		"ReviewTitle": "Picnic at the park. ",
		"Review": "We always come to have a picnic during the weekdays to avoid busy and crowded weekends. It is close to the hotel were I stayed. I love the park coz it's huge and clean. Well maintained. Lots of attractions to see and nice views for...More"
	},
	{
		"User": "Mercy888",
		"Location": "Manila, Philippines",
		"DateofReview": "February 3, 2017",
		"ReviewTitle": "Very cool and clean park :)",
		"Review": "This park is near the ampitheater with a durian roof, there was also a big eagle there and lots of policemen and soldiers as there will be a Chinese New Year program during our visit. It is a cool place to relax and have a...More"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 1, 2017",
		"ReviewTitle": "Nice and Clean!! =)",
		"Review": "I do jog here once in a while and well it is indeed clean plus there are lots of trees that it makes the air fresh."
	},
	{
		"User": "Greeg G",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 20, 2016",
		"ReviewTitle": "Relaxation",
		"Review": "Everytime I want to get relax and smell some fresh air, I go to here and I also do jog sometimes here"
	},
	{
		"User": "jaquinne",
		"Location": "Davao City",
		"DateofReview": "December 20, 2016",
		"ReviewTitle": "Family Thing",
		"Review": "A nice place to bring family and friends. the place is clean and strictly no smoking which is good for everyone. Secured, bags are checked before entering the premises."
	},
	{
		"User": "Nick T",
		"Location": "Philippines",
		"DateofReview": "December 2, 2016",
		"ReviewTitle": "a park for wellness",
		"Review": "I visited the park in the evening and surprisingly I saw many city folks enjoying jogging, dancing zumba, students practicing their dance presentation, and others strolling around with their friends or families. Some of the facilities needs repair including lighting."
	},
	{
		"User": "Dru S",
		"Location": "Cairns, Australia",
		"DateofReview": "November 27, 2016",
		"ReviewTitle": "just a quick visit to break up the day and relax for a couple of hours",
		"Review": "nice a peaceful very clean .....the tress around the grounds make a perfect sun shade was a nice place to relax"
	},
	{
		"User": "usairways1",
		"Location": "Charlotte, North Carolina",
		"DateofReview": "November 26, 2016",
		"ReviewTitle": "Peaceful",
		"Review": "Park is located near downtown very clean and well-kept beautiful landscaping and flowers it's free to the public the early morning or late in the evening to avoid the Heat"
	},
	{
		"User": "Leah N",
		"Location": "Lapu-Lapu City, Lapu-Lapu, Philippines",
		"DateofReview": "November 17, 2016",
		"ReviewTitle": "Where are the fun things?",
		"Review": "I was quite dismayed visiting the park this month because all the fun and entertaining big statues were removed from the area. The pirates, penguins, hollywood stars, dinosaurs, and others are all gone! But at least the pigeons are still around. The usual fitness buff...More"
	},
	{
		"User": "Jojie A",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "Davao People's Park",
		"Review": "Formerly the once popular PTA Grounds in Davao City, this P72 M worth People’s Park opened on December 15, 2007 which features a mini-forest, interactive fountains, waterfalls and ponds, a kid’s toyland and large sculptures representing indigenous groups in Southern Mindanao and the Philippine eagle....More"
	},
	{
		"User": "Valenzuela, Philippines",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "Stop & Relax",
		"Review": "This place is just another park so good to sit and relax amidst the busy city of Davao but there is no exciting part that you will find or any other exciting adventure that awaits here. The place is good for children who likes to...More"
	},
	{
		"User": "Piumal T",
		"Location": "Vilnius, Lithuania",
		"DateofReview": "October 28, 2016",
		"ReviewTitle": "Go relax. Enjoy",
		"Review": "I used to go to this place in the evenings just to relax and to chill. Nice place to kill the time. Some days there are water dance shows, which is beautiful. You can find some nice street food right next to the park in the streets. "
	},
	{
		"User": "GianJamesMags",
		"Location": " ",
		"DateofReview": "October 24, 2016",
		"ReviewTitle": "Tourist priority friendly ",
		"Review": "The park guys were kind enough to let us in due to their Tourist-priority friendly. Their are a lot of pigeons and are very used to people around. It's very relaxing to chill around during noon-time with all their trees providing shade and cool winds."
	},
	{
		"User": "Jessica A",
		"Location": "Philippines",
		"DateofReview": "October 22, 2016",
		"ReviewTitle": "Good view to gaze",
		"Review": "nice place to visit. you will have plenty of time here to relax and gaze the beauty of the view. Clean and lovely."
	},
	{
		"User": "Janna Michelle B",
		"Location": " ",
		"DateofReview": "October 18, 2016",
		"ReviewTitle": "The City's Child Friendly Park",
		"Review": "People's park is located in the center of the city. It is in walking distance with Apo View Hotel, Sampaguita Inn, Tsuru, TAPS and a whole lot more hotels, restaurants, inn and mall.\r How to go there:\r From the airport, take a cab ride and ask the driver to take you to people's park.\r What is in there?\r This is a park for kids, thus there are rides for the kids and sometimes it features different paintings in the dome. It is also famous for Mang Danny's ice cream."
	},
	{
		"User": "Inday23",
		"Location": "New York City, New York",
		"DateofReview": "October 18, 2016",
		"ReviewTitle": "Excellent place to stroll along",
		"Review": "If you are in Davao city, you need to stop by at People's Park, just to relax or to walk around. It's breath taking view inside the park will be relaxing."
	},
	{
		"User": "Querriel Arvy M",
		"Location": " ",
		"DateofReview": "October 11, 2016",
		"ReviewTitle": "Free and Relaxing",
		"Review": "The best part: FREE!!! You can take pictures of giant statues inside the park. Ranging from Cartoons, to game superheroes to movie characters. You can also enjoy the nature since there's a lot of trees and birds on the park."
	},
	{
		"User": "filipin0traveller",
		"Location": "manila",
		"DateofReview": "September 30, 2016",
		"ReviewTitle": "Park in the City",
		"Review": "We went in the morning so I cannot comment on an evening visit. Peoples Park is within walking distance from our hotel but could be reached using a trike. Many photo opportunities within the park. Near Pasalubong Center"
	},
	{
		"User": "Davao City, Davao City, Philippines",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "September 27, 2016",
		"ReviewTitle": "Peoples Park Davao",
		"Review": "Nice place to relax, jog, walk, spend your free time, get some fresh air, etc.\r \r Pros? Free, no entrance fee\r Cons? Not properly maintained, CR, fountain, etc.\r \r It would be nice if we could bring our pets here (even if we would clean our pet's wastes)"
	},
	{
		"User": "travelology_ph",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 9, 2016",
		"ReviewTitle": "For the People, By the People",
		"Review": "An enclosed free public park of Davao City. Medium sized park which showcases various statues made by a local artist. This is the fave hang out place of locals for family and friend bondings"
	},
	{
		"User": "77Raine27",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "September 8, 2016",
		"ReviewTitle": "Good Enough!",
		"Review": "A cultural theme park where you can enter for free. When we went there it was under renovation. Nothing much you can see just the huge People's Park signage."
	},
	{
		"User": "Nette0830",
		"Location": " ",
		"DateofReview": "September 1, 2016",
		"ReviewTitle": "Free WIFI inside the park",
		"Review": "You can stay in the park the whole day surfing the net or if you are a pokemon fanatic, there are pokemon everywhere."
	},
	{
		"User": "Yvonne M",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "September 1, 2016",
		"ReviewTitle": "top free park in davao city",
		"Review": "i was looking forward to coming back to this park from our visit 4 years ago as we were really impressed with this public park. it was just a few minutes walk from our inn so we went there night time..i noted new structures being...More"
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "one of the great parks in the city",
		"Review": "located along palma gil. there's a nearby 7-11 convenience store and pasalubong center. went there aug19 6am and there was an ongoing zumba exercise. almost 100 davaoenos are participating. lots of locals and tourists are there as well. there are pigeons which you can feed...More"
	},
	{
		"User": "Pcpau",
		"Location": " ",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "Just passing by",
		"Review": "I have known People's park for so long. I have done jogging session several times in the past. This was also the venue for a field trip with the sixth grader class of my daughter. The view and the sculpture are excellent. Last night I...More"
	},
	{
		"User": "Lina Gladys L",
		"Location": "Manila, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "free place to go",
		"Review": "its a good place to have a morning walk. you may also join the people doing their exercises with music. the place is clean and safe"
	},
	{
		"User": "Baguio, Philippines",
		"Location": "Baguio, Philippines",
		"DateofReview": "August 21, 2016",
		"ReviewTitle": "Not everyday to see a DURIAN roof, Trees and Shades, Arts and Nature..",
		"Review": "Best place to unwind, meet new friends, lots of trees and shades, perfect for strolling and family bonding..."
	},
	{
		"User": "joww101",
		"Location": " ",
		"DateofReview": "August 5, 2016",
		"ReviewTitle": "Nice for jogging and walking .",
		"Review": "Nice place for jogging and walking and meet up with friends and play games. 😄uhmm it's nice to go a dance practice in the big place there. Good for picnics also."
	},
	{
		"User": "Annb0226",
		"Location": "Chaweng, Thailand",
		"DateofReview": "August 5, 2016",
		"ReviewTitle": "Strolling in the Park",
		"Review": "Went there a little late after 8am with the fam. It's closing time which we don't know but thankfully the guards gave as a chance to stroll & take pictures since it's our last day in Davao. Great place to stroll with the kids. Proud...More"
	},
	{
		"User": "Earl Y",
		"Location": "Ostrava, Czech Republic",
		"DateofReview": "August 2, 2016",
		"ReviewTitle": "Nice Park",
		"Review": "The only thing the sets this park different from others is that there are statues which I don't know who they are and the story behind it. They're interesting to see though. The park is safe and well-maintained. There's also a place for jogging and...More"
	},
	{
		"User": "Kaysha Y",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 31, 2016",
		"ReviewTitle": "public park",
		"Review": "Great place to go to when its your first time in Davao, for jogging and sight-seeing. People can eat here and every sunday there is a free aerobics class everybody can attend for free!"
	},
	{
		"User": "Alvin N",
		"Location": " ",
		"DateofReview": "July 30, 2016",
		"ReviewTitle": "A visit to a Park",
		"Review": "My hotel is just in-front of the Park. So, i decided to check out. The park seems Safe, Clean and very refreshing. People are strolling and jogging."
	},
	{
		"User": "touristatravel2015",
		"Location": "Tarlac, Philippines",
		"DateofReview": "July 29, 2016",
		"ReviewTitle": "Very nice place",
		"Review": "The park is well-maintained and really beautiful at night. The place was very much secured because of the presence of the security guards. This is a good place to kill time."
	},
	{
		"User": "delight_2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 28, 2016",
		"ReviewTitle": "A family Dinner in the People's Park",
		"Review": "Pres. Duterte, former City Mayor in this very beautiful and peaceful place of Davao , was right when he named this beautiful and relaxing place as People's Part, for after all they money used to build this park is from the People. The children and...More"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 27, 2016",
		"ReviewTitle": "Good place to stop and jog by!",
		"Review": "It's really a good place to jog-walk around. I like seeing people being with their love ones in the park and feeling really happy! The arts and statues in there are truly worth seeing."
	},
	{
		"User": "Lawrence A",
		"Location": "Quezon City, Philippines",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "Feels safe to be here",
		"Review": "A simple park yet it's one of the few parks I've learned to appreciate. Wide, lively and the feel is just sooo Davao."
	},
	{
		"User": "virstud",
		"Location": "Caloocan",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "Nice place to stroll around",
		"Review": "We visited the park at night on our first night out. Security upon entry is very strict. Nice Durian inspired roofing. We just strolled around the park in circle."
	},
	{
		"User": "Erreth",
		"Location": "Cebu City, Philippines",
		"DateofReview": "July 4, 2016",
		"ReviewTitle": "Amazingly clean",
		"Review": "We went there as part of our day tour in the city and was very amazed as to the cleanliness of the park. You feel really secured even if you won't see any security guards roaming around. As what my Davaoena friend said, they have...More"
	},
	{
		"User": "ChesterClark",
		"Location": "Surigao City, Philippines",
		"DateofReview": "July 4, 2016",
		"ReviewTitle": "Leisure",
		"Review": "A short trip with friends suggest that this place is very friendly for family picnics. A little bit crowded at times but fair enough to roam around with kids."
	},
	{
		"User": "ryandgreat",
		"Location": "Makati, Philippines",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "people",
		"Review": "i've seen people from all walks of life, kids, adults, senior citizens, employees, students and tourists, there's nothing special about this park except for there are lotsa people who spend time at the park"
	},
	{
		"User": "Remelyn F",
		"Location": " ",
		"DateofReview": "June 26, 2016",
		"ReviewTitle": "Beautiful place for the kids",
		"Review": "The different fiberglass life size action figures display are nice treat for kids and kids at heart. I hope it will be a permanent display"
	},
	{
		"User": "MarcoDimSum",
		"Location": "Angeles City, Philippines",
		"DateofReview": "June 14, 2016",
		"ReviewTitle": "Nice place to chill and do some laps",
		"Review": "Nice oasis in the city with lots of trees and shade. As a runner, I wish they didn't make the jogging oval made of bricks, it's harder on the body and uneven. That said, it's great to have a place to do laps in the...More"
	},
	{
		"User": "Sydney",
		"Location": "Sydney",
		"DateofReview": "June 13, 2016",
		"ReviewTitle": "Don't waste your time",
		"Review": "It was probably very nice at some point but seemed very run down and in disrepair as far as I could tell. The fountain doesn't work anyone, the waterfall wasn't working and many chairs were just rusted and broken accidents waiting to happen. Any history...More"
	},
	{
		"User": "Jemir T",
		"Location": " ",
		"DateofReview": "June 7, 2016",
		"ReviewTitle": "IT WAS NOT MAINTAINED WELL THAT TIME",
		"Review": "Cause I have never been to what they say the Peoples Park of Davao where people hang around and have picnics, couples who dates there and people who wants to jog on a humble place. So we went there no fees were asked which before was present. Place was packed but very dark. People were running around the circle of the park. Fountain was not around at that time which was I wanna see."
	},
	{
		"User": "Andrew2016p",
		"Location": "Swansea County, United Kingdom",
		"DateofReview": "June 5, 2016",
		"ReviewTitle": "Great Fun",
		"Review": "I went to peoples park a number of times throughout the year and i have to say its great. There is just something about this place that makes me smile. i love visiting this place. it can be peacful and fun"
	},
	{
		"User": "lucseawalker",
		"Location": "Dumaguete City, Philippines",
		"DateofReview": "June 5, 2016",
		"ReviewTitle": "A park within the concrete city building",
		"Review": "There are some animation going on here from time to time ... good place to breathe between a few trees!"
	},
	{
		"User": "daveholden",
		"Location": "Lake Forest, California",
		"DateofReview": "May 29, 2016",
		"ReviewTitle": "What an absolute BLAST! ",
		"Review": "I went early, at 6 AM, to Peeples park. It was awesome! There were at least 1500 to 2000 people doing a lot of Zumba style dance routine. What a great time to be out in the middle of a beautiful park dancing for health! There were an additional 500 circling the park on the walking track… All the time this was interspersed with the craziest fiberglass sculptures of superheroes where you could stop and get your picture taken! Wow! "
	},
	{
		"User": "Maria Elena F",
		"Location": " ",
		"DateofReview": "May 29, 2016",
		"ReviewTitle": "Fun",
		"Review": "Love the. Hope you will like it too. Clean. Friendly people. Theres so many activities. There is a free lugaw ."
	},
	{
		"User": "Nise76",
		"Location": " ",
		"DateofReview": "May 22, 2016",
		"ReviewTitle": "Free Park at the heart of the city",
		"Review": "Great for walking with family or friends... There are also tables for picnic and no entrance free so that's an added plus because you can bond with your loved ones without spending much."
	},
	{
		"User": "Aphio1925",
		"Location": "United Kingdom",
		"DateofReview": "May 21, 2016",
		"ReviewTitle": "Free park",
		"Review": "Roam around for free, have exercise -zumba especially in the morning, see a lot of statues, all greens and very pleasant park to walk into."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 21, 2016",
		"ReviewTitle": "A haven in the heart of Davao City.",
		"Review": "To the locals like me, it is the perfect place to do my morning jogs plus we get to eat free lugaw (porridge). You couldn't imagine it is in the heart of the city because the place is so peaceful. I recommend this as a must visit place for tourists. The perfect place to relax in the afternoon or early evening after exploring the different tourist spots in Davao."
	},
	{
		"User": "Gary J",
		"Location": "Cooroy, Queensland, Australia",
		"DateofReview": "May 17, 2016",
		"ReviewTitle": "our visit",
		"Review": "This is most amazing place and i want get married there in august if i can contact whover is in charge . I met my future wife not far from there and we hope to be married in the park if we have permission in august this year"
	},
	{
		"User": "PrincessMiaGirl",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 16, 2016",
		"ReviewTitle": "The Greenest You Find In The City",
		"Review": "This is a perfect place to rest your tired feet from exploring the entire city. Enjoy people watching. Enjoy the fresh air. Walk fast, walk slow. Just go with flow."
	},
	{
		"User": "FAJATRAVEL",
		"Location": " ",
		"DateofReview": "May 14, 2016",
		"ReviewTitle": "Great place for family bonding",
		"Review": "Relaxing and colorful park with childrens playground. You can stroll around but you can also sit back and relax on benches watching numerous doves. We saw some people feeding doves so they were able to literally touch them. Feels like you're in Italy. You can also take photos with the colorful and life size cartoon characters. There is designated entrance and exit gates located in different sides of the park. No entrance fees but the park is quite maintained."
	},
	{
		"User": "Fred1021",
		"Location": "Los Angeles, California",
		"DateofReview": "May 10, 2016",
		"ReviewTitle": "Nice walking park",
		"Review": "We went to this park on a six day vacation and tour in Davao City. This park is a good place to stroll any time during the day because of its shaded track. There are a lot of activities to engage with: picture taking with the statues, many shady trees, and a center for travel information."
	},
	{
		"User": "Jonathan Christ... B",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 9, 2016",
		"ReviewTitle": "inexpensive park visit",
		"Review": "within the center of Davao City. Nice place to relax with your family. Near local food stalls. Safe fro kids with oval track open as early as 7:00am"
	},
	{
		"User": "Sol P",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 5, 2016",
		"ReviewTitle": "True to it's name \"People's Park\"",
		"Review": "This place is for everyone! A park in the middle of Davao City where you can relax, exercise, date etc... Every early morning Sunday, if you're lucky, you can have your free pongee/porridge(lugaw).... Have a great visit in your Park..."
	},
	{
		"User": "Brian Chester L",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 22, 2016",
		"ReviewTitle": "Busy Yet Relaxing Park",
		"Review": "I usually go here either to relax or exercise. The park will usually be bustling with activity in the afternoon until the evening. Lots of weird statues to look at, and also don't for get to go to the center of the park to relax and enjoy the company of trees."
	},
	{
		"User": "New York City, New York",
		"Location": "New York City, New York",
		"DateofReview": "April 21, 2016",
		"ReviewTitle": "relaxing",
		"Review": "a relaxing spot in the middle of the urban jungle.takes you away from the hustle and bustle of the daily city grind..."
	},
	{
		"User": "Jha Ctrl A",
		"Location": " ",
		"DateofReview": "April 15, 2016",
		"ReviewTitle": "Best city in the world",
		"Review": "High five guys! All the good vibes are here again & to tell you honestly. This city is close to my heart of how organized, relatively beautiful & amazing it is. From our tough mayor to the warmest smiles of the locals, who would definitely capture your heart and soul in a heartbeat. Seriously, Davao City is top 1, I mean in my heart i know this is far by the best cities I've ever been. This was like my 2nd hometown & all I can say are just purely positive things. I cannot say no more. You have to see to believe.\r \r For smokers & vapers: Davao City is strictly implementeng \"No Smoking Policy in Public\" so please please be aware! Don't be scared by this, I'm just nagging a lil bit like your grandma, your mom, your wife or girlfriend or just a nagging lil concerned friend. ✌️ Peace-out! :))"
	},
	{
		"User": "dred69",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 14, 2016",
		"ReviewTitle": "Awesome",
		"Review": "It was created by the City Government of Davao through the initiative of Mayor Duterte for the people of Davao. A place you can relax with family and friends. It was a PTA grounds before but now a beautiful man made forest at the heart of the City. It has no entrance so people come and go. Sculptures was made by Kublai Milan representing 10 tribes of Davao City."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 5, 2016",
		"ReviewTitle": "Good place for family outing",
		"Review": "People's Park can be a good place for the family to relax and hang out, especially to kids because they have lots of play areas and kids love to play and run anywhere. It's safe too and very accessible because it is located at the city center."
	},
	{
		"User": "AntonetteSato",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 4, 2016",
		"ReviewTitle": "Green Scenery is Great",
		"Review": "Peoples Park is very relaxing especially the green Pine trees and Acacia Trees.The acoustic music playing around the area also contributes to the tranquility of the park."
	},
	{
		"User": "ForexTaurus",
		"Location": "Phuket, Thailand",
		"DateofReview": "April 4, 2016",
		"ReviewTitle": "For kids",
		"Review": "Not much of a park but the kids love it. There are some pirate statues to take Selfies with. That's about it"
	},
	{
		"User": "rajnavarro",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 31, 2016",
		"ReviewTitle": "Strolling around, alone but happy",
		"Review": "Everytime I go to this park, I never feel like I am alone because it is a very lively park, filled with simple man-made figures where you can take pictures and stuff. If you wanna enjoy a cozy afternoon with some snacks and good friends with you, people's park will absolutely give you a great atmosphere and guess what, there are also a lot of areas where you can enjoy your snacks while chattering. Very clean environment with relaxing music. No entrance fee. Just make sure you're not carrying prohibited stuff with you."
	},
	{
		"User": "Christine M",
		"Location": "Cagayan de Oro",
		"DateofReview": "March 25, 2016",
		"ReviewTitle": "I became a little girl again!",
		"Review": "After Museo Dabawenyo, the service driver dropped us at People's Park and again we were thinking, hmmm.. Why here? It's just full of trees.. Wrong! As we went inside we were awed to the scenic view and activities people's park has to offer. We had our pictures taken between the bamboo trees like aspiring models, posed together with Philippine eagle and tribal statue, had a relaxing and breezy moment below the bamboo trees and lastly my favorite part was feeding the pigeons!! We enjoyed every moment of it like kids "
	},
	{
		"User": "GraceJ1",
		"Location": " ",
		"DateofReview": "March 24, 2016",
		"ReviewTitle": "Outing with kids and family",
		"Review": "I always idmire thus place very safe , relaxing it's a nice plesure to walk around watching lots of people while enjoying what thier doing lots of youngsters some of them doing thier practice for thier activities at school it's also good for old people very relaxing , my parent having a great time when I brought them ..."
	},
	{
		"User": "Alu H",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 8, 2016",
		"ReviewTitle": "An Oases at the hear of the metropolis",
		"Review": "Very relaxing place, the rainforest add the coolness of the park, the lifesize statue. Nice place for family"
	},
	{
		"User": "Racq",
		"Location": "Manila, Philippines",
		"DateofReview": "March 5, 2016",
		"ReviewTitle": "Not well maintained",
		"Review": "The Park is more of a jogging area with several cartoon characters in the form of statues. The children will surely enjoy them. There's almost no grass, the area is mostly cemented. The surroundings are filled with dried leaves and quite filthy. The comfort room...More"
	},
	{
		"User": "Tins C",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "February 26, 2016",
		"ReviewTitle": "ethnic natures park",
		"Review": "a combination of ethnic art originals of davao city being a dabawenyos, a perfect nature park, best place for zumba every weekends. it's good for walking while enjoying the ambiance."
	},
	{
		"User": "wildlfower777",
		"Location": "Al Ain, United Arab Emirates",
		"DateofReview": "February 25, 2016",
		"ReviewTitle": "Davao City's own \"Central Park\"",
		"Review": "The place used to be an athletic oval playground but the city decided its too small and too crowded for such. So, they converted it into a public park and launched a contest for its name. Thus, it earned its very appropriate name \"People's Park\"....More"
	},
	{
		"User": "Argdds",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 20, 2016",
		"ReviewTitle": "People's Park",
		"Review": "If you want to unwind visit Davao's people park, You can take pictures with Dagkong Rebulto, You can be fit also kay you can Jog or exercise. There's a lot of folk exercising evry afternoon. Clean and not so crowded. 😀"
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"DateofReview": "February 19, 2016",
		"ReviewTitle": "and ever changing park",
		"Review": "got to go in during a time that it was closed, thank you Mr. security guard. different stuff goes up during the seasons. i came in just at the end of Christmas"
	},
	{
		"User": "Michael L",
		"Location": "Davao, Davao City, Philippines",
		"DateofReview": "February 18, 2016",
		"ReviewTitle": "Clean and safe",
		"Review": "A small, though not uninteresting pocket park in the center of the city with so,e interesting local sculptures and comfortable seating. It's safe, and a good place to rest weary legs."
	},
	{
		"User": "Chatham, Canada",
		"Location": "Chatham, Canada",
		"DateofReview": "February 17, 2016",
		"ReviewTitle": "Park in the City",
		"Review": "Large park in the city of Davao. A lot to see, sculptures, botanical gardens, great for early morning walks and safe. I liked it."
	},
	{
		"User": "Jake2014jake",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 2, 2016",
		"ReviewTitle": "A park and mini forest at the heart of the city!",
		"Review": "The place is a nature park, an amusement park, and an activity center rolled into one. It is a nature park because you would never expect to see a little forest in the heart of a bustling city like Davao City and yet in the center is a real mini forest, where one could lounge and relax. Filled with numerous statutes with which you could have your photo taken, the place is also an amusement park which will delight the young and the old alike. And finally, during weekend mornings, the park becomes an activity and sports center, where you could do some running or jogging. There is also a zumba session for those so inclined. Both are events which attracts many participants, both locals and tourists. I myself witnessed the zumba and the jogging during the Sunday morning that I visited. If only all the cities in the country would have a park such as this one, the country would definitely have a happier and healthier people."
	},
	{
		"User": "peterP843QB",
		"Location": "Gawler, Australia",
		"DateofReview": "January 28, 2016",
		"ReviewTitle": "Relaxing",
		"Review": "A pleasant place to walk around worth the time.Unusual statues with plenty of great photo opportunities"
	},
	{
		"User": "kiwiboyz12",
		"Location": " ",
		"DateofReview": "January 28, 2016",
		"ReviewTitle": "Good place to hang out",
		"Review": "My second visit to People's park and it's a very nice place to hang out.Centrally located so it can be used as a meeting point to then head out for dinner."
	},
	{
		"User": "Mary A",
		"Location": "Sumner, Washington, United States",
		"DateofReview": "January 23, 2016",
		"ReviewTitle": "First time visit!",
		"Review": "It's a great place....lot's of people. I went there with my family during Christmas Holiday. We went there in the afternoon but I think it's so nice when you go there at night."
	},
	{
		"User": "bluearmy10000",
		"Location": "Manchester, United Kingdom",
		"DateofReview": "January 22, 2016",
		"ReviewTitle": "En masse family visit pre new year",
		"Review": "Very very busy, Great atmosphere. Fantastic for kids , ended up with a lot of sweaty, happy children"
	},
	{
		"User": "bambi_jimenz",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "January 21, 2016",
		"ReviewTitle": "Truly for the people",
		"Review": "What I like about this place, is the big eagle at the center of the park. My family and I went to Davao last year. We enjoyed posing for pictures at the many colorful places there especially at night. The lights just add to the attraction because we went there January 1 of last year so Christmas lights abound. I like to go back there again."
	},
	{
		"User": "Jay S",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 21, 2016",
		"ReviewTitle": "Free, Safe and Nice - A Reflection of Davao City",
		"Review": "I love it here since you can walk around with the family without having to worry about anything. Admission is free, the place is clean, nobody is allowed to smoke and you can have gatherings here. Definitely a place to visit at least once for non locals."
	},
	{
		"User": "Baguio, Philippines",
		"Location": "Baguio, Philippines",
		"DateofReview": "January 16, 2016",
		"ReviewTitle": "A complete community park",
		"Review": "I jog to People's Park as early as 6am and I was surprised with a number of people doing zumba when I arrive after half an hour. \r \r I though the zumba dance was only for gym members but after a few minutes of observing, I discreetly joined the dance, for free! The experience was really amazing as I danced together with a lot of joiners- from old to young, professionals to tourists!\r \r Tip:\r Head on to People's Park as early as 5am and secure your space in front of the zumba masters so you can dance and perspire more!"
	},
	{
		"User": "Roberto P",
		"Location": " ",
		"DateofReview": "January 8, 2016",
		"ReviewTitle": "A lot people come here to see. Need to update.",
		"Review": "Good public park that displays the artworks of local artists. But needs bright lighting at night. And needs to update the landscaping"
	},
	{
		"User": "Cel C",
		"Location": "Cebu City, Philippines",
		"DateofReview": "January 6, 2016",
		"ReviewTitle": "Nice place to walk!",
		"Review": "Me and my hubby have dating here. Safe place and nice to walk around. Picture-picture within the area."
	},
	{
		"User": "Katrina08_23",
		"Location": "Davao City",
		"DateofReview": "January 6, 2016",
		"ReviewTitle": "Beautiful!",
		"Review": "If you just wanna hung around and enjoy nature this place is just right for you. You can jog every morning and enjoy nature's beauty within the city. They also have zumba every Sunday morning. Nice to burn fats and excess cholesterol in a fun...More"
	},
	{
		"User": "iamatopmodel",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 3, 2016",
		"ReviewTitle": "Perfect for recreational activities",
		"Review": "Clean and well maintained. It's best to go there on Saturday and Sunday morning for jogging or zumba. Their free session on weekends starts at 6:00 AM."
	},
	{
		"User": "Veness Ehrn G",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 28, 2015",
		"ReviewTitle": "A Glimpse to Mindanao Culture",
		"Review": "It is a cozy place for friends and family to stroll , even for couples. One thing I like about this place is the strict regulations that they implemented. It sure keep the place safe, neat and clean for kids and adults. And good for...More"
	},
	{
		"User": "Ken Marius F",
		"Location": " ",
		"DateofReview": "December 26, 2015",
		"ReviewTitle": "It is a park com on",
		"Review": "Ok park for a walk. The have a monky cage++ didnt enjoy this park this much. But with all the amsing things to do in Davao and going to this park after I've been there for 3 weeks. It just got sucked up in to...More"
	},
	{
		"User": "yolyg2015",
		"Location": "Marikina, Philippines",
		"DateofReview": "December 24, 2015",
		"ReviewTitle": "Park at the middle of the city",
		"Review": "People's Park is one great park right in downtown Davao. It provides greenery in urban Davao.. a place to breathe, walk, sit and enjoy the place."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 22, 2015",
		"ReviewTitle": "Renovation needed",
		"Review": "The park is fairly clean but it needs renovation (repaint chairs and sculptures), maintenance (please clean the pond, the water is murky and has a lot of moss), please remove the monkey (people are feeding it with junk), and please allow dogs inside. You can...More"
	},
	{
		"User": "DMCY2015",
		"Location": "Pampanga Province, Philippines",
		"DateofReview": "December 15, 2015",
		"ReviewTitle": "Clean Park",
		"Review": "The park has a good security measures. Also has a statues that depicts the heritage of Davao. It is also a nice place to jog or to simply walk around the vicinity."
	},
	{
		"User": "HurricaneRob",
		"Location": "Houston, Texas",
		"DateofReview": "December 3, 2015",
		"ReviewTitle": "Quiet place for lovers",
		"Review": "I found it very relaxing, at the time I was dating my now wife and her mother and tita were with us.. we talked ahead of them"
	},
	{
		"User": "fraser s",
		"Location": "Canada",
		"DateofReview": "November 28, 2015",
		"ReviewTitle": "Nice place to have a walk",
		"Review": "The place is really good for walking. It is quiet and clean. And I feel safe walking around here with my family. A must go to place in Davao."
	},
	{
		"User": "Taildrag",
		"Location": "Clearwater, Florida",
		"DateofReview": "November 25, 2015",
		"ReviewTitle": "A quiet,clean,and beautiful park in the center of the city",
		"Review": "My wife and I spent a few hours walking around this very nice park.Very well kept and clean.This park is free to all.There are many areas for children to play and explore.Highly recommend a time there."
	},
	{
		"User": "lanaval",
		"Location": "Manila, Philippines",
		"DateofReview": "November 16, 2015",
		"ReviewTitle": "Needs more lighting",
		"Review": "It was a Saturday evening and there were just some few people in the park. It was dark in most areas so we had to watch our step especially on the uneven surface. We only did some picture-taking and left as there was nothing much...More"
	},
	{
		"User": "Rickf1",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 11, 2015",
		"ReviewTitle": "Excellent place to walk/jog",
		"Review": "Well maintained and free of diesel fumes. I was here almost every morning for 2 weeks. It was never too crowded even with the Saturday Zumba class. It was great to see many Dabawenyos involved in physical fitness."
	},
	{
		"User": "WillandKay",
		"Location": "Makati, Philippines",
		"DateofReview": "November 7, 2015",
		"ReviewTitle": "Refreshing park",
		"Review": "Went there for a lazy Sunday afternoon and to allow my daughter to experiment if her eagle balloon can fly like a kite. We were impressed that it was free but well-kept. Amazed at how homey it feels despite it being a public park. Luscious...More"
	},
	{
		"User": "Mandaluyong, Philippines",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "November 6, 2015",
		"ReviewTitle": "interesting art works",
		"Review": "this is a small park in the middle of the city of Davao that has a bit of everything- benches to sit on, some grassy area for picnics, a playground , a bamboo grove. but strangely, there is loud music blaring at all times. kind...More"
	},
	{
		"User": "Tolits09",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 20, 2015",
		"ReviewTitle": "A park for the masses",
		"Review": "Nice place to hangout or just to jog. Well maintained, but the CR is not very clean. You see people from all walks of life. Students, family."
	},
	{
		"User": "Irene F",
		"Location": " ",
		"DateofReview": "October 13, 2015",
		"ReviewTitle": "small but able...",
		"Review": "you would think this park is just one of the ordinary pastime places in davao. you're correct in a way but if it's your first time to visit the place, there's more to see that deserves appreciation. for one, there are several art structures that...More"
	},
	{
		"User": "John Elbert H",
		"Location": " ",
		"DateofReview": "October 7, 2015",
		"ReviewTitle": "Yes, it is!",
		"Review": "Yes it is really people's park. Nice place to visit. We stayed there for almost 2 hours. The music around the park makes the place more relaxing."
	},
	{
		"User": "Paulhudds2015",
		"Location": "Singapore, Singapore",
		"DateofReview": "September 23, 2015",
		"ReviewTitle": "Its a park",
		"Review": "Does what it says. Its a park. But not a lot of grass! Lots of concrete though... It has plenty of figures designed by local artists highlighting the city and the surrounding area, which are kinda fun. But overall, a park. If you have a...More"
	},
	{
		"User": "hijaviajeraph",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 22, 2015",
		"ReviewTitle": "Resting, Educational Park",
		"Review": "I love those big statues that represents Dabawenyos traditions and cultures. What strikes to me is the big Philippine Eagle sculpture near the entrance. Also the miniature of the whole DAVAO island inside is amazing. #thumbsup"
	},
	{
		"User": "Vince M",
		"Location": " ",
		"DateofReview": "September 20, 2015",
		"ReviewTitle": "It's really people's park",
		"Review": "Located in the middle of the city, a good place to refresh and take refuge from the city's noise and busyness."
	},
	{
		"User": "Nelle258",
		"Location": "Quezon, Philippines",
		"DateofReview": "September 16, 2015",
		"ReviewTitle": "Meet Local",
		"Review": "If your travelling to understand or know how the locals go night out, try visiting People's Park on a Sunday night. We went their Sept 6 a sunday and people gathered for a Singing contest and spend time out of the house. They looked really...More"
	},
	{
		"User": "Melbourne, Australia",
		"Location": "Melbourne, Australia",
		"DateofReview": "September 15, 2015",
		"ReviewTitle": "A relaxing area to visit.",
		"Review": "A lovely place to visit , morning , noon or night it always seems to be busy with people just walking or even doing there jogging on the large path that surrounds the park internally , plenty of shade and an hour or 2 spent...More"
	},
	{
		"User": "Sarah A",
		"Location": "China",
		"DateofReview": "September 2, 2015",
		"ReviewTitle": "Ok but Not a must",
		"Review": "Have been there and it is ok la .... If have time go up to my apo to get some green - is mich better ;) is a ok option to see some local night life as many local go there..."
	},
	{
		"User": "Bryce C",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "September 1, 2015",
		"ReviewTitle": "Family friendly park frequented by the locals.",
		"Review": "Seems like an average maintained public park. The fact that lighters, cigarettes, and food vendors are prohibited from entering contributes to an average cleanliness level. But it can be cleaner and better maintained for sure. Of course, don't expect an Ayala-ish kind of vibe from...More"
	},
	{
		"User": "Ma Cristina M",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "August 27, 2015",
		"ReviewTitle": "Forest in the City",
		"Review": "The Park is situated in the heart of the city right across Casa Leticia at the corners of Jose Camus and J. Palma Gil streets, and is a walking distance from Apo View Hotel, Mandaya Hotel, shopping malls, restaurants, bars, coffee shops, commercial establishments, and...More"
	},
	{
		"User": "realsheenamae",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 26, 2015",
		"ReviewTitle": "Davao Park",
		"Review": "Davaoeños was so excited when this park open. It is good for family picnic. Recommend to visit this place at night to see the fountain show and the beautiful lights inside. There is no entrance fee in entering this park so go and enjoy."
	},
	{
		"User": "Sampag1ta",
		"Location": "Puerto Galera, Philippines",
		"DateofReview": "August 23, 2015",
		"ReviewTitle": "nice park",
		"Review": "conveniently located park a quiet oasis in a noisy city, within a noisy city the park is convenient X"
	},
	{
		"User": "Jimmer A",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 13, 2015",
		"ReviewTitle": "Artistic and clean.",
		"Review": "People's park is a great place for friends and families to visit. You can see a lot of artworks that the city is proud of."
	},
	{
		"User": "Jigz N",
		"Location": " ",
		"DateofReview": "August 6, 2015",
		"ReviewTitle": "Forest at the heart of the city",
		"Review": "I jog here often and we gather groups here even students tend to make this park a practice area so I would rate this place excellent because its free and maintained. Come and visit because some history is also told in some parts of the...More"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 26, 2015",
		"ReviewTitle": "Family weekend getaway in the middle of the city",
		"Review": "This is one of the most affordable places to visit with the whole family. Kids will enjoy the play park, and the scenery is great for picture taking. This place has been developed for the whole family."
	},
	{
		"User": "Joyce C",
		"Location": "Iloilo Province, Philippines",
		"DateofReview": "July 23, 2015",
		"ReviewTitle": "Interesting place",
		"Review": "I liked the idea of putting structures of little brown men, artificial plants, etc, and the diversity of the place. It is also quite wide and there are actually birds walking on the road, giving you a 'nature' feel. Also, I can see that this place is one way of getting together without the cost of paying the venue. Hmm. It's just a shame that they have some sort of opening and closing 'time'."
	},
	{
		"User": "Dave F",
		"Location": "Melbourne",
		"DateofReview": "July 22, 2015",
		"ReviewTitle": "Great park",
		"Review": "Very nice park with some great sights to see. The statues are fun to pose with and it is kept clean and tidy."
	},
	{
		"User": "Mary Cris N",
		"Location": " ",
		"DateofReview": "July 21, 2015",
		"ReviewTitle": "Ordinary Place",
		"Review": "Just an ordinary park. If you want to kill your time, you better watch a movie than staying at this park."
	},
	{
		"User": "marianne f",
		"Location": " ",
		"DateofReview": "July 18, 2015",
		"ReviewTitle": "Nature in the city!",
		"Review": "Very romantic park, I must say! My husband and I personally loved the idea of a nature park in the city center. We checked in to a hotel in front and we wanted a breath of fresh air, so we went outside and found this really nice park. You can just walk or jog around it. Eat ice cream and just enjoy being a kid once again. It's really wide and spacious. It's a must see if ever you visit Davao. And don't forget to take a lot of pictures. Make memories...it's forever..."
	},
	{
		"User": "davao_dude",
		"Location": "Davao City",
		"DateofReview": "July 17, 2015",
		"ReviewTitle": "It's a breath of fresh air",
		"Review": "You can jog, walk around man-made forest replicas of major forests in the world. This I think is the lung of the Davao City center because of the green environment. A perfect place to hang around with friends and families at no cost. Try feeding the pigeons not with junk food. You can bring pellets for the birds to have healthier meals ;)"
	},
	{
		"User": "danalelojo",
		"Location": "Makati, Philippines",
		"DateofReview": "July 15, 2015",
		"ReviewTitle": "Sadly, it was closed",
		"Review": "We are about to go to Pasalubong Center when we got here, but sadly, it was closed yet. We were too early (9:30AM) for the opening. I would love to take a tour to this place and make my review but I guess it will not happen yet. \r \r I will be making my review here once I am able to and to go back to Davao. :) \r \r I can say and perhaps it can be compared to Nayong Pilipino in Manila? Anyway, one way to find out is to get here. :)"
	},
	{
		"User": "John Philip P",
		"Location": " ",
		"DateofReview": "July 13, 2015",
		"ReviewTitle": "Spacious public park in the city center.",
		"Review": "When in Davao, be sure to drop by this park. It's a testament of how clean and green Davao City is. There are also nice restaurants nearby where you can eat local food."
	},
	{
		"User": "Philippines",
		"Location": "Philippines",
		"DateofReview": "July 9, 2015",
		"ReviewTitle": "Enjoying the Green of Nature",
		"Review": "Park, plaza, picnic area... a place where you can relax, have fun, be you, and enjoy the fresh air and the beauty of nature in park."
	},
	{
		"User": "Iril P",
		"Location": " ",
		"DateofReview": "July 3, 2015",
		"ReviewTitle": "\"A touch of Davao\"",
		"Review": "I've been a constant visitor of people's park every time my family is in Davao City, usually twice a year. it's beautiful, clean and a perfect place for family bonding!"
	},
	{
		"User": "RicomeetsBhebs",
		"Location": "Philippines",
		"DateofReview": "July 1, 2015",
		"ReviewTitle": "A very clean and relaxing place",
		"Review": "We went there last saturday. The place was so beautiful and clean. They really maintain the cleanliness of the park. And there are securities who will check your things before going in. You will feel so safe during your stay there. And i never saw...More"
	},
	{
		"User": "K856FValanb",
		"Location": "Davao",
		"DateofReview": "July 1, 2015",
		"ReviewTitle": "you've never been to Davao if you've not visited this",
		"Review": "Forest in the midst of the city. BEAUTIFUL. A place where you can breathe fresh air in an urban place. Good for personal, group and lovers' time to bond with all its amenities. You will get a glimpse of what is Davao."
	},
	{
		"User": "leyopal",
		"Location": "Panabo City, Philippines",
		"DateofReview": "July 1, 2015",
		"ReviewTitle": "Sara's Park",
		"Review": "I always remember this park when the City government of Davao invited Dabawenyos in their \"name-this-park\" campaign. It was the time when Mayor Duterte has beautified this once \"PTA grounds\" into a park. If I have joined the campaign I could have submitted the park...More"
	},
	{
		"User": "saf7670",
		"Location": "Peterborough, United Kingdom",
		"DateofReview": "June 16, 2015",
		"ReviewTitle": "Nice place to relax in Davao... Just wear mosquito repellant !",
		"Review": "Visited Peoples park in the heart of Davao, the trees make it a nice sheltered place away from the heat of the city. Still havent figured out what all the odd statues are? The area is full of people walking, jogging or just relaxing ....More"
	},
	{
		"User": "ErwinTenTen",
		"Location": "Pampanga Province, Philippines",
		"DateofReview": "June 14, 2015",
		"ReviewTitle": "Breather in the middle of an urban",
		"Review": "Benches underneath a bunch of trees... The park is clean actually it is well maintained. A must see to anyone who are in davao"
	},
	{
		"User": "Jan B",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 12, 2015",
		"ReviewTitle": "good place to tambay",
		"Review": "a good place to stay.. with out any expenditure ... place is soo cool clean and have benches to sit."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 4, 2015",
		"ReviewTitle": "go here at night.its the best",
		"Review": "during the day its to hot and you will see all the imperfections. At night is the most fun, you will see a lot of different people here. the always gave a nice photo expo. mind it, this is more an asian park than a...More"
	},
	{
		"User": "FlorMiranda",
		"Location": "Makati, Philippines",
		"DateofReview": "May 10, 2015",
		"ReviewTitle": "A breath of fresh air !",
		"Review": "This is a piece of paradise in Davao. Ideal for families, friends, lovers , and even for solitary refection. Davao city is blessed to have this huge expanse of flora and fauna. Best place to jog in the city !"
	},
	{
		"User": "wenlong3788",
		"Location": "Bacolod, Philippines",
		"DateofReview": "May 10, 2015",
		"ReviewTitle": "Well maintained and safe park",
		"Review": "Well maintained park and very safe. Security checks before entering makes all those who enter feel safe. The place is good for picture taking as well as excellent place to walk, jog or run."
	},
	{
		"User": "larj2013",
		"Location": "Quezon City, Philippines",
		"DateofReview": "May 4, 2015",
		"ReviewTitle": "urban park",
		"Review": "best to hang out with family & friends to do almost anything under the sun...or night! good to see and have a snap with the big sculptures of indigenous people..."
	},
	{
		"User": "Peter S",
		"Location": "Tasmania, Australia",
		"DateofReview": "May 3, 2015",
		"ReviewTitle": "Nice family place",
		"Review": "Just to stroll around or lounge in this park is a great experience I visited in November 2014 and hearing the Christmas music playing was wonderful. Young couples parents with kids older couples everyone seemed to enjoy being there just to walk to feed the...More"
	},
	{
		"User": "jamjar136",
		"Location": "Melbourne",
		"DateofReview": "April 29, 2015",
		"ReviewTitle": "Nice clean place",
		"Review": "A nice park smack bang in the middle of the city. It's open for a few hours early int he morning for joggers, then closes. opens again in the afternoon and early evening. Nice for a walk, or a jog if you are so inclined."
	},
	{
		"User": "Beverly H",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 27, 2015",
		"ReviewTitle": "Awesome park",
		"Review": "Nice park with free zumba. I like the nice sculpture. Kublai Millan is a former highschool classmate and nice to know he designed the sculptures here."
	},
	{
		"User": "trippingpt",
		"Location": "Makati, Philippines",
		"DateofReview": "April 21, 2015",
		"ReviewTitle": "clean",
		"Review": "the Mayor really knows how to maintain cleanliness here :) has a lot of activity spots, from doing a regular stroll around the area or enjoying yourself in semi botanical garden within the busy city."
	},
	{
		"User": "Limay, Philippines",
		"Location": "Limay, Philippines",
		"DateofReview": "April 20, 2015",
		"ReviewTitle": "Fun picture-taking at People's Park",
		"Review": "Loved the figures everywhere! we had fun taking pictures of each and every statue there. the central area where benches are beneath the trees is very romantic. we even noticed a couple having their pre-nup pictorial there!"
	},
	{
		"User": "MrDestiny",
		"Location": "Sydney, Australia",
		"DateofReview": "April 14, 2015",
		"ReviewTitle": "Sad about the monkey",
		"Review": "Nice public space, more grass and less concrete would be nice. Needs maintenance, especially the concrete characters need repainting. The poor monkey going round and round in a small cage deserves better accomodation."
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "April 9, 2015",
		"ReviewTitle": "Nothing special",
		"Review": "I have been in the park several times - sad to say, even after several years after its opening - there is nothing very special. Strolling around, sitting on the benches ... that's it."
	},
	{
		"User": "tbose",
		"Location": "Kolkata (Calcutta), India",
		"DateofReview": "March 29, 2015",
		"ReviewTitle": "Fun place",
		"Review": "Excellent place for just some plain strolling or a good jog around the place or just sitting around in the benches."
	},
	{
		"User": "RoeBut",
		"Location": "Antwerp, Belgium",
		"DateofReview": "March 14, 2015",
		"ReviewTitle": "beautiful park",
		"Review": "beautiful,quiet not really big park. Had a nice walk, and in the weekends you can go for a public zumba at morning"
	},
	{
		"User": "superVeee09",
		"Location": "Lucena City",
		"DateofReview": "March 10, 2015",
		"ReviewTitle": "very nice during the night",
		"Review": "if you'll visit people's park do it during the night. well lighted. and don't worry about the safety of davao, it is number 4 in the safest city in the world."
	},
	{
		"User": "Ma S",
		"Location": " ",
		"DateofReview": "March 3, 2015",
		"ReviewTitle": "it;s ok but really not a park per say",
		"Review": "This park is nice. It is right in the middle of town. Only problem is that our backpack and bags were taken away. My son's skateboard was taken away and a number was written on it in permanent marker as well as our bags. THis...More"
	},
	{
		"User": "parttimefilo",
		"Location": "Coventry, United Kingdom",
		"DateofReview": "February 19, 2015",
		"ReviewTitle": "escape",
		"Review": "very nice little park where you can hide from the bedlam just outside the fence line shame they had to demolish a football field to get it in"
	},
	{
		"User": "Dubai, United Arab Emirates",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "February 12, 2015",
		"ReviewTitle": "Small Park with a Small Fee",
		"Review": "A single visit is worth it unless there are new things. Very accessible and entrance has a small fee. Do not be too excited in visiting here. Keep you expectation low but a visit is a must."
	},
	{
		"User": "Werner I",
		"Location": "Karlskoga, Orebro Lan, Sweden",
		"DateofReview": "January 7, 2015",
		"ReviewTitle": "Beautiful park",
		"Review": "If you visit Davao city you should take a look here. Not much to do, but beautiful. And the Filipino Eagle are very BIG :) But don´t bring bottles inside, because it makes guards crazy."
	},
	{
		"User": "Robert J",
		"Location": " ",
		"DateofReview": "January 4, 2015",
		"ReviewTitle": "Nice Park in the middle of Davao City",
		"Review": "This is an open park in the center of Davao City. It has walking paths and statues with grassy areas to sit down and relax. Lot's of kids here as it is a good spot for them to run around and play."
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "December 31, 2014",
		"ReviewTitle": "A park downtown",
		"Review": "You need to relax? You wish to be far away from the city's loud voice? Yeah, here it's indeed quiet and peaceful - and the most important: well-maintained. I miss this in many other places around Davao City. \"Sayang\"."
	},
	{
		"User": "glow143",
		"Location": " Davao City, Philippines",
		"DateofReview": "December 21, 2014",
		"ReviewTitle": "\" great for Zumba enthusiasts \"",
		"Review": "The park is a place were we really enjoy the experience of having Zumba in a bigger and wider area . I am one of those who constantly visit during weekends, and in this place I can unwind and sweat a lot to the beat....More"
	},
	{
		"User": "Emjae V",
		"Location": "Makati, Philippines",
		"DateofReview": "December 17, 2014",
		"ReviewTitle": "Quiet and peaceful",
		"Review": "The park is quiet and peaceful with lots of space to unwind. Clean, well-maintained and located just at the heart of the city."
	},
	{
		"User": "Fourth S",
		"Location": " ",
		"DateofReview": "December 15, 2014",
		"ReviewTitle": "Great for strolling!",
		"Review": "The park is very wide and the Kublai pieces the best attractions. You can bring food and eat in the benches or set a blanket in the inner of the oval. Children enjoyed watching the fishes in the pond (though it's quite murky now than...More"
	},
	{
		"User": "royalim",
		"Location": "cavite city",
		"DateofReview": "December 13, 2014",
		"ReviewTitle": "wide and quiet",
		"Review": "nice place to relax or jog. many place to set and talk a while.clean but many delapadated,shall i say things which is an eye sore.the eagle statue is wonderfull."
	},
	{
		"User": "Makati",
		"Location": "Makati",
		"DateofReview": "December 2, 2014",
		"ReviewTitle": "Good place for free",
		"Review": "The name speaks for itself. This place is secured, a trademark of Davao, I guess. The place is clean. Not really that much of a tourist attraction but if you have time to spare, visiting People's Park is not really a bad choice. Plus, it...More"
	},
	{
		"User": "Fredontheroad",
		"Location": "San Francisco, California",
		"DateofReview": "October 21, 2014",
		"ReviewTitle": "great park",
		"Review": "in the middle of the city. filled with larger than life sculptures of local life, centered by a huge likeness of the local favorite fruit: durian. always a pleasure to take a walk there"
	},
	{
		"User": "MarJho16",
		"Location": "General Santos City, General Santos, Philippines",
		"DateofReview": "October 6, 2014",
		"ReviewTitle": "Clean park",
		"Review": "There were many people, vendors, and it has a clean place because their mayor is really implementing the rules but be careful with pickpockets because you may go home crying."
	},
	{
		"User": "TravelBug1469",
		"Location": "Manila, Philippines",
		"DateofReview": "September 22, 2014",
		"ReviewTitle": "Your ID Please",
		"Review": "We went to People's Park very early in the morning, considering the tight itinerary we had on our list. The park is still 'closed' with very few people visible inside. We inquired at non-uniformed men manning the gate. They politely asked from where we were,...More"
	},
	{
		"User": "mochiluff",
		"Location": "Manila, Philippines",
		"DateofReview": "September 12, 2014",
		"ReviewTitle": "relaxing",
		"Review": "If you are living in Davao, this place is a very nice place to relax or jog. But if you are a tourist, there is really nothing new to see. It is just a standard park with a playground, park benches and a concrete running...More"
	},
	{
		"User": "Rolly M",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "September 9, 2014",
		"ReviewTitle": "The Safest Park in the Philippines",
		"Review": "I like this park because it is Free, clean, open, well-guarded and plenty of place to sit around. I went here alone and tried to look at it as an adult and as a child. I think Families will enjoy this park. There are whimsical...More"
	},
	{
		"User": "John G",
		"Location": "Newport Beach, California, United States",
		"DateofReview": "September 8, 2014",
		"ReviewTitle": "Beautiful setting",
		"Review": "Beautiful park with lots of local art and statues. Great place to people watch, enjoy a picnic, walk off a big meal or even use the jogging track. Very safe!"
	},
	{
		"User": "R0dent",
		"Location": "Austin, Texas",
		"DateofReview": "August 27, 2014",
		"ReviewTitle": "People's Park not for everyone",
		"Review": "Unless you go for a jog, you can be in and out within 30 minutes. I think people are exaggerating the park's cleanliness and landscaping. I don't mean to offend Filipinos, but this park is noteworthy only by Philippine standards. But to Westerners, it's just...More"
	},
	{
		"User": "Singapore, Singapore",
		"Location": "Singapore, Singapore",
		"DateofReview": "August 20, 2014",
		"ReviewTitle": "not much too see, dancing fountain wasnt really something to check out",
		"Review": "and the dancing fountain isnt much vigan have a better dancing fountain might be good for families with kids and lovers who prefers the dark, as the place is not well lighted"
	},
	{
		"User": "251Michigan",
		"Location": "Lansing, Michigan",
		"DateofReview": "June 21, 2014",
		"ReviewTitle": "Terrible",
		"Review": "No water falls, everything was closed. several subjects lifting weights next to the Garden area that had no flowers."
	},
	{
		"User": "Anna L",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "June 17, 2014",
		"ReviewTitle": "unforgettable experience",
		"Review": "stayed for 4 hours..waiting for other delegates since the bus going to samal was near here. we had our lunch here and the food is quiet expensive and doesnt taste well..outside there are durian stalls.. and sad is some gives us prices way too hugh...More"
	},
	{
		"User": "Globetrotter620701",
		"Location": "Philippines",
		"DateofReview": "June 16, 2014",
		"ReviewTitle": "A rainy afternoon",
		"Review": "I spent an afternoon in the park during my first day in Davao. Its my first time to go there. The park is big, with several attractions. The flowers are beautiful also the place where they held affairs or occasions. They also have a childrens...More"
	},
	{
		"User": "AprilCamias",
		"Location": "San Pedro, Philippines",
		"DateofReview": "June 11, 2014",
		"ReviewTitle": "Luneta Park in Davao",
		"Review": "Place to stay for a while and CHILL! this was the Luneta Park residing in Davao. me and my boyfriend made some flying creatures eat piattos :) hahaha"
	},
	{
		"User": "fujijohn",
		"Location": " ",
		"DateofReview": "May 28, 2014",
		"ReviewTitle": "NICE FAMILY PARK",
		"Review": "This place is free and lots of family come to stroll, picnic and play. The park is centrally located close to the downtown area. There are lots of trees really a nice park. We love it here."
	},
	{
		"User": "Ecyor",
		"Location": "Manila",
		"DateofReview": "May 8, 2014",
		"ReviewTitle": "A haven for park lovers within the city",
		"Review": "I make it a point to drop by the People's Park whenever I'm in Davao City. After long walks within the city proper, I find my way to this place to unwind and observe the locals. When you go here, make sure you don't bring...More"
	},
	{
		"User": "Jeannard Jay T",
		"Location": "Baguio, Baguio, Philippines",
		"DateofReview": "May 1, 2014",
		"ReviewTitle": "Greens in the City",
		"Review": "i like it because it is a goop place to be refreshed and hear the rushing waters and children's laughter in the middle of a busy city. it's located close to hotels, malls, government offices, schools, and even churches. it doesnt offer much activities but...More"
	},
	{
		"User": "Minneapolis, Minnesota",
		"Location": "Minneapolis, Minnesota",
		"DateofReview": "April 21, 2014",
		"ReviewTitle": "Great place to jog in the early AM",
		"Review": "Hundreds of people out every morning. Exercises let on Sat & Sun. Am happy my hotel was a few blocks away....no sleeping after 5:30AM close to the park...."
	},
	{
		"User": "Mishgreeka",
		"Location": "Heraklion, Iraklion, Greece",
		"DateofReview": "April 13, 2014",
		"ReviewTitle": "\"park\"",
		"Review": "The park in the evening is a hung-out for the locals,lovers,students and anyone who wish to have some peace of mind.It is clean and safe.Bars & restaurant are just nearby.Nothing but a park !"
	},
	{
		"User": "PinayfromTx",
		"Location": "Houston, Texas",
		"DateofReview": "March 29, 2014",
		"ReviewTitle": "Boring",
		"Review": "Nothing much to see and very hot on a summer afternoon. Glad we didn't have to pay an entrance fee. They let us in outside of the usual park hours since we weren't from Davao."
	},
	{
		"User": "whygoback",
		"Location": "Gili Trawangan, Indonesia",
		"DateofReview": "March 22, 2014",
		"ReviewTitle": "Ok Park",
		"Review": "The park is decent, and popular, the area around it has some decent food and nightlife. They keep it clean and safe so give it a stroll, then find some diner nearby and then head out for some music all within blocks of here."
	},
	{
		"User": "Kimberley_Chong",
		"Location": "Kuala Lumpur, Malaysia",
		"DateofReview": "January 31, 2014",
		"ReviewTitle": "Popular hang out spot",
		"Review": "Seems like a place for people to take evening walks, do group exercises and just sit around to enjoy the night. There is a security check upon entering just for general safety checks. If you stay late enough you can catch the lighted fountain display...More"
	},
	{
		"User": "msfinest",
		"Location": "Charlotte, North Carolina",
		"DateofReview": "January 30, 2014",
		"ReviewTitle": "Great place to relax",
		"Review": "People's park is one of the hang outs spots in Davao City, Most people go during afternoon and evening to spend quality time with friends and family, Some do their running in the oval track (500m) of the park early morning especially during Saturday and...More"
	},
	{
		"User": "Maricel P",
		"Location": "San Pedro, Philippines",
		"DateofReview": "January 25, 2014",
		"ReviewTitle": "clean and beautiful park",
		"Review": "it was night when we strolled the park and security upon entering the premises was so tight. we have to queue for the inspection of our bags. but the wait is worth it because you will truly appreciate the park.it was a wide park and...More"
	},
	{
		"User": "Dee G",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "January 14, 2014",
		"ReviewTitle": "Not Much to Miss - Visit if You Can",
		"Review": "People's Park is located in downtown Davao. Entrance is free, and it's a good place to visit if you have time. There''s not much in it, but it's got these nice statues made by a local artist and I think foreign tourists would love to...More"
	},
	{
		"User": "Columbus, Ohio",
		"Location": "Columbus, Ohio",
		"DateofReview": "January 6, 2014",
		"ReviewTitle": "a safe secure park",
		"Review": "A beautiful park in the midst of the city. Beautiful scenery, and walking, running paths. Well secured, NO CRIME!"
	},
	{
		"User": "zayki",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "December 11, 2013",
		"ReviewTitle": "Good family place but a busy park",
		"Review": "I cannot remember when I really went there but there was a lot of teens and college students even at night. But I think this will be a good place for the family on weekends. Clean and lots of spaces where can just bond with the little kids."
	},
	{
		"User": "BGonzalez1973",
		"Location": "Jewett City, Connecticut",
		"DateofReview": "December 11, 2013",
		"ReviewTitle": "Nice Park",
		"Review": "A place you can enjoy a nice walk. You can also see some sculptures there. A very safe environment day or night."
	},
	{
		"User": "Charina A",
		"Location": "Cotabato City, Philippines",
		"DateofReview": "December 9, 2013",
		"ReviewTitle": "Nice park",
		"Review": "For a public park that is free, I would say that it is an excellent park because it is clean. It also has lots of wonderful sculptures. The security is also strict which is really a good thing. The park is a very relaxing place. The park is also surrounded with restaurants so food is not a problem."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "December 5, 2013",
		"ReviewTitle": "Quick break in the heart of the city",
		"Review": "Consider it as Davao's lungs. The patches of green make you feel relax and forget that ur in the middle of an urban center. Great for walks and jogs in early mornings and late afternoons, or simply a place to stroll and chat with friends. Tip: free aerobic/Zumba exercises on weekends!"
	},
	{
		"User": "Runel Zeth R",
		"Location": "Bacolod CIty, Bacolod, Philippines",
		"DateofReview": "November 1, 2013",
		"ReviewTitle": "Art park",
		"Review": "I enjoyed the park because of the bautiful artwork of smilling kids. and I also enjoyed the doves that are living in that park, they come close to me.hehehe"
	},
	{
		"User": "bidnessboi",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 1, 2013",
		"ReviewTitle": "Worth a look if you have time",
		"Review": "It's a little park basically with some areas that are ok for photos. There's no adventure or glamour and it's a hang out for Davao residents. \r \r I walked through there once and it was pleasant. \r \r I don't know that it would be too exciting for foreign visitors whereby Samal, Jack's Ridge, Crocodile Park would be ahead on that list."
	},
	{
		"User": "marns_marns",
		"Location": "Manila, Philippines",
		"DateofReview": "September 17, 2013",
		"ReviewTitle": "Thumbs up for a public park",
		"Review": "The park is clean and it is no smoking. You can definitely enjoy your time if you have kids. The sculptures are a real work of art."
	},
	{
		"User": "Philippines",
		"Location": "Philippines",
		"DateofReview": "September 5, 2013",
		"ReviewTitle": "Safe and relaxing!",
		"Review": "Before you enter the park policemen will inspect your bags and other belongs for security reasons.The place is well kept.The trees are well groomed.The park is clean and has nice looking statues.Its a good place to rest after rooming around the city.Be sure to take pictures."
	},
	{
		"User": "Angelito P",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "August 26, 2013",
		"ReviewTitle": "Good enough",
		"Review": "Ponds, gardens and stone sculpture. Pastoral. Restful. The restaurants are just outside the complex."
	},
	{
		"User": "Cookie O",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 16, 2013",
		"ReviewTitle": "A sanctuary inside the city",
		"Review": "One of the most accessible and nicest places to visit in Davao. Once you enter the park you'll see curious-looking statues and kids running around and visitors taking pictures. The place has a warm and friendly atmosphere that invites everyone in. It's not unusual to...More"
	},
	{
		"User": "aki0618",
		"Location": "Manila, Philippines",
		"DateofReview": "August 13, 2013",
		"ReviewTitle": "great",
		"Review": "easy to find it and well kept...and they have toilets so convenient. They are also careful so there\"s a security check at the gates...."
	},
	{
		"User": "Christine C",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 31, 2013",
		"ReviewTitle": "Take the Kids",
		"Review": "People's Park is a place made for kids. It has sculptures and lots for them to see and do. It is located in the city so you can stop there for a walk or to relax. The statues are created by the famous artist Kublai....More"
	},
	{
		"User": "Don L",
		"Location": "Mindanao, Philippines",
		"DateofReview": "July 30, 2013",
		"ReviewTitle": "OK park, great statues",
		"Review": "The best thing about this park is that it is in middle of Davao - an oasis in a crowded, congested city. there are plenty of activities for kids. As well, there are wonderful statues to see created by Kublai, the guru-artist of Davao. I'd...More"
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 30, 2013",
		"ReviewTitle": "You shouldn't miss when in Davao",
		"Review": "I submit to the artists' excellence in the different sculptures dominating the park. The park not only offer a relaxing place and playground for children but also offers a showcase of Filipino masterpieces. We arrived at the park around 10am. We were told that the...More"
	},
	{
		"User": "Dibyne",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 30, 2013",
		"ReviewTitle": "Kublai's obra",
		"Review": "Definitely, one of the city government's greatest projects. This showcase the sculpture of Davao's best artist--- Kublai Millan.. Other than the city's people's park, he has created sculpture in most cities and municipalities of Mindanao.. Also, the place is preserved and is secured by government...More"
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "July 26, 2013",
		"ReviewTitle": "safe and clean -- even at night!",
		"Review": "this is the one park i've been to where you have street sweepers and park rangers up and about at around 8p.m. it was very safe, clean and brightly lit. i just chilled by the bench watching people jog around. it's a nice place to...More"
	},
	{
		"User": "Van G",
		"Location": "Cebu City, Philippines",
		"DateofReview": "July 1, 2013",
		"ReviewTitle": "One of the Best Parks in the Country",
		"Review": "This for me is truly one of the best parks in the country. They also give priority to visiting tourists even if they are closed for the usual rounds of cleaning. What I also love about this park is the huge eagle sculpture that accurately represents Davao for being the City that preserves the Philippine Eagle. This park also houses locals who are into their dance routines and exercises. A must visit when you are in Davao."
	},
	{
		"User": "ruzzell m",
		"Location": "Tacurong City",
		"DateofReview": "May 20, 2013",
		"ReviewTitle": "Gems Center of the City",
		"Review": "Way back last 4 years ago when our class going to Davao city, we visited this kind of Park.. I will say, this one of the best Park of the country.. A lot of things that your eyes will enjoyed to see.. also there is mini zoo and falls that man made.. i will definitely come here again when i going back to davao..... :-)"
	},
	{
		"User": "PhilipinoRabbit",
		"Location": "Oregon",
		"DateofReview": "May 7, 2013",
		"ReviewTitle": "Very nice Park in middle of city",
		"Review": "The People's Park is a must see if you are in Davao.It's a very large city block ,or larger, gated park. You have to go through security-no weapons or cigarettes as Davao is pretty much smoke free. The park has a circular walk along the perimeter with ponds, waterfalls, a large collection of different trees from all over asia and a sitting area and water show (some nights). During Christmas season they have a synchronized light and music and water show. It also has a kids play area. Very nice to stroll around in the evening with plenty of good restaurants nearby."
	},
	{
		"User": "docferry",
		"Location": "Manila, Philippines",
		"DateofReview": "March 25, 2013",
		"ReviewTitle": "A place to relax",
		"Review": "People`s Park is within the city proper. One can sit and relax and enjoy the weather. Its for free so no need to worry about expenses."
	},
	{
		"User": "charitoyara",
		"Location": "Quezon City, Philippines",
		"DateofReview": "March 20, 2013",
		"ReviewTitle": "People's Park, Davao City",
		"Review": "nothing much to see, except food vendors, the park is over rated, nothing exciting, foods sold by vendors are mostly junk foods."
	},
	{
		"User": "hrh_en-ar",
		"Location": "makati",
		"DateofReview": "March 17, 2013",
		"ReviewTitle": "surprising experience",
		"Review": "what surprised me in this park is that it has...bag inspection before you enter. :) the park is okay; it's not that big. it has man-made waterfalls"
	},
	{
		"User": "466Neo",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 17, 2013",
		"ReviewTitle": "A nice place for people with limited funds",
		"Review": "I do think its worth visiting but more for the learning about Davao and its citizen than for the place itself. Toilets are really nasty, but the park has value as a relaxing place where people from all classes can meet. There is no fee´s"
	},
	{
		"User": "Orlando, Florida",
		"Location": "Orlando, Florida",
		"DateofReview": "March 6, 2013",
		"ReviewTitle": "Worth a Quick Visit.",
		"Review": "It’s a small but interesting park in the center of Davao City, Entry is free but everyone is security searched on entry. Lots of trees, quiet areas and places for children to play. There are also lots of larger than life painted sculptures by the renowned Davao artist and Kublai Millan."
	},
	{
		"User": "Janarthani A",
		"Location": "Petaling Jaya, Malaysia",
		"DateofReview": "December 21, 2012",
		"ReviewTitle": "Lively place for a morning jaunt",
		"Review": "I happen to rent a room very near the People's Park. It is such a hive of activities on Saturdays and Sundays. There is an aerobic session which has 300 people dancing and enjoying themselves. \r It is quite small for a green lung in the city but you feel relatively safe. It is constant full of people, the security is pretty tight. The amenities are wanting, the toilets need to be maintained better. "
	},
	{
		"User": "sweetliar",
		"Location": "Chicago, IL",
		"DateofReview": "December 21, 2012",
		"ReviewTitle": "Hanging out with friends",
		"Review": "It's new! Did not realize this existed in the heart of Davao. There were plenty of areas that friends can just wander around, lovers to cozy up to each other whispering sweet nothings. Security checks each person entering the premises. Secure."
	},
	{
		"User": "charcieldavao",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 19, 2012",
		"ReviewTitle": "Speaks for the rich culture of Davaoenos",
		"Review": "Clean, Forest in the city, and wonderful art work of famous kublai can be seen in this place, playground that would kids surely njoy for free, plenty of seats that relax your mine and have some snacks while seeing plenty of visitors use to walk around, lovely music everywhere, and the most important is very safe, police visibility in area,no smoking, tight security check upon entrance makes everyone to feel more comfortable during their visit.\r Bringing of food is allowed but no sharp or deadly weapons allowed, and clean your own mess as courtesy to the next user and to the mgt of the park as this park is free of entrance and all amenities so let's be responsible and sensitive while you visit here."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "December 6, 2012",
		"ReviewTitle": "Great place to be, safe and relaxing",
		"Review": "A clean and pleasantly beautiful place for everyone. \r There is a scheduled opening time and this make sure that the park is cleaned and readied for the next batch to come in the later afternoon. Everyone feels safe. The guards checked whoever comes in.\r \r Beautiful place. Be sure to bring your camera"
	},
	{
		"User": "Yolanda F",
		"Location": "Quezon City, Philippines",
		"DateofReview": "November 28, 2012",
		"ReviewTitle": "Impressive Public Park worth visiting",
		"Review": "The park is located beside the Apo View Hotel and open till nightime. It is free of charge and offers the public a view of amazing and wonderful display of artworks and sculptures."
	},
	{
		"User": "suyen l",
		"Location": "singapore",
		"DateofReview": "November 22, 2012",
		"ReviewTitle": "good location for a family get together",
		"Review": "the place is child friendly this is the cheapest place to stay with the family and have adry picninc there"
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 20, 2012",
		"ReviewTitle": "A place for all people",
		"Review": "A forest in the City does exists? Yes, it does! The People's Park in Davao City is a forest in the city where you can enjoy to take a look at if you are a tourist in Davao. The different varieties of growing trees which will give shades when you stroll the area, the artificial waterfalls will enchant you to take a picture. And if you get tired of strolling around, the benches are all over waiting for you to take a rest, enjoy the scenery and see the locals enjoying the park's view as well. You can also have a picnic there, just ensure to bring your own and that you clean up your mess and throw it properly in the garbage bins visible within the park. The place is free for everyone :)"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 17, 2012",
		"ReviewTitle": "Perfect place to jog",
		"Review": "I am living 100 meters away from this park. And i could say that this is the perfect place for me to jog. Spent 30 to 60minutes twice a week here. Sadly, the park will open 5:00am everyday. I will give EXCELLENT rating if they will open the gate at 4:00am. "
	},
	{
		"User": "aki0618",
		"Location": "Manila, Philippines",
		"DateofReview": "October 28, 2012",
		"ReviewTitle": "nice place to jog",
		"Review": "yes and you will enjoy as there many people jogging in this place. they open early so convenient and clean...oh got clean rest room as well"
	},
	{
		"User": "Greg48",
		"Location": "Meriden, Connecticut",
		"DateofReview": "October 28, 2012",
		"ReviewTitle": "A reall kick",
		"Review": "it could be me-- but the People's pPark in Davao has just the right combo of tackiness and fun to make it a great place to go on a family outing. I was there alone and without family, but seeing the oversized statues, the families...More"
	},
	{
		"User": "Zhira T",
		"Location": "Makati, Rizal, Philippines",
		"DateofReview": "October 18, 2012",
		"ReviewTitle": "the Park",
		"Review": "it was the first ever park i when in to with guard who will ask for an identification card and check your bags. the place was clean and peaceful."
	},
	{
		"User": "yazhel",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 3, 2012",
		"ReviewTitle": "good for jogging",
		"Review": "nice place, nice security, nice music, everyone can definitely enjoy the place, but nothing spectacular really"
	},
	{
		"User": "Perry H",
		"Location": "Cebu City, Cebu City, Philippines",
		"DateofReview": "September 20, 2012",
		"ReviewTitle": "Nice Place to Relax",
		"Review": "Visited the park before I go back to Cebu last Sunday. It is very clean and it's a nice place to sit down and talk with your friends and take some pictures :P"
	},
	{
		"User": "Lara D",
		"Location": "Cavite City, Philippines",
		"DateofReview": "September 19, 2012",
		"ReviewTitle": "Nice park",
		"Review": "I thought it was just like any other ordinary park here in Manila. But it's not. It's bigger, nicer and more entertaining. They have statues, waterfalls, nice lights. Great place to unwind."
	},
	{
		"User": "sleep00walker",
		"Location": "Vienna, Austria",
		"DateofReview": "September 18, 2012",
		"ReviewTitle": "Fairy tale",
		"Review": "The best city park I have seen in the Philippines decorated with Kublai Milan's cute statues. Dont miss to visit it !"
	},
	{
		"User": "Victoria, Canada",
		"Location": "Victoria, Canada",
		"DateofReview": "September 17, 2012",
		"ReviewTitle": "Free for all, just mind the opening hours!",
		"Review": "This park is nice, with larger than life statues, a great place to hang around with friends. Mind the opening hours which are strange.. they are written on the fence.. something like 5am-9am and 9pm-midnight. If you get stuck outside there's some pretty good Ihaw-Ihaws...More"
	},
	{
		"User": "JollyBee2012",
		"Location": "Berlin, Germany",
		"DateofReview": "August 24, 2012",
		"ReviewTitle": "Army training course",
		"Review": "This so called park has nothing in common we the \"western\" definition of a park. No good place to relax at all."
	},
	{
		"User": "Ken S",
		"Location": "Diss, United Kingdom",
		"DateofReview": "August 20, 2012",
		"ReviewTitle": "An oasis in a busy city.",
		"Review": "Quite a unique place. I love the local wooden figures. There are some great flowers & plants. It is an oasis in a busy city."
	},
	{
		"User": "dhezabear",
		"Location": "Manila",
		"DateofReview": "August 18, 2012",
		"ReviewTitle": "Park for the people.",
		"Review": "Safe and clean! Great way to spend a sunny breezy afternoon with a loved one. Too bad it rained when we visited the place!"
	},
	{
		"User": "stevemobeman",
		"Location": "Lakeland, Florida",
		"DateofReview": "August 5, 2012",
		"ReviewTitle": "Delightful Visit",
		"Review": "Peaceful, beautiful, quiet all describe this park in the middle of a busy city. Many people attending, but so spacious that never feel crowded."
	},
	{
		"User": "Lei P",
		"Location": "Taguig City, Philippines",
		"DateofReview": "July 22, 2012",
		"ReviewTitle": "Free Showcase of Davao Culture!",
		"Review": "No entrance fee and the place's full of arts showing Davao's culture. The best part is you can feed the pigeons with Fita or Eggnog. That alone is so relaxing and fun!"
	},
	{
		"User": "hlim34",
		"Location": "Manila, Philippines",
		"DateofReview": "July 14, 2012",
		"ReviewTitle": "very clean and orderly",
		"Review": "it was very clean and well maintained. there are lots of statues that you could take pics of or you could just relax and go people-watching. nice place to while the time.."
	},
	{
		"User": "aki0618",
		"Location": "Manila, Philippines",
		"DateofReview": "July 11, 2012",
		"ReviewTitle": "love it",
		"Review": "close to where we stay... nice place for jogging, clean restrooms and i feel safe inside"
	},
	{
		"User": "Dumaguete City, Dumaguete, Philippines",
		"Location": "Dumaguete City, Dumaguete, Philippines",
		"DateofReview": "July 6, 2012",
		"ReviewTitle": "Clean n' Green Park",
		"Review": "One of the cleanest and greenest park I've ever visit, no entrance fee yet with security guard and person in-charge maintaining the park's cleanliness. There, you have views to take your pictures, you'll really enjoy. We have so fun in there."
	},
	{
		"User": "miles101366",
		"Location": "Manila, Philippines",
		"DateofReview": "June 22, 2012",
		"ReviewTitle": "huge park in a circle shape",
		"Review": "a non smoking park, local can do aerobics and jogging inside the park..playground is safe for the children. and pigeons flying free inside the park.."
	},
	{
		"User": "Ed I",
		"Location": "Davao",
		"DateofReview": "May 29, 2012",
		"ReviewTitle": "Nice place for couples and picture taking.",
		"Review": "I like the access to it, even tho it opens a little late in the day."
	},
	{
		"User": "3052240",
		"Location": " ",
		"DateofReview": "May 28, 2012",
		"ReviewTitle": "It's amazing at night!",
		"Review": "You can take many great photos, it's a great place to hang-out with your friends and family. And it's free!"
	},
	{
		"User": "maia_cyllene",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 24, 2012",
		"ReviewTitle": "The WALK",
		"Review": "Davao trip is not complete if you miss visiting their People's Park. It is a park in the center of the city. A good place to stroll with family on Saturdays and Sundays. They have gardens with gazebos where you could enjoy your simple picnic...More"
	},
	{
		"User": "Angel A",
		"Location": "Manila, Philippines",
		"DateofReview": "May 14, 2012",
		"ReviewTitle": "People's Park",
		"Review": "Well, the park was quite ordinary. It didn't really have the wow factor."
	},
	{
		"User": "mzzyap8",
		"Location": "Philippines",
		"DateofReview": "April 23, 2012",
		"ReviewTitle": "Aptly named: People's Park in Davao City:)",
		"Review": "Look, anywhere the city government maintains a \"beautified\" park for the enjoyment of residents and visitors alike, get an A+ grade from me:) Just take note of the park's schedule I attached here before you go. By the way, you are NOT allowed to bring...More"
	},
	{
		"User": "dianne_tjm",
		"Location": "Central Florida, Florida",
		"DateofReview": "April 15, 2012",
		"ReviewTitle": "nice typical park,",
		"Review": "this park is big and i enjoyed my strolling time here. we went here after our dinner at fridays and walikng around here helps us to loose our dinner..theres a lot to see here and my frendz and were having fun about the statues.. outside...More"
	},
	{
		"User": "Polomolok, South Cotabato, Philippines",
		"Location": "Polomolok, South Cotabato, Philippines",
		"DateofReview": "April 23, 2011",
		"ReviewTitle": "Relaxing place in the heart of the city",
		"Review": "Though I have been to Davao many times but I never visited that place except for my last visit because a friend of mine insisted. The park was a child friendly. I love the rainbow color of the floor when you reach entrance. The sculpture of eagles and children playing was nice. People there, loved to sit and listen to the music played in the park. \r \r They are strict with their security. You can't bring bottled water or a cigarette, lighter. You must leave it at the entrance and claim it when you decide to leave the park. Well, someone who is new to Davao must visit this place. Its just around the downtown, near to the restaurants and hospitals."
	}
]
