[
	{
		"User": "small-skiing-mole",
		"Location": "South East England",
		"DateofReview": "4 weeks ago",
		"ReviewTitle": "Plenty of eagles and other birds to see and informative film in a side room",
		"Review": "I believe this place does great work, breeding and releasing into the wild. However, they don't highlight this fact unless you watch the short documentary in a side room and then speak to the staff there. After walking round, it just seemed like a nice little bird zoo rearing highly endangered captive eagles and some other eagles, kites and owls, but a staff member in the film room highlighed the work behind the scenes rearing birds away from human contact so that they can be released. PLEASE HIGHLIGHT YOUR CONSERVATION EFFORTS MORE PROMINENTLY!"
	},
	{
		"User": "Aljess L",
		"Location": " ",
		"DateofReview": "March 5, 2018",
		"ReviewTitle": "Worthy cause",
		"Review": "Kudos to the Philippine Eagle Center for its work to propagate the Philippine national bird. Went there on a weekday, not that busy--no guide available as well. A visitor's center with a multimedia presentation would have helped further the cause.\r \r The place was a bit run down and could use a little sprucing up. It was sad to see the lone croc in its tiny enclosure and few other animals in captivity (deer, warthogs, etc.) \r \r Not a fan of zoos but a visit and donation to the center is all for a worthy cause.\r \r P.S. Bring bug repellent, the mosquitoes were relentless!"
	},
	{
		"User": "mrneli4evr",
		"Location": " ",
		"DateofReview": "March 5, 2018",
		"ReviewTitle": "Endangered Species in Davao",
		"Review": "Different Endangered Animals you can see here in Philippine Eagle Center but was neglected. The place was not well taking cared of. Sad to look at those Animals in dirty cages, trees uncut or well maintained. Entrance fees are very high cost - not worth it for what you will see inside. You will not enjoy touring inside or seeing those animals but you will feel sad unlike other Parks (for Animals) we've been to. I hope you can do better than that. Was not impressed. "
	},
	{
		"User": "Mhina1021",
		"Location": "Pasig, Philippines",
		"DateofReview": "March 3, 2018",
		"ReviewTitle": "Soaring with the Eagles",
		"Review": "And I'm not talking about Ateneo but the real thing. I encourage you to take time to visit this place when you're in Davao. A little educational trip on the side wont hurt. As our national bird is critically endangered together with the other endemic species, we need to spread awareness. But aside from that it was really amazing seeing them in person and to see how majestic these creatures are. "
	},
	{
		"User": "Katrina L",
		"Location": " ",
		"DateofReview": "March 3, 2018",
		"ReviewTitle": "Majestic endangered eagles",
		"Review": "The eagle center has many large cages for a few eagles. Some are not in cages, only tied to a post so visitors can come closer. They are really beautiful creatures. They have other animals there as well."
	},
	{
		"User": "leli G",
		"Location": " ",
		"DateofReview": "March 1, 2018",
		"ReviewTitle": "👍",
		"Review": "I hope that they have a guided tour like in D’bone so that it can be interactive and not boring. 👍👍"
	},
	{
		"User": "doctorfoxtrot",
		"Location": "Manila Philippines",
		"DateofReview": "February 17, 2018",
		"ReviewTitle": "Part of Itinerary But ..",
		"Review": "It was a good part of the itinerary in Davao . But going there took quite a lot of time. More time travelling than the time actually spent there. Aside from the eagles held in captivity , there is also an owl and a crocodile. Since you are already there why not spend time buying souvenirs, trying the honey coated turon , and a photo op with a python. "
	},
	{
		"User": "Vegaztony",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "San Francisco, CA",
		"Location": "San Francisco, CA",
		"DateofReview": "February 9, 2018",
		"ReviewTitle": "Cool Eagle Sanctuary",
		"Review": "This was a very educational stop and I was awed by the number of Eagles at the Centre. This is a tour that you do on your own, and I was impressed with everything here. This is definitely a must-see on your journey."
	},
	{
		"User": "pixieserrano",
		"Location": " ",
		"DateofReview": "January 30, 2018",
		"ReviewTitle": "Wide array of species",
		"Review": "There were more species here now than in the past few years, which is good because not only were there more animals and birds to see but it's inspiring to see more institutions adopting these creatures so they could survive. Would have been awesome if the whole place is kept tidy and the huts are maintained. overall, the experience is great especially for young children."
	},
	{
		"User": "Jay F",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 28, 2018",
		"ReviewTitle": "Only in Davao City",
		"Review": "Best time to visit is during feeding time. That is around 8:30-9:00 am daily or 3:00-4:00 pm. There is an injured eagle that cant fly but can pose very well, make sure you have a selfie with it. Also, make sure that you put on mosquito repellant when you visit the center."
	},
	{
		"User": "Tor Erling M",
		"Location": " ",
		"DateofReview": "January 26, 2018",
		"ReviewTitle": "Nice place for picnic.",
		"Review": "Nice place to see Eagles. And owls.walking around in fresh air and see birds or feed the fish. Or only have picnic with friends"
	},
	{
		"User": "looklikecris",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "January 24, 2018",
		"ReviewTitle": "A Sanctuary",
		"Review": "A sanctuary for our national bird. But aside from eagle, we also had a close encounter with a huge crocodile, wild boars and monkeys. Compare from the other zoos I've been, animals here were almost close to their original habitat. But they are still in capture. \r \r Entrance fee is 350 pesos for adults. It is pricey but we only think that it was a donation for this sanctuary because they really need our help for the conservation of our Philippine Eagles."
	},
	{
		"User": "travel_l_love",
		"Location": "Vienna, Austria",
		"DateofReview": "January 21, 2018",
		"ReviewTitle": "Unacceptable conditions",
		"Review": "It's one of the worst places for animals I have seen ever in my life. Although it is build with good intentions to help to sustain nature the cages for most of the beautiful creatures are far too small, the poor crocodile does not even have enough space to swim or dive. Only the massive KOJ Pond is ok.\r I felt such a pity for most of this beauties."
	},
	{
		"User": "Sally S",
		"Location": "Tagaytay, Philippines",
		"DateofReview": "January 10, 2018",
		"ReviewTitle": "Zoo type",
		"Review": "A lot of animals that was endangered can be found here at Philippine Eagle Center. Many eagles there was adopted by some large companies here in the Philippines to make sure they will grow well"
	},
	{
		"User": "Ailene E",
		"Location": " ",
		"DateofReview": "January 3, 2018",
		"ReviewTitle": "not properly maintained",
		"Review": "some areas need to be renovated. comfort rooms are unsanitary. there is no available guide, there are some description on cages but some are hard to read. just pay the entrance fee go inside and tour yourself."
	},
	{
		"User": "PHExplorer",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "December 31, 2017",
		"ReviewTitle": "Absolutely a must",
		"Review": "Do not expect a zoo. The center is simple, but with the small resources available to them (entrance fee is low) they did an excellent job. The birds are impressive to see, and there are many of them. The forest setting is wonderfully fresh and shady, and there are a few other animals that can be enjoyed. There is not too much explanation though, one aspect that could be improved. For young children it may easily get boring - you are watching birds after all. But for those who have never seen one of these elegant and endangered birds before, I recommend a visit. Plus the center definitely serves a good cause."
	},
	{
		"User": "Agnes Grace T",
		"Location": " ",
		"DateofReview": "December 21, 2017",
		"ReviewTitle": "Indeed, A Tourist Attraction",
		"Review": "If you haven't seen any eagle ever since, you must visit this place and see the wonders of eagles and nature in this place."
	},
	{
		"User": "efrenr916",
		"Location": "Taguig City, Philippines",
		"DateofReview": "December 14, 2017",
		"ReviewTitle": "A Filipino Treasure All must see",
		"Review": "The Phil Eagle, the eternal symbol of Mindanao & Philippine Strength & Tenacity is conserved in this Centre. Witness the majesty of this apex predator, the true king of the skies. See eagles bred in captivity, the last and final chance to conserve a National...More"
	},
	{
		"User": "redgotsohigh",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "A Must See!",
		"Review": "This place has an entrance fee of P250 but its definitely worth it. We get to see eagles for the first time and man they're all huge. There are other animals as well as as owls,boar,monkeys and all but really the highlight are the fierce...More"
	},
	{
		"User": "Jim P",
		"Location": " ",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "No Longer Called the Monkey-eating Eagle",
		"Review": "When I was at this place in 2001 they wouldn't let you within 100 feet of the eagles' cage for fear of scaring the pair away from breeding. By November, 2017, there were Philippine eagles in cages all over the place and you walk right...More"
	},
	{
		"User": "ymalih",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 16, 2017",
		"ReviewTitle": "Educational",
		"Review": "Visiting the Philippine Eagle Center is getting back to the basics and be one with nature. One gets to learn more about the eagle and be amazed by its physical features as well as becoming fascinated of its key role in the environment."
	},
	{
		"User": "RaffySun61",
		"Location": "Makati, Philippines",
		"DateofReview": "November 12, 2017",
		"ReviewTitle": "Must See If You Find Yourself In Davao",
		"Review": "It was a nice but sad visit. Nice cause we got to see Pagasa the eagle and his other companions but sad cause the facility could use a lot of improvements. Everyone should donate. They need better and larger enclosures for the eagles and other...More"
	},
	{
		"User": "MrSnatch",
		"Location": "Worcester, United Kingdom",
		"DateofReview": "November 11, 2017",
		"ReviewTitle": "Philippine Eagle Centre",
		"Review": "I visited the centre based on reviews I read on trip advisor. Personally they were quite misleading. We travelled from Lanang having to use a bus which took approx 45 minutes then had.to grab a tricycle to the centre upon arrival there were locals selling...More"
	},
	{
		"User": "lionlamica",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Florida",
		"Location": "Florida",
		"DateofReview": "November 8, 2017",
		"ReviewTitle": "COOL PLACE, BIG RAPTORS",
		"Review": "Went here today with my family and we had a great time looking at all the stuff from the very large croc to the phil eagles, owls, and other raptors, and the monkeys which were putting on quite a show for my family. If your...More"
	},
	{
		"User": "Raf O",
		"Location": "Philippines",
		"DateofReview": "October 20, 2017",
		"ReviewTitle": "Amazing Eagle",
		"Review": "The most beautiful eagle I've seen in my life..it's huge and looks different compare to other eagles. Tropical forest place is well maintained and preserved."
	},
	{
		"User": "Laney C",
		"Location": " ",
		"DateofReview": "October 17, 2017",
		"ReviewTitle": "Love it!",
		"Review": "Visiting the Philippine Eagle Center was my reason of going to Davao. It was raining, but I can’t cancel going to the center cause I’m only staying in Davao for 3 days. I haven’t been to a sanctuary so I can’t compare. Going there alone...More"
	},
	{
		"User": "Valdis A",
		"Location": "Kremenchuk, Ukraine",
		"DateofReview": "October 16, 2017",
		"ReviewTitle": "Huge Eagles! ",
		"Review": "Nice Park for any age guests. Huge Eagles are living in a good condition and well-maintained place. Ask to take you a photo with eagle. Only in Davao!"
	},
	{
		"User": "mangomagnate",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 3, 2017",
		"ReviewTitle": "worth a look",
		"Review": "Been there many times always enjoyable trip. Can get a tour guide if you want but not always needed."
	},
	{
		"User": "smartsmartin",
		"Location": "Manila, Philippines",
		"DateofReview": "September 27, 2017",
		"ReviewTitle": "Hello Pagasa & other PH Eagles!",
		"Review": "First time here despite visiting Davao countless of times. Great to have kids with you since they will be wide eyed upon seeing creatures they only see in books. For Filipino adults, just seeing Pagasa (the first PH eagle bred in captivity) perched atop a...More"
	},
	{
		"User": "Mon-Mon M",
		"Location": " ",
		"DateofReview": "September 24, 2017",
		"ReviewTitle": "Mighty Birds",
		"Review": "Very informative tour. Sad that the birds are still not a lot in numbers. But happy that there is something being done about it."
	},
	{
		"User": "hallslim",
		"Location": "Abu Dhabi, United Arab Emirates",
		"DateofReview": "September 13, 2017",
		"ReviewTitle": "Happy Weekend",
		"Review": "It is a nature trip and a wonderful appreciation of this royal and marvelously amazing bird. I have been here many times and still in awe of this place and esp proud that we are blessed with this Majestic bird,the one and only Philippine Eagle....More"
	},
	{
		"User": "I_Am_Gretchen",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila",
		"Location": "Manila",
		"DateofReview": "September 6, 2017",
		"ReviewTitle": "The Philippine eagles are majestic",
		"Review": "The Philippine eagles are majestic. We were in awe. Entrance is at 150 pesos. Wait for the eagles to open their wings or fly from 1 branch to another."
	},
	{
		"User": "Xplorer368",
		"Location": " ",
		"DateofReview": "August 16, 2017",
		"ReviewTitle": "Beautiful animals, please donate and make it better",
		"Review": "I am amazed at the size of the birds... absolutely beautiful animals. The trainers were really educational and accommodating. The facility needs more help... you can help by donating the facility."
	},
	{
		"User": "rainbowwarrior126",
		"Location": "General Santos, Philippines",
		"DateofReview": "August 14, 2017",
		"ReviewTitle": "One of a Kind!",
		"Review": "I've been there twice. I went there for the third time with my family because i wanted to show to the kids how beautiful the place is and at the same time to allow them to learn more about our national pride. We are lucky...More"
	},
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "July 16, 2017",
		"ReviewTitle": "A really good insight into many types of eagle, and more.",
		"Review": "Arriving at the centre, we were greeted warmly. To our amazement, we found we had our own personal guide, a young internee who told us she was a student of biology. She was excellent, and we had an entertaining and very well-informed tour of the...More"
	},
	{
		"User": "so g",
		"Location": "davao city",
		"DateofReview": "July 13, 2017",
		"ReviewTitle": "Must visit!!",
		"Review": "Educational and a wonderful way for children to appreciate Mother Nature and the web of life!! You can arrange for a tree planting and/or a donation for your party to leave imprints on foot paths!! allow an hour to see the short video presentation and...More"
	},
	{
		"User": "Jeremiah Anthon... R",
		"Location": " ",
		"DateofReview": "July 11, 2017",
		"ReviewTitle": "Very nice place to appreciate nature ",
		"Review": "It's a cross between a nature park and a reserve... You'll really appreciate the work of the centre in keeping the eagles alive and well... You can see not only eagles but also other birds and animals so it's also like a zoo... A definite...More"
	},
	{
		"User": "LG C",
		"Location": " ",
		"DateofReview": "July 7, 2017",
		"ReviewTitle": "Beautiful Bird Sanctuary",
		"Review": "From start to finish the Philippine Eagle Center was a journey worth taking. We planned the day around this activity because it seemed to have been about an hour drive from the hotel we were staying at in the city. We received a guided tour...More"
	},
	{
		"User": "Anne P",
		"Location": " ",
		"DateofReview": "July 5, 2017",
		"ReviewTitle": "Impressive Place",
		"Review": "This place is really interesting and very inspiring knowing that there is a group/team who works really hard to take care of our eagle and other species. I hope that they will have more advertisement, tarpaulin, billboard in the city to encourage people to visit...More"
	},
	{
		"User": "radeo25",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 3, 2017",
		"ReviewTitle": "the national bird of Philippines",
		"Review": "that time a visit i'm alone, i enjoyed watching the different eagles in cages, a i feel i'm in the jungle walking alone hearing some noise of birds, and you must visit if you are in davao city , it accessible to go this place...More"
	},
	{
		"User": "aoc827",
		"Location": "Cebu City",
		"DateofReview": "June 26, 2017",
		"ReviewTitle": "Every Filipino should visit this place",
		"Review": "It was definitely amazing to see how big the Philippine Eagle was and how wide is its wing span. There is even a small museum there that could be entertaining for history buffs.\r \r Location of the conservatory is a bit far from the city but definitely a place to go to while in Davao."
	},
	{
		"User": "Don R",
		"Location": " ",
		"DateofReview": "June 22, 2017",
		"ReviewTitle": "Must see",
		"Review": "Feels proud to see the largest eagle is found in the Philippines. They also have other types of large birds, a crocodile, philippine dear and a pond. I wish other large companies will support the center and further promote public awareness of the monkey eating eagle."
	},
	{
		"User": "Jerrilyn B",
		"Location": " ",
		"DateofReview": "June 10, 2017",
		"ReviewTitle": "A must Country Side Tour!",
		"Review": "Philippine Eagle Nature Center (also known as Philippine Eagle Camp) is more or less an hour drive from the city proper. It's a bit far, so its hard to commute thru jeepneys, so we decided to ride on a taxi but because its a bit far.\r \r  It has different species of our national bird as well as other species of birds, mammals and reptiles. This center aims to educate visitors to conserve and save the endangered species like the our very on Philippine eagle. \r \r This place was very peaceful you will just hear the chirping of birds, the rustling of leaves and the sound of wind blowing . \r \r If you're in Davao you must visit this place, especially if you are a nature lover <3"
	},
	{
		"User": "Sol P",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 26, 2017",
		"ReviewTitle": "\"Davao Vacation NOT complete- If Haven't seen How High Philippine Eagle Fly\"",
		"Review": "Philippine Eagle is now endangered specie and other than Durian Fruits, Philippine Eagle symbolizes Davao City. The venue is an hour ride from the City, best to travel with groups and with vehicle. There are many animals, souvenirs, fruits in the area. Bring your camera or cellphone, the ambiance is nature and you can take pictures with flying Philippine Eagle as your background, wear rubber shoes or sandals. Along Malagos street, you can also visit Malagos Garden Resort, Dairy Best etc.... fruits in Calinan are cheaper than buying in the city.\r \r Enjoy your vacation with the Philippine Eagle."
	},
	{
		"User": "Floreces",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "May 24, 2017",
		"ReviewTitle": "Educational Trip",
		"Review": "Updated Fees:\r Php150/adult\r Php100/child\r \r Free picture taking and viewing with the monkeys and eagles.\r There are also souvenirs and foods available outside at the Philippine Eagle Center.\r \r Location:\r More than 1 hour away from Davao City center and more or less 5 minutes from Malagos Garden Resort."
	},
	{
		"User": "John L",
		"Location": "Surigao del Norte Province, Philippines",
		"DateofReview": "May 23, 2017",
		"ReviewTitle": "Flying High With Philippines Eagle",
		"Review": "This place is becoming well known but it's a bit of a distance outside of the city area of Davao. If you are with a couple of others you can share a taxi, the only really sensible way to get there.\r From a nature point of view, I always thought the Australian wedged tail eagle and the American bald eagle were the biggest. So, it was a pleasant surprise to know that these magnificent birds are at the top of the tree. \r It's reasonably nicely set out without being too commercial, opting for natural surroundings.\r There is food available, resting places and a few other animal species there. Crocodiles, monkeys, darn big pythons, a goat or two and an animal of which I took a photo but have no idea what it is.\r There were a couple of sea eagles and koi fish pond. All adding to the ambience.\r Here's a tip - don't eat lunch there. There is a restaurant not too far away called Mountain Top Restaurant. Magnificent views while eating your meal and the scenery makes for great photos."
	},
	{
		"User": "Luke T",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "May 19, 2017",
		"ReviewTitle": "Wonderful place to visit beautiful Birds",
		"Review": "These birds are so beautiful and so grand, I love watching them. And it is wonderful that the people are doing their best to insure that they will be around forever"
	},
	{
		"User": "Loreenstadie s",
		"Location": " ",
		"DateofReview": "May 14, 2017",
		"ReviewTitle": "beautiful place",
		"Review": "This is must see as the Eagle is the largest eagle in the world this is located far from the town proper, it is about 40 mins to 1 hr travel by bus from the bus terminal to Calinan located beside Unionbank in San Pedro Extension. We were so happy to be so closed up with some eagles and had beautiful photos of them."
	},
	{
		"User": "John Q",
		"Location": " ",
		"DateofReview": "May 11, 2017",
		"ReviewTitle": "Visit to the Philippine Eagle",
		"Review": "A visit to the sanctuary of the endangered Philippine Eagle should be encouraged for Filipinos and bird lovers. The Philippine Eagle, the country's national bird, is one of the biggest birds of prey in the world with a wingspan of over 7 feet. It is also endangered with an estimate of less than a thousand in the wild. It is endemic to the Philippines only. The Sanctuary provides care for eaglets and wounded eagles in order to allow them to survive in the wild eventually. There are also other specie of birds in the sanctuary including hawks and owls as well a fauna such as deer, monkeys and wild boar. A visit to the sanctuary involves a walk-through along jungle paths. The walk-through is quite primitive but provides a more natural ambience to the visit. Best to bring raingear because it often rains in the vicinity being at the foothills of the Mt Apo mountain range although the sanctuary provides umbrellas to visitors."
	},
	{
		"User": "Ram_B1969",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 6, 2017",
		"ReviewTitle": "Go There For The Eagles",
		"Review": "The place was quite far if you're based in the city proper so try to save ample time for the road travel, and consider possible traffic. If you go there with the primary intention of seeing the eagles, then it's worth the trip. You'll see them close. Although it's still a pitiful sight to see some of them without a cage but then tied up. Made me think which one's better for the bird, to be in a cage but not tied up or out of cage yet tied. The plants and trees are so healthy and naturally beautiful. Bring your camera, wear comfortable shoes and prepare to walk on unpaved or partially paved path. Wear comfortable cool clothes and bring your hanky or small towel for your sweat. Apply a mosquito repellent so you'll have a comfortable time. The park's not that big and you'll be done in an hour or less, but for me it was a short yet full and enjoyable experience."
	},
	{
		"User": "elviep2014",
		"Location": " ",
		"DateofReview": "May 5, 2017",
		"ReviewTitle": "Nice but quite far",
		"Review": "We had to rent the hotel van to reach this area as it was far from the city centre. One cab driver was willing to take us there for a flat fee of Php 800 one way. The centre charges admission fee of Php 200 per person which discouraged some of the Filipino tourists who arrived at the same time as us. Quite an educational trip for us but somehow not worth the close to one hour trip to get there."
	},
	{
		"User": "Eve14_T",
		"Location": "Makati, Philippines",
		"DateofReview": "May 4, 2017",
		"ReviewTitle": "Sad state of the Philippine Eagle",
		"Review": "2nd time to visit but the first time was better than our last trip. Last time we saw Pag-Asa in his cage very clearly but this time we barely saw him. The cage was all covered up by trees not trimmed and crawling plants. The place was not maintained properly and there were lesser eagles. We were not able to visit the hatchery. But still the eagles are majestic "
	},
	{
		"User": "JanaK123",
		"Location": "Penang Island, Malaysia",
		"DateofReview": "April 30, 2017",
		"ReviewTitle": "Amazing to see these eagles",
		"Review": "We went at the same time that a group of youth (scouts?) were there so it was loud and perhaps we didn't get as much attention as we would have. The signs posted were informative. It was sad, though, to see eagles tethered. I hope that they were put in aviaries or something at some point so they didn't have to just stand on poles. There were some large aviaries so that was good to see. The Philippine Eagles are amazing creatures."
	},
	{
		"User": "reelrodcover",
		"Location": "Montgomery, Texas",
		"DateofReview": "April 15, 2017",
		"ReviewTitle": "Great Fun plac",
		"Review": "This is must see as the Eagle is the largest eagle in the world. Can take great pictures and have a grand time."
	},
	{
		"User": "Amil J",
		"Location": " ",
		"DateofReview": "April 14, 2017",
		"ReviewTitle": "unique experience",
		"Review": "visited here on 2004 with family, it was a great experience. what's unique about it was the main attraction those monkey eating eagles they are amazingly huge. beautiful nature."
	},
	{
		"User": "TruthCalifornia",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Boston, Massachusetts",
		"Location": "Boston, Massachusetts",
		"DateofReview": "April 11, 2017",
		"ReviewTitle": "An excellent place to see this eagle up close",
		"Review": "We were fortunate to see this eagle species in the wild. However, a scope view is not the same as an up close view. I don't like zoos but at this research centers, the eagles have a chance to breed and perhaps will be safe until the mountains will again support them."
	},
	{
		"User": "paulapple",
		"Location": "england",
		"DateofReview": "March 24, 2017",
		"ReviewTitle": "Good spot",
		"Review": "Nice place in cool gardens. Plenty of eagles and other birds in large cages. Research and education undertaken. Very interesting"
	},
	{
		"User": "HMix",
		"Location": "Taguig City, Philippines",
		"DateofReview": "March 23, 2017",
		"ReviewTitle": "Eagle Center at Calinan Davao",
		"Review": "A bit far but worth seeing these gorgeous animals. I noticed that they have fewer animals now compared to my previous visit in 2011/2012. You can get a cab (contrata or agreement style). They can wait for you for 1-2 hours. There are eateries on...More"
	},
	{
		"User": "Princess M",
		"Location": " ",
		"DateofReview": "March 22, 2017",
		"ReviewTitle": "Family Bonding",
		"Review": "Philippine Eagle Center houses several eagle who have been injured, captured as a pet and was rescued (its illegal to have them as pet etc because they are endangered and endemic in our country) there's also a big cage separated in the middle where male...More"
	},
	{
		"User": "Majewel1987",
		"Location": "Makati, Philippines",
		"DateofReview": "March 16, 2017",
		"ReviewTitle": "Philippine's eagle",
		"Review": "The place is not well maintained. A lot of mosquitoes. I still want to return to this place since the fees will help feed the birds."
	},
	{
		"User": "Olga P",
		"Location": "Vancouver, Canada",
		"DateofReview": "March 15, 2017",
		"ReviewTitle": "Not to miss this visit!",
		"Review": "Excellent and surprising find in our travel to Davao- the centre had amazing collection of plants and eagles. We were so happy to be so closed up with some eagles and had beautiful photos of them. We are impressed with the cleanliness and lush garden...More"
	},
	{
		"User": "rej26qmd",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "March 8, 2017",
		"ReviewTitle": "Must-Visit in Davao",
		"Review": "It is located in Malagos. Entrance fee is 5 pesos at the park, where the Philippine Eagle Center is located, and 150 pesos at the center itself. It is a bird sanctuary where you can also find other birds. The place encourages disinfection before you...More"
	},
	{
		"User": "Märijoice Angel... G",
		"Location": " ",
		"DateofReview": "March 4, 2017",
		"ReviewTitle": "Eco-friendly, Refreshing Tour with a Romantic Twist",
		"Review": "The trip here is enjoyable when you commute like locals do - jeepney then motorcycle ride ;) Boyfie and I enjoyed watching and taking photos of the august eagles and the other animals taken care of in here. They are the living mementos that this...More"
	},
	{
		"User": "YMCML",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "March 1, 2017",
		"ReviewTitle": "Majestic Philippine Eagles",
		"Review": "Metered taxi from the airport costed me almost 600 pesos one way on a light to moderate traffic. It's quite far from the city proper. Other options is to commute but it will take you a little more time to get there. Seeing the Philippine...More"
	},
	{
		"User": "masoraidar",
		"Location": "Cebu City, Philippines",
		"DateofReview": "February 25, 2017",
		"ReviewTitle": "Nice",
		"Review": "Awesome place to visit! The uncertain future of the Philippine Eagle should remind of how many species disappear from the surface of the Earth, not only through evolution."
	},
	{
		"User": "tom1941",
		"Location": "Philippines",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "Nice drive if you have extra time",
		"Review": "I enjoyed the drive from Davao to the park. Their were not really a lot of birds like at the park in Singapore. A cage of monkeys. It was clean and I did enjoy the day. There are a lot of vendor stands and I...More"
	},
	{
		"User": "bhsceo",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "Best Eagle Park",
		"Review": "Very much attractive & worth visiting Eagles viewing amazing.Beautiful garden & huts around. Like shopping era and cheap products."
	},
	{
		"User": "mike j",
		"Location": "Eureka, California",
		"DateofReview": "January 29, 2017",
		"ReviewTitle": "A bit of a long drive but worth it",
		"Review": "If you want to get close up views of Phillipine Eagles, Philippine Fish Eagles and other native birds of prey this is the place to go. There is also a rather large crocodile there amoung other attractions. The downside to this attraction is it was...More"
	},
	{
		"User": "evol68",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "January 20, 2017",
		"ReviewTitle": "Put anti-mosquito on your face",
		"Review": "There was a P5.00 fee to get to the entrance of the Philippine Eagle Centre where you have to pay P150.00/person. I don't know what the P5.00 was for. Anyway, as soon as we started walking into the Centre the bugs came to our face,...More"
	},
	{
		"User": "Mark w",
		"Location": " ",
		"DateofReview": "January 12, 2017",
		"ReviewTitle": "So Refreshing.....",
		"Review": "One of the highlights of our Davao Tour. Should be visited especially for those who haven't seen an Eagle Park. People from Davao are very friendly. Even without using Google Map, I am pretty sure that anyone can help you out in getting here:)"
	},
	{
		"User": "Jemima M",
		"Location": "Sydney, Australia",
		"DateofReview": "January 12, 2017",
		"ReviewTitle": "Beautiful specimen",
		"Review": "I commuted to the Eagle centre via jeepney/van. I took the Calinan route from Quimpo Boulevard. It costs 40p only then I took a tricycle to the centre itself. There's an environment government fee of 5p for adults and 3p for children. Then there's the...More"
	},
	{
		"User": "Michael m",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "London, United Kingdom",
		"Location": "London, United Kingdom",
		"DateofReview": "January 10, 2017",
		"ReviewTitle": "Much bigger than I expected",
		"Review": "It’s a bit out of the way, but its really worth it, large variation of animals and nature for a very cheap value. Beautiful nature but be careful of the insects and mosquitos. No food can be bought so bring a picnic, there are 2...More"
	},
	{
		"User": "JP N",
		"Location": " ",
		"DateofReview": "December 22, 2016",
		"ReviewTitle": "Highlight of My Davao City Tour",
		"Review": "I chose to commute to the Philippine Eagle Center, which was about 40kms from the city center. For someone like me who is from Manila, this is like travelling from the CBD to the nearby province of Laguna. Thanks to the warmth of the Dabawenyos, it was an easy commute. \r \r The park is a sanctuary of rescued eagles, and other endangered wildlife. The entrance fee is PhP150 (USD3.00) and is worth every penny. "
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "December 21, 2016",
		"ReviewTitle": "Wow",
		"Review": "Much nature, many animals. I really liked the lots of different plants the most. So great new kinds of palm trees. But of course the eagles are impressive, too. They are so big and they like to look really serious.\r Plenty of other animals and things also."
	},
	{
		"User": "RenatoPinoyExplorer",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "December 21, 2016",
		"ReviewTitle": "Captivating experience",
		"Review": "If you love nature and support the conservation of Philippine Eagle well this is the place to be. You will have a glimpse of the national bird and be proud of what the center had achieved so far. Aside from the mighty and majestic Philippine eagle there are other birds and other animals around which will fascinate every animal lover. The whole place is also reserved so the enormous trees can still be found. It was really a treat for me and my family."
	},
	{
		"User": "Greeg G",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 20, 2016",
		"ReviewTitle": "Amazing",
		"Review": "it is good to know them better when you meet them personally. aside from birds, they also have monkeys, dear, fish and some other creatures"
	},
	{
		"User": "TheGrandTourista",
		"Location": " ",
		"DateofReview": "December 18, 2016",
		"ReviewTitle": "I love the captive birds ",
		"Review": "So much lovely birds in captivity. They are doing g a great job running this zoo. All animals are in tiny cages the size of tiny trucks. Will go back again."
	},
	{
		"User": "onlyndz",
		"Location": " ",
		"DateofReview": "December 5, 2016",
		"ReviewTitle": "Majestic Eagle of the Philippines",
		"Review": "If you want to get a glimpse of the Philippine's national bird, this is the place you want to go to. This endangered bird is now making a comeback through the conservation efforts of the Philippine Eagle Centre. The center is an aviary with several species of raptors with the Philippine Eagle on the spotlight."
	},
	{
		"User": "Gali_Valiente",
		"Location": "Manila, Philippines",
		"DateofReview": "December 1, 2016",
		"ReviewTitle": "Haribon - one of the largest eagles in the world.",
		"Review": "The protected home of one of the largest eagles in the world - the Philippine Eagle. It's the only place where humans attempt to reverse the trend of the endangered eagle by making this a safe haven for the birds to propagate. You will see here the magnificent eagles in their protected habitat. \r \r 'Haribon' is short for the tagalog phrase haring ibon (\"King of birds\"). They are endangered and it may be a rare chance to see them before they disappear for good (hopefully not)."
	},
	{
		"User": "sjg0279",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Sydney, Australia",
		"Location": "Sydney, Australia",
		"DateofReview": "December 1, 2016",
		"ReviewTitle": "If you care about the Phil Eagle one must go here",
		"Review": "Good experience. Worth the long drive to the location. Be ready with your own water as the trip going to the place is quite long. Highly educational!"
	},
	{
		"User": "Marissa A",
		"Location": "Manila, Philippines",
		"DateofReview": "November 22, 2016",
		"ReviewTitle": "The Mighty Birds",
		"Review": "It was my second tour of the park but this time it was truly an engaging one. A bird handler named Buroy, brought out 2 eagles for a video and trick photo shoot. Amazingly, the birds appeared to be perched on my left arm and on Buroy's cue would extend and flap their wings. It was indeed a surprise interaction, educational and fun, worth sharing and promoting. The park could make this an official attraction and earn more funds for these endangered birds."
	},
	{
		"User": "tonitanch",
		"Location": "Manila",
		"DateofReview": "November 20, 2016",
		"ReviewTitle": "Must see place when in Davao",
		"Review": "The Philippine eagle is one of our country's treasures so it is really good that the public can see it in the confines of a park. It is a good learning experience to see all our other indigenous species like the civet, the deer, wild pig, owls, hawks. It was good to spend some time within a forest. Visit this place and help protect the Philippine eagle. "
	},
	{
		"User": "La D",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 16, 2016",
		"ReviewTitle": "Educational",
		"Review": "It's the best spot to see real eagles, especially the Philippine Eagle. The Centre is good for an educational trip as well"
	},
	{
		"User": "Enitsirk C",
		"Location": "Winnipeg, Manitoba, Canada",
		"DateofReview": "November 15, 2016",
		"ReviewTitle": "Bird's eye",
		"Review": "I had fun exploring and taking pictures of the Philippine eagles but they could improve it more by ensuring the cleanliness of the place. Expect insects like mosquitoes to bite you, or bring your own insect repellant."
	},
	{
		"User": "tito u",
		"Location": " ",
		"DateofReview": "November 11, 2016",
		"ReviewTitle": "Eagles unhappy even in huge cages",
		"Review": "Like my review on crocodiles, this is completely subjective as I advocate humane treatment to all animals as an essential part of our environmental preservation.\r \r For a start, the compound is not well-maintained -- the grass unkempt and trash abound. While the center is supposedly being ran by scientists and experts on the field of eagle species conservation, the whole exhibit area never fascinated me. I'm not sure how we can make the eagles enjoy their stay while in captivity, while being experimented on for propagation? It's best to visit the Malagos Bird Sanctuary and Resort nearby and be enchanted with the welcoming committee of colorful talking parrots and other birds perched on each handler's shoulders. "
	},
	{
		"User": "AmorSabella",
		"Location": "Davao City Philippines",
		"DateofReview": "November 11, 2016",
		"ReviewTitle": "Nature and Educational",
		"Review": "It is always nice to visit the Philippine Eagle Centre in Davao... It is about 20kms. Away from the City so it is good to visit the place early... You will pay around 80Php per person and you can go around the center and view the Philippine Eagle. The Centre has Description of their animals there so it is educational for Children.. Make you you bring mosquitio repellent and expect lots of other insects. Make sure you wear comfortable shoes and bring extra shirt and water."
	},
	{
		"User": "Amy S",
		"Location": " ",
		"DateofReview": "November 6, 2016",
		"ReviewTitle": "TO GO OR NOT TO GO...PHILIPPINE EAGLE CENTRE A REAL WONDER!",
		"Review": "My best friend thought of inviting my family and I to visit the Philippine Eagle Centre. And since the place is so far away from the city, I thought of not going; however, my best friend insisted so we went. It was a big surprise to see the huge cages where the eagles were kept. Never miss visiting the area if you are in Davao City."
	},
	{
		"User": "Maia_0515",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City",
		"Location": "Davao City",
		"DateofReview": "November 3, 2016",
		"ReviewTitle": "Life at its best...",
		"Review": "This has been my favorite tourist spot in the city. Philippine Eagle center is one of the Davao's educational tour destinations..."
	},
	{
		"User": "Buffy M",
		"Location": " ",
		"DateofReview": "October 20, 2016",
		"ReviewTitle": "A must!",
		"Review": "Visit to the PH Eagle Center is a must! You can feel the majesty of the Ph eagle when you see it in person. Be sure to help In the preservation of this majestic beauty."
	},
	{
		"User": "JamesKoh",
		"Location": "Singapore, Singapore",
		"DateofReview": "October 12, 2016",
		"ReviewTitle": "Philippine Eagle Centre",
		"Review": "Nice place but quite far from Davao city centre. Need to book a taxi to get there and do ask the driver to wait and bring you back to your hotel."
	},
	{
		"User": "GreenOnePointFive",
		"Location": "Quezon City, Philippines",
		"DateofReview": "October 11, 2016",
		"ReviewTitle": "Eagles teach us how to Love.",
		"Review": "Eagles teach us how to Love. Visit this place and it will teach you how to love. Naturally, eagles are monogamous. They are loyal to their partners. They are strong and protective. Visit and enjoy the beauty of eagle collection and learn how to protect...More"
	},
	{
		"User": "MrAngry50",
		"Location": "Oman",
		"DateofReview": "October 7, 2016",
		"ReviewTitle": "What could have been soaring heights !!!!",
		"Review": "You must admire all those involved with this centre. It is not aimed at tourism but due to financial restrictions they need the visitors to fulfil their dream of keeping the Philippine Eagle from extinction. The Centre has probably seen better days as must looks...More"
	},
	{
		"User": "lambourne717",
		"Location": "Brisbane, Australia",
		"DateofReview": "October 6, 2016",
		"ReviewTitle": "Amazing eagle",
		"Review": "So glad I didn't skip,this. It's a well organised centre with safe paths and plenty of information. 5 pesos to get into the park and then 150 entry fee. About an hour out of town."
	},
	{
		"User": "oindu_des_Alpes",
		"Location": "Iloilo City",
		"DateofReview": "October 6, 2016",
		"ReviewTitle": "Mixed feelings watching these magnificent creatures",
		"Review": "The reputation of a must see in Davao. Yes, the eagles are magnificent and there is quite a variety of them. But you can't prevent feeling sadness in seeing these wonderful birds in cages that, while allowing a good sight of them, mostly seem too...More"
	},
	{
		"User": "MediciBoy",
		"Location": " ",
		"DateofReview": "October 4, 2016",
		"ReviewTitle": "Educational",
		"Review": "Very educational and quite entertaining too. By visiting the park, you also help in the Philippine Eagle conservation efforts. Highly recommended if you're going here with kids."
	},
	{
		"User": "Jamal M",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Bandar Seri Begawan, Brunei Darussalam",
		"Location": "Bandar Seri Begawan, Brunei Darussalam",
		"DateofReview": "October 3, 2016",
		"ReviewTitle": "Eagle Sanctuary",
		"Review": "The Eagle Centre is a long distance away from Marco Polo Hotel and located in the jungle as this species need a natural breeding ground. The huge size of the eagle amazes me and the beautiful bird is very rare that it has been designated...More"
	},
	{
		"User": "Rino S",
		"Location": " ",
		"DateofReview": "September 24, 2016",
		"ReviewTitle": "Good",
		"Review": "It was better than I expected. Animals were well taken cared for. Entrance fee was reasonable and you can get your money's worth if you stay longer and watch or take pictures.\r \r Just make sure that you have bug spray as the area is 'wild' and there are insects flying to your face. Also, watch out for little snakes."
	},
	{
		"User": "Stuart H",
		"Location": " ",
		"DateofReview": "September 23, 2016",
		"ReviewTitle": "Family visit",
		"Review": "some parts needed upgrading but overall is an excellent and educational visit for both young and old."
	},
	{
		"User": "Benson C",
		"Location": "Hong Kong",
		"DateofReview": "September 21, 2016",
		"ReviewTitle": "Witness Philippine Eagles in action",
		"Review": "This is one of the new zoos to feature the Philippine eagles as it is also used as a conservation base to rehabilitate the species from the deforestation in the Philippines. Donors are brought to finance baby eagles and sponsors are named in the cages of those eagles in the zoo.\r \r There are numerous feeding times where the eagle is fed a live monkey for it to hunt in its cage.\r \r Aside from the eagles, also get a chance to see other wildlife like the Philippine crocodile and the mouse deers in action."
	},
	{
		"User": "nccuaresma",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 11, 2016",
		"ReviewTitle": "Nice place to visit with the kids",
		"Review": "A good place to learn about the eagles. I hope they would preserve the place well since some areas are no longer maintained well."
	},
	{
		"User": "travelology_ph",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 9, 2016",
		"ReviewTitle": "Conservation Area",
		"Review": "This place is not just for sight seeing purposes but a conservation facility for endangered animals such Philippine Eagle. I highly recommend tourist to go this place though quite far from city center because what you pay for will actually go a long way."
	},
	{
		"User": "TeyHM888",
		"Location": "QUEZON CITY",
		"DateofReview": "September 9, 2016",
		"ReviewTitle": "Eye to eye with an Eagle",
		"Review": "First, I would like to commend the people behind this center. It's not an easy task taking care of these endangered specie that's why we have to support it even with the expensive entrance fee.\r It's very refreshing visiting this center with the lush green ambiance. It's like communing with nature at its best.\r  It's not just the eagle that you will be educated but on different kinds of birds, plants and trees as well. It could be a great field trip for students, too.\r Meeting these eagles face to face is a surreal experience. You will just wish that they will be able to breed a lot and for the next generation to see them.\r Don't forget to buy pomelos also here. They are cheaper and taste great, too."
	},
	{
		"User": "Ra O",
		"Location": "Pasay, Philippines",
		"DateofReview": "September 3, 2016",
		"ReviewTitle": "Wow! ",
		"Review": "One reason why we went to Davao was to check the different species of eagles in the Philippines. The PEC was a conservation park and it served its purpose there. Big downside though was the security personnel who asked us to pay entrance fee which was higher than what was in the receipt. Also, staff in the main park entrance was unfriendly and rude."
	},
	{
		"User": "Yvonne M",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Iloilo City, Philippines",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "September 1, 2016",
		"ReviewTitle": "see our national birds here.....",
		"Review": "take a taxi for a day tour when there are 3 or 4 members in the group and include this in your itinerary..i was in awe looking the names of the eagles and seeing them first hand, you can see how grandiose and strong they look...and really huge!...it is a different experience from just reading them in the books or watching them in video or tvs...there's a good deal within the area, pasalubong kiosks..they are cheap when you know how to haggle...cheaper i think than other places downtown...i strongly recommend this place to all visitors in davao city..it is worth the pesos you'll pay..."
	},
	{
		"User": "Borgyliscious",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "Philippine National Bird can be found here",
		"Review": "Different birds and eagles can be found here, not only birds but other animals too. Good for those who loves nature. A bit far from the city though."
	},
	{
		"User": "Oliver T",
		"Location": " ",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "Worth the Visit",
		"Review": "It's a must visit site in Davao! You will learn a lot about Davao's ecosystem and will actually make you think about contributing to the welfare of the environment."
	},
	{
		"User": "Jamie W",
		"Location": " ",
		"DateofReview": "August 19, 2016",
		"ReviewTitle": "World's biggest Eagles ",
		"Review": "Excellent and very important to visit this establishment to help out endangered species. Eagles were great as were the other animals . All the staff make you feel so welcome. Thoroughly recommend this to ANYONE visiting Davao !!! Thanks for the experience :-)"
	},
	{
		"User": "marco v",
		"Location": " ",
		"DateofReview": "August 12, 2016",
		"ReviewTitle": "birds birds birds",
		"Review": "Nice trip out of the city and you can really get close to the eagles. It is a bit like walking thru the forest. Also bit cooler then downtown so nice on a hot day."
	},
	{
		"User": "tanyalou",
		"Location": "Manila, Philippines",
		"DateofReview": "August 10, 2016",
		"ReviewTitle": "Nature trip - Eagle watching",
		"Review": "Worth the Trek from the City. It's a bit far out but a must visit for anybody, even a city-bred-mall-rat like me would be awed by the magnificent beauty of the Philippine Eagle."
	},
	{
		"User": "delight_2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 28, 2016",
		"ReviewTitle": "Amazing Philippine Eagle",
		"Review": "The kids enjoy the trip, seeing eagles and other kinds of birds on their sanctuary on the centre. There were also many kinds of exotic animals to see and observe and you are in the midst of a protective forest. Very nice and memorable experience."
	},
	{
		"User": "Milapablo",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "July 27, 2016",
		"ReviewTitle": "Awesome Philippine Eagles",
		"Review": "First time to see eagles. We had pictures with an Eagle with its open wings. Fighter is awesome too."
	},
	{
		"User": "LaiCz",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Paranaque, Philippines",
		"Location": "Paranaque, Philippines",
		"DateofReview": "July 26, 2016",
		"ReviewTitle": "Philippine Eagle up close",
		"Review": "We were here 21st of July 2016. Different species of eagles are in huge cages. We saw one tied to a stand where you can take a closer look. They call him Fighter. I was waiting for him to spread or just flap his wings...More"
	},
	{
		"User": "oozingkev",
		"Location": "Bacoor, Philippines",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "See the Philippine Eagle",
		"Review": "See the only Philippine Eagle conservation center in the country. Enjoy other large birds, owls and mammals to see."
	},
	{
		"User": "rowena_morin",
		"Location": "Richmond Hill, Ontario",
		"DateofReview": "July 24, 2016",
		"ReviewTitle": "Awesome",
		"Review": "This place is amazing and eye catching. We enjoyed watching all kinds of Philippine eagles which is now endangered species . they are beautiful and are maintained well"
	},
	{
		"User": "macasaetchris",
		"Location": "Makati, Philippines",
		"DateofReview": "July 20, 2016",
		"ReviewTitle": "One with nature!",
		"Review": "Great experience here! Visited this place as part of my birthday celebration. This is the fist time I saw a Philippine Eagle and they are HUGE! Be quite when visiting this place and please turn off your flash. Don't clap or howl at the birds...More"
	},
	{
		"User": "Chuwy98",
		"Location": "Cebu City, Philippines",
		"DateofReview": "July 17, 2016",
		"ReviewTitle": "worth a visit for kids",
		"Review": "we spent about an hour at the park. its a typical filipino park/zoo. dont expect it to look like the once abroad but it was clean. the kids enjoyed learning about the Philippine eagle. many interesting facts from our guide."
	},
	{
		"User": "Hồng Anh N",
		"Location": " ",
		"DateofReview": "July 15, 2016",
		"ReviewTitle": "For eagle and nature lovers!!!",
		"Review": "You can observed lots of eagles here, they are so beautiful. Although the construction is not really good but its quite comfortable for these birds. Not lots of activities excepting from watching the birds but if you love the eagle, the Philippines national birds, let's...More"
	},
	{
		"User": "jesumjr",
		"Location": "Paranaque, Philippines",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "The refuge of the world's largest eagle!",
		"Review": "When in Davao City, don't fail to visit the Philippine Eagle Centre, home of the world's largest eagle and located in the outskirts of the world's biggest city in terms of land area. The ride to the center will normally take you about 45 minutes...More"
	},
	{
		"User": "virstud",
		"Location": "Caloocan",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "Learning to care for the Philippine Eagles",
		"Review": "The center is around 1 hour drive away from the city. It is bets to hire cab to get to the place. We learned a lot from our tour inside the center. We saw some of our poor animals who were shot and wounded which...More"
	},
	{
		"User": "jedainz",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 7, 2016",
		"ReviewTitle": "A Must Visit To All Tourists Bound For Davao!",
		"Review": "I'm sure everyone's been to better zoos but to see majestic Philippine Eagles and even sometimes, very up close is a must for everyone. I've probably been here for more than I can count since I was young and it never gets boring. And stores...More"
	},
	{
		"User": "gabbyxiu",
		"Location": "Surabaya, Jawa Timur, Indonesia",
		"DateofReview": "July 1, 2016",
		"ReviewTitle": "widely natural place in davao",
		"Review": "there's many various eagle. beside eagle, many birds have no cage (tied only) but everything was safe for kids. i enjoyed the beautiful garden, flower, and many gazebo area, fresh air and taste durian."
	},
	{
		"User": "Hanzo_83",
		"Location": "Quezon City, Philippines",
		"DateofReview": "June 30, 2016",
		"ReviewTitle": "Educational! Highly Recommended! Eye-opening!",
		"Review": "Recommended for children, this place will help kids understand and see what Philippine wildlife is all about. You would see a variety of endemic Birds Of Prey in this place. One thing that could make this better is a visual of what happens if animals...More"
	},
	{
		"User": "Katrina08_23",
		"Location": "Davao City",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "Need Renovation",
		"Review": "The last time I visit, there are only few birds. Sad to see that this is supposed to be the sanctuary of Philippine Eagle but I have a hard time getting through the cages"
	},
	{
		"User": "Bani U",
		"Location": "Puerto Princesa City, Puerto Princesa, Philippines",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "The Eagles Soar!",
		"Review": "My wife and I went to Davao for a short vacation and we found ourselves visiting the center on the second day of our stay. We have no idea actually of the extent of the damage done to the eagle's natural habitat before such visit...More"
	},
	{
		"User": "cherry052101",
		"Location": "Taguig City, Philippines",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "Birds everywhere",
		"Review": "First stop of our tour was in this place. Lucky us we just paid 5.00 each for the entrance in celebration of the independence day. Area was not crowded with guests so you can literally enjoy taking pictures of the birds or with the birds...More"
	},
	{
		"User": "Aveeno1991",
		"Location": "Manila, Philippines",
		"DateofReview": "June 24, 2016",
		"ReviewTitle": "Left in awe...",
		"Review": "Our main agenda for the day was a visit to the next door garden resort, however the side trip to the Philippine Eagle Center turned out to be more interesting, eventful and relevant. First, entrance was free as we went Independence Day. The eagle exhibition...More"
	},
	{
		"User": "Pitabites",
		"Location": "Los Angeles, California",
		"DateofReview": "June 23, 2016",
		"ReviewTitle": "Tall trees, beautiful plants and ....",
		"Review": "It is very informative and interesting to see the eagles. There's monkeys as well. Its a up and down walk so wear comfortable shoes. Some areas have potholes so kind of a struggle to walk through... There are small shops that sells local handcraft bags,...More"
	},
	{
		"User": "nprila",
		"Location": " ",
		"DateofReview": "June 19, 2016",
		"ReviewTitle": "Learning and entertaining",
		"Review": "I learned a lot. I learned that there are a lot of animals who are extremely endangered. The visit was both entertaining and learning. I hope everyone will be responsible enough not to make our animals a target for 'fun shooting', you wouldn't know he...More"
	},
	{
		"User": "aprilsky2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 9, 2016",
		"ReviewTitle": "National bird's sanctuary.",
		"Review": "If you are not a nature lover, you cannot appreciate the place. They have philippine eagle and other species of eagles as well as some wild pigs, local deer, monkeys and crocodile. Most of the animals under their care are already endangered species. Make sure to put on insect repellant to avoid the mosquitos. "
	},
	{
		"User": "Jamaica B",
		"Location": " ",
		"DateofReview": "June 7, 2016",
		"ReviewTitle": "Be Amazed with the Philippine Eagle",
		"Review": "I have never seen a Philippine Eagle up close until I visited this place. I was amazed on how strong and fierce it appears."
	},
	{
		"User": "michael s",
		"Location": "Bacolod, Philippines",
		"DateofReview": "June 6, 2016",
		"ReviewTitle": "Educational ",
		"Review": "Very good educational trip for the children. It is nice to know that a lot of people support preservation of these animal as shown in the foot walk wherein all donor names are printed."
	},
	{
		"User": "AGMMAC",
		"Location": "Pasig, Philippines",
		"DateofReview": "June 6, 2016",
		"ReviewTitle": "For kids and adults alike",
		"Review": "It's good to visit this place when in Davao to see the Philippine eagle and a really huge crocodile. Our son was happy to see the birds there. However, the place needs to be kept clean. The restrooms are dirty and you can see garbage everywhere. There's also no noise control inside. People can get too loud, distracting the animals."
	},
	{
		"User": "mike k",
		"Location": "Dumaguete City, Philippines",
		"DateofReview": "June 2, 2016",
		"ReviewTitle": "Not worth the time to go",
		"Review": "The Eagle was nice to see but you have to walk a long distance to even see it and not worth the long walk"
	},
	{
		"User": "timballenger",
		"Location": "Dumaguete City, Philippines",
		"DateofReview": "June 2, 2016",
		"ReviewTitle": "Davao inspection tour",
		"Review": "I was somewhat not impressed with this place, I saw almost no information about breeding and release of young eagles and other birds into the wild. \r there were a lot of people shouting at other persons in their group that makes a bird sanctuary just another public park.\r A lot of money has been donated to this place and no real information available."
	},
	{
		"User": "milettep2016",
		"Location": "Batangas City, Philippines",
		"DateofReview": "May 31, 2016",
		"ReviewTitle": "Adventure at the Eagle Sanctuary",
		"Review": "The Philippine Eagle Centre in Davao is one interesting place to visit and view eagle and its kinds. It's an amazing opportunity to get great photos of residents eagles and other animals. We even found and had a nice souvenir picture with the handsomest eagle. They want to really preserve the area for a natural and healthy habitat in order for the eagle species to survive and thrive."
	},
	{
		"User": "Jigger-Fred",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Philippines",
		"Location": "Philippines",
		"DateofReview": "May 29, 2016",
		"ReviewTitle": "Eagle Sanctuary",
		"Review": "This place is really ideal for a bird sanctuary. Its far from the busy city and the climate is cold. How i wish some of the birds are free to move but maybe the place is not as big and could be very expensive."
	},
	{
		"User": "auretanjr",
		"Location": "Houston, Texas",
		"DateofReview": "May 17, 2016",
		"ReviewTitle": "Must See for Bird Lovers",
		"Review": "The Philippine eagle is one of the largest birds in the world It is also called the monkey-eating eagle because the monkey was its main diet until recently. The staff in the sanctuary are very knowledgeable and are trained to raise the eagles for release inthe wild. The only problem is that the general population is not ready for such eventuality. Other type of eagles and hawks are on the property. When visiting, ask to be guided by one of the handlers. A tip of at least $10 will be much appreciated. "
	},
	{
		"User": "Asia A",
		"Location": "Narra, Philippines",
		"DateofReview": "May 11, 2016",
		"ReviewTitle": "Eagles and Animals",
		"Review": "The only place you can see the world's largest species of eagles. It is a nice walk and quite interesting. Several types of eagles and hawks can be seen. I really enjoyed the visit."
	},
	{
		"User": "Fred1021",
		"Location": "Los Angeles, California",
		"DateofReview": "May 8, 2016",
		"ReviewTitle": "Informative tour",
		"Review": "The tour was very informative. Our tour guide, Puroy, was very knowledgeable on the peculiar characteristics of the Philippine eagle which is an endangered specie. The center is not in its best condition since the center is funded by donations from private citizens and organizations."
	},
	{
		"User": "flxmanuel",
		"Location": "New York City, New York",
		"DateofReview": "April 30, 2016",
		"ReviewTitle": "emotional...",
		"Review": "As a child, I have always been fascinated by the Philippine Eagle, from the time I saw one in captivity, I have longed to visit the Philippine Eagle Center in Davao.\r \r A few days before my visit to the Philippine Eagle Center, news came out that “Pamana”, a Philippine Eagle released in the wild last June, was fatally shot in the protected area where she was released. It was devastating news for everyone involved in rescuing her before. A villager in Iligan found her in 2012 and was taken into the center and was treated for a gunshot and was released after undergoing rehabilitation. Despite attempts of the Philippine Eagle Foundation to educate people in protecting the endangered National Bird of the Philippines, there are still people who do not listen. There are less than five hundred Philippine Eagles in the wild today.\r \r \r \r The Philippine Eagle Center in Davao is home to at least thirty Philippine Eagles. Most of them suffered from gunshot wounds. There were a lot of foreign volunteers at the center when I visited and it made me wonder why these people are more concerned in helping preserve our National Bird more than other Filipinos. \r \r Among the eagles I saw, it was “Putol” who captured my attention. The eagle’s left wing was clipped by a bullet a few years ago. This eagle, who mightily spreads his broken wing reminds me of how resilient most Filipinos are. I was awed by the beauty and pride this eagle had. I just wish more people would take care of the flora and fauna that we have. I am grateful that people at the Philippine Eagle Center and Philippine Eagle Foundation have devoted their time and effort to give the Philippine Eagle a fighting chance to survive.\r \r The Philippine Eagle Foundation firmly believes that the fate of our vanishing Philippine Eagle, the health of our environment, and the quality of Philippine life are inextricably linked. We are therefore committed to promote the survival of the Philippine Eagle, the biodiversity it represents, and the sustainable use of our forest resources for future generations to enjoy.\r \r The Center is home to 36 Philippine Eagles, 18 of which are captive-bred. It also houses 10 other species of birds, 4 species of mammals and 2 species of reptiles. Simulating a tropical rain forest environment, the Center offers the visitor a glimpse into the country’s forest ecosystem. Although the exhibits are used primarily to help educate the Filipino people on conservation, the facility is also considered a major tourist attraction in Davao City.\r \r You can help save our Philippine Eagle in various ways. Visit the Philippine Eagle Foundation website for more information."
	},
	{
		"User": "Manay",
		"Location": "Martinsburg, West Virginia",
		"DateofReview": "April 28, 2016",
		"ReviewTitle": "Wonderful world",
		"Review": "Visiting family in Davao City, it was a privilege to be taking to the Eagle Centre. We in America cherish our eagles, especially the bald eagles. It is to heartwarming to see they do the same in the Philippines. The Centre is well appointed. Wonderful lanes to walk to the location of different birds. There are more birds there than the eagle. A bit more information for visitors would be good. When you go, be sure to take a camera. You will never forget this visit"
	},
	{
		"User": "Abi_girl07",
		"Location": " ",
		"DateofReview": "April 26, 2016",
		"ReviewTitle": "Long travel. It was just ok. ",
		"Review": "So going to Davao city, I know I had to bring my little boys as they might not be able to see a live eagle in the near future, the location is very far, we took a little bus, more like a van going to Calinan and took a tricycle going to the Philippine eagle, the entrance fee is expensive, though yes you will see eagles outside the cage and a lot inside. They need to clean up the space. And yes, lots of mosquitoes but yeah still glad brought my kids. Though you can see Eagles too at crocodile farm. They should lower the entrance fee, instead of building new cr' show about they use the money to clean the surroundings. "
	},
	{
		"User": "Talentscrib",
		"Location": "Philippines",
		"DateofReview": "April 25, 2016",
		"ReviewTitle": "Impressive bird sanctuary",
		"Review": "I loud there efforts of taking care of a number of the Philippine Eagle species to ensure they dont go extinct. How i wish they could fly way up though but some wildlife shooters endanger the birds. Ots an educational experience here, One can see an eagle here upclose.. Lots of other birds too"
	},
	{
		"User": "Dimple S",
		"Location": " ",
		"DateofReview": "April 21, 2016",
		"ReviewTitle": "Surpassed my expectations..",
		"Review": "I'm actually hesitant to come here at first, since I'm already used to the \"forest with wild birds\" set-up. It was also not my first time to see eagles, owls and other wild animals. But since I'm a nature lover and are greatly interested in science, I appreciated their detailed explanation of the research. It also seems that they are well-funded for they have some top of the line facility. \r You'll learn a lot by visiting this place. "
	},
	{
		"User": "dred69",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 12, 2016",
		"ReviewTitle": "Mother Nature",
		"Review": "It was one of the best place to visit, you can see different breed of eagles here and also they showcase to the visitors the life of an eagle. They have also different animals plus they preserved the place, the trees and plants."
	},
	{
		"User": "charmed497",
		"Location": "manila",
		"DateofReview": "April 6, 2016",
		"ReviewTitle": "Well preserved area",
		"Review": "You can see here, how the eagles were well taken care of. If you love nature also, this is the place to be. You will be able to appreciate the eagles in the philippines."
	},
	{
		"User": "Kuya Rey B",
		"Location": "Bukidnon Province, Philippines",
		"DateofReview": "April 1, 2016",
		"ReviewTitle": "Come. Gaze. Then Leave. But Amazed.",
		"Review": "There is a sign when you enter the gates that says Be Quiet, Young Eagles Are Sleeping. So you must walk slowly, almost meditatively, as you gaze at the Philippine Eagle. They are simply majestic. Do nothing but watch. Do not feed. Do not play...More"
	},
	{
		"User": "rr e",
		"Location": " ",
		"DateofReview": "March 27, 2016",
		"ReviewTitle": "Educational",
		"Review": "When you visit the spot, it will make you realize the importance of conserving the wildlife. My only concern is the lairs where the eaglea kept were so crowded."
	},
	{
		"User": "erika d",
		"Location": " ",
		"DateofReview": "March 26, 2016",
		"ReviewTitle": "If you are not very fond of eagles and zoos....",
		"Review": "Then this is not the place for you to visit. It has an entrance fee of I think P150 and there's nothing much to see but eagles and some other animals. But I like the pavement tho. It has engraving of names of people/family that...More"
	},
	{
		"User": "Thea T",
		"Location": " ",
		"DateofReview": "March 24, 2016",
		"ReviewTitle": "Great place to visit for nature lovers",
		"Review": "The center is a bit far from the city, possibly an hour away or more. Despite the long travel time, I think it is worth it to go there. You will be able to see the famous birds of prey up close (but no THAT...More"
	},
	{
		"User": "Nwrzx",
		"Location": "Jeddah, Makkah, Saudi Arabia",
		"DateofReview": "March 23, 2016",
		"ReviewTitle": "Part of our trip",
		"Review": "It's normal park and you see different families of Philippine Eagles. However, park uncomfortable due to a lot of ants and insects."
	},
	{
		"User": "Jonathan Christ... B",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 23, 2016",
		"ReviewTitle": "HARING IBON (KING OF BIRDS)",
		"Review": "If you want to witness the magnificent Philippines eagle this is the place to be. It is not only an eagle sanctuary they also provide rehabilitation of captured or injured subspecies of birds. It is quite far from the city central but worth it when...More"
	},
	{
		"User": "Elvis D",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "March 18, 2016",
		"ReviewTitle": "Philippine Monkey Eating Eagle",
		"Review": "Philippine monkey eating Eagle becoming extinct and this center had been built to protect them from extinction and reproduce them then release some to the forest. You can see also in the Centre crocodiles, monkey & snakes."
	},
	{
		"User": "thenavigator8",
		"Location": "Manila, Philippines",
		"DateofReview": "March 15, 2016",
		"ReviewTitle": "Take care of the endangered species",
		"Review": "There are so many kinds of eagle that you can see here. Adopt an eagle for P120,000 a year. If you are here look for Kuya Puroy for some awesome close encounter and photo ops with eagle :)"
	},
	{
		"User": "trentvano",
		"Location": "tampa FL",
		"DateofReview": "March 13, 2016",
		"ReviewTitle": "It was okay",
		"Review": "It was neat to see the giant eagles standing around on their pedestals. Also there are little exhibits with a crocodile, some deer, a little monkey island, a wart pig and other types of eagles. Takes a total of 120 pesos to get to the...More"
	},
	{
		"User": "Virtual_Angel888",
		"Location": "Virac, Philippines",
		"DateofReview": "March 9, 2016",
		"ReviewTitle": "See the Phil. National Bird up close",
		"Review": "Its thrilling to see the Philippine Eagle, one of the endangered species of eagle in the world today, and not only this, you can also find other types of birds in different cages here. Touring around the area will take around 45 minutes. Lots of...More"
	},
	{
		"User": "Racq",
		"Location": "Manila, Philippines",
		"DateofReview": "March 5, 2016",
		"ReviewTitle": "Very interesting and cozy place",
		"Review": "Going to Philippine Eagle center will take about an hour or more depending on traffic. From J. P. Laurel, take a jeep to Bankerohan, fare is PHP 9. Look for L3 terminal going to Calinan, fare is PHP 40. From Calinan, take a tricycle to...More"
	},
	{
		"User": "rod m",
		"Location": "Dasmarinas City, Philippines",
		"DateofReview": "March 5, 2016",
		"ReviewTitle": "Enlightening!",
		"Review": "After climbing Mt. Apo, and with a spare day before going back to Manila. We decided to visit the Philippine Eagle Center in Malagos. It more than 1 hour of travel by taxi from Davao City. We enjoyed our visit here and we were enlightened...More"
	},
	{
		"User": "ZaySy",
		"Location": "Makati, Philippines",
		"DateofReview": "February 29, 2016",
		"ReviewTitle": "Fighter!",
		"Review": "The entrance fee is really cheap. 5 pesos for adults, 3 pesos for kids.:) The center is fairly clean."
	},
	{
		"User": "mnjensen",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Odense, Denmark",
		"Location": "Odense, Denmark",
		"DateofReview": "February 27, 2016",
		"ReviewTitle": "A nice visit from Davao city",
		"Review": "It is a nice place to see the Philippine Eagle and other birds. It was a little in need of maintenance - but I think they are doing their best."
	},
	{
		"User": "Herbie A",
		"Location": " ",
		"DateofReview": "February 16, 2016",
		"ReviewTitle": "A very nice place and a good cause for Phil. eagle conservation",
		"Review": "The place is really nice. Its a conservation place for Phil. eagles and you can really see the beauty of these magnificent birds of prey. I recommend this place for bird lovers and nature lovers as well."
	},
	{
		"User": "FKSG",
		"Location": "Singapore, Singapore",
		"DateofReview": "February 13, 2016",
		"ReviewTitle": "A nice idea",
		"Review": "The idea behind this is great. Almost all of the eagles have been rescued from some kind of abuse or saved from death. Eagles are now bred in captivity. With so few Philippine eagles left in the wild, this is important. It is, however, hard...More"
	},
	{
		"User": "danmbuen",
		"Location": " ",
		"DateofReview": "February 10, 2016",
		"ReviewTitle": "Very nice place for kids and nature lovers",
		"Review": "The location is very far from the Davao city town center. I am not sure if it is accessible by public transportation. The place is properly maintained. This is my first time to get that close to eagles; they are huge and magnificent. The trees...More"
	},
	{
		"User": "FrogBandit",
		"Location": "London, United Kingdom",
		"DateofReview": "February 9, 2016",
		"ReviewTitle": "What a bird! Totally worth travelling round the globe to see. Its a conservation programme, NOT a zoo ;)",
		"Review": "The place itself is so peaceful. Full of beautiful, majestic and magical birds of prey. Some of them victims of human brutality that live on in the sanctuary and some raised there. But none of the birds rivalled the Philippine eagle. In fact I don't...More"
	},
	{
		"User": "Ed K",
		"Location": " ",
		"DateofReview": "February 7, 2016",
		"ReviewTitle": "Huge Eagles! ",
		"Review": "Great place to understand more about PH Eagles! Good place to spend a weekend afternoon with your family and friends. You can also take close up pictures with the birds!"
	},
	{
		"User": "Dan D",
		"Location": " ",
		"DateofReview": "February 5, 2016",
		"ReviewTitle": "Nice place lots to see",
		"Review": "Lots of birds, monkeys, and other animals. We had a good time here. Only takes a couple hours to walk around. Worth checking out!!"
	},
	{
		"User": "Jake2014jake",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 2, 2016",
		"ReviewTitle": "Up close and personal with the Philippine Eagle!",
		"Review": "To get to the place, from the Davao City center, proceed to Bankerohan Market and ride an L300 van to Calinan town. Travel time is at least 1 hour. From Calinan town, it is a 10 minute ride by motorcycle to reach the Center. This...More"
	},
	{
		"User": "GANDHILEO",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Hong Kong, China",
		"Location": "Hong Kong, China",
		"DateofReview": "January 29, 2016",
		"ReviewTitle": "Just weekend trip",
		"Review": "Very good place can see the Philippine eagles rare huge must see , good for a day trip and can have lunch there and help preserve this rare Eagles"
	},
	{
		"User": "reinavender",
		"Location": "Singapore, Singapore",
		"DateofReview": "January 22, 2016",
		"ReviewTitle": "Thought it was bigger",
		"Review": "I agree with previous reviews that this centre could do better with proper funding. By the time we went to the far end (from the entrance), the Eagles looked sadder and sadder. We were not able to see the feeding and baby eagle areas as they looked abandoned or was restricted from the public. If managed properly, it would have the Jurassic Park kind of feel."
	},
	{
		"User": "Jay S",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 21, 2016",
		"ReviewTitle": "Was Great But Not Maintained Well",
		"Review": "I used to visit here multiple times with the family when I was still single and it was a great because all the cages had animals on them.\r \r Now, with other parks to choose from, attendance has gone down and maintenance as expected would not be that good anymore. I wish they innovated or something rather than settled to be just an average animal park."
	},
	{
		"User": "Justin G",
		"Location": " ",
		"DateofReview": "January 12, 2016",
		"ReviewTitle": "simply amazing!!!",
		"Review": "the place is not bad! you could see the eagles everywhere. Could be improved to better cater more visitors. must have more things to do. But over all the experience is memorable"
	},
	{
		"User": "Sandrine P",
		"Location": "Lausanne, Switzerland",
		"DateofReview": "January 5, 2016",
		"ReviewTitle": "Exploring the beautiful eagles of mindanao",
		"Review": "I been here so many time since I was young, but every time I have the chance to come is always so fun amazed how beautiful is the birds are, this always a nice park to people who are new here in Davao and who wants to see the amazingly beautiful big eagle of mindanao, and every of my new visitors who came here told me that they loved it! so recommend this place for new visitors to come and see this park. In the park they also have different type of birds, a crocodile, monkeys and little museum, outside you can buy souvenirs and some filipino hand made bags and nice scarfs filipino snacks etc.. for very affordable prices! ( near the shops you can see python snakes and hold them )"
	},
	{
		"User": "al22tecc",
		"Location": "philippines",
		"DateofReview": "January 1, 2016",
		"ReviewTitle": "worth the trip",
		"Review": "The center is located inside another park, where you need to pay a small entrance fee. The entrance fee to the center is now at P150.\r \r The center explains how much they spend for the animals' food. I wonder if the entrance fee we pay is enough. The majestic philippine eagles are the highlight. There are other eagles and birds inside but its still the philippine eagle that is the main attraction. What adds to the interest is that these eagles are adopted by different institutions and some of them are quite popular. It is also nice to see the signages that explains when they were born, and who were the birds' parents. Some birds are tied down and not caged, but these are the ones whose wings were damaged and could not fly. However, these birds have adapted and are quite a ramp model, more than willing to strike a pose. However, they only follow their handlers. When we tried to say the same words, no reaction! Try to get a guide to bring you around the place. If none is available, if you see one around, try to tag along. The interaction that these handlers do with the eagles are a sight to see in itself.\r \r There were huge, lush trees and greens all over. However, this also means a lot of mosquitos when 3 or 4pm comes in."
	},
	{
		"User": "Zarah C",
		"Location": "Gothenburg, Sweden",
		"DateofReview": "January 1, 2016",
		"ReviewTitle": "Calm activity, beautiful sights",
		"Review": "Beautiful place, amazing to be to up-close to these animals. Would recommend going with a guide if possible, as we didn't and had a lot of questions I feel a guide might've been able to help with."
	},
	{
		"User": "majanu",
		"Location": "New York City, New York",
		"DateofReview": "December 27, 2015",
		"ReviewTitle": "Need real attention to this place",
		"Review": "Well it was Christmas eve and we visited this place. We made deal with taxi driver, and spent 10 hours for 1500 peso, including everything if you need ph # of this driver let us know. From Davao we took taxi to illgan city which is 400 km for 6000 peso. \r This eagle park is well small but amazing eagles, heart was happy to know at least some portion of government is trying to save those eagles. Took us 30 minutes from airport to go there, our driver knew local road. Traffic was really really bad, one motorcycle driver died in front of us, was hit by truck so local politician should stop bsing about smoking and fire crackers and pay attention to real problems. Davao felt so bad to us, totally dried (i visited manila, subic, bagio, camote, cebu, palawan, boracay and more place in phill in one year) . there is nothing to see other than couple places."
	},
	{
		"User": "Rexoy",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao",
		"Location": "Davao",
		"DateofReview": "December 19, 2015",
		"ReviewTitle": "A very good way to appreciate our wildlife",
		"Review": "Very informative place, great for kids to know more about the philippine eagle and our wildlife. Bring off to fend off mosquitos, dress to be able to hike around the area comfortably, may get humid and hot, bring water and an extta shirt!"
	},
	{
		"User": "richard e",
		"Location": "Singapore, Singapore",
		"DateofReview": "December 7, 2015",
		"ReviewTitle": "amazing eagles",
		"Review": "When visiting Davao, Philippine Eagle Centre is a must ! The Philippine Eagles are just amazing, the size, beauty and its grace while flying will definitely amaze you. The place itself is already old and some structures are dilapidated. Tourists can be generous with their donations to save this endangered species."
	},
	{
		"User": "HurricaneRob",
		"Location": "Houston, Texas",
		"DateofReview": "December 3, 2015",
		"ReviewTitle": "Birds and more cool birds",
		"Review": "Don't visit when its too hot, no where to get cooled down. Butthe Birds were well worth the money, you do have a ways to go to get to the Centre from Davao. I suggest renting a van.. DONT use a Taxi.. hard to get a taxi to return trip you "
	},
	{
		"User": "LanzSister",
		"Location": "Ormoc",
		"DateofReview": "December 1, 2015",
		"ReviewTitle": "Commune with nature and its habita.",
		"Review": "Trekking and hiking in a green environ and meeting eagles of varied species was such a unique experience of Davao City. These place is really the haven and habitat for eagles."
	},
	{
		"User": "Luke T",
		"Location": "Gingoog City, Philippines",
		"DateofReview": "November 22, 2015",
		"ReviewTitle": "This is one of the high lites of the Philippines to me. Beautiful Creatures both in the air and on a limb of a tree.",
		"Review": "My wife and I visited this area during a trip to Davao. While the city is beautiful and one of the safest cities in the world, the visit to see the Eagles touched my heart and I still see the Eagles in my dreams. And as you wander around stop and gaze in the face of the wise owls that are also here. This bird sanctuary is wonderful to see with several types of Eagles, Philippine Eagles, Pacific Coast Eagles and also some awesome Owls. Well worth the visit to see and visit. Stop in and see the animals also."
	},
	{
		"User": "rohanforce",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 16, 2015",
		"ReviewTitle": "Great up hill climb if you're a cyclist!",
		"Review": "As a triathlete & cyclist I do a lot of bike riding throughout the region & love riding up hill to the top to be treated by a beautiful sanctuary, with seeing the famous Philippine Eagle!"
	},
	{
		"User": "lanaval",
		"Location": "Manila, Philippines",
		"DateofReview": "November 16, 2015",
		"ReviewTitle": "Needs Maintenance",
		"Review": "We did not have the chance to really explore the park because our senior citizen companion could not tolerate long walks anymore. We enjoyed, however, the lush wild-like forest atmosphere with large, tall and old trees of different varieties. The park wasn’t kept well anymore and maybe this could be due to insufficiency in budget for its maintenance. Another plus part was the souvenir shops which offered very colorful native products at low price."
	},
	{
		"User": "ukjeprox",
		"Location": "Davao",
		"DateofReview": "November 12, 2015",
		"ReviewTitle": "Informative day out.",
		"Review": "Philippine Eagle Centre is a very interesting attraction. Appart from telling you about the work they do there in the rescue and release programme of the Philippine Eagle there are other animals there that will keep you interested."
	},
	{
		"User": "Tet C",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Metro Manila, Philippines",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "November 12, 2015",
		"ReviewTitle": "Nature trek with the eagles",
		"Review": "Visited the center with my kids last Nov 7 (Saturday). We got to the place around 10am and there were very few visitors in the place.\r \r We got lost finding the center, because it was actually located in an inner road. You'll have to take a right turn from the main road, and the sign was not really that visible.\r \r Suggest to bring mosquito patches if you're visiting the center with kids. The place is ok and unique in the sense that the kids appreciated all the different eagles we have, but its really a trek in the forest. There are lots of bugs, flying insects and just to be safe put on off lotion/ mosquito repellent."
	},
	{
		"User": "Chrïstïnę B",
		"Location": "Sweden",
		"DateofReview": "November 5, 2015",
		"ReviewTitle": "Good for Tourists :)",
		"Review": "You can learn something from this tourist spot from BIRDS- DIFFERENT WILD ANIMALS :)\r \r This is really influential and really my kinda thing.\r \r It's time for nature and just enjoy the scenery :) \r \r Maybe this time let us appreciate nature, natural born animals and have fun with ourselves & family.\r \r Time to forget your smart phone/s"
	},
	{
		"User": "jed1017",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "November 2, 2015",
		"ReviewTitle": "Not just Eagles",
		"Review": "The place is not just eagles, they also have different kinds of birds, monkeys and other animals. There are also a lot of information about the animals in there."
	},
	{
		"User": "JayZee007",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "October 31, 2015",
		"ReviewTitle": "Please Go to Support Our National Treasure",
		"Review": "Only here will you see our national bird up close (almost). It's quite a drive from Davao City but worth it to catch a glimpse of these magnificent birds. Though most of them were always high up in the tree branches in their enclosures, there were a couple on \"ground level\" that you could see. \r \r The grounds inside are almost jungle-like, so spray on some insect repellent, though I didn't see any mosquitoes, it's better to be safe than sorry. There's a tiny gift shop and place to buy refreshments. Bathrooms could have used a clean.\r \r What more funding would do to make this place even better! If you're in Davao, please visit!"
	},
	{
		"User": "shaofalcis",
		"Location": "manila",
		"DateofReview": "October 26, 2015",
		"ReviewTitle": "Support Eagle Welfare, make sure to visit when in Davao!",
		"Review": "Although the centre needs a lot of rehabilitation, it's still well kept. I'd say that this is a must when you visit Davao, if only to make an effort to donate to the cause of preserving our Philippine eagles."
	},
	{
		"User": "agar_floro",
		"Location": "Quezon City, Philippines",
		"DateofReview": "October 24, 2015",
		"ReviewTitle": "Grea endeavour",
		"Review": "I was there last year and I can appreciate the effort to help conserve our Philippine eagle. I guess they need more donors in order to really maintain the place. Since it is like in a semi forrested place, it is not good to go there during rainy season, pathways are quite mossy and slippery. It is quite far from the city and you should maximize the trip by exploring the surrounding area."
	},
	{
		"User": "Xyrich",
		"Location": "Singapore, Singapore",
		"DateofReview": "October 17, 2015",
		"ReviewTitle": "National Bird, The Mighty Philippine Eagle",
		"Review": "Located an hour drive from the city, this research facility offers visitors a glimpse of the conservation work for this endangered eagle. Take a van from Bankerohan market to Calinan and transfer to the Philippine Eagle Centre by pedicab."
	},
	{
		"User": "RodgerOndat",
		"Location": "Chiang Rai, Thailand",
		"DateofReview": "October 16, 2015",
		"ReviewTitle": "Worthy Conservation Project",
		"Review": "Endangered Eagles are displaced from forest habitat by human activity. Captive-breeding helps them. The Conservation project is located at the Malagos Watershed which is around 10 km north of Calinan or around 40 minutes drive for Davao City. There is a modest entrance fee which helps the center pay for its operation costs. Many high profile companies have adopted the eagles being maintained at the breeding Center. A few of the eagles are wild and are being treated for injuries at the center. In August one of those rehabilitated eagle released back into the wild was Murdered. I hope that with more public education and community involvement, Filipinos would have a better appreciation of these majestic bird and allow them to fly high and flourish."
	},
	{
		"User": "Rina S",
		"Location": " ",
		"DateofReview": "October 13, 2015",
		"ReviewTitle": "Eagles all around",
		"Review": "Quite far from downtown but the trip is really worth it. My first time to see the eagles. Tip: pasalubong are available at the park's entrance. They are cheaper than in downtown."
	},
	{
		"User": "Paulhudds2015",
		"Location": "Singapore, Singapore",
		"DateofReview": "September 23, 2015",
		"ReviewTitle": "up in the woods!",
		"Review": "It is a bit of a drive out of Davao, but well worth it. Not expensive for a ticket, but you get to see plenty of birds native to the Philippines which are really beautiful! \r \r The star is the Philippine eagle of course!\r \r There are plenty of cards around to tell you about what you are seeing, and tours available if you wish to have a guide.\r \r Best of all, last time I was there, a docile snake you get to pick up and have your picture with! Not sure what type of snake, maybe a python. But she was BIG! Kinda cool..."
	},
	{
		"User": "Morris98",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 21, 2015",
		"ReviewTitle": "Our King can Fly",
		"Review": "This review is based on my experience as a volunteer for the Philippine Eagle Center and what I know about it. :D The Center is home to 36 Philippine Eagles, 18 of which are captive-bred. There are also other birds and animals in the center . The center serves as the research, breeding and conservation facility for the Philippine Eagle. TRIVIA: The center is the only facility that is permitted to take care of the Philippine Eagle , so if you want to have a close encounter with this majestic bird, do visiti the center whenever you have a trip in Davao City. about an hour drive from the city and can be reached either by private or public transport. Buses going to Calinan depart every 15 minutes from the Annil Terminal located at corner Quirino and San Pedro Extension. Bus fare is at P30. From Calinan, take a pedicab going to the PEC. You can also ride a single motorcycle at P30 per motorcycle (P15 per person) .Entrance fee is P100 for adults and P50 for Kids.."
	},
	{
		"User": "Anna May V",
		"Location": "Pasig, Philippines",
		"DateofReview": "September 19, 2015",
		"ReviewTitle": "A Solid Advocacy",
		"Review": "Entrance is at 150p per head (adults). The place is huge, and offers food. You may also buy fruits from the stalls outside (at ridiculously low prices) and munch on it while wandering around. \r \r They have a selection of birds, mostly eagles. There was also a crocodile, a pen for a warty pig (did not see it, though) and a Grass Owl. \r \r It would have been good to have a guide (we did not inquire anymore as it was only one stop in our itinerary), we feel it would have made for a richer experience.\r \r The eagles are well groomed and look healthy. It must not be easy to maintain a place like this and my appreciation goes to the folks behind the foundation."
	},
	{
		"User": "bulakbol76",
		"Location": "Cebu City, Philippines",
		"DateofReview": "September 14, 2015",
		"ReviewTitle": "your chance to see these majestic eagles",
		"Review": "visited in the afternoon and were a bit daunted by the number of vehicles streaming in (we went on the Sunday of Kadayawan sa Davao, their annual festival). however, the center is pretty big so people spread out in the park area. enjoyed seeing the majestic Philippine Eagles although we felt we missed out on key information about habits, habitat, etc. Also had a nice time just walking among the plants and trees, which were different fro other places we had been to. also very handy that is was about 5 minutes away from Malagos Eco Gardens as it meant the total driving time in and out of the city proper worth the effort. "
	},
	{
		"User": "jopin",
		"Location": "Manila",
		"DateofReview": "September 7, 2015",
		"ReviewTitle": "Good refuge for these endangered eagles",
		"Review": "You'd think 32 out of the estimated 800 eagles estimated to still be out alive aren't that many but those are 32 that seemed to be well cared for and that have provided a laboratory for scientists to learn more about the Philippine eagle. Affordable entry fee ($0.10 per person to the grounds plus $3.20 per person to see the animals) but definitely not contributing much to the upkeep. Need to rethink how to make it a more dynamic operation capable of so much more. The grounds were well kept, the keepers we met seemed knowledgeable, the merchandising and posted information we saw were not bad. Something for all children and humans to learn. A cause worth advocating."
	},
	{
		"User": "narendra g",
		"Location": " ",
		"DateofReview": "September 7, 2015",
		"ReviewTitle": "Picnic ",
		"Review": "Very huge Eagles rare must visit and donate them to protect the species It is a must help to protect this species of Eagles thanks We felt like coming here over and over"
	},
	{
		"User": "yzhang2015",
		"Location": "Puerto Princesa, Philippines",
		"DateofReview": "September 5, 2015",
		"ReviewTitle": "Amazing Philippine Eagle",
		"Review": "If you're in Davao City don't forget to visit the Philippine Eagle Center..So amazing & peaceful place, relaxing too."
	},
	{
		"User": "patrickph",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "September 4, 2015",
		"ReviewTitle": "Amazing Eagle Experience ",
		"Review": "This was my 2nd visit in 3 years, but this last visit was the best , the caretaker was there and was coaching the eagle - we were able to get great photos :-) a bit far from Davao city , about 1 hr, away but worth the trip. We saw 2 eagles out of the aviary cages. Amazing birds! "
	},
	{
		"User": "Kris_ianne",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 27, 2015",
		"ReviewTitle": "Close To Nature & Wildlife",
		"Review": "Seeing the Philippine Eagle up close and personal, but not just the main attraction but also other wildlife animals, some are endangered and other are common to be seen on the zoo.\r \r Not like the other zoo that you see, you can also relax, because it is a nature friendly in which you can breath the fresh air"
	},
	{
		"User": "GerlieUy",
		"Location": "Negros Occidental, Philippines",
		"DateofReview": "August 26, 2015",
		"ReviewTitle": "Highly recommended",
		"Review": "I was so awed by the nature of the Philippine eagles. It is the must-go to place when in Davao, though one day must be allotted to do this nature tour. Entertaining ang friendly staff."
	},
	{
		"User": "Corazon S",
		"Location": " ",
		"DateofReview": "August 25, 2015",
		"ReviewTitle": "Tips when visiting Eagle Center",
		"Review": "We were there before 11am. We're lucky to see the eagles eat and kinda grab their rabbit foods. Perhaps, if you want to see them feed, you can go before 11am. :) \r Bring foods cause you might get hungry while watching the eagles and other birds. Also, if you want to leave something memorable and at the same time donate, prepare Php 300 for the 'Engrave your name on the walkway' thing they offer. :) \r \r It's actually nice to see them there. Oh, and if you want to have a cool picture with Fighter (the eagle standing in the middle and who lost his left wing), try to ask the caretaker to take a photo so you can have a close-up shot. :) "
	},
	{
		"User": "maribel_camelotes",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "August 24, 2015",
		"ReviewTitle": "A must see destination in Davao City where you could see a live Phil. Eagle.",
		"Review": "This is the only place you would see the Phil.Eagle. The entrance fee is only fifty pesos.Direction: From Davao City airport ride a taxi to bangkerohan L300 terminal bound for Calinan (taxi fare would be P170). Ride the van going to Calinan (fare is P40, distance is about 23 km from Davao city Proper. Tell the driver to drop you at the habal-habal terminal bound for malagos. Once you arrive Calinan, the habal-habal terminal is just near the L300 terminal. Tell the habal-habal driver that you are going to Malagos Phil. Eagle Center (distance is 10 km from Calinan proper, usual fare is P25 per passenger but if you want to be the only passenger you could pay the driver P200 back and forth). "
	},
	{
		"User": "kreez21",
		"Location": "Haarlem, The Netherlands",
		"DateofReview": "August 14, 2015",
		"ReviewTitle": "Close encounter with wildlife",
		"Review": "We went here on our last day in Davao and we had such a great time specially my kids. Our friends brought us here and they explained to us some of the facts about the park and the animals in it. We were even assisted by a very nice care taker in the park. We had the opportunity to have pictures taken with a hawk and a very cute owl (he told us its the smallest owl in the world). \r \r This is an amazing place to learn about the birds and other creatures. We can see that it is very well maintained and cared for. Hopefully there will be more places like this in our country."
	},
	{
		"User": "dathomas2015",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 13, 2015",
		"ReviewTitle": "Safest place for the Eagles and other wildlife",
		"Review": "Philippine Eagle Center is the place for conservation, research, to protect wildlife, and endangered species."
	},
	{
		"User": "Brisflip",
		"Location": "Brisbane",
		"DateofReview": "August 10, 2015",
		"ReviewTitle": "Nice birds but the centre needs some TLC",
		"Review": "Visited the centre last week, the birds are well kept and appear to be in good health. Great range of eagles, other birds and the odd monkey. The centre would be better if directional signage was clearer around the centre. Like the up close and personal areas of the centre. Worth a visit and support the centre in its care of the Eagle."
	},
	{
		"User": "tiger_downunder",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Brisbane, Australia",
		"Location": "Brisbane, Australia",
		"DateofReview": "August 9, 2015",
		"ReviewTitle": "Great to see the Eagles and other birds",
		"Review": "A great place to visit and to see the Philippines pride. I visited the place over 11 years ago and it was great and clean. The only disappointment...it's poorly maintained. You can't see the eagles on the big aviary because of tall grasses,vines, small trees and bushes. It's nice to see the Philippine Eagles at close encounter but I don't like to see them tied up for public display and left unattended. Some\r visitors are harassing them. "
	},
	{
		"User": "Dioneli S",
		"Location": "Iloilo City, Iloilo City, Philippines",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "Visit only if you haven't seen eagles or if you just need to check your bucket list",
		"Review": "I have been very disappointed with my visit in the PEC. I have read a lot of good reviews of this place so it sort of raised my expectation and unfortunately it was a let down.\r \r PEC is about 1.5hr away from city proper, 2hr away from Eden Nature Park. The road going to the center is well-paved but the maximum speed is only 60kph so you might need to consider that if you are managing your sched.\r \r Upon arrival, you will need to pay a Php5 entrance free to enter the Davao Water District then another Php100 for the PEC itself.\r \r Sad to say that the place is not well-maintained so wear pants or long-sleeves, or prepare to use your OFF lotion as there are lots of mosquitos. They are also selling citronella products in their gift shop if you came unprepared(like us).\r \r You could see different kinds of eagles. Some in cages, some out in the open(with a rope tied on their feet). Some cages are empty though.\r \r They have a koi pond near the lobby but you could barely see the fishes as the water is murky.\r \r To sum up, you can alot 20 to 30mins here then move on to your next activity. If you are not visiting Malagos Garden, consider if it is worth the long drive."
	},
	{
		"User": "colewanderer",
		"Location": "Malmo, Sweden",
		"DateofReview": "July 30, 2015",
		"ReviewTitle": "Love seeing Pag-asa❤️",
		"Review": "I took my whole family here and my husband as seeing a Philippine Eagle is on his top list. We did a donation to support Philippine Eagle Foundation too. I love nature and visiting here is such a good feeling. My family enjoy the cuteness of monkeys and I really enjoy seeing Pag Asa such a good looking eagle."
	},
	{
		"User": "Dave F",
		"Location": "Melbourne",
		"DateofReview": "July 22, 2015",
		"ReviewTitle": "Awesome eagles",
		"Review": "Seeing the majestic philippine eagle was great. Its a shame to know less than a thousand of these majestic birds are left on the planet. They are huge birds, 2 foot tall at least"
	},
	{
		"User": "Ronnarie",
		"Location": "Manila, Philippines",
		"DateofReview": "July 18, 2015",
		"ReviewTitle": "Eagles up close",
		"Review": "Upon entering the place you will have to pay 5 pesos for the Davao City Water District.There are no signs where the center is located so we just walked and looked at where some people are coming from. Entrance fee at the Philippine Eagle Center is 50 pesos and you can ask for a guide (free of charge).\r \r The need for a guide is a must so you will have more information of the animals there. You will able to see some of the eagles at a very close range and learn facts about them and how they were rescued.\r \r Snacks and drinks are available near the center's entrance, as well as souvenir items such as t-shirts, keychains and magnets.\r \r This place is worth visiting."
	},
	{
		"User": "John W",
		"Location": " ",
		"DateofReview": "July 17, 2015",
		"ReviewTitle": "Good, but could easily be improved",
		"Review": "The birds are magnificent, especially the Philippine eagles themselves. \r \r However, the condition of the grounds leaves a lot to be desired. An international traveller might be very put off by the poor state of the welcome garden - you have to pay (admittedly not very much) to get in here although it consists of no more than a few wooden shacks and a grassed area. Then you have to pay to get into the Eagle Park itself. \r \r The reception and cafe area also leaves a lot to be desired. It basically needs a good clean and a refresh. There is no indoor aircon area either.\r \r The park is set in tropical grounds and the walk is interesting due to the variety of flora. The range of birds is also good, although it is a shame that some of them are in smallish cages.\r \r The Philippine eagles are amazing, and have a real presence. They (and not the human organisation) are what raise the review from a 2 or 3 to a 4."
	},
	{
		"User": "Tonijr555",
		"Location": "Manila, Philippines",
		"DateofReview": "July 16, 2015",
		"ReviewTitle": "Huge birds",
		"Review": "Experience being up close with the eagles! We were lucky enough to chance upon and meet the caretaker of the eagles so he personally assisted us in handling the eagles while we were taking pictures"
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 15, 2015",
		"ReviewTitle": "Our Endangered Philippine Eagle",
		"Review": "This is one of the notable ecological projects in Davao. A sprawling forest dedicated to the breeding of the endangered Philippine Eagle. You will find different species of Eagles in captivity, some naturally born, others bred in captivity. There are other animals too. If you find the eagle breeder and caretaker Poroy, he will take out an eagle for you to pose with! A must see for us conservationists"
	},
	{
		"User": "David B",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 14, 2015",
		"ReviewTitle": "Philippine Eagle Park",
		"Review": "Worth the trip to see these magnificent birds. They are endangered, mostly because of ignorance and still being hunted."
	},
	{
		"User": "adianau",
		"Location": "Philippines",
		"DateofReview": "July 9, 2015",
		"ReviewTitle": "The King of the Mindanao Skies",
		"Review": "This place is where you will meet and greet the largest breed of eagles in the Philippines; closest to its extinction. This Centre is the nurturing home for its kind. A must see place to be visited."
	},
	{
		"User": "exploreraustralia",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "July 7, 2015",
		"ReviewTitle": "rare bird of prey centre",
		"Review": "Home to some 36 rare eagles 18 of which were bred in captivity the P.E.C. has also other bird species, mammals and reptiles.the size of the eagles is an initial surprise fully grown at one metre tall is a very large flying bird.the conservation program...More"
	},
	{
		"User": "BECHAY_DG",
		"Location": "Nevada",
		"DateofReview": "July 5, 2015",
		"ReviewTitle": "Educational!",
		"Review": "They do not only showcased Eagles but also other kinds of animals like Monkeys (I love them!) I was hoping to see birds show but it was not scheduled that day, I heard they do it on Sundays only. Being upclosed with Biasong Eagle was...More"
	},
	{
		"User": "cmsyambao",
		"Location": "Angeles City, Philippines",
		"DateofReview": "July 2, 2015",
		"ReviewTitle": "No Guide",
		"Review": "Though seeing Pag-Asa, the biggest eagle in captivity was a memorable experience, the entire park could have been better if there were guides or people to talk to or ask around the area. That could have made a big difference in the site. The staff...More"
	},
	{
		"User": "LawrenceSanDiego",
		"Location": "Pasig, Philippines",
		"DateofReview": "July 1, 2015",
		"ReviewTitle": "See the Philippine eagle up close",
		"Review": "The Philippine eagle, king of birds, is your main mission here, and hopefully you'll get to see him up close outside of a cage but chained to a tree stump. I'll leave it to you how you'll feel about that. The park could use some...More"
	},
	{
		"User": "SimonJ198",
		"Location": "Bournemouth, United Kingdom",
		"DateofReview": "July 1, 2015",
		"ReviewTitle": "Beautiful Eagles",
		"Review": "Great to see the national bird of the Philippines. Great to get close to these beautiful and very impressive eagles and we got some great photographs. Other eagles and birds of prey to see too, as well as a crocodile and monkeys. The Philippine Eagles...More"
	},
	{
		"User": "Glentoy",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 23, 2015",
		"ReviewTitle": "Home to our national bird",
		"Review": "Philippine Eagle Center is one of the must-visit places in Davao City. It is located in Calinan, about an hour away from the city proper. The center is easy to locate even when you are only commuting. See the Philippines' national bird up-close and personal....More"
	},
	{
		"User": "Mamitxoh",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Houston, Texas",
		"Location": "Houston, Texas",
		"DateofReview": "June 21, 2015",
		"ReviewTitle": "Unique Opportunity to See the National Bird of the Philippines",
		"Review": "The Philippine Eagle is the national bird of the Philippines, but few see it in the wild without great effort, since it is so endangered. The Center is working to change this, so a visit here is not only a great opportunity to see this...More"
	},
	{
		"User": "fred6301",
		"Location": "Sacramento, California",
		"DateofReview": "June 16, 2015",
		"ReviewTitle": "Educational and Memorable",
		"Review": "Great to walk thru the park and see the variety of Philippine Eagles that are there. I had did not know that there were Eagles that primarily ate fish, Eagles that primarily ate snakes, Eagles that primarily eat small animals. It was also great to see the variety of plants and trees that are rapidly disappearing because of development in the Philippines"
	},
	{
		"User": "Zendel1234",
		"Location": "Manila, Philippines",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "traveling for a cause",
		"Review": "This must be traveled and supported by us locals. This is touring for a cause. The entrance fees & donations help maintain the place & take care of the eagles & other birds."
	},
	{
		"User": "Peter & Jaysa K",
		"Location": "Auckland",
		"DateofReview": "May 30, 2015",
		"ReviewTitle": "Family day",
		"Review": "Educational and interesting Make sure to take mosquito repellent before walking through wooded areas The restaurant food was excellent. Although seating was poor We will visit again"
	},
	{
		"User": "lytzfmarchan",
		"Location": "bacoor",
		"DateofReview": "May 29, 2015",
		"ReviewTitle": "needs government attention",
		"Review": "The collection of eagles is just enough. We appreciated the picture taking side when the caretaker helped us take good shots; otherwise, it was just so so. The place needs clean up and maintenance maybe needs more funds to be more attractive."
	},
	{
		"User": "Lavern2014",
		"Location": "Quezon City, Philippines",
		"DateofReview": "May 27, 2015",
		"ReviewTitle": "Good to see Philippine Eagles",
		"Review": "It's a good experience because we got to see Philippine eagles. They look sad, though, except for the one that was feeding on a rabbit when we visited. I think they should get a budget from the government for the upkeep of the place."
	},
	{
		"User": "virmen",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "May 23, 2015",
		"ReviewTitle": "Nothing Special",
		"Review": "base on my experience this place is not worthy to visit aside from the entrance fee are very expensive the attractions inside are not fully maintained. hmmmm so wheres the entrance fees going? hmmmmmm i hope they should maintain the cleanliness and proper caring of the live animals inside!"
	},
	{
		"User": "Alfie A",
		"Location": "Davao",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "The monkeys are funnier than the eagles",
		"Review": "The eagles are quite boring but they are really big. They should make some show how the eagles do some stuff in the wild, like its nickname could the \"monkey eating eagle\". For me, the real fun here are the monkeys, as they have lots of monkey in that area. They have a community of monkey, you could see the Alpha monkey, mama monkey, baby monkey the crazy and the stupid monkey."
	},
	{
		"User": "CrimsonRedVP",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Baguio",
		"Location": "Baguio",
		"DateofReview": "May 16, 2015",
		"ReviewTitle": "Nature Trip",
		"Review": "Trip to Davao is never complete without a visit to the Philippine Eagle Centre. A must-see attraction. Friendly staff and very helpful."
	},
	{
		"User": "RdV88",
		"Location": " ",
		"DateofReview": "May 4, 2015",
		"ReviewTitle": "Wonder-full, must do when in Davao",
		"Review": "Staff are VERY knowledgable, this is a great center to come and learn about the majestic philippine eagle, help in the preservation of the eagle and other endemic species, and take a lovely walk amongst the beautiful trees and tropical foliage"
	},
	{
		"User": "MorionRunner",
		"Location": "Muscat, Oman",
		"DateofReview": "May 3, 2015",
		"ReviewTitle": "Refreshing",
		"Review": "one with nature. The place was cool and refreshing. Thumbs up to the guys who preserve the endangered eagles.. Owls are all over the place, my daughter is overwhelmed with the sights... One guy was there to assist anyone who wants to have a feel...More"
	},
	{
		"User": "sweethomes",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "April 29, 2015",
		"ReviewTitle": "great time experiencing with the birds",
		"Review": "You need to pay two entrance tickets...one for the park and the other for the eagle center..entrance fo the center is 250php for adults and half for the kids.. It took us more than an hour to tour the whole area..would like to thank Mr....More"
	},
	{
		"User": "jamjar136",
		"Location": "Melbourne",
		"DateofReview": "April 29, 2015",
		"ReviewTitle": "Very enjoyable",
		"Review": "It was a nice place. They have a wide variety of eagles there. we were lucky enough to have a keeper bring out a few eagles for us to have pictures with. he gave us gloves and we had an eagle sit on our hand....More"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 26, 2015",
		"ReviewTitle": "Support the eagle",
		"Review": "what i liked is the location in the middle of the woods. what i did not like is that the cages for the eagles are not super big. I hope this place gets more funding so the eagles can have a bigger cage."
	},
	{
		"User": "BluePoles",
		"Location": "Margaret River, Australia",
		"DateofReview": "April 24, 2015",
		"ReviewTitle": "Chance to see some Raptors",
		"Review": "While visiting Malagos Chocolate we went up the road to visit the Philippine Eagle Centre. It was a pleasant little walk around the park with a civet and crocodile thrown in with the eagles and kites. Only 100PhP and a chance to see some pretty...More"
	},
	{
		"User": "Duncan O",
		"Location": " ",
		"DateofReview": "April 19, 2015",
		"ReviewTitle": "A Must See.",
		"Review": "Very Philipino, but still a must see. Incredible birds. We also loved the large Python outside. Everyone should donate to the \"Save the Eagle\" cause."
	},
	{
		"User": "MrDestiny",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Sydney, Australia",
		"Location": "Sydney, Australia",
		"DateofReview": "April 14, 2015",
		"ReviewTitle": "Good to see the effort put in here",
		"Review": "The staff are very passionate and knowledgeable about their eagles, I would encourage everyone concerned with wildlife preservation to visit and support them."
	},
	{
		"User": "Gerri A",
		"Location": "Marikina",
		"DateofReview": "April 4, 2015",
		"ReviewTitle": "You come for the Eagles and there are a lot of them to see!",
		"Review": "Request for a tour. The caretakers are more than welcome to help and provide entertainment and additional knowledge/ information. You'll have better appreciation of the Phil Eagles this way. They are, after all, endangered. Beautiful creatures especially when they spread their wings!"
	},
	{
		"User": "arbsnoble",
		"Location": "Makati, Philippines",
		"DateofReview": "March 30, 2015",
		"ReviewTitle": "conservation",
		"Review": "it a place where philippine eagles are being bred, kept and rehabilition of illegally caught eagles. the very famous pag-asa still lives there and produces offsprings. this facility also helps educate people on conservation of this beautiful bird. this place will be the eagles last...More"
	},
	{
		"User": "KIKO597",
		"Location": "Manila, Philippines",
		"DateofReview": "March 29, 2015",
		"ReviewTitle": "Good Enough for a Nature Sanctuary",
		"Review": "Our first impression upon entering the pedestrian gate was neglect of the premises, but we found out later that the area is part of the Davao City Water District or Reservoir that collects 5 pesos per person just to pass going to this attraction. Since...More"
	},
	{
		"User": "jetters888",
		"Location": "Portland, Oregon",
		"DateofReview": "March 26, 2015",
		"ReviewTitle": "Awesome sanctuary",
		"Review": "Definitely worth drive to visit and see Philippines' national bird. The peaceful and eco-friendly sanctuary also includes other species of birds. Entrance costs about $1 USD."
	},
	{
		"User": "Rhia_MD",
		"Location": "Angeles City, Philippines",
		"DateofReview": "March 23, 2015",
		"ReviewTitle": "Informative but not maintained.",
		"Review": "This place is a good side trip if you are coming from eden nature park. Its a bit run down and not maintained. I think this place will become informative and interesting if you have a good tour guide."
	},
	{
		"User": "Roseann G",
		"Location": "Calamba, Laguna, Philippines",
		"DateofReview": "March 19, 2015",
		"ReviewTitle": "Wish it would be well maintained",
		"Review": "Its amazing how they were able to take care of these wonderful creatures. But the place is not well maintained, there should be staff that looks around or tourist guide at the entrance who will tour yoi around the place. The cages of animals has...More"
	},
	{
		"User": "RoeBut",
		"Location": "Antwerp, Belgium",
		"DateofReview": "March 14, 2015",
		"ReviewTitle": "family visit",
		"Review": "we went here with the whole family, it was an nice and interesting visit. the cages can bi bigger for some birds, but i think that will be the first thing they do when the have some more money"
	},
	{
		"User": "superVeee09",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Lucena City",
		"Location": "Lucena City",
		"DateofReview": "March 10, 2015",
		"ReviewTitle": "amazing eagle",
		"Review": "We had a very informative tour at the Philippine Eagle Centre. I like our tour guide. He also know what angle is best for pictures with the birds. My 2 year old son enjoyed watching the monkeys."
	},
	{
		"User": "TayNayNak",
		"Location": "Luzon, Philippines",
		"DateofReview": "March 1, 2015",
		"ReviewTitle": "A must see in Davao!",
		"Review": "A great venue to learn about our endangered Philippine eagle, a must visit for first time Davao City visitors."
	},
	{
		"User": "yasameen_desu",
		"Location": "Manila, Philippines",
		"DateofReview": "February 20, 2015",
		"ReviewTitle": "Highly essential for anyone who has not seen a Philippine Eagle in his life!",
		"Review": "I have not seen a Philippine eagle in my life and it's really different from the picture. I am not aware that it is such a huge bird, I know that it's supposed to be huge, maybe I was just completely overawed. They're majestic, they...More"
	},
	{
		"User": "RomanesinAsia",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 19, 2015",
		"ReviewTitle": "Big applause to the people of the Philippine Eagle Center..!",
		"Review": "Great job in keeping this Center going and in such a good shape. Congratulations to all. If in Davao, this is one place to visit; it is just a few minutes away from Davao. Plan to spend a couple of hours. Make sure you look...More"
	},
	{
		"User": "parttimefilo",
		"Location": "Coventry, United Kingdom",
		"DateofReview": "February 19, 2015",
		"ReviewTitle": "interesting",
		"Review": "very interesting birds and development of aviaries and people interaction worth the trip out of town to see"
	},
	{
		"User": "kewz",
		"Location": "Kew Gardens, New York",
		"DateofReview": "February 18, 2015",
		"ReviewTitle": "Learning experience",
		"Review": "The Eagles here were injured unable to compete in the wild. As you walk the trail viewing the birds you get educated on what can be done to help preserve the eagle population. You also see some deer, crocs and owls. When you finish your...More"
	},
	{
		"User": "Honeynjf",
		"Location": "Perth, Australia",
		"DateofReview": "February 17, 2015",
		"ReviewTitle": "Worth a visit",
		"Review": "The eagle park is defiantly worth a visit if you are in the area. The eagles are fascinating. I recommend going with a local friend if you have one as they can make the experience more enjoyable."
	},
	{
		"User": "adangoyjr",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "February 12, 2015",
		"ReviewTitle": "Good for nature lovers",
		"Review": "Very good for nature lovers and even those who are not... just to have a view of the rare Philippine Eagle. If you are coming from Eden Nature Park, the Philippine Eagle Center is a very good side trip."
	},
	{
		"User": "Bong Y",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Venice, Florida, United States",
		"Location": "Venice, Florida, United States",
		"DateofReview": "February 1, 2015",
		"ReviewTitle": "They raise eagles here",
		"Review": "The eagles and seahawks were interesting. However, some areas were closed off according to our guide. They are trying artificial insemination to increase the species with the monkey eating eagles but the results are still not in. Interesting, but a little rundown ...."
	},
	{
		"User": "earthdude",
		"Location": "North Carolina",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "I like the wildlife; the facilities, not so much",
		"Review": "This was the first time I met a Philippine eagle up close, but I am not so sure I like that the majestic bird was chained to its perch. There has to be a better way to present it. It's a good place to bring the kids so they can learn about what is being done to save the species. It has other species on display, but the enclosures seem cramped and the whole place is in need of some TLC."
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "Worth your effort",
		"Review": "I haven't seen a Huge Philippine Eagle in my entire life until 2012. \r \r It's really a nice experience and I salute the people who are taking care of this endangered specie because I was still able to see our National Bird. \r \r The trainer can ask the eagle to expand her crown (Idon't know the term for that) and pose for a group picture. :) "
	},
	{
		"User": "yambaheaven",
		"Location": "Northern NSW",
		"DateofReview": "January 8, 2015",
		"ReviewTitle": "Mixed reactions",
		"Review": "Like most things in the Philippines, this was once a well built park with good facilities. But as usual nothing has been maintained. The Philippine Eagle is a majestic creature and deserves the efforts of the staff at the facility. Our guide was very helpful and informative. I don't know that the eagles chained to the ground is the best way to display them to the public."
	},
	{
		"User": "KlausDORING",
		"Location": "Davao City",
		"DateofReview": "December 24, 2014",
		"ReviewTitle": "Another step to Mother Nature",
		"Review": "Learning abut our environment and the important future of our beloved Mother Nature means to say: Visit the Philippine Eagle Center in Malagos, Calinan, Davao City, Mindanao. Learn about the Philippine eagles, love them - and support them and this awesome and unique institution."
	},
	{
		"User": "glow143",
		"Location": " Davao City, Philippines",
		"DateofReview": "December 21, 2014",
		"ReviewTitle": "Love the Phil. eagle",
		"Review": "Learn to love our environment because it is our social obligation. We are not consistent with it. We always have the culture of Ningas Cogon. Be responsible as a traveler."
	},
	{
		"User": "allen g",
		"Location": " ",
		"DateofReview": "December 18, 2014",
		"ReviewTitle": "Rare with nature",
		"Review": "This place is in the middle of the forest a perfect place for our very own philippine eagle... There are only few of them left in the world... So dont miss the chance of seeing one in your lifetime... Never visit davao without going to see the philippine eagle centre"
	},
	{
		"User": "Jackie C",
		"Location": " ",
		"DateofReview": "December 16, 2014",
		"ReviewTitle": "Eagles up close",
		"Review": "Davao is known for being the habitat of the rare Philippine Eagle and if you can't see them in the wild, you can always go here, the park is well maintained and is usually being visited by young children :)"
	},
	{
		"User": "funhuntr",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila",
		"Location": "Manila",
		"DateofReview": "December 9, 2014",
		"ReviewTitle": "Worth the visit for 1st timers",
		"Review": "See actual eagles! If you haven't seen one before, this is the place to go to, if you're Filipino and haven't seen our national bird, well this is a must. Tip : get a guide, it's not too expensive (at least donate a good amount, say Php300 to 500 or more especially for big groups ... they're volunteers and worth every cent). The entrance fee (Php100) is a small price to pay to keep the grounds semi decent and to keep those birds fed. A place to visit at least once in Davao."
	},
	{
		"User": "TheUglyDog",
		"Location": "Orlando, Florida",
		"DateofReview": "November 25, 2014",
		"ReviewTitle": "Those are some BIG Birds!!",
		"Review": "This is a nice eco-park that is helping to preserve the Philippine Eagles. You can get quite close and really appreciate the size and magesty of these spectacular animals."
	},
	{
		"User": "Jeff Z",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 12, 2014",
		"ReviewTitle": "My childhood memories revisited",
		"Review": "Ahh... I still remember back then when I first visited here, it was on a school trip during elementary. The first thing that I wanted to see here was the Philippine Eagle itself. I only manage to caught a glimpse of it since we had...More"
	},
	{
		"User": "Nomad_Charles",
		"Location": "Variable",
		"DateofReview": "November 12, 2014",
		"ReviewTitle": "The birds are fantastic",
		"Review": "This is a bit run down but in a nice tropical jungle sort of way. The birds are fantastic and well worth the visit. The whole setting is shady and very beautiful and relaxing. To get there by public transport: - take a jeepneye from...More"
	},
	{
		"User": "lloydangpogi3",
		"Location": "Manila, Philippines",
		"DateofReview": "November 3, 2014",
		"ReviewTitle": "american bald eagle is over rated....needs funding for the strongest bird in the world...critically endangered. HELP ...",
		"Review": "i find it amazing to see the national bird of our country. its so huge. . . .very territorial . . . but they need funding to make it a great park. . . . it is critically endangered . . . funding is low...More"
	},
	{
		"User": "Fourth S",
		"Location": " ",
		"DateofReview": "October 28, 2014",
		"ReviewTitle": "A must see! :)",
		"Review": "I took my kid for a tour to get him acquainted with these magnificent creatures. He likes it so much we made 3 trips to the cages that single visit! Reading the provided information about the eagles is amazing, i never knew then that eagle...More"
	},
	{
		"User": "FilipinoAdventurer",
		"Location": " ",
		"DateofReview": "October 13, 2014",
		"ReviewTitle": "Endangered Philippine Eagle",
		"Review": "Whenever I visit Davao which is one of my favorite cities here in the Philippines, one of my sure stops is the Philippine Eagle Center. I been to a lot of countries, I saw species of eagles prevalent to their area like when I went...More"
	},
	{
		"User": "iamsherri",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "September 24, 2014",
		"ReviewTitle": "A great experience",
		"Review": "I was with my father when i first visited the place and it was really a great experience to see the Philippine Eagle. The place was nice but not really that perfect coz its obviously not well-maintained. I love the huge trees and different plants...More"
	},
	{
		"User": "TravelBug1469",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "September 22, 2014",
		"ReviewTitle": "Fly High Philippine Eagle",
		"Review": "Good there is a foundation taking care of the endangered Philippine eagle. The Philippine Eagle Center needs more visitors and / or donors to come to Malagos. Every contribution you make, however small, will come a long way for preservation and propagation of the King...More"
	},
	{
		"User": "Kuki F",
		"Location": " ",
		"DateofReview": "September 17, 2014",
		"ReviewTitle": "amazing",
		"Review": "Its amazing to see the king of birds. When they fly they are really huge. The place is not that clean."
	},
	{
		"User": "Darundoy18",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "September 13, 2014",
		"ReviewTitle": "Pray to the Birds of Prey",
		"Review": "I liked the huge space of the park and the chance to be with nature. The care takers are nice people and let you have a photo op with some of the birds there. Too bad there aren't any tour guides to give us some...More"
	},
	{
		"User": "raymmiconmapper",
		"Location": "Bacolod, Philippines",
		"DateofReview": "September 13, 2014",
		"ReviewTitle": "a must see in Davao",
		"Review": "very educational & close encounter with the Philippine eagle & other birds Pag-asa.Mindanao, Rose etc. etc.the caretaker Mr.Poroy showcases the bird's talent & antics"
	},
	{
		"User": "igmegalingan",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 13, 2014",
		"ReviewTitle": "Hope the Eagles are still benefiting from this place",
		"Review": "There is something seriously wrong with big birds in cages especially considering the power of their size and the nature of birds to fly in big directions. I hope this place is doing what it is meant to do which is to help these big...More"
	},
	{
		"User": "davao_dude",
		"Location": "Davao City",
		"DateofReview": "September 7, 2014",
		"ReviewTitle": "Educational",
		"Review": "The center houses birds in captivity. Some of the eagles were rescued then rehabilitated before they were released in the wild. It is also successful in breeding the eagles while in captivity."
	},
	{
		"User": "Aileen T",
		"Location": "Caloocan, Philippines",
		"DateofReview": "September 6, 2014",
		"ReviewTitle": "Selfie Mindanao",
		"Review": "I thought the place will be boring, we are wrong. It's a big WOW. The eagles have different tricks and we all amazed. And the best part we have a selfie picture with the eagle named Mindanao. We are shock that the caretaker told us...More"
	},
	{
		"User": "terry_pagunsan",
		"Location": " ",
		"DateofReview": "September 3, 2014",
		"ReviewTitle": "Philippine Eagle Center in Davao City",
		"Review": "We had a lengthy drive in going to the place from the City proper. The place is damp as it rained the day before. Have seen small, medium and large size eagles. We saw monkey also."
	},
	{
		"User": "Ma S",
		"Location": " ",
		"DateofReview": "September 3, 2014",
		"ReviewTitle": "Eagle Centre",
		"Review": "We took the kids here. We were amazed with the birds there. Saw my first Sea Eagle! I never thought it was that big. It was clean and well maintained for a rainforest type place. Bought some really cool native handicrafts. There were a group...More"
	},
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "August 29, 2014",
		"ReviewTitle": "Name says it all",
		"Review": "The Philippine Eagle is one of the most magnificent birds I have ever seen. I hope that the centre continues the good work that they do in ensuring that these creatures are protected and hopefully increase their number. The place is one of the \"must visit\" when you're in Davao. "
	},
	{
		"User": "cpepino",
		"Location": "Mandaue, Philippines",
		"DateofReview": "August 26, 2014",
		"ReviewTitle": "Philippine Eagle Center",
		"Review": "The Philippine Eagle Center is actually beautiful. Lots of trees... cool shade, but its area was just small. There are few birds being taken cared of. And there are very few varieties of birds to see. But I am not an expert, so maybe I am not quite right in my opinions. \r \r The conservation efforts are commendable but I think the center needs more funding to really achieve their mission. I hope the center will continue to strive to keep the place, maybe expand it a little bit more... keep it as it is - clean. Although I am not happy to see these magnificent birds in cages or leashes, but they are worth visiting so that an awareness can be created for the kids and the next generation. The awareness to preserve and protect our habitat and all those living in it."
	},
	{
		"User": "Lynard M",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "August 24, 2014",
		"ReviewTitle": "superb experience",
		"Review": "it was my first time to see eagles, although i have seen one somewhere else but not close enough. if you want to consider visiting the place, bring along with you mosquito repellents."
	},
	{
		"User": "AkoBato",
		"Location": "Singapore, Singapore",
		"DateofReview": "August 20, 2014",
		"ReviewTitle": "mindanao is the star of the centre",
		"Review": "i've always wanted to see the philippine eagle but my expectations werent that high...but going to the place and actually seeing one, and especially having an eagle like mindanao is just really amazing.\r \r this bird can do selfie with you and has tricks up his sleeves.\r \r there is an entrance at the gate for 5PHP, which we dont know what for as there is another entrance when you actually go up the centre (100PHP). but either way its just a small amount to make sure these birds are protected.\r \r the foot path of the centre is also interesting as it has stones with names on it (probably those who donated) and its fun reading it and seeing how many people from all over the world have been to the centre.\r \r its a must place to go when you are in davao.\r \r taxi ride would cost 1000PHP round trip, but you can ask the taxt driver to give it to you at 2500 to include trips to other landmarks"
	},
	{
		"User": "SandySanti",
		"Location": "Manila, Philippines",
		"DateofReview": "August 6, 2014",
		"ReviewTitle": "great eagle sanctuary",
		"Review": "amazing place to visit. about 40 minutes from town. its nice to see the conservation efforts for the philippine eagle"
	},
	{
		"User": "Liezel G",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "August 3, 2014",
		"ReviewTitle": "Nice for fieldtrip",
		"Review": "This is far away from downtown. But for fieldtrip this is worth a visit. It's nice to know that the place and animals is still preserved. It's very relaxing and my son enjoyed the animals. :)"
	},
	{
		"User": "Iza_Obejera",
		"Location": "Manila, Philippines",
		"DateofReview": "July 29, 2014",
		"ReviewTitle": "Protector",
		"Review": "I liked that the place is doing their job protecting the Philippine Eagles who are endangered. As well as the other birds."
	},
	{
		"User": "geofhaar",
		"Location": " ",
		"DateofReview": "July 28, 2014",
		"ReviewTitle": "Rather small",
		"Review": "It's a nice place to spend a halfday, but quite far from Davao centre and rather small. Aside the philippine eagle they have also other eagles, owls, monkeys and 1 crocodile which in my opinion should be transfrered to a bigger place."
	},
	{
		"User": "JuanangGala",
		"Location": " ",
		"DateofReview": "June 23, 2014",
		"ReviewTitle": "Nice stroll",
		"Review": "This centre is about 1-1.5 hrs from Davao City. If you have the time, it nice to go. \r \r Get a guide. The facts and trivia they give out make the stroll more interesting. The guides are students and volunteers, keep this in mind when you tip."
	},
	{
		"User": "Steve S",
		"Location": "Toronto, Canada",
		"DateofReview": "June 22, 2014",
		"ReviewTitle": "Eagle",
		"Review": "We were with 4 kids and 3 adults and all got a photo taken with an Eagle from the caretaker.Quiet and know one around on a Saturday too."
	},
	{
		"User": "JEmmanuelLasPinas",
		"Location": "Las Pinas",
		"DateofReview": "June 21, 2014",
		"ReviewTitle": "A unique place to visit",
		"Review": "Schedule enough time to get there and once you get there, do not rush. spend time learning about the Philippine eagle and its habitat and visit the raptors that are housed at the centre."
	},
	{
		"User": "itoy_MNL",
		"Location": "Manila, Philippines",
		"DateofReview": "June 20, 2014",
		"ReviewTitle": "Its nice to see the Philippine Eagle... that's it...",
		"Review": "We went to Davao for a vacation and planned to include the PEC on our last day itinerary.\r \r It is easily accessible from downtown Davao. Just go to the Annil Bus Terminal located at the corner of San Pedro and Quirino Streets. The fare for air-conditioned bus from Davao City to Calinan is 45 pesos. Upon arriving at the Calinan Bus Terminal, there are tricycles waiting which goes directly to the Philippine Eagle Center (10 pesos fare per person if sharing the ride with other passengers). The total travel time is about an hour, shorter time if you travel by car.\r \r We checked the website of PEC prior to our visit, where it is indicated that there are tour guides who will assist you for free. Upon paying for our entrance tickets, we saw a group of tour guides sitting at a table merrily chatting and ignoring us even if its obvious that we were there as local tourists. Then a group of foreigners arrived, and they eagerly approached and volunteered to tour the foreign guests around. ITS A COMPLETE SHAME THAT THESE TOUR GUIDES ARE DISCRIMINATING FELLOW FILIPINOS. -calling the attention of PEC Management.\r \r We had no choice but to wander around on our own. The place is filled with lush vegetation, more like a jungle-type of atmosphere where you will see huge trees and wild flowers blooming. We had a glimpse of different bird and animal species aside from the Philippine Eagle. Its too bad that the famous eagle named \"Pag-asa\" is in a huge cage located on the upper part of the center and is currently not accessible due to some maintenance on-going. \r \r Be careful while walking around because there are small insects which flies directly to your eyes, I got about four of them and my companion had three stuck in our eyes. Carefully pick them out as you might end up having pieces of these insects in your eyes if you just scratch your eyes with the insect in it. Better to wear your eyeglasses or shades or perhaps swimming goggles for kids ;-) it looks dumb but its better than having your visit ruined by insects stucked in your eyes.\r \r There's a free toilet located near the ticket counter, along with the PEC souvenir shop and snack center. \r \r Overall, the Philippine Eagle Center is worth a visit to see the Philippine's famous eagle. \r \r IMPORTANT REMINDER:\r There's a man selling \"driftwood\" carving of the holy family outside the Center. It looks good and he explained to us that its worth the 1,200 pesos price tag because its an authentic wood carving from the nearby penal colony. We haggled for 600 pesos but ended up paying 700 pesos. Upon returning to Manila, we found out that the outer frame is genuine driftwood, but the sculpture itself is just molded from plaster of paris. Another shameful act of dishonesty from fellow Filipinos. :-(\r \r The gift shops lined up outside the PEC sells more expensive goods. Better save your money and proceed to Aldevinco Shopping Center in downtown Davao. I bought batik shawls there for 180 pesos and you can get better design and quality from Aldevinco for as low as 150 pesos."
	},
	{
		"User": "Anna L",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "June 17, 2014",
		"ReviewTitle": "the tour was great but the system is poor",
		"Review": "it was a great tour but i cant forget the argument with other visitors. i understand they where arguing about the whose to go first or whose in the line or not.. sad but sometimes its a fact."
	},
	{
		"User": "Joel D",
		"Location": "Manila, Philippines",
		"DateofReview": "June 15, 2014",
		"ReviewTitle": "The Eagle conservation Center in the Philippines",
		"Review": "I rate the place very good and really made sure i visit because I am a supporter of any conservation effort specially the Philippine Eagle. The place is dated and definitely needs good maintenance and upkeep. It was may first time to see various eagles up close. The place has good vegetation but a little improvement in terms of cleanliness, maintenance and discipline will make the place more attractive."
	},
	{
		"User": "AprilCamias",
		"Location": "San Pedro, Philippines",
		"DateofReview": "June 11, 2014",
		"ReviewTitle": "Time to be Amazed by the Nature",
		"Review": "Nature will love you and you will love the nature. I was amazed by the nature's wonders. It seems that you are in the middle of a vast, quiet forest with lots of endangered species. It was like a Bug's Life or Narnia. It was a definite place to go to when you are in Davao :)"
	},
	{
		"User": "promdicitygirl",
		"Location": " ",
		"DateofReview": "June 3, 2014",
		"ReviewTitle": "must-see",
		"Review": "There are a lot of different birds and animals in the Eagle Center. Of course, you will see the Philippine Eagle but you will also enjoy seeing the different birds native to Mindanao."
	},
	{
		"User": "Screaming_Pen",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 27, 2014",
		"ReviewTitle": "A good spot to enjoy nature",
		"Review": "The Philippine Eagle Centre is one of the best tourist spots in Davao City even before when I was young. It houses the great Monkey-eating eagle which is arguably one of the largest eagles in the world. \r \r However, there are some noticeable changes that needs immediate attention for further improvement of the area.\r 1. the cleanliness - the area must be kept clean at all times. Since most of the tourists there are nature-tripping, they really cannot appreciate litter. Garbage bins were full and there were some areas were very untidy. \r 2. price increase - the adult / child entrance fees of 100 / 50 would in my opinion, discourage local tourists to visit because it is somewhat costly. However, if the fee would benefit the animals in the centre then I may agree to the agree to the price increase (effective June 4, 2014)\r 3. predicament of the animals - As I have observed some cages of the animals lacked maintenance like cleaning, and pruning the weeds that engulfed the big cages. Maybe they should at least clean it once in a while.\r \r If these three would be addressed, I think the centre will still be a great tourist icon in Davao City for many years to come. PLEASE DO ADDRESS THE ISSUES I HAVE RAISE. Not for me, but for the benefit of the next generation. \r \r Tip: Look for handlers around the center that would provide opportunities for you to have a closer picture or even hold the eagles."
	},
	{
		"User": "RuthBB76",
		"Location": "Manila, Philippines",
		"DateofReview": "May 18, 2014",
		"ReviewTitle": "Must visit",
		"Review": "Must visit when in Davao. Nice and pleasant nature trip among century old trees and thick foliage. The eagles are awesome. The guides are very good in explaining the why and wherefores of Pag-asa and the other eagles."
	},
	{
		"User": "GraceSanJuan",
		"Location": "San Juan",
		"DateofReview": "May 15, 2014",
		"ReviewTitle": "Haribon really must see",
		"Review": "We spent almost P1,000 for taxi going to Malagos Park and going back to D'Leonor Adventure Park. Took almost 45 minutes by taxi. I wish Davao city Tourism do something about a shuttle to transport tourists to this destination, so we wont be at the mercy of Cabs."
	},
	{
		"User": "Blessie Y",
		"Location": " ",
		"DateofReview": "May 3, 2014",
		"ReviewTitle": "Small but not boring",
		"Review": "We went there just last month and we're glad to know that the sanctuary is improving. A volunteer for the Philippine Eagle welcomed us and made us comfortable to the place, he explains everything about the eagles-their behaviors and their way of living (it was a bit entertaining),truly educational. The place is a bit small because they're just occupying a small portion of an acre. Attractions include: eagles, monkeys, an alligator, fish pond, a small museum. Entrance fee is 50php, and an additional 5php for the watershed. \r \r Oh, don't forget to give a tip for the volunteers, they're extremely kind and accomodating. On your way out, you will find locals with large pythons for picture taking. You just have to pay 20php per person, unlimited pictures. The pythons are a bit scary because they're big but they're totally calm and friendly, I guess. \r \r Enjoy the davao heritage. Visit Philippine eagle. "
	},
	{
		"User": "bel3ms",
		"Location": "Manila, Philippines",
		"DateofReview": "April 20, 2014",
		"ReviewTitle": "the eagles are worth it",
		"Review": "the eagles are worth it! go here first and then ask the taxi driver to bring you to malagos garden resort. buy malagos dark chocolate bar and bring home with you. its the best!"
	},
	{
		"User": "Glentoy",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 17, 2014",
		"ReviewTitle": "A must-see attraction in Davao City",
		"Review": "It is quite far from the city but if you want to see the Philippine Eagle, you should visit this center. It is our national bird after all. Entrance fee is only P50 for adults and P30 for children below 18 years old."
	},
	{
		"User": "lifegifts",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 16, 2014",
		"ReviewTitle": "your visit helps conserve the eagles",
		"Review": "Its a place to see the endangered Philippine Eagles. Its both a conservation park and breeding place. Visit to help conserve the eagles and enjoy the silent moments with the birds and trees. I suggest that tourists talk with the employees to learn more of the great work they are into."
	},
	{
		"User": "Carlos D",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 16, 2014",
		"ReviewTitle": "World Class",
		"Review": "The science behind this captive breeding facility is definitely at par with similar Centres around the world. The Education Centre & live displays do justice to this Eagle which is the tallest in the world. The collection of other tropical raptors & other species is very interesting."
	},
	{
		"User": "Kaye214",
		"Location": "Davao",
		"DateofReview": "March 27, 2014",
		"ReviewTitle": "A bit far but one of a kind trip",
		"Review": "It's about an hour's ride from the city but when you get there you'll have fun especially if you're with kids. Near the entrance there's a guy who has a pet snake and he will let you hold it and pose for a photo for any amount you want to give. The entrance to the park is cheap and the place is pretty big with some decade-olds trees. It's not in tip top shape but there are quite a number of eagles (the reason you're going here after all), most in cages and about a couple out in the open (eagles who can't fly anymore). If you have time or enjoy nature/animals, it's worth a visit."
	},
	{
		"User": "donzero",
		"Location": "manila",
		"DateofReview": "March 24, 2014",
		"ReviewTitle": "a great learning experience",
		"Review": "a great learning experience and a knowledgeable and friendly guide is what this place boasts of. indeed worth the trip!"
	},
	{
		"User": "Dibyne",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 20, 2014",
		"ReviewTitle": "Nature tripping thats effortless",
		"Review": "Its the kind of nature tripping without exerting much effort. also, you get to see the monkey-eating eagle which Davao is famous about."
	},
	{
		"User": "Scottie B",
		"Location": "Valencia City, Philippines",
		"DateofReview": "March 9, 2014",
		"ReviewTitle": "Just an average attraction",
		"Review": "It is just an average attraction, they have have more living monkeys than their living philippine eagle."
	},
	{
		"User": "Minette T",
		"Location": " ",
		"DateofReview": "March 8, 2014",
		"ReviewTitle": "Close-to-nature experience!",
		"Review": "My aviary experience in the Malagos Phil. Eagle Sanctuary was definitely a one-hella experience.Kids were in awe of the different species of birds & eagles upclose and personal. It's like u are wandering inside a forest, a protected wildlife, with so much of God's wonderful creations to see! Filmviewing for interested guests is also welcome for addt'l knowledge. Stuffed dead eagles are well preserved inside the glass cabinets. So much to see w/ so li'l time, will absolutely go back to appreciate more of natures' wonders."
	},
	{
		"User": "agramsagitro",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "March 4, 2014",
		"ReviewTitle": "Educational Visit",
		"Review": "We had a very good guide around the center so we learned a lot about the Philippines Eagle, such an amazing bird!!!! Doesn't take long to visit the center making an easy stop in one's itinerary."
	},
	{
		"User": "Jeremy N",
		"Location": "Dover, Delaware",
		"DateofReview": "February 26, 2014",
		"ReviewTitle": "Great day tour stop",
		"Review": "Great place to visit in Davao especially if you are a bird and nature lover. Very well maintained and the animals and birds are well taken care of. The staff is very knowledgeable and friendly."
	},
	{
		"User": "Asiatique07",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "February 23, 2014",
		"ReviewTitle": "Informative but needs improvement",
		"Review": "As someone who advocates life, I am thankful for this institution's endeavor to protect the Philippine eagle. However, as someone who's been to other aviaries, I would say that this place needs a lot of improvement. Well, considering the cheap entrance fee, I can see why the state of the park is like so, but if it's to protect this endangered species and to promote awareness about it, I would be willing to pay more just to uplift this aviary.\r \r In terms of the flora, it is very abundant, and it also includes some other fauna that is endemic in the country. I also like how there are informative boards and trivia about different sub- species of eagles. I like how they are focused more on what's endemic in the country as well.\r \r There are things that need improvement. For one, the museum's displays are obviously not taken care of properly. The stuffed animals have collected dust and some have been stored away probably because the environment in the museum is not controlled. Another thing is that the birds are chained. I know that this is to prevent the people from getting hurt, but another thing that can be done I think is to put a glass walkway or a cage walkway for people so that they can observe the birds fly freely. Some parts of the aviary specifically the wires are also not maintained. From the people I was with who've been there before, they also noted a considerably fewer number of birds. I think there is lack of funding in terms of breeding these birds and probably the lack of zookeepers.\r \r To end, the place is worth a visit to get to know these endemic eagles more. It will help them raise funds to protect these animals as well as to repopulate them. However, don't expect an ideal aviary seeing as it needs further improvement. There are stalls for donations though, so hopefully many will be able to help."
	},
	{
		"User": "trainerstone",
		"Location": "Philippines via Chicago",
		"DateofReview": "February 17, 2014",
		"ReviewTitle": "They try hard",
		"Review": "A basic aviary and breeding reserve for the endangered Philipine eagle. It is close to an hour outside of the ,main city, but worth it to see these magestic birds in large cages. The goal is to repopulate as much as they can. Worth the trip. "
	},
	{
		"User": "iluvursmiles",
		"Location": "Quezon City, Philippines",
		"DateofReview": "February 11, 2014",
		"ReviewTitle": "Birds in their cages",
		"Review": "This is a nice place to visit when you are in Davao because they have our National Bird. The sad thing is, most of the birds are in their cages so you can't have a good picture with you and the bird together. We came here before we went to Malagos Garden Resort so we had very limited time to stroll around and we were trying to catch the 1030am bird show at Malagos. \r \r I was trying to look for their contact number to inquire but I just couldn't find it and couldn't get through. I hope they can have a hotline so people can inquire. From what I saw you can take pictures with the eagle up close. So it would be helpful if they had time schedule of when they would bring out the eagles so you can take pictures with them. Sadly, they brought out 3 birds but their show / program was in conflict with the 1030am bird show in Malagos."
	},
	{
		"User": "ManilaGingersnap",
		"Location": "Manila",
		"DateofReview": "January 31, 2014",
		"ReviewTitle": "Must-go",
		"Review": "You will learn a lot here so make sure you go. There were buses of school kids when we got there and their field trip was thankfully over by then. So don't go too early as the area where you are toured is not very big. "
	},
	{
		"User": "Maricel P",
		"Location": "San Pedro, Philippines",
		"DateofReview": "January 25, 2014",
		"ReviewTitle": "an experience worth remembering",
		"Review": "My visit to the Philippine Eagle Center was worth remembering. i had visited zoos and had seen different kinds of eagle. but the experience i had at this place was just so unforgettable. i had the very rare chance of having a picture face to face with an eagle held for me by the caretaker!!"
	},
	{
		"User": "Leland_DLC",
		"Location": "Manila",
		"DateofReview": "January 3, 2014",
		"ReviewTitle": "A Good Cause",
		"Review": "This Center is one of the things Davao is known for. It's quite far from the city center. Probably a long hour's ride by car. You have to get off a short walk away from the Center itself and there are no clear directional signs where the Center is. (Just walk diagonally across the mini park and turn right at the fork). The Center itself is rather small and some of the (eagle) cages were empty when we visited.\r \r There's a sign at the entrance saying that one ticket supports 20% of the daily expenses of keeping an eagle alive so that's a good enough reason to go given that this is a critically endangered species. Thanks to the Foundation for the work it does. \r \r To make this trip worth it (especially for kids), best to go to Malagos Garden right after visiting the Eagle Center."
	},
	{
		"User": "Shamrockbuddy",
		"Location": "Bordentown, New Jersey",
		"DateofReview": "December 26, 2013",
		"ReviewTitle": "Charming and educational",
		"Review": "Bit of a ride up the mountain to get there but worth the effort. Nice park layout ... some walking uphill but no problem. Beautiful jungle setting. Magnificent birds abound."
	},
	{
		"User": "Charina A",
		"Location": "Cotabato City, Philippines",
		"DateofReview": "December 9, 2013",
		"ReviewTitle": "Educational and fun",
		"Review": "This is a must see place for tourist and even locals not only because this eagle is really a very fascinating but also we get to appreciate the efforts done by the foundation to save this eagle. Filipinos should visit this place so that we will know the value of this creature. it is very sad that this eagle are being shot and killed in the wild."
	},
	{
		"User": "dagol",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Cagayan de Oro, Philippines",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "November 30, 2013",
		"ReviewTitle": "The third trip to the Eagle Park",
		"Review": "Have aways enjoyed going here but this time I got the feeling that the upkeep of the place is not what it should be. Some areas were closed off as huge branches had fallen, and was in danger of falling down from the big trees in the area.\r It was raining heavily this time, and the paths were slippery so this may have affected the impression somewhat.\r As usual the Philippine Eagles were impressive and worth the visit. They are indeed magnificent and majestic.\r Will be back and hope the upkeep of the place will be kept at a high level."
	},
	{
		"User": "vicki h",
		"Location": "Traralgon, Australia",
		"DateofReview": "November 14, 2013",
		"ReviewTitle": "Beautiful Rainforest",
		"Review": "Beautiful Place, Just A Bit Short On Fresh Water For The Animals. Eagles Are Bred There As They Becoming extinct."
	},
	{
		"User": "JonjonEstipona",
		"Location": "Makati, Philippines",
		"DateofReview": "November 12, 2013",
		"ReviewTitle": "Biggest Flying Birds Alive!",
		"Review": "Fascinating, wild, and I really had an intense time here. I made a minor mistake by coming alone. Well, here's a tip, tours and shows have schedules, so better know when to go to fully enjoy the place. I went around the whole forest alone....More"
	},
	{
		"User": "chito m",
		"Location": "Al Khobar, Saudi Arabia",
		"DateofReview": "October 31, 2013",
		"ReviewTitle": "The best program for Nature conservation",
		"Review": "The people behind this center knew very well their stuff...they are committed and dedicated to the project..The place is nice ,the trees,land contours were preserved.Kudos to the Director and their staff for managing the place well,,,and making our tour a very educational and enjoyable one...More"
	},
	{
		"User": "Princess Salvia G",
		"Location": "Malaybalay City, Philippines",
		"DateofReview": "October 29, 2013",
		"ReviewTitle": "Awesome",
		"Review": "Those monkey-eating eagles are the biggest birds I've ever seen! Amazing! We couldn't see much of the owls though, because they're hiding during the day."
	},
	{
		"User": "Becha",
		"Location": "Sydney, Australia",
		"DateofReview": "October 17, 2013",
		"ReviewTitle": "Amazing eagle",
		"Review": "My husband find it so amazing to see the biggest eagle that he saw in his life. There are other animals to see as well. The place is also good to relax with a group of friends."
	},
	{
		"User": "Addicted2Asia",
		"Location": "USA",
		"DateofReview": "October 7, 2013",
		"ReviewTitle": "Well worth the trip!",
		"Review": "Spent a few hours here enjoying nature and the many displays. Our timing was good so we watched the eagles being feed. In addition to the eagles, several other species were on display: deer, Philippine Warty pigs other fowl. A good attraction for young and...More"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "October 6, 2013",
		"ReviewTitle": "Noble flyer!",
		"Review": "Makes you feel proud to see thia majestic eagle. Largest in the world. Also a great place to see animals endemic in the island. Getting there by public transpo is an adventure in itself."
	},
	{
		"User": "GlobalGoodTimes",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Las Vegas",
		"Location": "Las Vegas",
		"DateofReview": "September 15, 2013",
		"ReviewTitle": "Wonderful Local Eagle Park Sanctuary!",
		"Review": "What a fantastic sanctuary for the endangered Philippine Eagle. There were several varieties and each had unique characteristics. We hired a guide which was well worth it--he went into detail on each species and provided some great background and local knowledge about the survival of...More"
	},
	{
		"User": "Tiny M",
		"Location": "New York City, New York",
		"DateofReview": "September 3, 2013",
		"ReviewTitle": "Lets Save the Philippine Eagle!",
		"Review": "It was good to know that there is a serious effort to save the Philippine Eagle! And that some success have been achieved breeding them in captivity."
	},
	{
		"User": "marc_martin",
		"Location": "Manila, Philippines",
		"DateofReview": "August 31, 2013",
		"ReviewTitle": "Unique place in the middle of the rain forest",
		"Review": "You can find a myriad of bird species, but above all the Philippine Eagle which is an endemic bird. You also see rare kinds of pigs, chicken and other animals. Highly informative and educational."
	},
	{
		"User": "Angelito P",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "August 26, 2013",
		"ReviewTitle": "Educational. Awesome.",
		"Review": "Tucked away in Calinan, this complex allows one into the wonderful world of eagles. And other animals. A real python can be held around your neck at the market area."
	},
	{
		"User": "SunSandBeach80123",
		"Location": "Quezon City",
		"DateofReview": "August 16, 2013",
		"ReviewTitle": "Wow for the Philippine Eagle",
		"Review": "Best visit this place with good friends... and a good photographer. This sanctuary offers not only the majestic Philippine Eagles but also other flying creatures such as owls, but dont forget to put on your mosquito repellant coz mosquitoes are also part of these flying...More"
	},
	{
		"User": "Reimmak",
		"Location": "Marikina, Philippines",
		"DateofReview": "July 29, 2013",
		"ReviewTitle": "Amazing Eagles",
		"Review": "Its very interesting to see these kind of creatures. Although I'm not able to take a close up picture with the Eagle. You might also have a hard time going back to the city since most of the available rides are single motorbikes, so if...More"
	},
	{
		"User": "Dreamgirl_1253",
		"Location": "Quezon City, Philippines",
		"DateofReview": "July 23, 2013",
		"ReviewTitle": "Let us help save the Philippine Eagle",
		"Review": "One can learn a lot about eagles by touring the Philippine Eagle Center --- a competent guide (volunteer) will accompany your party and explain the eagles' characteristics, their mating habits and their loyalty to their lifetime mate."
	},
	{
		"User": "Rolixto",
		"Location": "Caloocan, Philippines",
		"DateofReview": "July 23, 2013",
		"ReviewTitle": "Philippine Eagles Territory",
		"Review": "The place is a little bit run-down and poorly maintained. What gives this place an average rating for me and my family is that we saw the majestic Philippine Eagles and even PAG-ASA for the first time and also the other animals that are in...More"
	},
	{
		"User": "kalboHastings",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Hastings",
		"Location": "Hastings",
		"DateofReview": "July 22, 2013",
		"ReviewTitle": "Something Special",
		"Review": "This is a wonderful experience & really is something special. The entrance to this facility has the usual sellers of souvenir items but that isn't really a problem - the large snake might be for some but it is harmless & is a thrill to...More"
	},
	{
		"User": "asialand",
		"Location": "Singapore, Singapore",
		"DateofReview": "June 17, 2013",
		"ReviewTitle": "Other animals inside the reserve",
		"Review": "Despite the name, there are also a number of other animals inside the reserve, like deer, monkeys, a fat and lazy wild boar, and a massive crocodile. The crocodile enclosure is a bit hidden, though."
	},
	{
		"User": "kmittag",
		"Location": "Subic, Philippines",
		"DateofReview": "June 13, 2013",
		"ReviewTitle": "Positive park",
		"Review": "First we were in Eden nature park and that was bad, so i get a positive surprise here. They entrance fee was 50 P and find that okay. This is not European standard but still some of the best I have see on Philippines"
	},
	{
		"User": "Resty2010",
		"Location": "Bangkok, Thailand",
		"DateofReview": "May 31, 2013",
		"ReviewTitle": "Visiting Davao is not complete if you have not seen the Philippine Eagle",
		"Review": "The caretaker was so helpful in explaining to us the habitat of Phil eagle. The first place we visited upon arriving in Davao is the Phil Eagle Center. The place is clean with well secured location. Vendors are very courteous. We really enjoyed our visit....More"
	},
	{
		"User": "mayapis",
		"Location": "Pasig, Philippines",
		"DateofReview": "May 10, 2013",
		"ReviewTitle": "See the Philippine up close. Its worth the trip.",
		"Review": "If only to see and appreciate the endangered but magnificent Philippine Eagle, I would rate this place a 5. We were fortunate enough to have a free tour guide named Obet (I think) and his explanation of the eagle’s life cycle (i.e. only 1 eaglet...More"
	},
	{
		"User": "Michael L",
		"Location": "Davao, Davao City, Philippines",
		"DateofReview": "April 22, 2013",
		"ReviewTitle": "A valiant effort; an attractive place",
		"Review": "the Eagle Center is a must-see for all first time visitors to this city. It represents a valiant, continuing attempt to restore the Philippine Eagle, hunted to the point of eradication, to its rightful habitat. The birds are magnificent, and beautifully exhibited in larger enclosures;...More"
	},
	{
		"User": "nasmej11",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "March 30, 2013",
		"ReviewTitle": "join the guided tour",
		"Review": "there is a free guided tour. it is a just a short walk. i learned to appreciate the philippine eagle. if you are generous enough, you can sponsor one of the philippine eagles and you will have the honor to name it."
	},
	{
		"User": "docferry",
		"Location": "Manila, Philippines",
		"DateofReview": "March 19, 2013",
		"ReviewTitle": "Awesome",
		"Review": "The place gives one hope. This is a breeding place for animals in near extinction. We donated for the study and preservation of our Philippine eagle."
	},
	{
		"User": "466Neo",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 17, 2013",
		"ReviewTitle": "Worth visiting but not anything special",
		"Review": "If you are a Philippino you will probably think a lot higher of the place than I do, but if you are a western foreigner you will probably get a bit disappointed. If you go there with out having big expectation, I think most will...More"
	},
	{
		"User": "arwen_31",
		"Location": "Vanderhoof, Canada",
		"DateofReview": "February 19, 2013",
		"ReviewTitle": "needs improvement",
		"Review": "the place needs rehabilitation. the cages are old. i pity the Philippine eagle. As if he is in a lonely place.this place used to be a tourist spot but now it looks like it was long forgotten"
	},
	{
		"User": "MrEdnWilbur",
		"Location": "Jacksonville, Florida",
		"DateofReview": "January 29, 2013",
		"ReviewTitle": "Go Where Eagles Dare",
		"Review": "And no this place is the same type of place the song describes but is a much better place in fact. The Philippine Eagle Center is a beautiful place located in the jungle covered mountains outside of Davao about an hour away from the city...More"
	},
	{
		"User": "Elrod13",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "January 28, 2013",
		"ReviewTitle": "Worth the visit",
		"Review": "After being exposed to other \"animal attractions\" in the Philippines, I was suprised and found this property to exceed my initial expectations. Several of the birds were tethered out in the open for better photos and one of the caretakers brought one of the Sea...More"
	},
	{
		"User": "Albert E",
		"Location": "Makati, Philippines",
		"DateofReview": "January 22, 2013",
		"ReviewTitle": "A Must Visit",
		"Review": "If it's your first time in Davao or if you've never been here, you should try it. You'll appreciate the majestic Philippine Eagle and the rich bio-diversity of the Philippines."
	},
	{
		"User": "ASBUCAN",
		"Location": "Tabuk, Philippines",
		"DateofReview": "January 21, 2013",
		"ReviewTitle": "No Cages for Good Eagles",
		"Review": "If you're shy to ask visitors to take your photos, you'll end up like this photo shot I took. You'll have more fun if you mimic the eagle's cry, coz the eagles respond. Luckily they're not as shy as meh. Infos are displayed about Eagles....More"
	},
	{
		"User": "toursaver",
		"Location": "Parrish, Florida",
		"DateofReview": "January 16, 2013",
		"ReviewTitle": "Philippine Eagle",
		"Review": "Our family went to this park last December 27, 2012. The place is just ok. It's a small park. You could see the entire area for about an hour."
	},
	{
		"User": "ap0lz",
		"Location": "Makati, Philippines",
		"DateofReview": "December 31, 2012",
		"ReviewTitle": "As expected",
		"Review": "The trip to the eagle sanctuary took an hour! It was long. But we divided the trip in two since there is a nice stretch of restaurants on the way to the sanctuary that serves catfish. The food there is great and helped us become...More"
	},
	{
		"User": "gregorian43",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "General Santos, Philippines",
		"Location": "General Santos, Philippines",
		"DateofReview": "December 29, 2012",
		"ReviewTitle": "where eagles soar",
		"Review": "had only time for a brief visit but it was great toe see what they are doing to help restore this endangered species to its former numbers ."
	},
	{
		"User": "amaapa",
		"Location": "Ca PS",
		"DateofReview": "November 20, 2012",
		"ReviewTitle": "Need to clean up park",
		"Review": "Park need more maintenance. Bird cages needs maintenance. Not enough restrooms, and they are dirty. Employees are not customer friendly. Need some training on how to provide good customer service"
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 20, 2012",
		"ReviewTitle": "Good Educational Place",
		"Review": "If you want to see with your own two eyes the Philippine Monkey- Eating Eagle, more eagles, hawks, owls and breath the fresh air and help maintain the maintenance of the place, don't hesitate to visit the Philippine Eagle Center when you are in Davao...More"
	},
	{
		"User": "Travel B",
		"Location": "Manila, Philippines",
		"DateofReview": "November 18, 2012",
		"ReviewTitle": "The Majestic Philippine Eagle",
		"Review": "The 45-minute journey (via car) was worth the destination. The Philippine Monkey Eagle Eagle is a majestic creature. You'll feel at awe at its presence. Listening to the different bird calls of the different bird of preys was also breathtaking, as if you're in a...More"
	},
	{
		"User": "Cynthia K",
		"Location": "Manila, Philippines",
		"DateofReview": "November 9, 2012",
		"ReviewTitle": "A notch for nature lovers",
		"Review": "The Philippine Eagle Centre is situated close to Calinan, Davao City which is a 30-45 minute drive from the center, depending on the traffic. It's a rehabilitation center for injured Philippine Eagles and other birds. It's a place where school children often take educational trips....More"
	},
	{
		"User": "bracomo",
		"Location": "davao",
		"DateofReview": "November 1, 2012",
		"ReviewTitle": "educational and entertaining...",
		"Review": "I would recommend this place to all nature lovers and also to tourists and locals who love seeing the Philippine Monkey Eating Eagle. It is such an amazing experience to have a close encounter with these birds of prey. Would definitely be a fun day...More"
	},
	{
		"User": "Greg48",
		"Location": "Meriden, Connecticut",
		"DateofReview": "October 28, 2012",
		"ReviewTitle": "Everthing I expected",
		"Review": "One of my main reasons for visiting Davao was to see this Center, and I wasn't disappointed. The walking paths were easy to negotiate-- helpful for an older guy-- an the Eagles on display were impressive and appear well cared for."
	},
	{
		"User": "travelogue823",
		"Location": "manila",
		"DateofReview": "October 27, 2012",
		"ReviewTitle": "Meet Pag-Asa and other Philippine Eagles",
		"Review": "How can one not visit the Philippine Eagle Center when in Davao? It's about an hour's drive from the city. Surprisingly, there are no signs along the road. A sign pointing to the watershed seems to be the key but it is easy to miss....More"
	},
	{
		"User": "lizl0ves2travel",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "October 26, 2012",
		"ReviewTitle": "Help in Saving the Philippine Eagle",
		"Review": "The place is not very much well-maintained but the animals are not in bad condition either. Aside from the Philippine Eagle, there are other breeds of eagle and other animals too. It rained when we visit there and we were delighted that they have free...More"
	},
	{
		"User": "maanmananzan",
		"Location": "philippines",
		"DateofReview": "September 26, 2012",
		"ReviewTitle": "The Philippine Eagles are the star!",
		"Review": "The Centre has quite deteriorated from the last time I was there 5 years ago. Still, the purpose of the visit was to see the Philippine Eagle, and yes,they were there!Awesome."
	},
	{
		"User": "Airah_18",
		"Location": "Iligan, Philippines",
		"DateofReview": "September 23, 2012",
		"ReviewTitle": "I LIKE IT HERE...",
		"Review": "I can't believe that I saw so many eagles in person especially Pag-asa.. There are lots of eagles in huge cages. They are given special treatment. I also like the gallery part and the short film showing. There are many monkeys too. :D If you...More"
	},
	{
		"User": "ilyn_03",
		"Location": "Doha, Qatar",
		"DateofReview": "September 20, 2012",
		"ReviewTitle": "Amazed to see PAG-ASA - the Philippine Eagle",
		"Review": "well we were there early in the morning started off our full day tour..it was a refreshing walk experience. the birds are well handled and I thought they were flying free but I was wrong. they were also in cages and were tied. the park...More"
	},
	{
		"User": "Erinzd",
		"Location": "Darwin, Australia",
		"DateofReview": "September 20, 2012",
		"ReviewTitle": "Loved it and a good cause",
		"Review": "I loved the Eagle Park. It was clean and the paths swept and tidy. Would recommend next time having lunch here as it is a nice park to sit and relax in. Entrance was cheap and I bought some great value T-shirts which are awesome...More"
	},
	{
		"User": "lshapspro",
		"Location": "Stockholm, Sweden",
		"DateofReview": "September 9, 2012",
		"ReviewTitle": "Looking at traumatized eagles is a sad experience",
		"Review": "it's always amazing to be close to such wonderful birds and the Philippine Eagle is no exception. It's the only eagle in the world with blue eyes. Most of the eagles live in rather small cages and the ones that don't, can't fly. I had...More"
	},
	{
		"User": "santi331",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 7, 2012",
		"ReviewTitle": "The Majestic Philippine Eagle",
		"Review": "In you are ever in Davao City, do find the time to visit the Philippine Eagle Center in Malagos. One can only marvel at the majesty of the Philippine Eagle after seeing them up close and I certainly appreciate the hard work that is being...More"
	},
	{
		"User": "Angelito P",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "September 3, 2012",
		"ReviewTitle": "Please save the eagle - - - make a donation",
		"Review": "This is the plea from the Center. And lots of people have responded. if you want to help, your friends who visit just migh see your name on the concrete stepping stones as they walk around the property. I wanted to eat marang near the...More"
	},
	{
		"User": "Alquanna",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Quezon City, Philippines",
		"Location": "Quezon City, Philippines",
		"DateofReview": "August 29, 2012",
		"ReviewTitle": "You can't say you've been to Davao without visiting this.",
		"Review": "Even if you only visit this place during your trip to Davao, it is already worth the journey. While most of the birds are in enclosures (many of the birds housed here have been injured and cannot fly for long periods of time already), the...More"
	},
	{
		"User": "TravelingKarakatak",
		"Location": "Gilroy, California",
		"DateofReview": "July 25, 2012",
		"ReviewTitle": "Endangered species",
		"Review": "A must visit if you are in Davao. The bird is very regal and fierce looking. It is a pity there are very few left. Maybe a couple should be let loose in the Jungles of Sumatra or mainland asia to perpetuate their species as they have no habitat left in this country."
	},
	{
		"User": "TravelAgentDavao",
		"Location": "Davao City",
		"DateofReview": "July 24, 2012",
		"ReviewTitle": "The Philippine Eagle Center - How to Get There",
		"Review": "The Philippine Eagle Center is located at Malagos, Calinan, Davao City. It is the home of the endangered species, Philippine eagle - the largest eagle in the world. We have learned the expensive cost to maintain such facility with low margin of profit collected from daily tourists. Most funding came from NGO's and some national politicians. We would like to encourage everyone to pay a visit at Philippine Eagle Center while in Davao to see the magnificent Philippine eagle and help save this national treasure."
	},
	{
		"User": "Lei P",
		"Location": "Taguig City, Philippines",
		"DateofReview": "July 23, 2012",
		"ReviewTitle": "Up Close and Personal with Eagles!",
		"Review": "Aside from Pag-asa, you get to see different species of eagles, a giant yellow snake (right in the entrance), monkeys, wild boar, crocodile, and deer. Their natural habitat is well-simulated making. The staff's efforts and dedication in saving the extinct Philippine monkey eating eagle are very commendable. Hands down!"
	},
	{
		"User": "jetset2010_10",
		"Location": "Los Angeles, California",
		"DateofReview": "July 18, 2012",
		"ReviewTitle": "Phillippine's Pride",
		"Review": "We loved the Philippine eagle! The place is spacious. I wish there was a Gift Shop to showcase the attractions and for people/tourists to buy souvenirs such as fridge magnets and postcards. There is one, but it was sparse and there's not much for browsing. Outside are stalls with assorted souvenirs. Appreciate that we were provided an umbrella when there was a light drizzle."
	},
	{
		"User": "ImmerWandern",
		"Location": "Palos Heights, Illinois",
		"DateofReview": "July 16, 2012",
		"ReviewTitle": "Very educational visit",
		"Review": "The Philippine Eagle Center lies about an hours drive outside Davao City proper. The purpose of this institution is multifaceted but its main thrust seems to be educational; visitors will not only see the Philippine national bird up close but several other raptors endemic to the archipelago. The tour guide will emphasize the loss of natural habitat as well as hunting in the decline of these magnificent creatures. The center also offers \"Keeper Talks\" where the caretakers of specific species of eagles give more detailed presentations of their wards; unfortunately we did not make it to any of these talks and took only the general tour.\r \r The Center cares for injured raptors, conducts field research, and engages in breeding programs.\r \r There was a pond with an estuarine crocodile wallowing in the water. Another area featured Philippine macaques. Our guide pointed out a far-off tree where fruit bats were roosting.\r \r It was both inspiring and depressing to encounter the eagles under these conditions. Most of the cages were small and even the largest enclosures would not have let the eagles do more than perhaps glide a short distance. We never witnessed any eagle fly. Some eagles were wounded and were no longer able to fly; they would not have survived in the wild anyway. One can only hope that the work they do does help preserve the Philippine Eagle and its other brethren. \r \r In addition to the Philippine Eagle, we also saw Grass owls, White-bellied sea eagles, Brahminy Kites, Philippine serpent eagles and the Philippine eagle-hawk or Pinsker's Hawk.\r \r One reviewer mentioned the leaves, twigs, and slippery walkways. Understand that the Center is in a tropical rain forest and the forest canopy is constantly shedding material which drops to the ground to either become fodder for animals or turn into topsoil. Perhaps the staff could sweep more frequently but totally clean paths may be too much to expect. It is a rain forest so the paths will be slippery; in fact our visit was interrupted by heavy rain showers. I do agree, however, that the signage needs updating. I am not sure how accessible the Eagle Center would for guests using wheelchairs; certainly some of the paths would seem to be extremely difficult to negotiate in a wheelchair. I would like to see larger bird enclosures - perhaps extensive netting covering several trees - for those raptors that were still capable of flight. I can only imagine what ii must look like to see one of them soar overhead.\r \r The visit is worth the entrance price and the effort to go there. Be prepared for a jungle walk; this is not a sanitized zoo environment. Consider bringing binoculars to get a closer look at some of the eagles in their enclosures, though this is not absolutely needed. Ask the staff and guides for specific actions you can take as individuals to help make the survival of these eagles more likely."
	},
	{
		"User": "kdsmithjr",
		"Location": "ithaca, ny",
		"DateofReview": "July 12, 2012",
		"ReviewTitle": "A great place to spend a quiet yet educational afternoon. The kids will love it too.",
		"Review": "This is a park/research center and it is well done. The landscaping is good and there is no commercial feel at all. Even the on-site sovenirs are reasonably priced and the proceeds go to help the animals. The place is not really easily accesible by bus, so be prepared to hire a driver/taxi...and negotiate the price before because it can vary widely. Best to take a local with you to do things like get a good price to come and go.Lots of competition at malls like SM Plaza, so you might get a good deal from there to the center and back....and be dropped off at good shopping and eating at the end."
	},
	{
		"User": "HALLYCS",
		"Location": "Quezon City",
		"DateofReview": "June 29, 2012",
		"ReviewTitle": "Needs improvement",
		"Review": "I think this place needs more improvement. There were dried leaves and twigs everywhere. It is poorly maintained because the pavements were too slippery. Some signage were full of moss. \r \r With the help of the government and other private sectors, this place can still be saved."
	},
	{
		"User": "Robert J",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Canberra, Australia",
		"Location": "Canberra, Australia",
		"DateofReview": "June 26, 2012",
		"ReviewTitle": "Sensational Bird",
		"Review": "It was great walking through, seeing nature wonderful Birds Worth seeing again."
	},
	{
		"User": "MrsLeeQuezonCity",
		"Location": "Quezon City",
		"DateofReview": "June 8, 2012",
		"ReviewTitle": "Special relationships between eagles and their handlers",
		"Review": "Go to Philippine Eagle Center early so you can time your visit with feeding time of the eagles - around 9am. Take note that the PEC is far so you have to give enough allowance for travel time. Find the eagle handlers and witness how eagles respond to commands that they alone can do."
	},
	{
		"User": "LolaGo1",
		"Location": "Washington DC, District of Columbia",
		"DateofReview": "May 25, 2012",
		"ReviewTitle": "SHARING THE EAGLE CENTRE",
		"Review": "Traveling SOLO in Davao City is difficult due to the locations of the tourist spots of this city. They are far from each other and not walkable. I hired the services of one car owner to drive me to 4 sites of the city for PHP 2,500. \r \r The first place I visited is the Eagle Center. My understanding is that the land where the centre is located was donated by a guy from Batangas. Kudos to him for sharing this property to us, the public. \r \r There are several eagles on display.Insemination is used to breed these eagles at the yellow building/laboratory of the centre. Big trees, plants and sound of gurgling water (water shed) make the trip to the center so peaceful and relaxing.There are some stores in front of the centre where one can buy souvenirs.."
	},
	{
		"User": "maia_cyllene",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 24, 2012",
		"ReviewTitle": "Sunny afternoon!",
		"Review": "If you love trees, wild flowers, eagles, birds, monkeys and animals PEC is a place to go with family. Children will enjoy the view and you will get a picture perfect day on a sunny afternoon. \r \r You will be stepping on stone pathway in going to aviaries and cages. Children would enjoy skipping and jumping to it.\r \r They have a snackbar where cold drinks and shakes are served! \r \r NICE!"
	},
	{
		"User": "TravellingStoneHenge",
		"Location": "On The Ground",
		"DateofReview": "May 22, 2012",
		"ReviewTitle": "Worth a visit.",
		"Review": "We were lucky that we arrived during the feeding period. We followed the caretaker as he fed the birds and he acted as a sort of unofficial guide, He even took some of the tame eagles and allowed them to perched on his hands and enticed them to spread their wings. "
	},
	{
		"User": "inabear",
		"Location": "Laguna Province, Philippines",
		"DateofReview": "May 11, 2012",
		"ReviewTitle": "Nature Trip",
		"Review": "On our way to the Phil Eagle Center, we made a couple of wrong turns because the signage was confusing, and when we got there, the guide I had emailed ahead to reserved had not arrived. We had to do the tour on our own, without a guide, which I think took away from it being a learning experience for my children. It is a bit more overgrown than I remember it to be when I first went, years ago, but we still had a fun time, seeing the eagles and other animals. Perhaps my children were too little to fully appreciate the eagles, so I think we should just bring them back there when they're a bit bigger."
	},
	{
		"User": "gns50",
		"Location": "Houston, Texas",
		"DateofReview": "May 2, 2012",
		"ReviewTitle": "Nice place to visit",
		"Review": "Nice place to see a very big bird. I went with filipino friends who spoke with a handler of the birds, he took an eagle from his cage and let us get very close with the eagle. Free to enter the park, I left donation and gave the handler a tip."
	},
	{
		"User": "Christan A",
		"Location": "Baguio",
		"DateofReview": "May 2, 2012",
		"ReviewTitle": "touch of nature",
		"Review": "It's a great experience seeing this birds. Knowing their state it makes me more active in being an advocate for these birds."
	},
	{
		"User": "cresil",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "May 1, 2012",
		"ReviewTitle": "A must place to see in Davao",
		"Review": "This park is very informative about the Philippine Eagles. This should be included in the itinerary for first time tourists in Davao. The Eagles here are amazingly beautiful."
	},
	{
		"User": "boypad",
		"Location": "Asia",
		"DateofReview": "April 21, 2012",
		"ReviewTitle": "In birds eye view",
		"Review": "You will learn to appreciate and co-exist with nature specially bird kingdom. I learn from that tour that Philippine Eagle are consider monogamous creature. Now that's amazing ;)"
	},
	{
		"User": "mzzyap8",
		"Location": "Philippines",
		"DateofReview": "April 18, 2012",
		"ReviewTitle": "Made me really appreciate these magnificent Eagles!!!",
		"Review": "You have to drive to Baguio District (cooler climate in higher elevation; passed the Malagos Bird Show location),1 hour away from Davao City town proper. Follow the signs to the Eagle Center on your right, park, and walk through the watershed (entrance fee is 5...More"
	},
	{
		"User": "dimpledude",
		"Location": "Chino Hills, California",
		"DateofReview": "April 14, 2012",
		"ReviewTitle": "ENLIGHTENING",
		"Review": "It was a trip worth the effort! The Philippine Eagle is such a jewel for the eyes to see.I was amaze to be that close to a real Philippine eagle. Physically the place is so-so but the presence of the eagles compensate for it.Plus entrance...More"
	},
	{
		"User": "Ponchit_gardenworx",
		"Location": "Davao City",
		"DateofReview": "April 10, 2012",
		"ReviewTitle": "if you have time ...visit and be informed",
		"Review": "Well cared for birds, informative displays. good and knowledgeable guides."
	},
	{
		"User": "woodstuck",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 31, 2012",
		"ReviewTitle": "You have to visit this place",
		"Review": "Philippine Eagle Centre is really a must vist/must go to place when you are in Davao. Majestic, sleek, awesome, regal, magnificent, or simply beautiful, these Philippine Eagles are (yup eagles as they have like more than 10 eagles). Forget the crocodiles, the phythons, I mean...More"
	},
	{
		"User": "imojen",
		"Location": "Manila, Philippines",
		"DateofReview": "March 23, 2012",
		"ReviewTitle": "great place for kids",
		"Review": "when we're in the area, i try to bring our guests to the philippine eagle center. it is a big place with lots of interactive spots for kids. i especially like the birds the fly around and the crocodiles area."
	},
	{
		"User": "Bluedyokohama",
		"Location": " ",
		"DateofReview": "March 23, 2012",
		"ReviewTitle": "Help the Phil eagle",
		"Review": "The place is not really first class, but the birds inside, you will appreciate, so many birds and endangered animals to see, worth going to this area"
	},
	{
		"User": "Mark E",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Makati City",
		"Location": "Makati City",
		"DateofReview": "March 20, 2012",
		"ReviewTitle": "Eagles and then Some",
		"Review": "I must say, on my second visit here, it got worse. The trails are not clean, there were trails leading to nothing really. Some cages are just too dirty. The signages around the park are not kept clean. The comfort/rest rooms are dirty and stinky....More"
	},
	{
		"User": "Babut_Bacena",
		"Location": "Manila, Philippines",
		"DateofReview": "March 1, 2012",
		"ReviewTitle": "Very educational",
		"Review": "Watch out for snakes crossing the pathways!!! I got scared when I saw this warning. But it was lucky for me I didn't see one. Trivia that stuck to me is that eagles are monogamous!!!"
	},
	{
		"User": "leicia",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 24, 2012",
		"ReviewTitle": "great cause",
		"Review": "the whole notion of protecting the eagles is commendable in itself.."
	},
	{
		"User": "lily p",
		"Location": "Makati, Philippines",
		"DateofReview": "January 21, 2012",
		"ReviewTitle": "The entrance fee of 50 pesos was all worh it!",
		"Review": "Tip: put on insect repellants before gooing inside. The Philippine Eagle Center tries it's best to keep the birds and other animals in their natural habitat, vegetation is a little bit dense so there were mosquitoes and other insects. And trust me the mosquitoes there...More"
	},
	{
		"User": "istop4streetfood",
		"Location": "Manila, Philippines",
		"DateofReview": "January 17, 2012",
		"ReviewTitle": "you can do better!",
		"Review": "the kids were excited to see the Haribon, Pride of the Philippines... but sadly, one cage seemed empty... and the other birds were probably too high up their \"cage\"... Which would have been okay - to give them a more natural environment... but the area...More"
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 23, 2011",
		"ReviewTitle": "Educational especially for students",
		"Review": "Philippine eagles are endangered specie and this place helps to preserve the eagles. I hope there will be lots of sponsors to support this place for propagation of these eagles. I think the place just needs support to better improve it."
	},
	{
		"User": "B_112",
		"Location": "Quezon City, Philippines",
		"DateofReview": "November 7, 2011",
		"ReviewTitle": "Philippine Eagle Centre",
		"Review": "Tour guide was very good and tour was informative. Noble work being done for our Philippine Eagles."
	},
	{
		"User": "alohabong",
		"Location": "Honolulu, Hawaii",
		"DateofReview": "November 1, 2011",
		"ReviewTitle": "A National Bird to be proud of & a great place for Photography",
		"Review": "Getting to the Philippine Eagle center started as an adventure. Davao city center to Calinan then jump on the back of a scooter taxi that takes you to the center (about 30-50 peso one way). My pedicab guy stayed there and waited to take me...More"
	},
	{
		"User": "Detcabmd",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Madrid, Spain",
		"Location": "Madrid, Spain",
		"DateofReview": "October 20, 2011",
		"ReviewTitle": "Go for the Eagles",
		"Review": "Great eagles! Awesome. Davao is really taking care of these birds. Hope funding will continually flow."
	},
	{
		"User": "trondolav",
		"Location": "Finnoy, Norway",
		"DateofReview": "May 23, 2011",
		"ReviewTitle": "it was okey",
		"Review": "this park has seen its better days, no maintenance, and time has left its mark, with that said, it was an okay trip will I return? no i dot think so"
	},
	{
		"User": "asianraptor",
		"Location": "manila",
		"DateofReview": "May 12, 2011",
		"ReviewTitle": "AWESOME!",
		"Review": "f your are a true-blue protector of philippine eagle, this place is for you. nature is abound. lots of trees and green surroundings. the coffee shop needs improvement in terms of service and food. you need insect repellent if you are sensitive to insect bites."
	},
	{
		"User": "ccduckie",
		"Location": "Victoria, Canada",
		"DateofReview": "December 8, 2010",
		"ReviewTitle": "Eagles were cool to see but the rest was just ok..",
		"Review": "You can't really top the Eagles, but the rest of the facility wasn't too impressive.. They had quite a large Koi pond and a pen of native deer.. Bring a lot of bug repellent. I'm glad I went just to say I saw it, but...More"
	},
	{
		"User": "daphiness",
		"Location": "Makati, Philippines",
		"DateofReview": "September 28, 2010",
		"ReviewTitle": "Made my Day!",
		"Review": "We went on a 1-day trip to Davao and this was our first stop from the airport (took a taxi -- about 45 minutes one-way). It officially opens at 8am but we were allowed to enter a little earlier. The entrance fee is only PHP50...More"
	},
	{
		"User": "thedude_888",
		"Location": "Budd Lake, New Jersey",
		"DateofReview": "September 23, 2010",
		"ReviewTitle": "Eagles",
		"Review": "If you are into the whole nature thing, then you will enjoy this. Philippine eagle is rare, you won't see it anywhere else and it is a beautiful bird."
	},
	{
		"User": "Mozzroom",
		"Location": "New Plymouth, New Zealand",
		"DateofReview": "June 24, 2009",
		"ReviewTitle": "Must Visit In Davao",
		"Review": "To get to the centre you can either catch a taxi as mentioned in the previous review or you can catch public transport which will also deliver you to the centre. In Davao you can catch a shared air con van to Calinan from the...More"
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"DateofReview": "May 3, 2008",
		"ReviewTitle": "Good place for an hour's stay",
		"Review": "To get to the Philippine Eagle Centre, we hired a taxi in Davao for P1200 return: it also took us to Malagos Garden Resort for a cheap A$5pp lunch and a quick visit to the Orchid Centre on the way back. The Eagle Centre takes...More"
	},
	{
		"User": "ericafaith16",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Philippines",
		"Location": "Philippines",
		"DateofReview": "November 15, 2007",
		"ReviewTitle": "My Date with an Eagle",
		"Review": "The first time I visited the Philippine Eagle Conservation Farm at Malagos, Davao City, I was both excited and in awe on the thought that eagles can really be bred in captivity. In the farm, I met Kalayaan, an eagle born in captivity. His parents...More"
	}
]
