[
	{
		"User": "Amy S",
		"Location": " ",
		"DateofReview": "November 8, 2017",
		"ReviewTitle": "REDEMPTORIST CHURCH IS BEAUTIFUL!",
		"Review": "Redemptorist Church is accessible to everyone because of its location. The church is constantly visited by tourists from all over the world. There is so much peace inside the church. To accommodate non Filipinos, English Mass is part of the service."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 21, 2017",
		"ReviewTitle": "Religiously attractive",
		"Review": "I use to attend mass here when I was a student and just recently I visited the church, and I found out that although it's an old church, but the cleanliness and serenity are well-maintained. Much to my surprise, there's a seminary now in the...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "June 7, 2017",
		"ReviewTitle": "Wedding Venue",
		"Review": "The place is exclusive even though it is near the road; the management made it so. Nice modern rounded structure. simple but elegant. the altar is seen by the churchgoers because seat are gradually elevated to look at the center; the altar."
	},
	{
		"User": "tom1941",
		"Location": "Philippines",
		"DateofReview": "February 8, 2017",
		"ReviewTitle": "Not friendly - not even the priest!",
		"Review": "All they want is for you to attend and leave. I only go because of the English. I will say the homilies are better than most in Davao. The men to help with communion \"at least one\" is rude and does not like to accommodate...More"
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 10, 2016",
		"ReviewTitle": "my sanctuary",
		"Review": "Everytime I have something to be grateful, and everytime I have problems, this is the place I always go."
	},
	{
		"User": "rickyrose",
		"Location": "pasay, philippines",
		"DateofReview": "July 4, 2016",
		"ReviewTitle": "Pray",
		"Review": "Nice set-up of this Church. Altar is lower than the pews. Very solemn place to pray and meditate. It is across a shopping mall."
	},
	{
		"User": "Kuya Rey B",
		"Location": "Bukidnon Province, Philippines",
		"DateofReview": "April 7, 2016",
		"ReviewTitle": "For believers, a place to pray and hope for a miracle.",
		"Review": "My family visited this place as part of our Holy Week Visita Iglesia. Places like this are not for enjoyment of the senses, it is for the happiness of the soul. There are various opportunities to pray - a grotto, an uphill stations of the...More"
	},
	{
		"User": "Miler15",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 25, 2016",
		"ReviewTitle": "My college friends wedding.",
		"Review": "This where i was baptised but it took me several years to actually be here to attend a Sunday service and most of the time, a friends wedding. Nice place. Abreeza is just a stone throw away."
	},
	{
		"User": "Cel C",
		"Location": "Cebu City, Philippines",
		"DateofReview": "January 14, 2016",
		"ReviewTitle": "Place for Pray",
		"Review": "Me and my hubby went here for thanking Him for lifting us up when we were down, comforting us when we were in sorrow and for all the blessings He has given to us."
	},
	{
		"User": "Davao City",
		"Location": "Davao City",
		"DateofReview": "December 31, 2015",
		"ReviewTitle": "A Place to Pray and Relax",
		"Review": "I got married here 33 years ago. Though it's difficult to reach this nice church nowadays because of terrible traffic, this place remains as one of my favourite places to be with God and pray. A wonderful ambiance under century trees."
	},
	{
		"User": "Veness Ehrn G",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 11, 2015",
		"ReviewTitle": "My Frequent Stop for Giving Thanks",
		"Review": "Though I always get caught by a tiresome traffic after the mass I still love going into this church. Aside from being accessible, I feel comfort in this place."
	},
	{
		"User": "lanaval",
		"Location": "Manila, Philippines",
		"DateofReview": "November 16, 2015",
		"ReviewTitle": "Beautiful church for the Mother of Perpetual Help",
		"Review": "It is now in front of a mall unlike years back and yet, you could feel the solemnity of the place once you get in. The rounded architecture with open spaces did not affect the peaceful ambiance and opportunity to meditate and pray."
	},
	{
		"User": "Kaye214",
		"Location": "Davao",
		"DateofReview": "November 11, 2015",
		"ReviewTitle": "Peaceful Church in the City",
		"Review": "I always go to church here because the location is convenient and I love the trees at the back. Huge church and during Christmas they always have the big belen on the side :)"
	},
	{
		"User": "Quezon City",
		"Location": "Quezon City",
		"DateofReview": "October 1, 2015",
		"ReviewTitle": "Religious fervor in the city of Davao",
		"Review": "For those who are Catholics looking for a place to worship in the busy city of Davao, the Redemptorist Church in Bajada is an answer to your prayer. Devotees of the Mother of Perpetual Help also visit this Church, similar to the Redemptorist Church in...More"
	}
]
