[
	{
		"User": "ToujoursLaRoute",
		"Location": "Iasi, Romania",
		"DateofReview": "Reviewed today ",
		"ReviewTitle": "Merge with the locals",
		"Review": "Place is overcrowded, everything is very cheap (on the western standards)...but the quality of products is also very low. On the food side, the smells are melting with the smog from hundreds of open barbacues...if you feel courageous enough just go for it, but do not expect high sanitary standards. Security wise, anything can arrive in a place like this, despite the presence of some military forces (as these days Mindanao is still under threat of communist guerillas). Be prudent, stay safe!"
	},
	{
		"User": "Jojo S",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed 1 week ago ",
		"ReviewTitle": "cheapest place...",
		"Review": "its good for mid earner, and not very choosy, bawal ma arte sa lugar nato. you can eat all you can the foods are very very cheap...shopping galore lots of merchandise, if your tired roaming, there is a massage area"
	},
	{
		"User": "daveholden",
		"Location": "Lake Forest, California",
		"DateofReview": "Reviewed 3 weeks ago ",
		"ReviewTitle": "This is such a great adventure in shopping",
		"Review": "To go to the night market is a real treat. First of all there is updated security on both ends of the street. This helps everyone to feel very safe. You can walk for two or three blocks on Monday 100 stores. Some self clothes and some sell crafts… The most memorable stores are those that are selling food stuffs! Everything from squid on a stick to anything else you might imagine! It is really a great cross cultural experience… If you were a native… You already go there! It is so cool!"
	},
	{
		"User": "Happy F",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed March 12, 2018 ",
		"ReviewTitle": "Improved Security",
		"Review": "We were hesitant to bpvisit this place after the bombing incident that happened last 2016. But we still went for this is ine of the must go in davao trip. The security has been improved there were military roaming around the area. I got a chance to spot some great finds at their super cheap vintage clothes as low as 1 dollar. After our vintage shopping we went straight to the food stalls a lot of food ootions amd super cheap too. You must visit this place it ooens at 6pm to 12midnight."
	},
	{
		"User": "tsbSeattle",
		"Location": "Seattle",
		"DateofReview": "Reviewed March 11, 2018 ",
		"ReviewTitle": "A MUST Visit if you go to Davao",
		"Review": "In every city there is usually one spot that you need to visit to say you have experienced it. In my opinion that is Roxas. To be able to go out at night into the third largest city in the Philippines feeling safe, experiencing amazing street food, bargaining for goods and trinkets and participating in the \"local\" way of life.... If you value experience and exposure to culture, this is the place in Davao. The only place I wanted to go back for seconds and thirds.."
	},
	{
		"User": "trxngvrra31",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "Reviewed March 5, 2018 ",
		"ReviewTitle": "Dragonballs",
		"Review": "eating here at the roxas ave in davao is one of the besh thing ever! Dragonballs, proben ugh!!! it's difficult to imagine a metropolis in which the rush of human activity falls away at time of the night. thus when my boyfriend and our friends took me for a street food dinner here in Roxas. It was like rediscovering a piece of home. Amazing!"
	},
	{
		"User": "Aljess L",
		"Location": " ",
		"DateofReview": "Reviewed March 5, 2018 ",
		"ReviewTitle": "Great eats!",
		"Review": "The night market shows the resilience of the Davao people. Security was tight with military and police visibility. A place to mingle with the locals, cheap food and great eats! Couldn't get enough of the durian ice cream!"
	},
	{
		"User": "Amani C",
		"Location": "Caloocan, Philippines",
		"DateofReview": "Reviewed March 1, 2018 ",
		"ReviewTitle": "THE HIGHLIGHT OF OUR DAVAO TRIP",
		"Review": "THIS IS THE BOMB (not literally bomb lol). You will regret if you will miss this in Davao. We went there for 2 nights and was really near to where I am staying and not hard to find. It was very secured with lot of checkpoints that will make you at ease despite of the previous incident happened. This street is very active at night from flea market, massage and to the unending food trip that fits your budget. This is what I miss the most when I went back to Manila."
	},
	{
		"User": "kalboHastings",
		"Location": "Hastings",
		"DateofReview": "Reviewed February 10, 2018 ",
		"ReviewTitle": "busy and now has a lot of security",
		"Review": "Located right next to the Marco Polo Hotel - we visited just once but because the market had recently been attacked by a militant bomber we went to show our defiance at this type of activity. Security is now very tight and the place is now very safe. You can avail yourself of street foods, shop for all sorts of items or have a street massage. worth at least one visit"
	},
	{
		"User": "Kuching, Malaysia",
		"Location": "Kuching, Malaysia",
		"DateofReview": "Reviewed February 8, 2018 ",
		"ReviewTitle": "OMGed the food!",
		"Review": "Love the food!!! at first was rather skeptic on going because of previous 2yr bombing. however when we arrived, theres tight security checking everyone coming into the night market..so thats good.\r the souvenir is veryy cheapp there & then at the back portion got many food stall selling grilled food; seafood/chicken/tunabelly..n they have halal food stall.food was awesome!"
	},
	{
		"User": "gwenjs2017",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed February 3, 2018 ",
		"ReviewTitle": "Food Tripping!",
		"Review": "At 6pm the street is closed and tents are set up for the goodies, at the end of the road are food stalls..maybe selling same food but you have to use your senses! I So love the grilled tuna teamed up with seaweed salad (lato). Paniza Organic Icecream is a winner, we have to come back to taste it again! one stall sells bagnet with rice at only P60 !! Don't miss out this place, very orderly and peaceful. Security officers are visible and maybe will try Ukay shopping next time! "
	},
	{
		"User": "looklikecris",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "Reviewed January 24, 2018 ",
		"ReviewTitle": "Saan aabout ang 50 pesos mo?",
		"Review": "I'm a fan of a night market, and just like my friends. This night market was popular in the news few months ago because of the bombing incident. Yes, you heard it right! And the whole Mindanao region are in Martial Law that time. Sounds really scary but not for me.\r \r I gave excellent rating for this place because of budget, variety and security. \r \r Let's start with security, since Martial Law is up there, you can see uniformed soldier anywhere. But they are not intimidating in our sight. I even have a short conversation to one of them. This night market organized an entrance and exit guarded by our brave soldiers.\r \r Budget, it you have 50 pesos you can eat a complete meal here. A lot of grilled street foods down to refreshing beverages. And if you go to the ukay ukay, you can get something out of your 50 pesos.\r \r Variety, from Food to goods... almost everything was here."
	},
	{
		"User": "Valdis A",
		"Location": "Kremenchuk, Ukraine",
		"DateofReview": "Reviewed January 4, 2018 ",
		"ReviewTitle": "Crowded but fun!",
		"Review": "Every night one of the central streets of Davao - Roxas ave. becoming a street market.\r All what u want you can find it here and of course - local delicacys and homemade ice cream. Ukay Ukay market, Massage sessions just on the street.\r Price for Massage just 70 peso - legs - 30 mins, 80 peso back - 30 mins.\r Must to visit!"
	},
	{
		"User": "folanke",
		"Location": "Philippines",
		"DateofReview": "Reviewed December 25, 2017 ",
		"ReviewTitle": "Bustling market",
		"Review": "Place gets bustling at night, and it is a fun expereinces hunting for bargains, or catch some snacks...friendly police and security but very thorough and professional..."
	},
	{
		"User": "Mehylander",
		"Location": "Morgantown, West Virginia",
		"DateofReview": "Reviewed December 21, 2017 ",
		"ReviewTitle": "A Great Experience",
		"Review": "Visiting Davao, and I heard rumors of a night food market. As I investigated, I did find videos on YouTube that showed the market. This made the place a target for me. \r \r It was quite simple to grab a grab ride from my condo. The Market doesn't actually start up till 6pm so the traffic to get there was a little rough. Once there all the people and food was fantastic.\r \r I started by walking all the way through at least once so I could have my options. Once all the way through I came back and chose my booth and my seat. I ordered several samples of seafood and a drink. The owners of the booth gave me my drink and started barbequing my selections. A man was in the back of the booth with a small grill and a fan. He was constantly fanning the embers to keep them hot. The one thing with this market is that there isn't any utensils.. You are given a plastic glove and you actually eat your food with your hands. The food when served is already diced up and cut up so that you can do so without any issues. \r \r Everything that I tried was fantastic. My favorite of course was the milkfish. When you visit Davao and you want to get a good taste of the culture, I would say its best to start here. One note though is that if your tall, your going to be ducking a lot lol."
	},
	{
		"User": "Agnes Grace T",
		"Location": " ",
		"DateofReview": "Reviewed December 21, 2017 ",
		"ReviewTitle": "Cheap but branded Clothes from Ukay-Ukay and delicious street foods",
		"Review": "If you visit Davao City, don't forget to drop by at Roxas Night Market as you can buy Cheap but branded Clothes, jeans, and bags from Ukay-Ukay and you can also eat delicious street foods as well."
	},
	{
		"User": "Nadine V",
		"Location": "Auckland Central, New Zealand",
		"DateofReview": "Reviewed December 17, 2017 ",
		"ReviewTitle": "Lots of foods and clothing",
		"Review": "Came here for dinner the other night and I must say it was really packed! Bumping shoulder to shoulder with everyone else while trying to look for food to eat. There are a wide variety of street foods available so I’m sure you’ll find something to try during your time there. Just be prepared to be sweaty, a bit claustrophobic, and to smell like smoke and food by the end of the night!"
	},
	{
		"User": "redgotsohigh",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed November 26, 2017 ",
		"ReviewTitle": "A must when in Davao",
		"Review": "Definitely a must see when you're in Davao. Place is filled with food stalls as well as clothing/accessories stall that is cheaper compared than malls and establishments. Definitely worth trying the food as its delicious and cheap!"
	},
	{
		"User": "Ben T",
		"Location": "Toowoomba, Australia",
		"DateofReview": "Reviewed November 19, 2017 ",
		"ReviewTitle": "Market flourishing after last year’s bombing",
		"Review": "After the tragic bombing in Sept 2016, Roxas Ave Night Market is here to stay. With heavy security presence, the night market has a mix of food vendors and apparel merchants. Popular with locals, it’s a stones throw from People’s Park."
	},
	{
		"User": "JMHerald",
		"Location": " ",
		"DateofReview": "Reviewed November 13, 2017 ",
		"ReviewTitle": "Value for money. Variety of food. Very crowded. ",
		"Review": "Pros: Your money can buy you a lot of food here in the night market, ranging from turo-turo, to grilled meat and seafoods, to desserts like durian ice cream, up to bargain clothes and items. Place is secured as there are security measures conducted prior entering the night market. \r \r Cons: Very crowded. Expect bumping elbows with strangers. Food stalls are sometimes occupied thus need to locate a vacant area to eat. Arrive early if you want to explore this food market at ease. "
	},
	{
		"User": "MrSnatch",
		"Location": "Worcester, United Kingdom",
		"DateofReview": "Reviewed November 13, 2017 ",
		"ReviewTitle": "Roxas street food",
		"Review": "Family and I visited this very busy night market to sample some of the delights I'd heard about and wasn't dissapointed.\r If you suffer with asthma or any other breathing problems the smoke from all the bbqs might be a problem.\r There are a massive variety of foods drinks and other things, vendors are all friendly and the best thing is the price of everything so so cheap very good value and fun also.\r I would recommend to anybody who is looking for a bit of culture and good food to visit Roxas Night Market. "
	},
	{
		"User": "Fay Fay Y",
		"Location": "Los Angeles, California",
		"DateofReview": "Reviewed November 12, 2017 ",
		"ReviewTitle": "Eat like a local",
		"Review": "A must-try for any visit to Davao. Security has been heightened since the previous attacks--expect to wait in line and get searched prior to entry into the night market. Arrive early if you want to grab a seat--it gets very crowded."
	},
	{
		"User": "Amy S",
		"Location": " ",
		"DateofReview": "Reviewed November 8, 2017 ",
		"ReviewTitle": "GREAT DEALS AT ROXAS AVENUE NIGHT MARKET!",
		"Review": "If you are one individual who loves shopping for a good bargain, try going to the night market along Roxas Avenue. You'll see lots of good things for a fraction of the price as compared to regular stores."
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "Reviewed November 1, 2017 ",
		"ReviewTitle": "Nice market lots of food",
		"Review": "We arrived just before 5pm and they had the place set up in about 20 mins and cooking food. the BBQ chicken and pork was great. The best thing we had were these green peppers that were dipped in batter and fried, also the quail eggs were very good which were battered and fried. security checks are all over the place and you will be checked before you are allowed in due to what happened earlier this year. If you are in Davao this is a place you don't want to miss."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed October 21, 2017 ",
		"ReviewTitle": "Inexpensive foods at night",
		"Review": "Lots of foods are displayed here from late afternoon to late evening. You can just choose according to your taste and palate, and of course, budget."
	},
	{
		"User": "Ricky P",
		"Location": " ",
		"DateofReview": "Reviewed October 9, 2017 ",
		"ReviewTitle": "Best in Davao!",
		"Review": "This is the most exciting part of our trip in Davao city-their food! I love all the foods we tried specially the Grilled tuna and squid. They were fresh and tasty 😋. And oh! The seaweeds too!"
	},
	{
		"User": "UsapangGala",
		"Location": "Pasig, Philippines",
		"DateofReview": "Reviewed September 20, 2017 ",
		"ReviewTitle": "Food everywhere,",
		"Review": "I arrived in Davao City when Martial was already brought down to Mindanao, so when if you will enter the premises of the market, you have to present your ID and have your bags inspected. Roxas night market starts at about as early as 5:00 PM. You can already see some stalls set-up ready for business. I usually go here to kwek-kwek with seaweeds. Other than kwek-kwek, most of the stalls sell \"inihaw\" of all kinds; from pork, crustaceans, and of course tuna. You should also try the Durian ice cream here. You will enjoy better if you will go with your friends here.\r \r Aside from food, there are stall for you to shop clothes, bags and shoes at a low price but don't expect you could buy original stuffs here like Nike and the likes.\r \r No need to bring huge amount amount of cash unless you plan to buy a lot. At P100 your cravings will surely be satisfied."
	},
	{
		"User": "Jayawanth r",
		"Location": " ",
		"DateofReview": "Reviewed September 19, 2017 ",
		"ReviewTitle": "Amazing place",
		"Review": "Just went there on walk with a friend of mine and all i could see was delicious snacks and fresh juices and all types of meaty food calling me over to taste em😂✌ such a nice place at night and thrill"
	},
	{
		"User": "jonalber2",
		"Location": "Singapore, Singapore",
		"DateofReview": "Reviewed September 5, 2017 ",
		"ReviewTitle": "What an experience!",
		"Review": "For those who love both food and thrills, this is the place to go! They serve street food (mostly grilled or fried, no soups here!), and lots of traditional Filipino dishes like kinilaw, lechon kawali, kwek kwek, and balut. Every stall, more or less sells the same dishes as all other stalls, except that each one makes it in their own style e.g. one might marinate his fish, while another would just slightly salt it before grilling. It's exciting to taste the same dish cooked in many different ways. \r \r You can walk the whole stretch from end to end. When you find a stall you want to try, just pick (or point) what you want, and they will heat it up (or grill it) for you. Patrons usually sit in small, tight tables. Too small that you brush elbows and backs with the person beside & behind you, but still enough room to move your hand to your mouth to eat :P Once they heat up your food, they serve it with rice (1 rice serving is around 15 php). Rice servings are TINY. So ordering 2 - 3 per person should be enough. Don't forget to use a hand glove to enjoy finger-licking goodness! \r \r If you are going here, I suggest wearing light clothes at it can get warm with all the grilling going on right, left, and centre. Also, be prepared for your hair and clothes to smell like smoke when you're done."
	},
	{
		"User": "Mandaluyong, Philippines",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "Reviewed August 29, 2017 ",
		"ReviewTitle": "Best deals!",
		"Review": "I was able to buy a travellers bag for only 100PHP and it's in good condition. I was also able to buy a few shirts for only 20PHP apiece. The night market also features food section, where you can buy a huge chunk of tuna belly for only 90PHP! Durian is also sold and eaten at this stretch. Short-time massages are also in this place, so you can relax after walking and finding the best deals. "
	},
	{
		"User": "raymond c",
		"Location": "San Francisco, California",
		"DateofReview": "Reviewed August 20, 2017 ",
		"ReviewTitle": "Street food not to miss and massage",
		"Review": "I have to go here and experience all the street food davao to offer and did not disappoint. I have squid ball, mango, peanuts, fishballs, pork bbq, griiled squid, chicken feet, intestine and the famous DURIAN...."
	},
	{
		"User": "Screaming_Pen",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed August 18, 2017 ",
		"ReviewTitle": "The Davao spirit is alive in the Night Market!",
		"Review": "Roxas night market boasts a plethora of food choices that suits the budget conscious. The BBQs cost you $0.1 and the other food is also around that range. You can also try the desserts of ice cream, cupcakes, Kwek-kwek or any food that's there. You...More"
	},
	{
		"User": "charmaineruizsison",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed August 15, 2017 ",
		"ReviewTitle": "Budget-wise yet super worth it!",
		"Review": "If you wanna have street food for dinner then Roxas night market is very much available! You have lots to choose from there! Super affordable but surely will save your hunger! After eating and eating, you can have shop directly with lots of \"ukay-ukay\" store...More"
	},
	{
		"User": "tortangsardinas",
		"Location": "Makati, Philippines",
		"DateofReview": "Reviewed August 9, 2017 ",
		"ReviewTitle": "Excellen food for a very good price",
		"Review": "The grilled tuna belly (good for two) and squid was so delicious we ate 2 cups of rice each. The place is also clean and safe."
	},
	{
		"User": "Ronna V",
		"Location": " ",
		"DateofReview": "Reviewed August 9, 2017 ",
		"ReviewTitle": "Dinner at the night market ",
		"Review": "On my first night i walked from the hotel to this night market its about 15 mins from city hall. Even it its martial law, seems like normal.except of course with the soldiers and police around. Its good though i feel safe.. The food is...More"
	},
	{
		"User": "Nigel G",
		"Location": "Singapore",
		"DateofReview": "Reviewed July 27, 2017 ",
		"ReviewTitle": "Nothing Special - No Beer !!",
		"Review": "A road by day that turns into a food market at night. In the heart of old Davao. I was staying at the Marco Polo Hotel a few meters from the end of the market. A security check at the entrance with ID check before...More"
	},
	{
		"User": "Ideas_6622",
		"Location": "Singapore, Singapore",
		"DateofReview": "Reviewed July 21, 2017 ",
		"ReviewTitle": "Back to the old days night market",
		"Review": "We came here on a wet evening. It was drizzling and several locals stood below the buildings for shelter while some others, walk around looking for stuff. Most of the stalls are selling identical items except for clothes and some old shoes. The items are...More"
	},
	{
		"User": "Benedict A",
		"Location": " ",
		"DateofReview": "Reviewed July 14, 2017 ",
		"ReviewTitle": "Nothing Special",
		"Review": "From two full city streets, this controversial night market now occupies one side of Roxas Avenue. A memorial roundabout was built in commemoration of the victims of the bombing in 2016. It offers cheap buys, good street food, and massage on the side. Other than...More"
	},
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed July 12, 2017 ",
		"ReviewTitle": "Interesting mix of people and food everywhere.",
		"Review": "After a tiresome walk from Victoria Plaza at J.P. Laurel to the night market at Roxas Avenue, it was a relief to have several choices of drinks from calamansi (local lemon), buko (young coconut) to iced tea and cucumber juices. Barbeque stalls were everywhere; serving...More"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed July 4, 2017 ",
		"ReviewTitle": "Davao Night Market",
		"Review": "If you want to relax and dine, you could pay a visit here. There is a massage area, food and \"ukay-ukay\" (used clothes) stalls. The place is safe, guards and police are visible in the area."
	},
	{
		"User": "Queensyl R",
		"Location": " ",
		"DateofReview": "Reviewed June 11, 2017 ",
		"ReviewTitle": "When hungry grab a foodie at Roxas Night Market",
		"Review": "People often come here to enjoy delicious food without hurting your pocket. Plenty of food to choose, from the Filipino street foods to the traditional Chinese dumplings. Home of the yummiest dirty ice cream and can all shop here. Its like the street market in Mongkok but just more on foodie than garments and bling-blings. Drop by here if you ever plan to visit Davao and experience the fun, you'll never find yourself as a stranger to this place because it always feels like home, from the food to the hospitality of the people. Life is Here!"
	},
	{
		"User": "Ray T",
		"Location": " ",
		"DateofReview": "Reviewed May 28, 2017 ",
		"ReviewTitle": "Fun to do, right by the Marco Polo hotel",
		"Review": "Interesting, fun thing to do once. Especially convenient if you are staying at the Marco Polo Hotel, it's right our front. Plenty of food to choose form."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "Reviewed May 26, 2017 ",
		"ReviewTitle": "Familiarization while still daylight",
		"Review": "We were there earlier just before dusk. I showed to my friends where the Night market is in Davao City. It is in a portion of Roxas Avenue between Aldevenco shopping center and the ADDUniversity.\r \r So when they will come back on there own they can direct the driver or have familiarized already the place. Sure they will, for they planned to eat out in an open grill. The place is a famous hangout to most inhabitants in the city. Because of its affordable food and the ambiance which they like it for a change."
	},
	{
		"User": "elviep2014",
		"Location": " ",
		"DateofReview": "Reviewed May 5, 2017 ",
		"ReviewTitle": "Interesting and fun",
		"Review": "Our hotel was just steps away from the night market. It was interesting to see the street very clean the day after the night market considering how many stalls were set up at night. Lots of food stalls but basically offering the same type of grilled food. It has a small area for people offering massage and another area for clothes. Kudos to the city for setting up the stalls so that the food section is quite far from the canal for hygienic reason."
	},
	{
		"User": "DVOpommy",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed May 4, 2017 ",
		"ReviewTitle": "Fun place to visit for tourists",
		"Review": "Approx one kilometer long running down one side of Roxas Street, pretty much the center of town with easy access by all means of transport.\r \r Restaurnts and eateries battling on street pop up BBQs. Funny walking through clouds of BBQ smoke.\r \r Lots of small booths selling clothes, second hand shoes and lots of accessories.\r \r There is an outdoor massage area and well worth a visit. Massaged in a plastic chair as you sit down but it was excellent as well as very cheap."
	},
	{
		"User": "Kiara P",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "Reviewed April 24, 2017 ",
		"ReviewTitle": "Fun Place to be!",
		"Review": "This is one of my go-to places where I can eat for less than P100. I already have my favorite barbecue place (look for Mommy Gi's) where they serve the best pastil (or pastel? not sure of the spelling). \r \r Roxas Night Market has different stalls for food, used clothes/shoes/bags and there is also a massage area. Great value for money."
	},
	{
		"User": "WorldtravellingPooh",
		"Location": "Makati, Philippines",
		"DateofReview": "Reviewed April 10, 2017 ",
		"ReviewTitle": "Street food at its best in Davao",
		"Review": "After finding our spot among the hundreds of stalls there, we had a great time eating freshly grilled food - from pork bbq, to grilled squid, to bbq longganiza, etc. We ate rice that is in a banana leaf. It was like my childhood all over again. The food were varied and cheap. Try the buchi which is served hot and freshly cooked. Would you believe it has strawberry, nutella and many more. "
	},
	{
		"User": "jedainz",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed April 6, 2017 ",
		"ReviewTitle": "Look for Barney's BBQ and Paniza Ice Cream",
		"Review": "Among the hundreds of stalls here, the best barbecue I would have to say is Barney's. Paniza ice cream is worth the try too. Dragon Balls are great but I couldn't find which one is the original I used to order at.\r \r Great streetfood with a variety of choices. Your fifty pesos will leave your stomach satisfied."
	},
	{
		"User": "Kris E",
		"Location": " ",
		"DateofReview": "Reviewed March 26, 2017 ",
		"ReviewTitle": "Locals",
		"Review": "If youre in Davao City and you want to expore the heart of the city you might as well dropby Roxas Night Market where you can enjoy wide variety of street foods and Rtws at very affordable prices specially if your on a tight budget."
	},
	{
		"User": "Riyadh, Saudi Arabia",
		"Location": "Riyadh, Saudi Arabia",
		"DateofReview": "Reviewed March 19, 2017 ",
		"ReviewTitle": "Good place for Fun and Bonding",
		"Review": "Intrigued by the place because of the news. Since I was in Davao, I should have a visit. I asked my friend to bring me there.\r \r Of course I have to be there at night time for it is a regular street during day time.\r \r For at night, the street becomes a magical place for gathering of friends, fun and bonding. The whole streak of the streets is full of police in uniform and what not. So I can say that this particular street is pretty safe now. Lots of mobile grilling store and some tables beside it. At the other end, stalls for non-food. Lots of things you can find and buy.\r \r A really good place to unwind. But not to relax. Because the place is swarming with people."
	},
	{
		"User": "Paranaque, Philippines",
		"Location": "Paranaque, Philippines",
		"DateofReview": "Reviewed February 15, 2017 ",
		"ReviewTitle": "Good finds in Davao City Roxas Night Market",
		"Review": "I was curious to see this place since it was all over the news almost a year ago due to the bombing. Locals told me it was perfectly safe in fact the day after the bomb it was back to business.\r \r So what can you find in the area? There are a lot of street food available - Balut (Duck Eggs) and BBQs are available, and Mang Danny's Ice Cream is also a popular choice among the locals (you can easily ask there where it is located, it's the ice cream stand with a long line). You must try Mang Danny's Ice Cream It has this homemade quality where flavors are all natural (Durian is very very popular!) and the ice cream texture is thick (only P20 for 3 scoops).\r \r Other finds are trinkets, gadget accessories, preloved designer bags or brand new imitation goods."
	}
]
