[
	{
		"User": "zachtripper",
		"Location": " ",
		"DateofReview": "July 25, 2017",
		"ReviewTitle": "island life",
		"Review": "This might not too fancy. But the serenity of this place will just give you a blast of relaxation and relief at the same time. Not too crowded, which is perfect for couples who needs isolation. perfect for honeymooners. It will leave you always happy memories."
	},
	{
		"User": "Andreli F",
		"Location": "Pagadian City, Philippines",
		"DateofReview": "January 3, 2017",
		"ReviewTitle": "Adventure",
		"Review": "Our family of 14 booked an exclusive island hopping with lunch and diving last Dec. 27. We had our reservation ahead and paid in advance. We contacted thru their website. I must say, the over all experience was the best and I would highly recommend this to big grps or family ( boat has max of 25 pax). Food was great, dive master was good. Kids just enjoyed the snorkeling and kayaking. You just have to inform them at least 1 day before your sched how many will dive in order for then to have time to prepare the tanks, equipments, etc. For our grp, we had 4 ( 2 adults and 2 teens) and all were first time divers. 25?mins per dive is not enough for them and it was worth it ( you just add 800 pesos per pax)"
	},
	{
		"User": "Anjeline M",
		"Location": " ",
		"DateofReview": "June 20, 2016",
		"ReviewTitle": "I feel like I'm in an aquarium😍",
		"Review": "Took the island hopping with intro dive for P1,800/pax (inclusive of lunch) - not bad!Food was good and the staff are oh so friendly! Shoutout to Kuya Lhocz who assisted us on our scuba dive. He makes sure you're doing good down there and grants all our request along with Capt. Jernel (well not all but almost LOL) so we really had maximize our tour in Samal Island."
	},
	{
		"User": "Charleen C",
		"Location": "Manila, Philippines",
		"DateofReview": "February 11, 2016",
		"ReviewTitle": "Awesome!",
		"Review": "Had the best time island hopping with these guys. Super friendly and helpful. Boat is in tip top shape. Diving equipments are also in good condition. Food is simple but good. I would use them again when I go back to Davao."
	},
	{
		"User": "malzgerz",
		"Location": " ",
		"DateofReview": "January 30, 2016",
		"ReviewTitle": "Our First Time to Scuba Dive! ^_^",
		"Review": "One of our dreams is to try scuba diving and as I am searching for activities to do when we will be in Davao, I got to search this Samal Water Sports who offer Island Hoping with Scuba Diving. And since I want to try the scuba diving I contacted the number that is in their website. Good thing there are also group who will avail the tour on the date we want to do it. This was a great experience an experience I want to try again. But there is also a sad part on this tour, because we don’t capture our moments when we are scuba diving, our underwater camera on that day and by the time we will dive got damaged... =( and the Samal Water Sports don’t have underwater camera by that time... That’s why I want to try again this scuba diving, probably on other areas of the Philippines. But I would say that the tour of Samal Water sports is affordable, island hopping with scuba diving including delicious food serve by their crew... ^_^"
	},
	{
		"User": "Jeroen_Elout",
		"Location": "Makati",
		"DateofReview": "August 4, 2015",
		"ReviewTitle": "Scuba Diving Live aboard Trip",
		"Review": "We had a great time with Samal Watersports doing a 3 day live aboard trip for a very friendly price. At the same time my friend was doing his Open Water Course. Divemaster Balolok proofed to be a master at finding the most exotic critters while Captain Jeynel and his crew kept us safe and cooked our excellent meals. \r \r The boat is open but can get closed along the sides when it rains, we did sleep in hammocks and on masts on the floor. Nothing better then waking, jumping in and doing a dive before breakfast. \r \r Some awesome variation in dive sites, nice and gentle beach entries to keep the non divers happy and dramatic sea fan walls for experienced divers and this all withing minutes away from each other."
	},
	{
		"User": "iamjuliep",
		"Location": "Manila, Philippines",
		"DateofReview": "December 11, 2014",
		"ReviewTitle": "Well Pampered Island Hopping Experience",
		"Review": "Shout out to Samal Watersports' team for a great boat trip to different destinations in Samal!\r \r PJ gave us the best and hassle-free deal for our island hopping tour. The package includes all the gears and equipment needed for snorkeling, kayak ride and diving.\r \r We have also availed their food and drinks package and truly, it was a great deal! Bread, fruits and water are already available upon entry on the boat. Mineral water, soft drinks and coffee are free all day long! Right after the first island activity (swimming, diving and snorkeling), we were served with a sumptuous lunch -- chicken bbq, grilled pork and grilled tuna complete with fresh fruits (2 kinds) and vegetable salad. Snacks also followed after the last stop of the island hopping. \r \r What else can you ask for with this kind of deal plus the very good service that Samal Watersports crew has to offer. It was truly a great pampering experience!"
	},
	{
		"User": "Fung14",
		"Location": "Birmingham, United Kingdom",
		"DateofReview": "July 7, 2014",
		"ReviewTitle": "Top class",
		"Review": "We did 2 fun dives with PJ and his crew and had a great time! Everyone was really friendly and they us a fantastic lunch on board the dive boat. We were lucky to spot a school of black jacks which swam right past us.\r \r The owner PJ himself managed the booking and was great in communicating to us before we visited."
	},
	{
		"User": "DrunkenDugong",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 26, 2014",
		"ReviewTitle": "Fun Snorkeling Tours with Samal Watersports Center",
		"Review": "I've loved snorkeling ever since I was a kid. So discovering Samal Watersports' snorkeling tour was a real find for me. This outfit runs dive and boating tours around Samal Island and its neighbors Talicud and Ligid, and I have to say Belgian owner PJ Vererfven runs the ship and crew I'd trust my own guests with. \r \r The boat is clean, with a decent toilet, and is well-equipped with life vests and life rings, and the masks and snorkels they provide are new and seal well; my wife Cathy and I never had problems with ours. All the crew know how to dive, are courteous and welcoming, and proactively look out for your safety. My wife got tired out by the current on one dip, and before she even thought of asking for help one of the boatmen had already thrown her a life ring. PJ is also a good guide and genial company, pointing out the good spots and regaling us with stories of his previous tours over lunch.\r \r The boat tour, whether for diving or snorkeling, comes with lunch and it's a generous spread. On our second trip with them, with five of our guests, we had grilled marlin steaks, barbecued chicken, sweet and sour pork, salad, and fresh pineapples and mangoes. Lunch was grilled fresh on the boat, and you can either eat on board or ask to be taken to a beach. \r \r Samal Watersports Center definitely gets my recommendation for facilities, safety, service and food."
	},
	{
		"User": "johnandpauline15",
		"Location": "Puerto Galera, Philippines",
		"DateofReview": "September 18, 2013",
		"ReviewTitle": "Diving and accomodation",
		"Review": "I have done several dives with the boys from Samal Island Water Sports. I upgraded my dive ticket to Advanced. They did an excellent job and really enjoyed myself I highly recommend them."
	}
]
