[
	{
		"User": "EmppuL",
		"Location": "Helsinki",
		"DateofReview": "4 days ago",
		"ReviewTitle": "Odd looking church",
		"Review": "I think is worth to visit when sightseeing in the city. Interesting architecture. There was a wedding when we went, so it was nice to see that as well."
	},
	{
		"User": "rj_travelbug",
		"Location": "Iloilo City, Phils",
		"DateofReview": "January 23, 2018",
		"ReviewTitle": "Beautiful Church",
		"Review": "Solemn mass celebration last sunday, well ventilated with 3 huge ceiling fans. I was wearing a pullover and was expecting to feel warm but never did. Attended English mass 6pm. Very good choir."
	},
	{
		"User": "Valdis A",
		"Location": "Kremenchuk, Ukraine",
		"DateofReview": "January 4, 2018",
		"ReviewTitle": "Been here for wedding",
		"Review": "Nice and big church with interesting and unusual design. I been here few times and the last time for wedding of my friend. Located in the center, just in front of City Hall. Must See while in Davao!"
	},
	{
		"User": "Amy A",
		"Location": "Ithaca, New York",
		"DateofReview": "January 2, 2018",
		"ReviewTitle": "Big historic church",
		"Review": "This is a big Catholic church close to the main downtown easy to access. It can give one a good view of the City's religious relic and people who go there for spiritual needs."
	},
	{
		"User": "folanke",
		"Location": "Philippines",
		"DateofReview": "December 25, 2017",
		"ReviewTitle": "Impressive church",
		"Review": "This is probably the biggest church in Davao and very central right near the City Hall etc...huge building...but I never entered yet.."
	},
	{
		"User": "redgotsohigh",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "Nice church",
		"Review": "A very nice church almost at the heart of the city. We almost make it a point to visit 1-2 churches everytime we go out town to pay respect as well as to thank the Lord for the blessings we have been getting."
	},
	{
		"User": "Amy S",
		"Location": " ",
		"DateofReview": "November 8, 2017",
		"ReviewTitle": "BREATHTAKING SAN PEDRO CATHEDRAL",
		"Review": "By the time we entered the Cathedral, there was that feeling of peace and safety. It is one place to go when and if one needs peace."
	},
	{
		"User": "Raf O",
		"Location": "Philippines",
		"DateofReview": "October 19, 2017",
		"ReviewTitle": "Pray",
		"Review": "A good place to pray and talk to God. Beautiful church in the city. It's one of the oldest. Lots of people come to visit and pray on this church"
	},
	{
		"User": "Kimitaka S",
		"Location": " ",
		"DateofReview": "September 17, 2017",
		"ReviewTitle": "Modern construction ",
		"Review": "Many people of the Philippines believe Catholicism, and therefore there are churches everywhere. San Pedro Cathedral, maybe one of the biggest in Davao, is a modern construction, and since I expected something historical, I was disappointed a little bit."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 1, 2017",
		"ReviewTitle": "the seat of roman catholic",
		"Review": "roman catholic center of power in the diocese of davao, were important mass is held, even it suffer the evil works of extremist group it remain to be tough and lots of devotee everyday visits the place."
	},
	{
		"User": "Mia P",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 29, 2017",
		"ReviewTitle": "Awesome Church",
		"Review": "The church is in front of the municipal hall and is within walking distance from the Osmeña Park. The church was being cleaned when we visited. It's spacious and cool inside, despite the heat outside the church. It's accessible because it's along a major road."
	},
	{
		"User": "Ronna V",
		"Location": " ",
		"DateofReview": "July 26, 2017",
		"ReviewTitle": "First to see when i arrived the city ",
		"Review": "Arriving from sta ana wharf i rode a jeepney to the city.. The first stop is here in san pedro cathedral... Giving thanks and praise for the safe travels.. Thank god i made it :) Nice architectures.."
	},
	{
		"User": "travelbug47london",
		"Location": "London",
		"DateofReview": "May 10, 2017",
		"ReviewTitle": "An amazing shape",
		"Review": "You will be fortunate to ever see a cathedral shaped as this is. Located opposite the Davao City Hall and at the end of San Pedro Street it is easily found. If you are a Christian it is good to coincide with an English Mass...More"
	},
	{
		"User": "Nigel G",
		"Location": "Singapore",
		"DateofReview": "April 30, 2017",
		"ReviewTitle": "A Unique Architectural Style",
		"Review": "This is a most unusually designed cathedral - indeed when I first saw it I thought I must have been in the wrong place. Modernistic design, and I'm told it incorporates Islamic features. Broad open style nave with pedestal altar and bishops throne on the...More"
	},
	{
		"User": "tailor1989",
		"Location": "Surat, India",
		"DateofReview": "April 26, 2017",
		"ReviewTitle": "My Street",
		"Review": "I used to stay here nearby this place so whenever i get free time i just go here walk by. usually you can get crowd nearby the place and there is a market too so you can enjoy nice view around the centre. its like...More"
	},
	{
		"User": "Jonathan Christ... B",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 13, 2017",
		"ReviewTitle": "A MUST VISIT IN DAVAO CITY",
		"Review": "One of the oldest cathedral in davao city. this is were my younger got baptized. old structure but unique in design a must visit when in davao city"
	},
	{
		"User": "jedainz",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 6, 2017",
		"ReviewTitle": "One of the churches in Davao City",
		"Review": "This church has been around for ages. It's definitely worth visiting if you are in to touring historical sites."
	},
	{
		"User": "bhsceo",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 15, 2017",
		"ReviewTitle": "A place of worship",
		"Review": "Best place of worship in the heart of Davao city on San Pedro.Going with family & friends.Can go by Zeep and well connected wholeover the city."
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"DateofReview": "January 28, 2017",
		"ReviewTitle": "The Cathedral is less attractive than other Filipino ones",
		"Review": "This is an unattractive concrete brutalist style building. I did not find it to be one of the more beautiful Filipino or indeed worldwide Cathedrals, even though I am Catholic. Even the altar was relatively bare."
	},
	{
		"User": "Las Pinas, Philippines",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "January 20, 2017",
		"ReviewTitle": "Very near the City Hall of Davao",
		"Review": "It's a simple cathedral but for a Catholic like me it's a must-see so I can pay homage to our GOD for giving us the opportunity to visit Davao. From City Hall we just crossed the street to go to San Pedro Cathedral. Then we...More"
	},
	{
		"User": "STCast25",
		"Location": "Kawit, Philippines",
		"DateofReview": "December 2, 2016",
		"ReviewTitle": "Shrine for St. Peter",
		"Review": "The cathedral hasn't changed much, except for the altar (which is not distinguishable from new and ornate altars churches have been acquiring in recent decades) since I last visited it in the 1990s. There are a lot to be improved in the cathedral in terms...More"
	},
	{
		"User": "Carmina E",
		"Location": "Manila",
		"DateofReview": "November 21, 2016",
		"ReviewTitle": "Thank you Lord for making me see Davao",
		"Review": "At the center of town, right across City Hall, this Catholic Church is a monument of the piety and devotion of Davaoenos."
	},
	{
		"User": "lambourne717",
		"Location": "Brisbane, Australia",
		"DateofReview": "November 6, 2016",
		"ReviewTitle": "In a tourist area",
		"Review": "Close to other attractions and free entry. You're so close you may as well take 5 minutes here. Spanish architecture."
	},
	{
		"User": "Christine F",
		"Location": " ",
		"DateofReview": "November 5, 2016",
		"ReviewTitle": "Sunday Mass",
		"Review": "We had a chance to hear mass in San Pedro Cathedral during our stay since it was near our hotel. Good thing is they have schedule for \"english\" because we are from Manila. Very convenient because there were fastfood chains nearby where you can eat...More"
	},
	{
		"User": "batgurlaloo",
		"Location": "Manila, Philippines",
		"DateofReview": "October 24, 2016",
		"ReviewTitle": "A must visit Church in Davao City !!!",
		"Review": "The San Pedro Cathedral in Davao City is located at the middle of the busy city, just across the City Hall. The church has a nice architecture where the pews are in a circular arrangement that gives a perfect emphasis on the altar. Before you...More"
	},
	{
		"User": "Inday23",
		"Location": "New York City, New York",
		"DateofReview": "October 18, 2016",
		"ReviewTitle": "Love this catholic church, very solemn and very convenient.",
		"Review": "If you are catholic, this is the best church to visit, it's centrally located near City Hall. Just a walking distance from Grand Menseng Hotel."
	},
	{
		"User": "filipin0traveller",
		"Location": "manila",
		"DateofReview": "September 30, 2016",
		"ReviewTitle": "Popular Cathedral",
		"Review": "The priest was right on spot when he noticed that many tourists attended mass on that Sunday afternoon. This was mainly because of the chance to attend a mass and at the same time visit many other attractions."
	},
	{
		"User": "77Raine27",
		"Location": "Cavite Province, Philippines",
		"DateofReview": "September 9, 2016",
		"ReviewTitle": "Nice time to Reflect",
		"Review": "Part of the city tour is a visit to San Pedro Cathedral. After my trip to Garden Island of Samal, this was my only time to thank God for all HIs blessings and pray for my personal intentions. Got so caught up with tour and...More"
	},
	{
		"User": "Lina Gladys L",
		"Location": "Manila, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "solemn place to pray",
		"Review": "its very easy to find. and its a good place to pray for. i like taking photos inside a church and i did it in the cathedral,"
	},
	{
		"User": "Davao City, Davao City, Philippines",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "August 23, 2016",
		"ReviewTitle": "One of the oldest church in Davao",
		"Review": "Just very near the city hall and there are other parks nearby. Davao Museum is just a walk away from the cathedral."
	},
	{
		"User": "Kaysha Y",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 1, 2016",
		"ReviewTitle": "place for religious people",
		"Review": "This place is for all your needs if your a religious person, you can buy candles anywhere children will sell you candles and small stores sell all kinds of ornaments from candles to religious figures."
	},
	{
		"User": "Justine F",
		"Location": " ",
		"DateofReview": "July 15, 2016",
		"ReviewTitle": "WORTH A FAMILY VISIT",
		"Review": "The church offer holy masses in different languages and in different time slots. Many people frequent the church especially during Sundays. The church is clean and organized...."
	},
	{
		"User": "virstud",
		"Location": "Caloocan",
		"DateofReview": "July 14, 2016",
		"ReviewTitle": "Oldest cathedral in Davao City",
		"Review": "The cathedral is located near the city hall. It is said to be the oldest cathedral in the city. It is one of the popular tourist attraction in the city also."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 7, 2016",
		"ReviewTitle": "The current design is that of a boat! I liked the original one",
		"Review": "I am a devout Catholic, so any Cathedral is a special place of worship. I used to regularly attend Sunday masses in the evening here but when I shifted to morning services I move from Ateneo de Davao Chapel and the Sta Ana Parish. Most...More"
	},
	{
		"User": "tolentinomaldex",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "July 6, 2016",
		"ReviewTitle": "Round formed cathedral",
		"Review": "The cathedral is located in front of Davao City Hall. After goong to church you can have you meals at the popular Kulasa's."
	},
	{
		"User": "rickyrose",
		"Location": "pasay, philippines",
		"DateofReview": "July 3, 2016",
		"ReviewTitle": "Not ancient",
		"Review": "This is a modern Church compared to other Cathedrals in the country. It is located right in the heart of downtown of Davao City."
	},
	{
		"User": "aprilsky2016",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 1, 2016",
		"ReviewTitle": "A place of worship at the heart of the city.",
		"Review": "The cathedral is very accessible and properly ventilated. It is open daily to the public. The architectural structure is outstanding. Many devotees go to mass here but since it is at the heart of the city and just along the street, you can here the...More"
	},
	{
		"User": "gabbyxiu",
		"Location": "Surabaya, Jawa Timur, Indonesia",
		"DateofReview": "July 1, 2016",
		"ReviewTitle": "Beautiful Cathedral",
		"Review": "Awesome cathedral, classic like Rome in Davao. We prayed, enjoy here. Many visitors in sunday. Have parking area but full of people. So far, we love this place, near people park (walk 5 min)"
	},
	{
		"User": "ryandgreat",
		"Location": "Makati, Philippines",
		"DateofReview": "June 28, 2016",
		"ReviewTitle": "the feast",
		"Review": "went there last Sunday for the first time! we heard the english mass, the church is located near the people's park and davao city hall, although located in a busy area, there is quiet place in the church for praise and worship"
	},
	{
		"User": "Cebu City, Philippines",
		"Location": "Cebu City, Philippines",
		"DateofReview": "June 5, 2016",
		"ReviewTitle": "A Testament that interfaith can peacefully co-exist ",
		"Review": "The church is very contemporary in the sense that its not a colonial atone church. And design motifs from other faith were incorporated in the architecture."
	},
	{
		"User": "daveholden",
		"Location": "Lake Forest, California",
		"DateofReview": "May 30, 2016",
		"ReviewTitle": "The cathedral was packed for services",
		"Review": "This cathedral is at the very heart of the city. It is surrounded by vendors of every kind which is a little strange. Once you get past the entrance you can feel the religious importance. The outside of the building could use a little freshening...More"
	},
	{
		"User": "Bon S",
		"Location": " ",
		"DateofReview": "May 23, 2016",
		"ReviewTitle": "A place to reflect",
		"Review": "It was a Sunday when I arrived in Davao so I decided to go to church. As I am searching in the net for the nearest church, I came across San Pedro Cathedral. The church has good architecture style and I was privilege because the...More"
	},
	{
		"User": "Aphio1925",
		"Location": "United Kingdom",
		"DateofReview": "May 21, 2016",
		"ReviewTitle": "Sanctuary",
		"Review": "A place where you seek guidance from the Almighty. Situated at the heart of downtown area of Davao City."
	},
	{
		"User": "Katrina08_23",
		"Location": "Davao City",
		"DateofReview": "April 25, 2016",
		"ReviewTitle": "The heart of Davao!",
		"Review": "I just wondering though why the pic did not show the Cathedral instead this might give an impression that the Sangunian is our Cathedral. I' giving it 3 star for the misleading pic but San Pedro Cathedral is a place of worship, must visit it...More"
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 5, 2016",
		"ReviewTitle": "A symbol of faith and strength",
		"Review": "This cathedral was built long time ago and this symbolizes strength and faith in God. The cathedral is open for public to just get inside and offer prayers."
	},
	{
		"User": "Racq",
		"Location": "Manila, Philippines",
		"DateofReview": "March 5, 2016",
		"ReviewTitle": "Peaceful",
		"Review": "The church is clean even if there are lots of people on a Sunday morning. While seating and praying, I find the Cathedral a peaceful place."
	},
	{
		"User": "mnjensen",
		"Location": "Odense, Denmark",
		"DateofReview": "February 27, 2016",
		"ReviewTitle": "Nice looking Cathedral",
		"Review": "Not so much into church sightseeing - but compared to the other attractions in Davao worth a visit. I especially like the look of the building from the outside."
	},
	{
		"User": "larry0123",
		"Location": "Overland Park, Kansas",
		"DateofReview": "February 19, 2016",
		"ReviewTitle": "love the shape",
		"Review": "nothing gets to you like the shape. i walked all around it and then inside not much to the inside but that it is a big church. i am glad i went but d'bone collector nearby made this worth it"
	},
	{
		"User": "Jake2014jake",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 2, 2016",
		"ReviewTitle": "Oldest church in Davao City but looks contemporary.",
		"Review": "The Cathedral is located at San Pedro Street just across the City Council building and the Commemoration Marker Statue. While allegedly the oldest church in Davao City and built in 1847, it is a far cry from the really old and preserved churches in the...More"
	},
	{
		"User": "San Antonio, Texas",
		"Location": "San Antonio, Texas",
		"DateofReview": "January 14, 2016",
		"ReviewTitle": "Church in the heart of downtown",
		"Review": "Close to city hall and China Town. We took some pictures from the outside, but didn't enter as they had services ongoing."
	},
	{
		"User": "Elmo B",
		"Location": "Manila, Philippines",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "Busy Church",
		"Review": "Right at the heart of the city, across Davao City Hall, Davao City Council and Rizal Park. Be wary of beggars and peddlers around that will try to call your attention. Going to this church on a vehicle may require you to go through heavy...More"
	},
	{
		"User": "jed1017",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "October 29, 2015",
		"ReviewTitle": "Closed",
		"Review": "Why in the world would a church be closed? There are some adoration chapels beside it but I still don't understand why will they close a church? It's not even under renovation."
	},
	{
		"User": "Vince M",
		"Location": " ",
		"DateofReview": "September 20, 2015",
		"ReviewTitle": "Take time to see",
		"Review": "A sacred edifice to catholics just within the compound of the city hall and the council hall of Davao City. If you are into arts and architectures, this is a must to see."
	},
	{
		"User": "Than T",
		"Location": "Manila, Philippines",
		"DateofReview": "August 13, 2015",
		"ReviewTitle": "Repository of Beggars",
		"Review": "I would call myself somehow religious because I include a church visit in all my itineraries. This noted church is on top of the list in any visit to Davao. I like Davao City because I see no beggars in the streets. But I was...More"
	},
	{
		"User": "Kris_ianne",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 12, 2015",
		"ReviewTitle": "Faith Of A Filipino - Davaoeños",
		"Review": "A Catholic Church in the Heart of the City. People who are religious and saying their prayers for the Lord"
	},
	{
		"User": "Vsevolod L",
		"Location": " ",
		"DateofReview": "July 27, 2015",
		"ReviewTitle": "Best thing in Davao",
		"Review": "I think this church is very nice and intresting. Definitely the best thing I saw in Davao. One of my favorite churches in the world now."
	},
	{
		"User": "Richthof R",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 26, 2015",
		"ReviewTitle": "where most people go to church",
		"Review": "If your a Roman Catholic, this is your church to be, the oldest one in the city where most of the people resides near there attend mass. It is where most of the confirmation took effect and one of the most that brings out the...More"
	},
	{
		"User": "melds67",
		"Location": "Bendigo, Australia",
		"DateofReview": "May 20, 2015",
		"ReviewTitle": "Good place for meditation ",
		"Review": "Aside from being a historical church, the ambiance and beauty is being preserved always. I have to visit the place again after 14years been away from Davao. If you need serenity and peace in life; the best place to say your prayers and wishes. Don't...More"
	},
	{
		"User": "Lulubelle R",
		"Location": " ",
		"DateofReview": "May 18, 2015",
		"ReviewTitle": "quite",
		"Review": "there is a mass held everyday at 6am. so if you are an early riser you can start the day with a mass before you eaty our breakfast. Just a stone throw away from Bahay ni Tuding."
	},
	{
		"User": "Limay, Philippines",
		"Location": "Limay, Philippines",
		"DateofReview": "April 20, 2015",
		"ReviewTitle": "Silences your heart for a little while",
		"Review": "The oldest church in Davao City really makes you meditate and think about a lot of things. despite being on the façade of the noisy city hall and osmena park, it is still a nice respite from the hustle and bustle of city life."
	},
	{
		"User": "jeanjer2010",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 18, 2015",
		"ReviewTitle": "Weekly schedule for my family!",
		"Review": "Nice, peaceful & very wide to accommodate church goers! Very accessible to everyone. Safe because a lot of Policemen are watching for the orderly of the place."
	},
	{
		"User": "James G",
		"Location": "Manila, Philippines",
		"DateofReview": "April 16, 2015",
		"ReviewTitle": "Nice Interior and Exterior",
		"Review": "A nice place to give thanks to God (especially during the morning where there aren't many people around). Visited this place around 7AM since it was just a few blocks away from Bahay ni Tuding (the inn where we stayed at). If you pay attention...More"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 25, 2015",
		"ReviewTitle": "the weirdest cathedral in the world",
		"Review": "from the outside it looks like an ugly spaceship. but inside it is really nice and big, if you are a catholic a must see"
	},
	{
		"User": "Albert A",
		"Location": "Quezon City, Philippines",
		"DateofReview": "February 23, 2015",
		"ReviewTitle": "Sunday Assembly",
		"Review": "the roads in the area are all one-way. The church area is barricaded to afford room for people going to hear mass. Its monument in its own right. Everything is old but preserved, and rich in history."
	},
	{
		"User": "parttimefilo",
		"Location": "Coventry, United Kingdom",
		"DateofReview": "February 19, 2015",
		"ReviewTitle": "archetecture",
		"Review": "beautiful building erupting from the city streets it has the feel and strength of the philippine culture"
	},
	{
		"User": "adangoyjr",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "February 12, 2015",
		"ReviewTitle": "A Main Landmark in Davao",
		"Review": "A must visit in Davao even if you are not Catholic. The church interior is good particularly at night when the lights are turned on."
	},
	{
		"User": "MsManang",
		"Location": "Houston, Texas",
		"DateofReview": "February 4, 2015",
		"ReviewTitle": "Old church revisit",
		"Review": "the church is very open to public..it has been there a long time and many find visits here are calming to the souls of the weary whether you are just a tourist or native davaowenians up and about the city."
	},
	{
		"User": "Samy N",
		"Location": " ",
		"DateofReview": "November 21, 2014",
		"ReviewTitle": "Great & Peaceful",
		"Review": "Such a great peaceful place, deserves to visit, it's constructed in an amazing design to looks like umbrella , and from inside looks very luxury."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "November 12, 2014",
		"ReviewTitle": "Beautiful Old Cathedral",
		"Review": "This is well worth visiting and is a beautiful cathedral. Some lovely statues adorn the inside and it is very peaceful once you get through the grounds where they sell religious figures and candles to burn to the right of the entrance. The only thing...More"
	},
	{
		"User": "Cebu City, Philippines",
		"Location": "Cebu City, Philippines",
		"DateofReview": "November 2, 2014",
		"ReviewTitle": "Oldest church of Davao",
		"Review": "Since im used to visiting old churches,this one doesn't really \"look as old\" as the ones iv visited (cebu and other parts of the visayas). The outside looks \"unfinished\" while the interiors are quite nice. Seems they've been doing renovations as the inside of the...More"
	},
	{
		"User": "Christine C",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 3, 2014",
		"ReviewTitle": "A BEAUTIFUL AND HOLY PLACE",
		"Review": "I visit San Pedro Cathedral on every visit to Davao. I grew up in this church with my family. I always light a candle and offer a prayer for my whole family."
	},
	{
		"User": "TravelBug1469",
		"Location": "Manila, Philippines",
		"DateofReview": "September 24, 2014",
		"ReviewTitle": "Cultural Treasure",
		"Review": "San Pedro Cathedral is said to be the oldest church in Davao and a historical landmark. Its original structure built in 1847 along - what was believed to be the oldest street in Davao - the San Pedro Street, had been re-built many times.The present...More"
	},
	{
		"User": "raymmiconmapper",
		"Location": "Bacolod, Philippines",
		"DateofReview": "September 13, 2014",
		"ReviewTitle": "Iconic & modern church",
		"Review": "in honor of Davao's patron saint San Pedro,the cathedral is a not to be missed edifice,located along San Pedro street very near city hall in the bustling city proper.Hundreds of devotees, churchgoers & visitors troop to this modern & iconic church with a boat structured...More"
	},
	{
		"User": "Yuna Y",
		"Location": "Manila, Manila, Philippines",
		"DateofReview": "August 21, 2014",
		"ReviewTitle": "San Pedro Cathedral",
		"Review": "located in the heart of Davao City. One of the biggest church and the place where you can find peace from the busy street. One of the historical places too."
	},
	{
		"User": "Joseph Bernard A",
		"Location": "Marawi, Philippines",
		"DateofReview": "July 28, 2014",
		"ReviewTitle": "Nice and Quiet",
		"Review": "When i went here, it was nice and quiet. I love going to this church because of its quietness and serenity that you feel whenever you go inside and have prayer."
	},
	{
		"User": "JEmmanuelLasPinas",
		"Location": "Las Pinas",
		"DateofReview": "June 21, 2014",
		"ReviewTitle": "Stop by for a moment of prayer",
		"Review": "The church is centrally located in downtown Davao city just a stone's throw away from the City Hall. Very accessible."
	},
	{
		"User": "MelP160",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 5, 2014",
		"ReviewTitle": "\"Km Zero\" of Davao City",
		"Review": "My \"Kilometer Zero\" of Davao because it is where the first settlers set up residence. To this day, the cathedral is still the locals place of worship. Take the time to check out the side chapel on the right, next to the candle section. This...More"
	},
	{
		"User": "PIO C",
		"Location": "Edinburg, Texas",
		"DateofReview": "August 17, 2013",
		"ReviewTitle": "refer below",
		"Review": "just an average catholic church in the city.was told by a cab driver that there are two catholic churches with A/C within the city,as well."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "May 12, 2013",
		"ReviewTitle": "At the heart of the city",
		"Review": "Everyone can access whenever they come to Davao City before their shopping itinerary. It can accommodate more people. A very nice architectural design with large open sides to get more air. Best place to attend mass at its schedule."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 15, 2013",
		"ReviewTitle": "A holy place",
		"Review": "When lonely and sad and happy too - go to church and pray. Right in the center of the city. A holy place with daily masses."
	},
	{
		"User": "6452",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 2, 2013",
		"ReviewTitle": "Must visit when in Davao",
		"Review": "The first place my family and I visited when we arrived in Davao was San Pedro Cathedral.That is to thank God for our safe trip. It is located in the heart of the city. It is in front of Sangunihan Panlunsod or the City Council...More"
	},
	{
		"User": "mzzyap8",
		"Location": "Philippines",
		"DateofReview": "April 24, 2012",
		"ReviewTitle": "You can't miss the shape of San Pedro Cathedral:)",
		"Review": "Kinda like an onion or a lotus flower; ones imagination can go on and on:) I came here to Thank God for a safe trip to Davao, my family's first time in Mindanao. Lots of jeepneys ply this route---within walking distance are parks, museum, government...More"
	},
	{
		"User": "davao city",
		"Location": "davao city",
		"DateofReview": "September 12, 2011",
		"ReviewTitle": "Biggest church in davao",
		"Review": "The cathedral is newly renovated and the altar is newly designed. The new altar has a very elegant and flashy design, sooo much different from the old one which was very simple. It's very interesting to visit this church specially during sunday when it's filled...More"
	}
]
