[
	{
		"User": "Rizwan E",
		"Location": "Karachi, Pakistan",
		"DateofReview": "December 9, 2016",
		"ReviewTitle": "Sad conditions",
		"Review": "A lot of history at this part of Davao; the beach and the park, as I read about it and headed towards it after reading visitor reviews. Of course these reviews were of 2011 and alot had changed since then. This place is in ruins. The ostriches look sad and the park is in a dilapidated condition. The water has had its way with the wall separating the park and the ocean. No rest rooms or benches.\r But like many visitors; regular and new, I must say that the view of the ocean is nevertheless relaxing, calm & alluring."
	},
	{
		"User": "Werner I",
		"Location": "Karlskoga, Orebro Lan, Sweden",
		"DateofReview": "November 14, 2016",
		"ReviewTitle": " Beautiful but dirty",
		"Review": "This is a must to visit place to visit in Davao. Very peaceful and fresh wind at seaside. It's a shame nobody repair anything last 10 years. It could be so much better. But it's worth a visit anyway. Just take a jeep from city to Matina Aplaya and ask drive stop near Baywalk. It's only 100 meter walk "
	},
	{
		"User": "Piumal T",
		"Location": "Vilnius, Lithuania",
		"DateofReview": "October 18, 2016",
		"ReviewTitle": "Go Chill and Relax",
		"Review": "This was my favorite place to go and chill in the evenings in Davao. The place is very relaxing and lot's of people are coming to jog and spend the evening too. The sea, monumnents, small zoo and everything makes this a nice place"
	},
	{
		"User": "havegutwilltravel",
		"Location": "Alor Setar, Malaysia",
		"DateofReview": "July 3, 2016",
		"ReviewTitle": "baywalk with bustling activities",
		"Review": "A stroll in late afternoon is a right thing to do here...bustling with activities along the bay such as sepak takeaway games, aerobatic ,roller skating..you can see a harbour from here .."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 23, 2016",
		"ReviewTitle": "It's a place good for lovers",
		"Review": "Watching the seawaters while seated with a special someone is an unforgettable moment. This place is romantic."
	},
	{
		"User": "Manay",
		"Location": "Martinsburg, West Virginia",
		"DateofReview": "March 30, 2016",
		"ReviewTitle": "Sunset Splendor",
		"Review": "If you want to enjoy spectacular sunsets, be sure to take a walk on the Seawalk at that time. Not only is the sunset beautiful, but it's effect on people is also quite positive. It is nice to see people walking and talking pleasantly. I wouldn't mind visiting Davao again just to enjoy the seawalk"
	},
	{
		"User": "Nwrzx",
		"Location": "Jeddah, Makkah, Saudi Arabia",
		"DateofReview": "March 22, 2016",
		"ReviewTitle": "Vacation and pleasure",
		"Review": "Davao is the safest place in Philippine and there are a lot of attractive, don't miss to visit Eden Park and I would recommend to stay in waterfront hotel"
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 22, 2016",
		"ReviewTitle": "Stroll and Enjoy Fresh Sea Breeze",
		"Review": "Sadly recent strong waves destroyed part of the sea wall along the \"bay walk.\" We must tell the Department of Tourism to rehabilitate the area! Nevertheless, it provided us a relaxing stroll along the Davao Gulf and directly across Samal Island! We have our own Statue of David there in all his glory. And if you haven't been to Copenhagen yet, you will find The Little Mermaid serenely sitting by the breakwater! A nice photo opp with the Mermaid and Samal as background"
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "November 21, 2015",
		"ReviewTitle": "the fruitstands are the best here",
		"Review": "just not an exciting place.bit dirty and old. lots of beggars this is more a place for the neigbourhood. the fruitstnds that are abbundant are good to."
	},
	{
		"User": "daveholden",
		"Location": "Lake Forest, California",
		"DateofReview": "October 29, 2015",
		"ReviewTitle": "Worth doing but not a clear winner! ",
		"Review": "The beach is very interesting. You can walk on a concrete pathway right in the water. You will see lots of people sitting bench after bench ... Kids out playing and the occasional beggar. I don't know what I was expecting but it was somewhat dissatisfying ... Still, go there! "
	},
	{
		"User": "JEmmanuelLasPinas",
		"Location": "Las Pinas",
		"DateofReview": "August 31, 2015",
		"ReviewTitle": "Great for a late afternoon or early evening stroll",
		"Review": "The best thing about the Davao baywalk is that it's free. Take a leisurely stroll in the late afternoon or early evening. People watch or take in the sunset sky."
	},
	{
		"User": "Mark L",
		"Location": "Bulacan Province, Philippines",
		"DateofReview": "July 30, 2015",
		"ReviewTitle": "This could a been a great place.... but...",
		"Review": "...no. This place is like taken for granted. The David statue is remarkably sexy but the place is like unfinished. The basin around David is dry. There are some animals there. Some ostrich, sheep, and chicken, tables and chairs that is good for picnic, and...More"
	},
	{
		"User": "yasameen_desu",
		"Location": "Manila, Philippines",
		"DateofReview": "February 24, 2015",
		"ReviewTitle": "Worth visiting for the sake of rarity of the replica but the place is highly disappointing, dull and dirty.",
		"Review": "The statue of David and the Little Mermaid cannot be easily found anywhere in the Philippines. Considering that this site is one of the few places where replica of the statue of David is found, the place is so undeveloped. The only reason it is...More"
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "February 1, 2015",
		"ReviewTitle": "David by the Sea",
		"Review": "Well, there's the gigantic (tackily replicated) statues of Michaelangelo's David facing Davao Gulf and unusually diminuitive copy of Hans Christian Andersen's Little Mermaid. Nothing much to see aside from the said characters. Just interesting to see them in this city of durian, Phil Eagles and...More"
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "January 10, 2015",
		"ReviewTitle": "Cheap Date Destination",
		"Review": "You will see: Statue of David - A 20-ft Golden Naked Man Little Mermaid - replica of Denmark's Little Mermaid Resto bars Street food and coolers. Bench with roofs. And a lot of young crowds."
	},
	{
		"User": "dog2015",
		"Location": "dde",
		"DateofReview": "January 6, 2015",
		"ReviewTitle": "ostriches",
		"Review": "The place reeks of ostrich crap. Why is one of the most dangerous birds on the planet allowed to roam free here? Is that statue really necessary? Places to sit are few and far between that is unless you want to look and smell some...More"
	},
	{
		"User": "Angelito P",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "September 12, 2014",
		"ReviewTitle": "David is watching",
		"Review": "The center of attraction here is a giant statue of David, rendered in bronze color, altho most likely made of concrete. Friends tell me that when the park opened, the prude elder folks had David's private parts covered since they found that a statue with...More"
	},
	{
		"User": "MushPanjwani",
		"Location": "Hong Kong, China",
		"DateofReview": "May 24, 2014",
		"ReviewTitle": "Beautiful sunrise over the bay!",
		"Review": "If you like sunrises, you'd love the Baywalk in Davao. Get there at sunrise and you'll see the Statue of David glistening in the light. You have the bay in front, sunrise and te Mermaid of Copenhagen on the left, and views of Mount Apo...More"
	},
	{
		"User": "Telai J",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 3, 2013",
		"ReviewTitle": "Best Time to go is Sunrise",
		"Review": "there's nothing much to do there except take a picture with the giant statue of David, and the Little Mermaid replicas. there used to be baby sharks in the small pool leading to the beach, but they're no longer there. it's just basically a baywalk...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "March 23, 2013",
		"ReviewTitle": "Deserted.. needs maintenance",
		"Review": "What a pity. This could be a very nice place for everyone. Sea breeze, big open space, many people will be happy to stay here for a walk, or picnic or just to pass the time. The naked statue is not the issue. It looks...More"
	},
	{
		"User": "balmix_turistas",
		"Location": "Quezon City, Philippines",
		"DateofReview": "February 15, 2013",
		"ReviewTitle": "A bit disappointed",
		"Review": "We just dropped by this place on our way to the bus station at noon time and we ended up disappointed. The pond is dry. It looks deserted. I hope they could restore this park. At least the replica of David is here for some photo ops."
	},
	{
		"User": "EllaR0787",
		"Location": "Batac, Ilocos Norte, Philippines",
		"DateofReview": "August 28, 2012",
		"ReviewTitle": "take a walk...",
		"Review": "The Davao Baywalk shows historical persons like the giant replica of David's statue. It's a typical park by the way except for this statue that is seen only in 3 places in the world..."
	},
	{
		"User": "imojen",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 15, 2012",
		"ReviewTitle": "What could be!",
		"Review": "I have been down along here many times and it is upsetting that a beach front should be in this state. The blame can be attributed to the two treasure finds made in that area during CONSTRUCTION, once they were recovered then the CONSTRUCTION efforts kind of dried up. \r This area has huge potential to be a great place for families to picnic and enjoy the scenery.\r It needs to be given to an entity that is interested in seeing its potential as a tourist and activity area for locals and tourists to enjoy.\r If you have any ideas on what you'd like to see happen here then please let me know. Jake"
	},
	{
		"User": "JD1TRAVELLER",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 1, 2012",
		"ReviewTitle": "It's a pity",
		"Review": "we used to jog every morning at baywalk until recently.we always find the place dirty,filled with balut shells,empty beer bottles and cigarettes.no washroom to relieve oneself if the need arises.the issue of reclaiming the sea doesnt sit well with us also"
	},
	{
		"User": "Michelle S",
		"Location": "Manila, Philippines",
		"DateofReview": "March 23, 2012",
		"ReviewTitle": "sad",
		"Review": "the baywalk used to be awesome when there were still some stands there. nowadays people just go for the david's sculpture and the exact replica of the little mermaid from denmark"
	},
	{
		"User": "Davao",
		"Location": "Seattle",
		"DateofReview": "February 18, 2012",
		"ReviewTitle": "Nice view, but not much else",
		"Review": "Went there around dusk. The view was nice, but other than that... Not much to see there. There were a few beggar children hanging around, so if plan to give them some pesos, it's best to put some pesos in your pocket so you aren't digging through your belongings along the walkway."
	}
]
