[
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "Reviewed October 15, 2017 ",
		"ReviewTitle": "Peace and Quiet",
		"Review": "The place has become even more popular and people come here for Sunday mass. Parking can be a bit difficult because of the number of visitors. The outdoor setting is great for those who just want to listen to the mass and say their prayers in private. A great place to visit for some solitude, peace and quiet."
	},
	{
		"User": "Harlem Ray D",
		"Location": " ",
		"DateofReview": "Reviewed July 29, 2017 ",
		"ReviewTitle": "Peaceful and Calm",
		"Review": "The place is simply reffered to as 'Shrine' by locals like me. The same could even apply to taxi when you intent to visit there. Just say 'Shrine' and more often than not you'll get their.\r \r HOW TO GET THERE!\r As far as my memory could go back no jeepny route has ever been established there. So if the luxury of time is on your side here is a more adventurous way to go up the Shrine hills.\r \r 1. From wherever you are in the city so long as you read the sign board 'Matina' your in lock. Just tell the jeepny conductor or the driver to be dropped by 'kanto Shrine'.\r \r 2. Now the fun part. Ride a tricycle up. I tell you its breath taking. Literally. On top of that is the fare of 7pesos only. So tourist please be generous a bit. Its criminally cheap for what the ride up offers. Your prayers start from here.\r \r 3. Way of the cross. Ascending up the hill are stations of the cross. A good reason to walk your way up Shrine."
	},
	{
		"User": "elviep2014",
		"Location": " ",
		"DateofReview": "Reviewed May 28, 2017 ",
		"ReviewTitle": "Very serene place",
		"Review": "We were lucky to catch a mass when we arrived around 5 pm. The place have at least 4 altars for worshipping and dropping mass offerings and petitions. You can feel a sense of peace in the area. Close to Jack Ridge so you can go straight to the restaurant after visiting the Shrine. Just make sure that you don't go to the Shrine too late as they might be closed around 6 pm."
	},
	{
		"User": "Marlita C",
		"Location": " ",
		"DateofReview": "Reviewed October 19, 2016 ",
		"ReviewTitle": "I go here to PRAY",
		"Review": "For us Dabawenyos we go here when we want to do novena for special problems or petitions. It is very quiet place ideal for prayer."
	},
	{
		"User": "Sol P",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed September 4, 2016 ",
		"ReviewTitle": "A Place to Meditate",
		"Review": "It's a place to be with yourself whether you want to pray, meditate or just take time of silence. Overlooking the City of Davao and just a 30 minutes away from the City. You Can buy food outside the Shrine, can ride Taxi or tricycle."
	},
	{
		"User": "atrielle",
		"Location": " ",
		"DateofReview": "Reviewed August 4, 2016 ",
		"ReviewTitle": "Peaceful Commune with the Creator",
		"Review": "The place sits on top of a hill, it's so peaceful and quiet. Here one can commune with the Creator, far from noise and any distraction. Stay for at least 30 minutes and soak yourself with peaceful meditation it will work wonders for your soul."
	},
	{
		"User": "Michael L",
		"Location": " ",
		"DateofReview": "Reviewed July 11, 2016 ",
		"ReviewTitle": "SOLEMNITY AT ITS BEST",
		"Review": "If you want to have a good communication with God, then this is the best place to be. But it is best not to join the crowd, the best is to go there alone or with your family"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed June 9, 2016 ",
		"ReviewTitle": "Holy grounds.",
		"Review": "A must see place for devotees. The place is very solemn and ideal for meditation. It is surrounded by trees and is located on top of the hill overlooking Davao City."
	},
	{
		"User": "Jonathan Christ... B",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed March 23, 2016 ",
		"ReviewTitle": "A BREATH OF FRESH AIR",
		"Review": "I used to climb the shrine hill from our hours literally on the foot this hill. It is a little bit trick climb but it is worth it when arrive there. The is so peaceful and quiet. It is place you can stay for hour without getting bored. You can bring light snack and have a little gathering . but the main purpose of your visit is to reflect and recollect for those religious a time to be with the lord. Perfect for families and couple even singles."
	},
	{
		"User": "IanE4",
		"Location": "Melbourne, Australia",
		"DateofReview": "Reviewed February 17, 2016 ",
		"ReviewTitle": "Spiritual Destination",
		"Review": "This is a place to visit if you want to be close to God, I visit this Shrine every time that I am in Davao. It is a very meditative experience."
	},
	{
		"User": "kiwiboyz12",
		"Location": " ",
		"DateofReview": "Reviewed January 28, 2016 ",
		"ReviewTitle": "A serene place with lots of space",
		"Review": "Visited on a Sunday for the 12pm English Mass & even though we were 30 minutes early it was packed & no seats. The service was very good & it was nice to sit back & give thanks for everything.A must visit if you are in Davao."
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed December 12, 2015 ",
		"ReviewTitle": "Fantastic view",
		"Review": "the view is fantastic! it is a nice place to meditate or just to relax. the wind is nice and cool. just a good place"
	},
	{
		"User": "MarieMarc2014",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "Reviewed November 25, 2015 ",
		"ReviewTitle": "One of a kind",
		"Review": "This shrine is different from the others as it is wide and the prayer areas are separate from each other. I was also impressed that the these areas are not enclosed by walls as it give people the chance to appreciate the calm place while praying."
	},
	{
		"User": "lanaval",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed November 16, 2015 ",
		"ReviewTitle": "Solemn visit",
		"Review": "It was my first time here and I appreciate the solemnity of the place . The area is expansive and relaxing which offers good chance for contemplation and prayers."
	},
	{
		"User": "Lenore B",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "Reviewed November 12, 2015 ",
		"ReviewTitle": "serene place",
		"Review": "The place is located at the top of the hill and you can feel the calmness and serenity of the place. The air circulates freely and this is an ideal place to meditate and give thanks."
	},
	{
		"User": "Houston, Texas",
		"Location": "Houston, Texas",
		"DateofReview": "Reviewed September 17, 2015 ",
		"ReviewTitle": "Beautiful Adoration",
		"Review": "I've read about this shrine for most of my life and finally got a chance to see it for myself. It is a beautiful shrine and lived up to my expectation with gold leaf alter pieces and statuary and the Infant. Many were there to pray and reflect. Worth the stop regardless of your faith tradition, but especially meaningful if you are Catholic."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "Reviewed June 7, 2015 ",
		"ReviewTitle": "Quiet retreat",
		"Review": "Just 15 minutes away from downtown Davao, the Shrine is one place where you can have a quite prayer, intimate conversation with your loved one, or simple just have a late afternoon meditation with a great view of the southern part of the city."
	},
	{
		"User": "Peter S",
		"Location": "Tasmania, Australia",
		"DateofReview": "Reviewed May 3, 2015 ",
		"ReviewTitle": "Moving",
		"Review": "A unique experience, the most holy place in Davao. So quiet you can feel the reverence that the faithful; have for this place. A place I felt truly at peace."
	},
	{
		"User": "KRDL",
		"Location": "Limay, Philippines",
		"DateofReview": "Reviewed April 20, 2015 ",
		"ReviewTitle": "A silent place to meditate",
		"Review": "For people who want to really be on the silent retreat, I highly recommend this place. It is indeed far away from the city center but it's all worth it!"
	},
	{
		"User": "James G",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed April 16, 2015 ",
		"ReviewTitle": "Serene and Quiet Place",
		"Review": "Went here with my family to give thanks for all the blessings we have received. The place is wonderfully kept clean and neat. You'll definitely feel the calmness of the place so it's quite nice to really get deep in words and reflect. You can...More"
	},
	{
		"User": "Aton T",
		"Location": " ",
		"DateofReview": "Reviewed March 8, 2015 ",
		"ReviewTitle": "Peaceful and quiet",
		"Review": "Very peaceful and quiet and wide and green. Its like you could actually send your prayers straight to heaven, like you can hear Him whisper in your ears. Beautiful place to meditate and pray."
	},
	{
		"User": "TayNayNak",
		"Location": "Luzon, Philippines",
		"DateofReview": "Reviewed March 1, 2015 ",
		"ReviewTitle": "So many chapels inside this beautiful place",
		"Review": "Chapels abound inside this beautiful and sprawling property, makes for good spiritual and physical exercise. I would probably visit, pray and meditate here everyday if I lived in Davao City."
	},
	{
		"User": "parttimefilo",
		"Location": "Coventry, United Kingdom",
		"DateofReview": "Reviewed February 19, 2015 ",
		"ReviewTitle": "beautiful setting",
		"Review": "very nice place well set out even for an atheist just a beautiful parkland setting with interesting little chapels strewn about the property"
	},
	{
		"User": "Oslo, Norway",
		"Location": "Oslo, Norway",
		"DateofReview": "Reviewed February 18, 2015 ",
		"ReviewTitle": "Good Place to Kick Back and THINK.",
		"Review": "This is a nice place to walk around and do nothing. Grassy, quiet with several chapels. We found a nice place to sit and just relaxed for awhile and it was great. Very peaceful and worth the stop."
	},
	{
		"User": "alexarian",
		"Location": "Cebu City, Philippines",
		"DateofReview": "Reviewed November 2, 2014 ",
		"ReviewTitle": "Green, wide open space",
		"Review": "Abit Far. You can drop by here on your way outside the city. I think this one is near an overlooking resto that i missed."
	},
	{
		"User": "Christine C",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed October 3, 2014 ",
		"ReviewTitle": "QUIET, BEAUTIFUL AND PEACEFUL",
		"Review": "This is a great religious experience. Quiet, peaceful and beautiful. You can meditate, pray and get close to god."
	},
	{
		"User": "raymmiconmapper",
		"Location": "Bacolod, Philippines",
		"DateofReview": "Reviewed September 20, 2014 ",
		"ReviewTitle": "a place for prayer & meditation",
		"Review": "the shrine is located on a hill,shady & quite place..attended a novena & afternoon anticipated mass..ample parking space & well kept ground & lawn,the choir sings beautiful & solemn hymms..I suggest they put more lamp posts or street lights outside the shrine, an advantage during...More"
	},
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "Reviewed August 29, 2014 ",
		"ReviewTitle": "Lots to see around",
		"Review": "This place had certainly grown from when I first visited. There's more to see now, but if you don't like crowds, then a visit at night might be better. This one certainly gets packed when there are big events in Davao such as the recent...More"
	},
	{
		"User": "Angelito P",
		"Location": "Muntinlupa, Philippines",
		"DateofReview": "Reviewed August 21, 2014 ",
		"ReviewTitle": "Solemnity",
		"Review": "This is not touristy yet a must see. The sprawling grounds in this place of worship create a prayerful mood. The chapel is packed. The trip up the shrine is made more memorable because one has to arrange private transportation to get there. A side...More"
	},
	{
		"User": "christa d",
		"Location": "Vienna, Austria",
		"DateofReview": "Reviewed July 27, 2014 ",
		"ReviewTitle": "pilgrimage place",
		"Review": "Situated in a park are the shrine, a tent for sermons, a statue of Jesus resurrection and a souvenir shop, where I found a black Jesus. The differences in Catholic churches in the Philippines compared to Spain was my interest to visit this place. As...More"
	},
	{
		"User": "Liza A",
		"Location": "San Jose City",
		"DateofReview": "Reviewed July 16, 2014 ",
		"ReviewTitle": "A time to reflect.",
		"Review": "It sits atop of Davao Matina Hills, a serene place of worship. It is a collection of open air Chapels with no walls bounding it."
	},
	{
		"User": "San Juan",
		"Location": "San Juan",
		"DateofReview": "Reviewed May 15, 2014 ",
		"ReviewTitle": "visit this place- very clean",
		"Review": "On our way to Jack's Ridge we passed by this shrine, but since we're in a taxi, the cab charged us another flag down P40.,for stopping by the shrine. Davao taxi cabs are too much."
	},
	{
		"User": "xChaLeex",
		"Location": "Quezon City, Philippines",
		"DateofReview": "Reviewed September 6, 2013 ",
		"ReviewTitle": "Tranquility",
		"Review": "Beautiful landscapes and the ones you'd see when you are having retreats. Depending on the time of your visit, there will be ongoing mass and everyone is expected not to make a noise. There's like an outdoor place for prayers and feel religious. It is located near Jack's Ridge so the place is atop of Davao City."
	},
	{
		"User": "PanchiFiodorof",
		"Location": "Oberammergau, Germany",
		"DateofReview": "Reviewed September 6, 2013 ",
		"ReviewTitle": "A city of dreams",
		"Review": "This post communist city, plenty of religious images, and full of wonder places, deserve to be walked all along, day and night. To try his people and to enjoy pubs, restaurants, churches, and every place. It's a gift of God in our days. Not less than 3-4 days to visit in a calm walk."
	},
	{
		"User": "igga200",
		"Location": " ",
		"DateofReview": "Reviewed August 3, 2013 ",
		"ReviewTitle": "serene",
		"Review": "a good place to visit for religious people. it was very quiet and not a lot people are there during our visit. it's a shrine so people mostly pray or light a candle. that's about it."
	},
	{
		"User": "Reimmak",
		"Location": "Marikina, Philippines",
		"DateofReview": "Reviewed July 29, 2013 ",
		"ReviewTitle": "Drop by and Pray",
		"Review": "You can never go wrong when you add this in your itinerary. make sure to drop by this Shrine, its not the size that matters but how we give thanks for being safe in every place we go. There is an available parking on the side so you can always ask the cab to wait for you. "
	},
	{
		"User": "Resty2010",
		"Location": "Bangkok, Thailand",
		"DateofReview": "Reviewed May 31, 2013 ",
		"ReviewTitle": "Sacred Place Indeed",
		"Review": "We thanked God for allowing us to visit this religious place where we thanked Him for the very successful family trip/ vacation. the place is sacred and very clean with security and ample place for prayer and meditation and of course photo-taking opportunity."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "Reviewed February 17, 2013 ",
		"ReviewTitle": "Excellent place to meditate",
		"Review": "So close to the city center, overlooking the beautiful Davao and the Gulf. \r \r Even without a mass one feels better to be here. Serene and beautiful place to meditate. Lush green surroundings and the admirable landscape is a great sight.\r \r Best time to come here is when there is the Mass."
	},
	{
		"User": "Ruberto V",
		"Location": "Davao",
		"DateofReview": "Reviewed February 3, 2013 ",
		"ReviewTitle": "That was terrible",
		"Review": "Everything went wrong. I was not comfortable there yeah, it was not a pleasant experience yeah. We'll send you an email to activate your account, so please triple-check that you've typed it correctly."
	},
	{
		"User": "Doha, Qatar",
		"Location": "Doha, Qatar",
		"DateofReview": "Reviewed September 20, 2012 ",
		"ReviewTitle": "best place for prayer and meditation",
		"Review": "for each and every trip that I've done, it is a must for me to visit a church or a sacred place such as this. first time for me to actually find and see an old set up of a church and the people of davao is able to preserve its beauty and serenity. I'm impressed"
	},
	{
		"User": "stevemobeman",
		"Location": "Lakeland, Florida",
		"DateofReview": "Reviewed August 5, 2012 ",
		"ReviewTitle": "The shrine",
		"Review": "Beautiful landscape, views, peaceful serene atmosphere. A great place for a little peaceful meditation & prayer"
	},
	{
		"User": "Rexoy",
		"Location": "Davao",
		"DateofReview": "Reviewed August 1, 2012 ",
		"ReviewTitle": "A wonderful place to pray, reflect and relax",
		"Review": "This is one of Davao's original places to go to when in Davao, its located on top of a hill overlooking Davao, one may hear mass here, pray in any of the chapels or under the coolness of a mango tree, or on a bench...More"
	},
	{
		"User": "Maia_0515",
		"Location": "Davao City",
		"DateofReview": "Reviewed July 2, 2012 ",
		"ReviewTitle": "A Shrine for everyone",
		"Review": "This is a beautiful shrine located on top of the hill which is a walking distance from Jacks ridge. This is a perfect place for meditation, reflection and prayer. There were people who comes over to do picnic though but the place is so huge...More"
	},
	{
		"User": "dianne_tjm",
		"Location": "Central Florida, Florida",
		"DateofReview": "Reviewed April 15, 2012 ",
		"ReviewTitle": "solemn",
		"Review": "im a born again already when i visited this church and i find it so holy n a solemn place i wont hesitate to visit this church when i visit davao again. anyway its not the religion who can save us but our faith n...More"
	},
	{
		"User": "Mark E",
		"Location": "Makati City",
		"DateofReview": "Reviewed March 20, 2012 ",
		"ReviewTitle": "Holy Mass at the Shrine",
		"Review": "We went at the Shrine, as native folks call it, to attend mass. We needed to check the schedule as they hold mass in Visayan and in English. We took the English noon mass. The place was full of trees so you'll feel the breeze....More"
	},
	{
		"User": "Babut_Bacena",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed March 1, 2012 ",
		"ReviewTitle": "Pray a novena",
		"Review": "Given the time, I would have spent time to pray a novena there. Send your petitions and prayers at the Shrine. This is near Jack's Ridge where you can eat great food!"
	},
	{
		"User": "CheParacuelles",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed February 22, 2012 ",
		"ReviewTitle": "SHRINE Davao: Everytime I need a place and time with God and nature",
		"Review": "The HOLY INFANT JESUS of PRAGUE SHRINE is commonly called by the people of Davao as “SHRINE”. The church is wide open, the area looks like a park coz it is wide and big, it has big trees around, bermuda grass, and benches where you...More"
	},
	{
		"User": "davao",
		"Location": "davao",
		"DateofReview": "Reviewed February 11, 2012 ",
		"ReviewTitle": "i feel relaxed and blesses when i am at shrine",
		"Review": "i feel like i am close to heaven when i am there.. since i was 3 my family used to visit here and until now we make it a point to pray and visit the shrine.."
	}
]
