[
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 8, 2017",
		"ReviewTitle": "chowking = very good food",
		"Review": "My family and I went to this mall today to have chow king and it was very good food, from the fried chicken which was my favorite and way better than kfc to the noodles and sioma and rice that were also very tastey, you will not go home hungry because the portions are big and the cost was very reasonable. The service was good, fast and the place was clean. We also did some shoping in the mall after and it was ok, just like all the sm malls are. Some stores had great prices and some were pricey. They also have a neat arcade like place with bumper cars in it that was fun for my kids."
	},
	{
		"User": "arielsanjose",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 28, 2017",
		"ReviewTitle": "Lousy Service & Dirty Kitchen",
		"Review": "The area was small similar to a carinderia. Worst, food service is very slow. You need make constant follow-up of your order. Even worse, the store kitchen is so small; hence, the garbage and food are literally in close encounter!"
	},
	{
		"User": "moshemo19",
		"Location": "Pampanga Province, Philippines",
		"DateofReview": "August 22, 2017",
		"ReviewTitle": "An SM mall that reminds of another SM Mall",
		"Review": "This mall reminds me of another mall in Luzon - SM City Pampanga. I am from Pampanga and I just visited Davao for a few days. The architectural similarities are extremely striking! The 3-floor rpund center hole, the placement of escalators and stairs from that center is identical, as well as the side-to-side locations of The Store and Supermarket. I was juat amazed how similar they are the whole time I was there. "
	},
	{
		"User": "Queensyl R",
		"Location": " ",
		"DateofReview": "June 11, 2017",
		"ReviewTitle": "Shop, Dine and Play!",
		"Review": "This has been my favorite mall among all the malls in the city, I simply called it \"The Serene Mall\" away from all the noise in the downtown and the stressful heavy traffics.There's plenty of shops and restaurant to choose from, a wide activity area to watch out the mall shows of your favorite artist. If you wanna play bingo this is the right place to come."
	},
	{
		"User": "Norm H",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "May 31, 2017",
		"ReviewTitle": "SM City! Well done.",
		"Review": "Spent an enjoyable afternoon strolling the halls of this upscale Davao mall. We were impressed by the cleanliness of a large but organized mall. We've visited all of the local malls, and the SM City ranks in the top 3 malls in Davao. Most everything you need from groceries to movies, health foods to souvenirs. Just wish there was a map to help find some of the smaller stores. The parking could be better..."
	},
	{
		"User": "SimonJ198",
		"Location": "Bournemouth, United Kingdom",
		"DateofReview": "April 29, 2017",
		"ReviewTitle": "One of the best Malls in Davao.",
		"Review": "Have visited this large , modern , very clean mall several times . Plenty of shops and restaurants and a cinema as well as huge SM department store and supermarket. One of Davao City's best Malls. All the staff are helpful and polite ,especially in the SM department store."
	},
	{
		"User": "Lance_Kerwin",
		"Location": "Tromso, Norway",
		"DateofReview": "March 21, 2017",
		"ReviewTitle": "Very nice",
		"Review": "My number one favorite mall in Davao. A very good place for shopping, dine out or watch a movie on a cinema."
	},
	{
		"User": "iRoelle",
		"Location": " ",
		"DateofReview": "February 14, 2017",
		"ReviewTitle": "Hangout",
		"Review": "SM Davao is our hangout everytime we are in the City, everything we need is here dining in, movies, groceries and shooping goods"
	},
	{
		"User": "Hamburg, Germany",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 22, 2017",
		"ReviewTitle": "Good clean mall",
		"Review": "Everything in place. Seems well managed. No surprises, what is a good thing here. Clean The expectancy shops, supermarket, department store. Clean Toilets. Clean food on clean table. Huge choice."
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "August 25, 2016",
		"ReviewTitle": "the usual SM...",
		"Review": "had lunch here after visiting Phil Eagle Center last August 19. there are vans bound to gensan at the car park area. there was an art(painting) exhibit at the annex 2nd floor...most artworks are inspired by Duterte. =)"
	},
	{
		"User": "David N",
		"Location": " ",
		"DateofReview": "July 10, 2016",
		"ReviewTitle": "Just another mall",
		"Review": "In terms of all the malls in Davao this one isn't the worst ... But it's just another mall in Davao (meaning not many fancy speciality shops if you like brand names, fancy watches etc)... Reasonably maintained and clean which is a nice plus --...More"
	},
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 19, 2016",
		"ReviewTitle": "SM City in Ecoland is getting better.",
		"Review": "SM City in Ecoland, Matina is getting better now that it has expanded with it's Annex area where Starbucks and Krispy Kreme coffee shops are located, and there's Bonchon Korean chicken, Sumosam Japanese restaurant, Kuya J's resto (serving filipino comfort food), and others. Annex also...More"
	},
	{
		"User": "SherwinJoseph",
		"Location": "Luzon, Philippines",
		"DateofReview": "April 16, 2016",
		"ReviewTitle": "Typical, relatively small, a bit crowded",
		"Review": "This is a typical SM mall. Just like other SM City in other areas, it's compact but complete. As they say, they've \" (we've) got it all for you.\" SM City Davao is along the Matina area. The other side of Davao -- relatively far...More"
	},
	{
		"User": "emzz2014",
		"Location": "Cairo, Egypt",
		"DateofReview": "February 12, 2016",
		"ReviewTitle": "Food court with lots of varieties, seafood, beef soup",
		"Review": "I enjoyed the food court with the extensive varieties of Vegetarian, chicken, meat, soups and local desert. Lots of modern shops with almost all you need encluding bicycles. The thing I could not sea easily is full bodyI massage shop but I am shure they...More"
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "February 8, 2016",
		"ReviewTitle": "Good",
		"Review": "Good place to visit with your family and friends etc. There's a lot stores and restorans. And if my memory still is alive i thing there is starbucks cafe bar"
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "January 23, 2016",
		"ReviewTitle": "It's ok place",
		"Review": "It is nice place if u have time What i noticed in the Philippines, Whereever you go there are so much people Philippines have more people than ants have army ;) kidding"
	},
	{
		"User": "wildbbillpidg",
		"Location": "Lima Peru",
		"DateofReview": "December 15, 2015",
		"ReviewTitle": "Different kind of movie theater",
		"Review": "In The SM mall in Davao city there is a movie theater which offers Red Carpet treatment. Only one movie at a time play in that part of the theater which has very plush leather reclining seats. It is worth trying at least one time...More"
	},
	{
		"User": "Grafton, NY",
		"Location": "Grafton, NY",
		"DateofReview": "October 16, 2015",
		"ReviewTitle": "Probably my fav mall in the city",
		"Review": "I think this is my favorite mall in the city. We go there for movies and to eat and to get new eye glasses. The SM department store is fine, too. The grocery is good. It's closest to home."
	},
	{
		"User": "Jan B",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 12, 2015",
		"ReviewTitle": "typical SM little bit small",
		"Review": "its a 3 building complex.\r \r you have to transfer to another building when you need to go shopping, grocery or restaurants.\r \r at first you will find it small but when you're inside you will see lots of restos serving tons of people on a daily basis."
	},
	{
		"User": "Римма К",
		"Location": " ",
		"DateofReview": "May 19, 2015",
		"ReviewTitle": "Have good stuff on second floor shop",
		"Review": "Bought shorts and another stuff. Good supermarket and little shops. Department store is amazing! Visited it twice. They also have organic food store on first floor. If you need anything you can find it in SM. I didn't like nccc and abreza mall."
	},
	{
		"User": "MejoBadBoy",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "May 14, 2015",
		"ReviewTitle": "Nothing much",
		"Review": "Same typical SM Mall again. The only good thing about this mall is that the Durian is much cheaper at the grocery compare to the stall outside. No big restaurants or clothing brands in this mall. Restaurants are not that too many as well. At least they have Starbucks, JCo and Krispy Kreme here. "
	},
	{
		"User": "Rubio4u",
		"Location": "Puerto Plata",
		"DateofReview": "April 15, 2015",
		"ReviewTitle": "Everything you need!",
		"Review": "My family and i live close by this mall. It is laid out conveniently mostly on two floors with ample escalators. A short walk will bring you to the annex where most of the technology stores are as well as a few restaurants. Most of the security guards and staff in the stores are indeed friendly and courteous as my family and i have grown to know many of them personally. Our toddler son loves the \"Choo Choo Train\" that rolls around the first floor. As always, there are a few things that bother my wife and i and that is 1. The solicitors, whether it is the agents that are hounding us to buy over inflated priced real estate or pesky sale people hassling us to buy some life insurance. These sales people see us there all the time, however they act like droids and will act as if they never saw us before. The sales people do not seem to understand the words \"no thank you\". 2. The bathrooms! Broken stalls and absolutely no hand soap! 3. The repetitive music being piped in from the PA system. My goodness, yes, we do come to this mall twice a week and we spend the day here as we do all of our weekly purchases here. Is there anything else in the music selection other than the same ten songs? It is mind numbing and you are driving customers out to use other malls!"
	},
	{
		"User": "tbose",
		"Location": "Kolkata (Calcutta), India",
		"DateofReview": "March 31, 2015",
		"ReviewTitle": "Centrally located",
		"Review": "A pretty massive establishment, with all kinda necessary shops available for people.The SM departmental store itself is pretty massive and have already many new stores being added to its already massive collection.\r What I felt lacking was it needed to have more toilets in the sprawling mall.Also the toilets lacked cleanliness and was never equipped with toilet paper.Also, the parking for this place was really tough,I think the establishment has to think about a multistoreyed parking space soon."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "November 7, 2014",
		"ReviewTitle": "My favourite shopping mall in Davao",
		"Review": "Love this shopping mall as it has everything I really enjoy. Three great music stores! Each with a good selection of instruments and very knowledgeable staff. The selection of stores is fabulous and the layout is very good. Child minding service is excellent. This is the mall I would recommend for visitors to this beautiful city."
	},
	{
		"User": "MarJho16",
		"Location": "General Santos City, General Santos, Philippines",
		"DateofReview": "October 6, 2014",
		"ReviewTitle": "Big mall",
		"Review": "Compared to Sm Lanang it is much bigger and there plenty of stores to buy for pasalubong and lots of foodchains to eat."
	},
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "August 29, 2014",
		"ReviewTitle": "Great shopping and eating",
		"Review": "Liked this mall for its shops and the variety of eating places you can visit and the amusement places. My husband's favourite is Shakey's Pizza - he just loves their pizzas. There's also the carousel and the train ride for children. The shops also offer a variety - not only in terms of prices, but also quality. Thoroughly recommend this mall when visiting Davao. The supermarket is also very good."
	},
	{
		"User": "Davao del Sur Province, Philippines",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "August 8, 2014",
		"ReviewTitle": "Love their supermarket!",
		"Review": "One of the things I love here is their grocery products, the SM BONUS products! SM is known to offer expensive products but it's not. They offer cheaper products under SM Bonus name but the quality is still excellent!"
	},
	{
		"User": "igga200",
		"Location": " ",
		"DateofReview": "August 3, 2013",
		"ReviewTitle": "just like any SM mall",
		"Review": "we chose to stop by this mall in davao since it's closer to our hotel. it looks just like any SM mall in the country. it has a number of stores to choose from, food stalls & restaurants & very accessible. the guards & mall personnel were courteous, friendly & respectful."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "March 23, 2013",
		"ReviewTitle": "Great shopping place in town.",
		"Review": "You can find it all here. A big mall complete from nice restaurants to cafes, from appliances to groceries, from high end shoes to bags and many more.\r \r It is very accessible to buses, jeepneys and taxis. We came from the other province and it is just a comfort to drop off from our destination to this big mall no hassle."
	},
	{
		"User": "MrSnatcher",
		"Location": "Worcester, United Kingdom",
		"DateofReview": "February 13, 2013",
		"ReviewTitle": "Amazing",
		"Review": "SM shopping mall wow what can i say ? Everything you need in one massive space, friendly helpfull staff , outstanding"
	},
	{
		"User": "MrEdnWilbur",
		"Location": "Jacksonville, Florida",
		"DateofReview": "January 29, 2013",
		"ReviewTitle": "Humongous!",
		"Review": "As the title suggests, this is one huge mall plus an annex building. The ground floor is served mostly by restaurants of the fast food variety. At the same floor, you can also access a few clothing stores including SM Department Store and SM Grocery. The second level is where you can find most of the clothing and variety stores. On the day I was there, the mall was packed by both shoppers and gawkers. I only stayed there to eat at the Roadhouse Cafe and then proceeded to visit Starbucks located at the Annex Building. But go visit this mall as it has everything for everyone."
	},
	{
		"User": "j_k271",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 10, 2013",
		"ReviewTitle": "Quite relaxing but inconvenient when with toddlers",
		"Review": "i always go here with my children to relax, shop and stroll. the place is quite relaxing and spacious, the saleslady are nice, parking lot are huge, but when it comes to emergencies like your baby poops they dont have any convenient place to change diapers and wash your baby, only the flatform foldable attached on wall and just wipe your baby there with all the smell for the entire room..haha i'd rather go home, they wont even let you use the CR for disabled even just for washing, your beg is no use..another negative feedback also is the phone attendant of their cinema are not nice, they were always like in a hurry or something and they get mad eventually even if you just asked her twice..my call does't last a min. duhh.. i hope they do have this complains and suggestion forms."
	},
	{
		"User": "kdsmithjr",
		"Location": "ithaca, ny",
		"DateofReview": "September 21, 2012",
		"ReviewTitle": "If you need to re-connect to the mall scene...",
		"Review": "SM City is one of Davao's American Style Shopping malls. There are others more oriented to the \"stall\" setup, not something common in America other than in places like farmers markets. SM City, were is transplanted into a typical american medium to small size city would fit right in. There are a variety of shops, the obligatory \"food court\" and lots of distractions to lighten your wallet. SM Department store is an anchor and is similar to the smaller chain dept stores in america. Prices are OK to outrageously high. Don't expect to brag to your folks back home about \"....i got x a such a great price in the Philippines at the mall\" some steal you got shopping at SM. On the other hand, if you have a serious need for something you forgot back home, like a comfortable pair of shoes or some reading glasses, etc. A place like SM would be a great place to look because you have so many choices."
	},
	{
		"User": "lenie",
		"Location": "almere",
		"DateofReview": "July 10, 2012",
		"ReviewTitle": "one of the newest malls in davao",
		"Review": "a nice clean mall with everything availabel, and still getting more shops. big parking around, and everybody is trying to help you to buy some articles. \r one of the best places to buy your davao souvenirs is the sm department store (shop for it on the ground floor) \r not in the midle of the city but easy to reach by cab"
	},
	{
		"User": "dhaynosaur",
		"Location": "London, United Kingdom",
		"DateofReview": "December 27, 2011",
		"ReviewTitle": "Your average shopping mall",
		"Review": "Area is too crowded. There are too many new buildings around it.\r \r Go early in the morning else parking is packed and there'd be too many people, especially on holidays and weekends.\r \r Tried to shop for a Christmas decor on Christmas eve but apparently theyve already 'pulled out' all Christmas decors because it is already 'gift giving'\r \r Sales ladies are too helpful that they've become too annoying."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 3, 2011",
		"ReviewTitle": "so convenient",
		"Review": "This big mall in Davao is one of the best. It's clean especially the toilets. There's always somebody who maintains the cleanliness after every customer's use. The store crews are very helpful and willing to assist you and guide you. The distance is not located at the city center, but it is accessible through jeep or taxi."
	}
]
