[
	{
		"User": "defyeo",
		"Location": "Davao City",
		"DateofReview": "1 week ago",
		"ReviewTitle": "Destination mall in Mindanao",
		"Review": "This mall has complete amenities. Good to hangout with the entire family. The mall have several large format stores such as Uniqlo, Forever 21, Terranova, Marks and Spencer, Sports Central, Ace Hardware, Department Store and Supermarket. The mall also has several amenities such as IMAX, Bowling, Fountain, SMX Convention center, Park Inn Hotel, Foodhall and Digital cinemas. \r \r This mall also has complete dining options to choose from. \r \r Overall I find this mall to be the finest mall in Davao. "
	},
	{
		"User": "xheroine1981",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 22, 2018",
		"ReviewTitle": "Can be called Food Mall",
		"Review": "Too many restaurants, stalls and cafes you can see here.. from fast food to dining.\r You can select cuisines like local (Davao's best), Filipino, Asian, Indians, Middle Eastern, European, Western, Japanese, Chinese, Koreans and a lot more\r Aside from it, the mall also offers movie house, supermarket, pharmacy, department store, fun land, some branded names, phone accessories, convention center, parking space, bank office (BDO)"
	},
	{
		"User": "looklikecris",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "January 24, 2018",
		"ReviewTitle": "Surprisingly huge",
		"Review": "We went here on a Sunday and also Christmas season. But I was surprise it was not that crowded as I expected. Upon entrance, you will realize that it was really huge.The name premier was really fit for this mall.\r \r We just took a jeep going here and we took a cab going out. For a traveler just like us, it was really easy to commute coming here."
	},
	{
		"User": "Tony_King_Jr",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 8, 2017",
		"ReviewTitle": "Visit for Weekend Food Park",
		"Review": "The place is very accessible especially for me that I just work near the area. It is a must visit every time there is a Weekend Food Park in their parking lot area. There are a lot of shops and stores to choose from inside. I just noticed in the department store that SM Eco has updated stocks than the Sm Lanang."
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "November 7, 2017",
		"ReviewTitle": "Alot of nice stores",
		"Review": "Nice place to walk around and shop on a hot day. Most stores have reasonable prices and there are a few that are expensive like in the US. The strange thing is the sizes are very small. I tried on a pair of shorts I liked and they would not even go over my legs and they were XL. Maybe I was in the wrong section I don't know but if you buy clothes I would recommend you try on first."
	},
	{
		"User": "ToujoursLaRoute",
		"Location": "Iasi, Romania",
		"DateofReview": "October 16, 2017",
		"ReviewTitle": "Best place for shopping in Davao",
		"Review": "Quite impressive mall, with a convenient access directly from the Radisson Park Hotel. Try to find the local products, there is a stand in the supermarket and also an entire shop at the same level (-2). Plenty of choices in terms of electronics...and also the usual brands. Very securized place."
	},
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "October 15, 2017",
		"ReviewTitle": "Love this Mall!",
		"Review": "This is my favourite shopping mall in Davao. Everything I want is here - from restaurants to cafes and department stores. It is very handy to Park Inn by Radisson and the walk bridge from the hotel to the mall is an excellent idea. I love the variety of shops - from high end boutiques to mid-ranged ones. I also love the fact that every time I visit there are new shops, new spas, new restaurants, etc. For me, this place just caters for all that I want in a shopping mall."
	},
	{
		"User": "Kimitaka S",
		"Location": " ",
		"DateofReview": "September 17, 2017",
		"ReviewTitle": "New and clean shopping mall",
		"Review": "On the second day of my stay in Davao, a friend of mine brought me to this shopping mall. It is a modern and clean mall, in which any kinds of shops exist. We took a cup of coffee at Starbucks on the second floor."
	},
	{
		"User": "Mae G",
		"Location": " ",
		"DateofReview": "September 1, 2017",
		"ReviewTitle": "Love to Shop",
		"Review": "Very handy if you are staying at Radisson hotel.Lots of Posh Restaurant .We havent been to their foodcourt ,if they have one I am pretty sure its also very affordable like in SM Cebu."
	},
	{
		"User": "Medy1950",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 17, 2017",
		"ReviewTitle": "Our biggest mall so far in Davao City",
		"Review": "Conventions are held here. In fact my friend from Manila is having their CREBA conference at the SMX in October! They cancelled their first venue since the SMX is so much more spacious and convenient for parking! Various exhibits are also held in the Atrium. For Kadayawan, it is the Ikebana Exhibit! We just dropped by before going to the airport to pick up a few things not available in other Malls and to window shop. "
	},
	{
		"User": "Katrina08_23",
		"Location": "Davao City",
		"DateofReview": "August 10, 2017",
		"ReviewTitle": "They've got everything you need!",
		"Review": "From low budget to extravagant dinning, shopping or just strolling around the mall I believe they got what you need"
	},
	{
		"User": "streeteasy55",
		"Location": "New York City, New York",
		"DateofReview": "August 7, 2017",
		"ReviewTitle": "roof top",
		"Review": "nice mall to hang out. they have great fashion brands. nice coffee shops and food stops as well. I like best the roof top food stop especially at night. they have grocery within. Very clean mall. Oh, the starbucks... caffeine anyone? Great mall to chillax....More"
	},
	{
		"User": "tessamaete",
		"Location": " ",
		"DateofReview": "July 5, 2017",
		"ReviewTitle": "Sm",
		"Review": "This sm mall was not that big but it was spacious. It has class and i love it. You can find almost anything in here. The location is also very accessible. I would definitely visit this place again"
	},
	{
		"User": "roymksh23",
		"Location": "Makati, Philippines",
		"DateofReview": "June 6, 2017",
		"ReviewTitle": "Beautiful SM Lanang",
		"Review": "Just like any other SM Malls but this is a bit beautiful and so spacious, nice ambiance, its like high end malls in the country. If youre looking for a relaxing mall, you might consider going here. Just take a taxi and say to the...More"
	},
	{
		"User": "bhsceo",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 23, 2017",
		"ReviewTitle": "Highly managed showrooms and entertainment spots plus Lunch & Dining",
		"Review": "One could find all that of interest to everyone,Luxury watches ,various computers & accessories,hardwares & Stationary showrooms,Outfits of all range and brands of International fame,Eating spots like Jollibee,Chowking,KFC and more.Hangout places and Entertainment.Find to explore many varieties in Departmental Store,Luxury Cars,Outfits & Clothings showrooms,Games &...More"
	},
	{
		"User": "Franklin C",
		"Location": "Honolulu, Hawaii",
		"DateofReview": "May 12, 2017",
		"ReviewTitle": "Very Modern Mall",
		"Review": "If your into Trendy Malls this one will fit the bill. Wide Spacious with a Supermarket to boot. Their food court or where most of the main dining areas are located on the upper floors but the escalators help with the way up. Security is...More"
	},
	{
		"User": "falthaher",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 8, 2017",
		"ReviewTitle": "Time well spent",
		"Review": "SM North Lanang St. is best, largest and the most new shopping Mall. Pretty modern, lots of shopping, food, cafes.....near Davao airport. Behind the mall, Park inn hotel, a perfect location to those who are shopaholic."
	},
	{
		"User": "Khaleesi0815",
		"Location": "Makati, Philippines",
		"DateofReview": "April 10, 2017",
		"ReviewTitle": "Top of the class",
		"Review": "I have been hearing that SM Lanang Premier is one of SM's class A malls. I must say this is true. When I visited in March, I was astounded with how well-lighted and clean the mall is. Their shops and restaurants are updated. The last...More"
	},
	{
		"User": "Gordonchef",
		"Location": "Vancouver, British Columbia, Canada",
		"DateofReview": "April 6, 2017",
		"ReviewTitle": "Alot of closed shops",
		"Review": "Most shops in this mall dont last 1 yr. The ones that do ate very lucky or backed up with a huge company. Locals have seen alot of store closed down and new ones pop up. It seems like this mall only cares about rent...More"
	},
	{
		"User": "Lavert B",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Kent, United Kingdom",
		"Location": "Kent, United Kingdom",
		"DateofReview": "March 30, 2017",
		"ReviewTitle": "Awesome",
		"Review": "Great variety of shops and a world of different cuisines to tempt you, and lots of style too. Very clean and friendly."
	},
	{
		"User": "Norm H",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "March 15, 2017",
		"ReviewTitle": "Four levels of shopping and dining.",
		"Review": "Conveniently connected to the Park Inn Radisson Hotel by a covered walkway. Four levels of shopping and dining and cinemas. An open design, very clean, it's great for air conditioned strolling. There is also a beautiful fountain out front that has a dancing light and jet water show every hour after dark."
	},
	{
		"User": "Mortanah",
		"Location": " ",
		"DateofReview": "March 9, 2017",
		"ReviewTitle": "Decent mall. With IMAX",
		"Review": "As far as malls goes this one is quite nice. The thing I like especially about this one is the 3D IMAX theatre. It's not quite as big as the ones back home but I really like watching movies in IMAX. Makes as the difference. And compared to CAnada the prices are much cheaper for tickets. ₽450 for IMAX and only ₽180 for regular film. "
	},
	{
		"User": "jaquinne",
		"Location": "Davao City",
		"DateofReview": "March 1, 2017",
		"ReviewTitle": "Easy to Locate",
		"Review": "I always prefer this place because the shops and restaurants are easy to locate. When meeting up a friend it is very easy to give direction."
	},
	{
		"User": "MsDumaring",
		"Location": " ",
		"DateofReview": "February 11, 2017",
		"ReviewTitle": "Many things in one place",
		"Review": "I attended a meeting at the SMX Conference Centre, which really is inside the SM Lanang Premier mall. This mall has many of the high street brands from clothings, book store, restaurants and cafes, a supermarket as well as manicure and pedicure shops. There is also a souvenir shop inside the mall, called \"Kultura\". Items sold vary from t-shirts, hats, bags, pouches, magnets, dried mangoes, chocolates, beauty products, pearls and many more. Prices are affordable although if you go to the markets you can stretch your peso more. "
	},
	{
		"User": "Irene F",
		"Location": " ",
		"DateofReview": "February 5, 2017",
		"ReviewTitle": "convention center galore",
		"Review": "davao has been a must-see city in southern philippines, particularly in the island of mindanao. it boasts of several natural premier spots as well as man-made tourist hubs. sm lanang is one of the latter.\r \r when we held a convention here a year ago, we didn't encounter any problem during the whole duration of the event. with state-of-the-art facility and spacious function halls, SM managed it smoothly and efficiently. and the participants could freely roam around the mall right after the affair. \r \r truly, SM got it all! "
	},
	{
		"User": "Kakay O",
		"Location": " ",
		"DateofReview": "January 28, 2017",
		"ReviewTitle": "Good central place",
		"Review": "It's located well and complete. Nice stop before continuing on a journey. Good choices of shops and restaurants."
	},
	{
		"User": "Victorianlad",
		"Location": "Melbourne, Australia",
		"DateofReview": "January 28, 2017",
		"ReviewTitle": "Quite good mall",
		"Review": "This shopping centre has three levels and unlike some others quite a good level of natural light inside as there is a sort of atrium.\r \r The SM Department store is not huge but is on two levels.\r \r The SM supermarket is very big but at 1100 on a Saturday had many cashier booths unstaffed.\r \r Much of the food seemed to be either outside - so that after hours dining was possible - or on the third floor (meaning a lift or escalator trip.)\r \r Aircon worked fairly well.\r \r Taxis and jeepnets were well arranged outside with no waiting."
	},
	{
		"User": "Cathy H",
		"Location": " ",
		"DateofReview": "January 26, 2017",
		"ReviewTitle": "Classy and big!",
		"Review": "Well not really big in size but the interior makes it look like it's really wide and it's refreshing to see and shop by! The place is not too crowded and they have SMX Convention there. It is like the SM Aura in Manila because it is that grand. "
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 18, 2017",
		"ReviewTitle": "For me THE mall in Davao",
		"Review": "SM Lanang is at least for me the place where I find almost everything. The usual mall things of course like supermarket, department store, small electronics, clothes. Many things to eat inside and outside. My all time favorite is the Hukad restaurant of course. \r One nice thing is the water illumination in the evening. Best viewed from second floor. \r Of course everything including the Toilets is clean. \r Very important also for me is the laundry service, you find it at the floor below the ground floor. \r And even more important for me as a man, we love it non complicated. This mall is so easy to understand, no hidden things, great. "
	},
	{
		"User": "Ajie A",
		"Location": " ",
		"DateofReview": "January 16, 2017",
		"ReviewTitle": "Last stop before leaving davao",
		"Review": "This mall is usually our last stop. We shop at their supermarket which is almost complete - from local to imported items. I can find here almost all i need for our coffee shop business.\r The mall is spacious, with high end shops. But sometimes, if i need to buy clothing and shoes, this is not the place. "
	},
	{
		"User": "Leo E",
		"Location": "Cagayan de Oro, Cagayan de Oro, Philippines",
		"DateofReview": "January 14, 2017",
		"ReviewTitle": "Premiere Convention Center",
		"Review": "We attended a church activity at Davao City, Mindanao Regional Conference, all the way from Cagayan de Oro City. It was a 2-day affair held at SMX Convention Center of SM Lanang Premier. I was mesmerized at the vastness of the complex. Imagine the SMX alone contained around 5,000 people more or less, what with the praising and singing worship songs plus the dancing... with the words of God that you received as they were delivered by different speakers/preachers, we sure did had a good time. And no other venue can compliment to the occasion than the huge convention center.\r \r Dining is not a problem as an array of restaurants, fastfoods, delis, food stalls and all that you can imagine are readily there waiting for everyone. Comfort rooms are aplenty, with wider spaces and large cubicles and more in numbers, I've got no problem at all! \r \r Parking area is so large you can get lost if you are not observant enough. They also have a place for souvenir picture taking at the back portion of the ground level. \r \r Roaming around the large edifice makes you feel like a tourist in your own country as the ambiance is special, euphoric and satisfying. Great place, really! Congrats to the Sys!!!"
	},
	{
		"User": "backpackingfoodieph",
		"Location": "Cainta, Philippines",
		"DateofReview": "December 9, 2016",
		"ReviewTitle": "One of the Prime",
		"Review": "SM Lanang could be one of the prime malls of SM Supermalls. It has big open ground floor. When we went there in June 2016, there's a Food Fest activity happening. There's a cooking competition, Cake design competition, some food free taste. On the same weekend of the event, there's also Food Expo happening in the Hall at the 2nd flr. We were able to get in but before we do, we have to signup first. The shops available in SM Lanang are from low-end to high-end brands. \r \r Since our flight is in the evening, we were still able find time to watch movie. We watched the Lights Out, people inside are majority of teenagers. The crown are very loud and it made me irritated and frustrated. The people teens inside are very noisy, it seems that they come inside the movie house just to chat with each other and not to watch the movie. I wasn't able to control my temper so I yelled too loud for them to keep quiet. However, they didn't stop and it just made me look stupid.Good thing the lights are off and no one seen me. hahaha! \r \r Overall, my visit in SM Lanang Premier didn't ruin that moment from the cinema. I like the mall's environment, it feels like I'm still in manila inside."
	},
	{
		"User": "Dave H",
		"Location": " ",
		"DateofReview": "December 5, 2016",
		"ReviewTitle": "Good shopping Mall",
		"Review": "A nice big shopping mall, clean and very tidy, with plenty of places to eat, always go shopping here when in Davao"
	},
	{
		"User": "Dan Michael F",
		"Location": " ",
		"DateofReview": "November 20, 2016",
		"ReviewTitle": "One of best",
		"Review": "We came by here before ending our Samal Island trip to shop. The mall is big and beautiful. They have many shops to choose from. As one of highlighted malls in Davao, they also have a convention area where many big events are held. If you have enough money for shopping, you may find the thing you needed. It takes time to round the place but it will be worthed. Accesible because it is situated near the highway."
	},
	{
		"User": "MikeInWyoming",
		"Location": "General Santos, Philippines",
		"DateofReview": "November 11, 2016",
		"ReviewTitle": "One of many, it depends on where in Davao you are at the moment.",
		"Review": "Davao is a large city with significant traffic problems. And so where I shop is as much determined by where I am as by anything else. SM Lanang is on the \"outskirts,\" by one measure, but it is on one of the most congested roads in all of Davao by another. If I am going to be visiting the Bureau of Immigration, that's where I will go. Abreeza, (a Robinson's) Mall is not too far away and probably just as good in my opinion. \r \r If I am visiting my daughter, who is at Ateneo de Davao University, her apartment is far closer to SM City Mall in Ecoland. \r \r I find parking is better at SM Lanang. The parking an SM City is just weird. But crossing the traffic to either get to, or leave, SM Lanang, as there is no traffic light is for me beyond frustrating. \r \r All SM Malls I have been in, are well maintained, and nice places. The stores in all of them are targeted to those with larger budgets, in comparison to the Gaisano Malls or the old Victoria Mall in Davao. \r \r Many of the stores I find in one SM Mall, I find in most of the rest. And if I am on the other side of the city, I will go to the NCCC Mall rather than any SM which is next door the S&R, a store over much like Costco in the US and has much I can't get anywhere else. Lanang is far from that. \r \r It can take an hour to get from S&R to SM Lanang. Like I said in the beginning. Choosing a mall is more a matter of where you are when you start."
	},
	{
		"User": "edikdak",
		"Location": "SJDM City",
		"DateofReview": "November 2, 2016",
		"ReviewTitle": "Dumayo ng SM",
		"Review": "Upon touchdown of Davao, eat brunch at Man Inasal Courteous Davaenous :D and always smiling, very helpful Since we don't know their dialect, they make you comfortable with their fluent English accent!!!"
	},
	{
		"User": "Benedict A",
		"Location": " ",
		"DateofReview": "October 27, 2016",
		"ReviewTitle": "Cool and High End",
		"Review": "Really cool architecture for the mall. Fresh aura and vibe. Good stalls and shops. The Sky Garden is really cozy and classy. Wish there more food options and hang out spots."
	},
	{
		"User": "PeachyWanderer",
		"Location": "Naga City, Philippines",
		"DateofReview": "October 9, 2016",
		"ReviewTitle": "My SM in Davao",
		"Review": "In every place I travel, I always look for the nearest SM mall. This is because SM still is the most customer friendly mall for me.anywhere I go (except for SM MOA).\r \r Davao has two SM Malls. I choose Lanang. It is not crowded and has all the stores that I need. For a frequent traveller, it is the most convenient and the lay-out is easy to understand. It is hard to get lost in an SM Mall. You can always find your way without asking anyone. And SM Lanang is no different.\r \r I would always get lost in other malls. But Lanang is convenient and it is easy to get a taxi. "
	},
	{
		"User": "C W",
		"Location": "Melbourne, Australia",
		"DateofReview": "September 19, 2016",
		"ReviewTitle": "Good local shopping centre",
		"Review": "This mall has all of the basic shops and food outlets that you need. Not as big or luxurious as some of the other malls in the city but not far behind :)"
	},
	{
		"User": "Jeremy N",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Dover, Delaware",
		"Location": "Dover, Delaware",
		"DateofReview": "August 28, 2016",
		"ReviewTitle": "Better malls in Davao",
		"Review": "Have been to this mall several times and while its a really nice new modern mall it lacks alot of things other malls have especially in food choices..i prefer Abreeza or SM City Ecoland over SM Lanang"
	},
	{
		"User": "Vanessa M",
		"Location": " ",
		"DateofReview": "August 20, 2016",
		"ReviewTitle": "Best Starbucks Experience!",
		"Review": "When i went to Starbucks there, the barista / cashier is very friendly and warm. I purchased a Davao Tumbler. She asked me if I'm a turista and I said yes. The she started asking me how my experience in Davao was.. Rarely can you find a barista like her. I forgot to get her name, though. the date of visit is Aug 18 around 2-3pm."
	},
	{
		"User": "Paulo D",
		"Location": " ",
		"DateofReview": "July 30, 2016",
		"ReviewTitle": "Good mall right in an area where there's space to breathe ",
		"Review": "If I were staying at this city, this would be my preferred mall. It's a more suburban part, Lanang, and the place is such a charm. \r \r This SM mall boasts of space and the design is non obtrusive even if you have kiosks at the ground floor. \r \r Don't come here looking for a food court serving local food. You have the usual local chains at the top floor or step out at the garden dining area and explore the casual dining offerings of Davao City. \r \r Less crowded, too, if you frequent Metro Manila SM malls. I love it. "
	},
	{
		"User": "michael l",
		"Location": " ",
		"DateofReview": "July 26, 2016",
		"ReviewTitle": "Just your average mall",
		"Review": "I'm not sure of the criteria for reviewing a mall, but by any standard this is an anodyne, clean, fairly sterile shopping plaza. It's architecturally undistinguished, and the store offerings are largely middle of the road; no high end designers, no fancy boutiques, and nothing to attract the eye or wallet of the rabid recreational shopper. Succinctly, it's big, it's bland, and it's entirely average in all respects. "
	},
	{
		"User": "Miler15",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "A bit far from me",
		"Review": "This place is great when it comes to foodies and shopping. Its just that am so far away from this mall. The Imax is one of my favorite. Also love the sky garden and its very accesable to the nearest hotel."
	},
	{
		"User": "Andy H",
		"Location": "London, United Kingdom",
		"DateofReview": "June 24, 2016",
		"ReviewTitle": "Best Mall in Davao",
		"Review": "Friendly staff, plenty of dining options inside and outside (Fountain courts), there is a cinema, travel agent and if you are staying in Park Inn hotel, this is connected via a bridge to the mall"
	},
	{
		"User": "Nikolai S",
		"Location": "Oslo, Norway",
		"DateofReview": "June 18, 2016",
		"ReviewTitle": "Perfect shopping mall",
		"Review": "Perfect place to do all kind of shopping. It has a Starbucks Cafe and many hundreds of other stores. It has a upper end setting"
	},
	{
		"User": "AGMMAC",
		"Location": "Pasig, Philippines",
		"DateofReview": "June 6, 2016",
		"ReviewTitle": "Nice mall with so many choices for dining",
		"Review": "This is the closest mall to Hotel Tropika. They have Marina Tuna (for really good seafood), Foping's (for halo-halo), coffee shops and many well-known brands. You can also do your groceries there. The layout is pretty nice, not cramped."
	},
	{
		"User": "Lanylynne May A... R",
		"Location": "Taytay, Philippines",
		"DateofReview": "June 6, 2016",
		"ReviewTitle": "Stayed at SM Prestige lounge",
		"Review": "Not a usual SM interior design here at SM Lanang Davao. Friendly staff and spacious. Not crowded prestige lounge. We will be back here soon.. Thank you SM Prestige lounge.."
	},
	{
		"User": "CaliTo69",
		"Location": "Philippines",
		"DateofReview": "June 5, 2016",
		"ReviewTitle": "a different SM",
		"Review": "i was amazed by the design, as if it's not the common SM's you see. There is a big open space inside the mall and there are numerous seats for people to seat and relax.\r One thing struck me is when you ride on a taxi, there is a watcher who issues you a ticket indicating the date you rode & plate # & company name of the taxi. This is to enable you to call them in case you left something or for you to complain or complement about the taxi driver."
	},
	{
		"User": "flxmanuel",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "New York City, New York",
		"Location": "New York City, New York",
		"DateofReview": "April 28, 2016",
		"ReviewTitle": "the best in davao",
		"Review": "feels like you are in another country!spacious and very ideal for shopping.not very crowded with a lot of shops and restaurants.definitely the best in davao city!"
	},
	{
		"User": "Abi_girl07",
		"Location": " ",
		"DateofReview": "April 26, 2016",
		"ReviewTitle": "Went there for dinner and it was good.",
		"Review": "My kids and I went to the mall for dinner and there's a fountain show and is live band playing. It was pretty nice. There's a hotel near it, radisson inn and probably will stay there next time we are in Davao."
	},
	{
		"User": "SherwinJoseph",
		"Location": "Luzon, Philippines",
		"DateofReview": "April 16, 2016",
		"ReviewTitle": "Spacious, just like other SM Premier Malls",
		"Review": "This is pretty much like other SM Premier Malls. Just had a different color in the interior. SM Premier Lanang provides more space and relatively larger stalls. You'll find signature brands here -- high end and classy. Restaurants are also available in the area. SM...More"
	},
	{
		"User": "Emil H",
		"Location": "New York City, New York",
		"DateofReview": "April 15, 2016",
		"ReviewTitle": "Wow, super mall",
		"Review": "I'm staying at the Park Inn, in a suite. The hotel is connected to the mall via a second-story ski way. this mall has everything it's clean it's comfortable and the price is right"
	},
	{
		"User": "jaycode23",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "March 26, 2016",
		"ReviewTitle": "Very Good Mall in Davao Ciry",
		"Review": "If you don't know where to go and eat in Davao City, you might want to visit SM Lanang Premiere. Visit their Starbucks Coffee at the second floor if you have some time to spare."
	},
	{
		"User": "GraceJ1",
		"Location": " ",
		"DateofReview": "March 24, 2016",
		"ReviewTitle": "Holidays",
		"Review": "It's was a gourgeous place very convenient, big space love the shop most of the things you need is already in this shopping mall easy access to all transport very clean and yoy can say it's a safe place to meet up some friends ...."
	},
	{
		"User": "Jemir T",
		"Location": " ",
		"DateofReview": "February 29, 2016",
		"ReviewTitle": "FANCY SHOPS AND RESTAURANTS",
		"Review": "I already visited this mall for a couple of times already and tried some restaurants and some food stalls. Like in Mushi Manju their korean style waffle you gotta try this it's delicious when it is served hot. Bhajia Pizza place was also outstanding they...More"
	},
	{
		"User": "ArcticStorm",
		"Location": "Edmonton, Canada",
		"DateofReview": "February 16, 2016",
		"ReviewTitle": "Nice mall",
		"Review": "This is a rather nice mall. It's pretty spacious. All the shops are on the perimeter of the mall, while the middle is spacious. You can stand in the middle and look around for the shop that you are looking for."
	},
	{
		"User": "Angela M",
		"Location": "Pasig, Philippines",
		"DateofReview": "February 12, 2016",
		"ReviewTitle": "Not your typical SM",
		"Review": "as the name suggests, its a premier (SM) mall so expect it to be less crowded compared to the usual SM malls. Stalls are branded and the center area is quite spacious."
	},
	{
		"User": "Ed K",
		"Location": " ",
		"DateofReview": "February 8, 2016",
		"ReviewTitle": "Clean and new mall",
		"Review": "Wide selection of shops. Big supermarket to stock up daily necessities. Clean toilets. It also has a wide selection of food choices, from fast food to local crusine restaurants."
	},
	{
		"User": "Maria Teresita E",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "San Francisco, Philippines",
		"Location": "San Francisco, Philippines",
		"DateofReview": "January 26, 2016",
		"ReviewTitle": "Great Place to Shop",
		"Review": "SM Lanang Premier is the best place to shop if you speak about International Stores, the mall is clean."
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "January 21, 2016",
		"ReviewTitle": "Good place",
		"Review": "Nice place, with lot of stuff and really too much people. Much restorans, shops etc. There is good coffee bar on second floor i think ."
	},
	{
		"User": "Mortanah",
		"Location": " ",
		"DateofReview": "January 17, 2016",
		"ReviewTitle": "Nicest theatre in Davao",
		"Review": "If you are looking for the nicest theatre in the area, this is it. They have a huge IMAX 3D screen that is fantastic. It's also not very busy so you can get the great seats that you want. Defiantly the place to watch the...More"
	},
	{
		"User": "Ralph S",
		"Location": "San Antonio, Texas",
		"DateofReview": "January 14, 2016",
		"ReviewTitle": "Another nice mall in Davao.",
		"Review": "This has many nice upscale shops and good dining is also available. Very good Cyber Mall here for all your needs."
	},
	{
		"User": "J_Mon0",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2015",
		"ReviewTitle": "Nice, relaxing, not crowded.",
		"Review": "Nice for strolling, window-shopping, and exploring what's available this side of town. SM is SM, but this in particular was quite refreshing because of the absence of crowds. Some of the stores and boutiques sold their items cheaper compared to their Manila counterparts. Liked the...More"
	},
	{
		"User": "Elmo B",
		"Location": "Manila, Philippines",
		"DateofReview": "November 19, 2015",
		"ReviewTitle": "SM City Lanang in Davao",
		"Review": "Arrival and Pre-departure place in Davao SM City Davao in Lanang, gives you the same SM experience. At the basement services from laundry, haircut, and other body-prepping, traveling and ticketing, pet grooming are provided. A wide SM supermarket also servers you. SM City Lanang also...More"
	},
	{
		"User": "agar_floro",
		"Location": "Quezon City, Philippines",
		"DateofReview": "October 25, 2015",
		"ReviewTitle": "Big Spacious SM Mall",
		"Review": "This is SM Mall is quite different from the usual SM Malls I have ever been to. It is spacious, clean and better planned. It is a nice change from the usual crowded SM malls. Even the restrooms are far better maintained."
	},
	{
		"User": "jake162015",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "October 22, 2015",
		"ReviewTitle": "great atmosphere and ambiance",
		"Review": "We went here because of a business convention and I am amazed that this SM Mall is so huge and spacious, you wont feel tired strolling around. Lots of stores you won't find in Manila. Outside, it is very accessible, jeepneys are well organized so...More"
	},
	{
		"User": "Loislim",
		"Location": "Davao City, Philippines",
		"DateofReview": "September 24, 2015",
		"ReviewTitle": "Paying bills is a cinch!",
		"Review": "Aside from being a premier mall, SM Lanang has an efficient Business center downstairs (where the underground parking is located). Since the Davao Light office has opened their customer services and payment centers at the SM Malls, paying our bills has become faster and easy....More"
	},
	{
		"User": "Anthony M",
		"Location": "Alameda, California",
		"DateofReview": "September 23, 2015",
		"ReviewTitle": "SM Lanang",
		"Review": "A mall is mall is a mall just an average mall same shops as another one good place to stroll and get out of the sun. Don't have very many stores to interest me. Clean, safe, tried some good food in the court."
	},
	{
		"User": "Arvin Jay L",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Digos City, Philippines",
		"Location": "Digos City, Philippines",
		"DateofReview": "September 10, 2015",
		"ReviewTitle": "Superb Dining at Vikings",
		"Review": "Went to the place to eat at vikings. A Perfect place to celebrate your most memorable occasion in your life. Eat well and good."
	},
	{
		"User": "Jembalaya",
		"Location": " ",
		"DateofReview": "September 10, 2015",
		"ReviewTitle": "Great Variety of Shops",
		"Review": "I liked the variety of shops in SM Lanang Premier. It is comparable to SM Aura in BGC here in Manila. Given the chance, I would drop by this mall again in my future trips to Davao City."
	},
	{
		"User": "charytraveller",
		"Location": "Abu Dhabi, United Arab Emirates",
		"DateofReview": "September 3, 2015",
		"ReviewTitle": "A place for time pass",
		"Review": "Nothing much to see, it is just for strolling, meet ups, and to waste time. Shops are limited. The main attractions would be the restaurants like Vikings (yes! they have a branch there) and the Marina Tuna. The rest are just ordinary Filipino (grill, kare-kare...More"
	},
	{
		"User": "Kring1947",
		"Location": " ",
		"DateofReview": "August 23, 2015",
		"ReviewTitle": "Long Weekend",
		"Review": "Excellent location as it is just across the hotel where we were staying. Good mix of stores and restaurants. Very clean and spacious."
	},
	{
		"User": "Lita H",
		"Location": "Manchester, United Kingdom",
		"DateofReview": "August 22, 2015",
		"ReviewTitle": "The fountain show is just a come-on...it's the shopping experience that is the real crowd-pleaser!",
		"Review": "A very good shopping experience...The outlets offer good value for money. And if you're looking for souvenirs, go to KULTURA for the ultimate shopping experience where the staff are attentive and very friendly and helpful.."
	},
	{
		"User": "JOMARE O",
		"Location": " ",
		"DateofReview": "August 20, 2015",
		"ReviewTitle": "Excellent for families! ",
		"Review": "SM Lanang Premier is a nice shopping mall with lots of entertainment for the whole family. The Bowling Alley is one of the best in the city. We sat at the balcony and watched the fountain dance and listened to a string quartet playing classical...More"
	},
	{
		"User": "Mits A",
		"Location": "Taguig City, Philippines",
		"DateofReview": "August 10, 2015",
		"ReviewTitle": "A classy place in davao",
		"Review": "It felt like I was back in Manila, most of may fave stores were present there. We didn't have much time to go around the mall much but I liked the fountain show."
	},
	{
		"User": "Barnes C",
		"Location": " ",
		"DateofReview": "August 6, 2015",
		"ReviewTitle": "Prestige Lounge and Cinema needs to be checked",
		"Review": "nice little mall. we visit this mall 2-3x a week as it is near our house. Parking is easy, Grocery is stacked with lots of imported products. I thought the attendants in the Prestige Lounge need a bit more training in customer service, sometimes you...More"
	},
	{
		"User": "Fritzie P",
		"Location": " ",
		"DateofReview": "July 1, 2015",
		"ReviewTitle": "One of the 1st class malls",
		"Review": "It was such a great experience to came here and witnessed their dancing fountain. And take note it was my first time here and looking forward for my second."
	},
	{
		"User": "saf7670",
		"Location": "Peterborough, United Kingdom",
		"DateofReview": "June 20, 2015",
		"ReviewTitle": "Shopping great, cinema great discovery centre appalling!",
		"Review": "Sm is great for shopping, restaurants and cinema when in davao. Do not waste yourtime, effortor money visiting the Discovery science centre on the 2nd floor it is a total waste of time and money. Paid 250php for all day entry, and entered,the firstthing that...More"
	},
	{
		"User": "WanderLustDavao",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Davao City",
		"Location": "Davao City",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "High end mall for everyone",
		"Review": "SM Lanang Premier is obviously marketed to become a high end retail establishment yet its stores still cater for shoppers with varying budget and needs. Love the space that makes shopping more relaxed and fun, and the array of restaurants fronting the country's largest dancing...More"
	},
	{
		"User": "bunko007",
		"Location": "Quezon City",
		"DateofReview": "May 30, 2015",
		"ReviewTitle": "Nice complement to the adjacent Park Inn by Radisson Davao",
		"Review": "Stayed for two nights at Park Inn by Radisson Davao and welcomed with open arms the presence of SM Lanang. During my two days of work, SM Lanang was my place for unwinding - for dinner, drinks with companions, and a bit of shopping for some stuff. \r \r The mall has tight security, clean, and has good selection of restaurants, food stalls and kiosks, drug store, banks, moviehouses and an IMAX theater. \r \r It's not as huge as those malls in Manila but good enough for the less crowded J.P. Laurel Ave area."
	},
	{
		"User": "MejoBadBoy",
		"Location": "Las Pinas, Philippines",
		"DateofReview": "May 14, 2015",
		"ReviewTitle": "Not your typical mall..",
		"Review": "Since I live in Manila, I am used with the other SM malls in Metro Manila area. This is a huge mall with IMAX theater and SMX Convention Center as well which is all located inside the mall. No self-served touch screen map to help you look for the store or restaurant you are looking for and you have to run after the guards just to ask where is where. The sad part about it is that the guards only speak \"Bisaya\" only. I tried asking them in tagalog but they responded back in \"Bisaya\" making me feel like an idiot figuring out what they are saying and just rely on their gestures where's the store I was looking for in the Mall. Piece of advice, BRING A MAP of this MALL or better yet a GPS to help you navigate inside the mall. "
	},
	{
		"User": "kalboHastings",
		"Location": "Hastings",
		"DateofReview": "May 4, 2015",
		"ReviewTitle": "Classy Midsized Mall",
		"Review": "Relatively new Mall in Lanang, close to the Airport, hotels etc. This place has most of the type of shopping & food outlets you need. The water display in the evenings is a wonderful watch. A nice combo of indoor & outdoor shopping/eating. Recommended."
	},
	{
		"User": "Peter S",
		"Location": "Tasmania, Australia",
		"DateofReview": "May 3, 2015",
		"ReviewTitle": "WOW",
		"Review": "One of the newer malls in Davao it truly has the WOW factor. ^ floors lots of space and selling to a wider customer range. This ,mall is very popular and is close to most hotels and the airport. Staff are friendly and take pride in their what they do. and like most in this region is immaculately kept. a real pleasure to visit."
	},
	{
		"User": "Jeff Y",
		"Location": "Makati, Philippines",
		"DateofReview": "April 22, 2015",
		"ReviewTitle": "SM Lanang is worth visiting",
		"Review": "This modern and big (by provincial standards) mall of SM in Lanang, Davao City is like any typical SM mall- lots of stores and restaurants. But unlike other SM malls, it seems more spacious and not as crammed as their other SM malls. There is a nice Starbucks outlet which seems suspended in between 2 floors. A restaurant row facing the nearby Radisson Hotel (complete with a connecting walk-way) makes for good eating. Lots of parking and along the main road. Quite nice and a good way to spend a lazy afternoon."
	},
	{
		"User": "slazenger552",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 14, 2015",
		"ReviewTitle": "Nice place to stroll with friends and family",
		"Review": "This mall is so big and it has good amenities. It's also good for friends and family to come and shop. The SMX convention center is also good for conventions, concerts and other big events. The place is refreshing and relaxing, especially at the garden with fountain at the back side, during night time."
	},
	{
		"User": "fcl2929",
		"Location": "Kuala Lumpur, Malaysia",
		"DateofReview": "March 8, 2015",
		"ReviewTitle": "Huge Complex, Newly Open, Interesting, WiFi",
		"Review": "I stay at Crown Regency Hotel which is about 10 mins taxi ride away from SM Lanang Shopping Mall, that cost me Php 70 per way.\r \r Taxi driver recommended to me this is better, usually I always trust the local taxi. Once arrived at lobby, body search by guard as usual in Philippines, walk inside, one is greeted by the huge expansive and can see 4 to 5 floors link by escalator. \r \r Varieties of outlet selling clothes, electronic, food and many more. There wasn't really crowd probably it is due to it is still new and many shop under renovation. \r \r There are plenty of food outlet on the 3rd Floor, western, locals. There is SMX Exhibition Hall also.\r \r The surprise is that, the WiFi is working and quite effective probably due to lesser crowd, hope this is not the case.\r \r I surely will cone back to SM Lanang whenever I travel to Davao Phillipines."
	},
	{
		"User": "leftovertoo",
		"Location": "Oslo, Norway",
		"DateofReview": "February 10, 2015",
		"ReviewTitle": "SM Bakery at SM Hypermarket Lacks HYGIENE, A MESS.",
		"Review": "SM Bakery at SM grocery store is a disaster. They use nice baskets with disposable paper liners. The only thing they dont dispose of the liners. The whole day each and every customer shares the same basket liner that becomes rather disgusting as the day proceeds. People are eating their cakes as they wait in line to pay Kids dirty hands are on the pastries, etc. etc, and the droppings are not removed and are there for you when you put your cakes etc. on the same liner. HELLO, they are disposable cheap paper, throw them out after each use. Stop trying to save money over hygiene."
	},
	{
		"User": "saf7670",
		"Location": "Peterborough, United Kingdom",
		"DateofReview": "February 6, 2015",
		"ReviewTitle": "Standard SM Mall in Davao",
		"Review": "3 levels of shops restaurants including cinema and bowing in Lanang, Davao. The shops are generally the same as found in SM stores throughout the Philippines.\r SM Lanang has however an outdoor range of upmarket restaurants which provide excellent western style meals. The mall also has a musical light/ water fountain show in the evenings.\r If you are passing through Davao SM is a great place to spend a few hours."
	},
	{
		"User": "Samy N",
		"Location": " ",
		"DateofReview": "November 20, 2014",
		"ReviewTitle": "Huge Mall to spend full day.",
		"Review": "all excellent brands many restaurants and adult entertainments and kiddie entertainment, huge mall, so when you visit Samal island resorts you must go for a refreshment visit to SM Lanang, will take you back to Urban life again."
	},
	{
		"User": "Xanerin",
		"Location": "Alice Springs, Australia",
		"DateofReview": "November 7, 2014",
		"ReviewTitle": "Big lot of nothing",
		"Review": "This mall is huge and reminds me of many malls in Australia. No character - shops around the outside with the open space in the middle with nothing. So much could be done to improve this space - suggest a huge carousel for the patrons and this would certainly add more appeal. There was a jumping castle on the lower ground floor which was squeezed in - not tied down - poor effort. The only thing this mall has going for it is the restaurants - Vikings, Hogs Breath, and the usual. Feel I had visited a hospital rather than a mall, however excellent toilets!"
	},
	{
		"User": "marie032013",
		"Location": "West Kirby, United Kingdom",
		"DateofReview": "October 21, 2014",
		"ReviewTitle": "not worth the money",
		"Review": "I have been in Bench Fix Salon in Sm Lanang during my holiday. I requested for hot oil treatment. The staff gave me a \"power dose\" which consisted of cream applied on my hair and covered it with a cellophane. I asked why they did not do the usual hair steaming and the staff replied that it is only available for hair spa. It was the first time that I had a hot oil treatment without the \"hair steam\". I would not recommend it and its not worth paying 850 pesos."
	},
	{
		"User": "MarJho16",
		"Location": "General Santos City, General Santos, Philippines",
		"DateofReview": "October 6, 2014",
		"ReviewTitle": "Enough space",
		"Review": "The place is quite ordinary, we just come here to stroll and buy goods. I liked the view the saleslady is accommodating."
	},
	{
		"User": "raymmiconmapper",
		"Location": "Bacolod, Philippines",
		"DateofReview": "September 20, 2014",
		"ReviewTitle": "Trendy mall",
		"Review": "large SM mall just like its cousins in NCR, Luzon & the Visayas..they access bridge to Park Inn Radisson Davao hotel,the SMX convention center favorite venue for exhibits & fairs..security guards are courteous & I saw one of the guards riding on a segway checking the vicinity! wow! hope to visit SM Lanang the next time."
	},
	{
		"User": "blessie",
		"Location": "New Zealand",
		"DateofReview": "August 29, 2014",
		"ReviewTitle": "Love the fountain court",
		"Review": "Another SM mall that cannot be missed. The attraction here is quite different from SM City in that this mall has a fountain reputed to be the largest in the Philippines. The water fountain puts on a great light show every night, every hour starting from 4 p.m. As for the mall, the shops are mostly the \"branded\" varieties, so prices can be a bit steep if you are paying in Philippine pesos. If you convert it to dollars, then it's still cheap. The mall does not have the same foot traffic as SM City so it doesn't really get that crowded. There is also always something going on in the Atrium - could be an exhibit or a nightly show. The basement houses hair salons and other places where you can have your nails or eyebrows done. It also has service centers where you can pay your utility bills. As for eating places, go to the top floor, and the choices are quite a few - all reasonable priced. For the record - cafes and restaurant inside the mall are cheaper than those outside the mall or those facing the Fountain Court."
	},
	{
		"User": "Liezel G",
		"Location": "Davao del Sur Province, Philippines",
		"DateofReview": "August 8, 2014",
		"ReviewTitle": "Biggest mall in Davao",
		"Review": "This is the biggest mall in the City! They have the first Vikings Restaurant in Davao. The place is huge, I love the idea that I can still get sunlight from the inside specially at the atrium. The have a fountain court that is very nice during the night!"
	},
	{
		"User": "McJhoe",
		"Location": "Al Ahsa, Saudi Arabia",
		"DateofReview": "August 5, 2014",
		"ReviewTitle": "The only premier class sm mall in mindanao at the moment.",
		"Review": "Very nice premier classmall having great feature like world class 4 star-hotel\"park inn by radisson, world class mice \"smx convention center, imax cinema, very nice atrium, science discovery, bowling and more plus a lot of famous local and foreign restaurant along sky garden and fountain court area."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "July 3, 2014",
		"ReviewTitle": "Convenient for those coming from the north.",
		"Review": "Coming from Davao del Norte, SM Lanang is just the right place for a stop. It is also so close to Swiss Deli, though there are also good restaurants inside. \r \r The needed items can be mostly found here from high-end stuffs to practical needs. My husband chose to have his hair-cut here as well. Parking is not a problem. It has wider area for cars. Very convenient from parking to the various levels of the Mall through a two-way escalator from there.\r \r Love to be here too."
	},
	{
		"User": "Ecyor",
		"Location": "Manila",
		"DateofReview": "May 2, 2014",
		"ReviewTitle": "Wow!!! Was all I could say",
		"Review": "From the title of my review, i was simply amazed with what I saw. Way back in 2010, there was only SM Ecoland and now in 2014 when I came back, they have this. Kinda far from the city proper and near the airport, this place is still accessible.\r \r It actually reminds me of a crossbreed between SM North Edsa and SM MOA."
	},
	{
		"User": "BGonzalez1973",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Jewett City, Connecticut",
		"Location": "Jewett City, Connecticut",
		"DateofReview": "December 17, 2013",
		"ReviewTitle": "Big Mall",
		"Review": "One of the several malls I visited while in Davao. They have a wide variety of stores for anyone's shopping pleasure. They also have a wide variety of places to eat if you get hungry. Very clean and well kept mall. Would definitely recommend this mall if you love shopping and are not on a budget."
	},
	{
		"User": "TinaCasey0423",
		"Location": "Pasig, Philippines",
		"DateofReview": "December 4, 2013",
		"ReviewTitle": "One of the biggest malls in the Philippines, down south",
		"Review": "SM Lanang Premier is just like the twin sister of SM Mall of Asia in Manila. It offers a spacious mall area lined up with stores from both international and local brands. SMX Convention Center is located at the 3rd floor of the mall, spacious area good for conventions, concerts, corporate events and other big functions. I consider this as one of the world class malls in the Philippines, next to SM Mall of Asia."
	},
	{
		"User": "davaocityguide",
		"Location": "Davao City",
		"DateofReview": "October 7, 2013",
		"ReviewTitle": "Biggest Mall in the Philippines' Biggest City",
		"Review": "There's just so much space in this mall. Whether shopping, dining, or just lounging around, it's quite enjoyable spending time in this one of a kind mall, spacious, very clean mall. Kind of reminds me of Singapore malls -- generous spaces, and good quality but affordable brands. One wouldn't think this mall in a province in the Philippines, but it is!"
	},
	{
		"User": "Gordonchef",
		"Location": "Vancouver, British Columbia, Canada",
		"DateofReview": "September 4, 2013",
		"ReviewTitle": "Bowling lane sub standard. theaters ok. mall is so so",
		"Review": "Nothing special about this mall. Just like any other malls. Having over prices stores that no one buys. Nice free a/c. The water/light shows makes it sad.. I guess for davao standards its something to look at but if you seen Bellagio or Hong kong disneyland for kids water park, this makes it look like a water hose and some flashlights.. Bowling lanes are shorter than standard lanes and they oil every inch so actually bowlers that spin the ball , there is no traction. Movie theaters are like any other newer malls in davao. The IMAX is here a JOKE, its not 180 degree screen more like 90... 3d effects are mediocre at best. At least they have some decent resto here."
	},
	{
		"User": "Eve N N",
		"Location": "Davao City, Philippines",
		"DateofReview": "May 2, 2013",
		"ReviewTitle": "lovely dancing water and lights... made my day holiday complete... :)",
		"Review": "passing by at sm lanang premier yesterday was great. the dancing lights worth the wait. i did not manage to take even a single wink because i dont want to waste any second while the music is on and the water is dancing with beautiful combination of lights.. you must witnessed it too. very fulfilling... :)"
	},
	{
		"User": "DSnoopyGirl",
		"Location": " ",
		"DateofReview": "April 3, 2013",
		"ReviewTitle": "SM's Premier Mall in the South",
		"Review": "SM's extensive experience in the business of Malls is evident in their construction and management of SM Lanang. \r Located in a place which was not conventionally a place for commercial shopping, they have, once again, successfully created a \"supply\" not dependent on the \"need\".\r It boasts of a good number of familiar shops and services that you can find in the capital of the Philippines, which is a real comfort for people from the Metro visiting Davao.\r Parking is not a problem.\r I also noticed a very efficient cab-queuing process that was quick and safe.\r The main Atrium was big and the high ceilings of the mall made this area look even more spacious.\r The security guards were quite familiar with the location of the shops.\r Aircon was cold enough to cool the huge mall."
	},
	{
		"User": "pinayads",
		"Location": "Cainta, Philippines",
		"DateofReview": "April 3, 2013",
		"ReviewTitle": "One-Stop Destination for Shopping, Dining, Entertainment and So Much More",
		"Review": "One of the best malls I've ever been to! I was really awed by the place. It so spacious. The mall's exterior design is inspired by origami, the traditional Japanese art of paper folding. The abstract and asymmetric lines of the origami are introduced in the mall's the north, south and west facades. \r \r SM Lanang Premier is targeted towards the higher segment of the market, no wonder it belongs to the crème de la crème of SM malls. \r \r I love its Flat Café where Starbucks is designed on top of a free-standing slab that offers a 360-degree view of the monumental atrium.\r \r Tenants/Mall staff are very friendly and helpful."
	},
	{
		"User": "JenAspacio",
		"Location": " ",
		"DateofReview": " ",
		"ReviewTitle": " ",
		"Review": " "
	},
	{
		"User": "Manila, Philippines",
		"Location": "Manila, Philippines",
		"DateofReview": "March 29, 2013",
		"ReviewTitle": "Fashion Forum, Flat Cafe, Skygarden and So Much More at SM Lanang Premier",
		"Review": "I love everything about SM Lanang Premier. From the Fashion Forum to the impressive 360 degree view atop the Starbucks Flat Cafe to the restaurants Selera (make sure to try the bacon wrapped bagaybay), Hog's Breath Cafe and Blugre at the Skygarden!"
	}
]
