[
	{
		"User": "redgotsohigh",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "Nice Church",
		"Review": "A very nice church almost at the heart of the city. We almost make it a point to visit 1-2 churches everytime we go out town to pay respect as well as to thank the Lord for the blessings we have been getting."
	},
	{
		"User": "pattayabeach888",
		"Location": "Melbourne, Australia",
		"DateofReview": "August 24, 2017",
		"ReviewTitle": "Wonderful Church and Warm People",
		"Review": "I have met the local priest a couple of times for a quick chat and found him and the staff to be very nice, warm, sincere and compassionate people. If you have the time I think a visit to this church is essential."
	},
	{
		"User": "Althea-CZ",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "July 18, 2017",
		"ReviewTitle": "Nostalgic Visit",
		"Review": "I was able to hear mass and visit the Adoration Chapel when my scheduled clear because my friend can't make it for our lunch appointment. So my aunt invited me to go with her, We had snacks at Cecil's Bakeshop while waiting for the start...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "June 6, 2017",
		"ReviewTitle": "Nice church away from the main thoroughfare",
		"Review": "Seen at the crossroad of Sta. Ana and Lapu-Lapu streets this church has been standing long time but still looks nice and well maintained. Usually a wedding venue too. I"
	},
	{
		"User": "jedainz",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 6, 2017",
		"ReviewTitle": "Church with longest aisle in Davao City",
		"Review": "They renovated Sta Ana into this beautiful work of art over the past years. Gone are the dull grey and white walls to be replaced by cobblestones and rustic brick walls. If you like visiting churches, visit Sta Ana Church."
	},
	{
		"User": "Mick B",
		"Location": "Southampton, United Kingdom",
		"DateofReview": "October 6, 2016",
		"ReviewTitle": "Wonderful",
		"Review": "Came here for a christening service. Inside the church there are many murals depicting the life of Jesus. Well worth a visit"
	},
	{
		"User": "Tarinding",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 22, 2016",
		"ReviewTitle": "old world charm",
		"Review": "It is a baroque themed church. The gold gild and chintz were generously applied inside incl the retablo above the altar plus the fact that it is airconned,makes it my favorite church.There is order and silence althroughout."
	},
	{
		"User": "Tisha B",
		"Location": " ",
		"DateofReview": "July 5, 2016",
		"ReviewTitle": "sunday mass",
		"Review": "Nice church. although modern with LCD screens and fully airconditioned they maintained the architecture and murals."
	},
	{
		"User": "Aveeno1991",
		"Location": "Manila, Philippines",
		"DateofReview": "June 24, 2016",
		"ReviewTitle": "My place of worship in Davao",
		"Review": "My travels to Davao almost always end on a Sunday and first is my agenda for departure day is the early morning mass at Sta Ana. It is a short distance from my hotel (on a good day one could walk) and taxi drivers are...More"
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 16, 2016",
		"ReviewTitle": "Still the same structure since the 50's but upgraded. A holy place",
		"Review": "Sundays bring us to the Sta Ana Shrine for a Cebuano mass at 7 am. It is alright even if I do not speak a word or maybe can speak a few. The parish priest tries to also translate the key words and themes in...More"
	},
	{
		"User": "Wayne E",
		"Location": "Canova, South Dakota",
		"DateofReview": "November 3, 2015",
		"ReviewTitle": "This is the way more churchs should be.",
		"Review": "My wife is a life-long resident of Davao and this is her favorite house of prayer. It takes us over 1 hour to travel here and we visit on a regular basis."
	},
	{
		"User": "obieoneobie_1",
		"Location": "Davao City, Philippines",
		"DateofReview": "October 15, 2015",
		"ReviewTitle": "Great Church",
		"Review": "Over the years it's made many improvements! Now Air-conditioned!! Some Masses in English, over all Very nice church.."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 7, 2015",
		"ReviewTitle": "Solemn place to pray",
		"Review": "From an old art deco church, it has transformed into a lovely, modern air conditioned parish. The altar is also better now. With the heat outside, this makes praying and meditation more solemn and conducive."
	},
	{
		"User": "audmonamikaela",
		"Location": "Lillestrøm.norway",
		"DateofReview": "September 9, 2014",
		"ReviewTitle": "Beautiful church",
		"Review": "I used to hear mass here when we live nearby. The church has evolved since then into a beautiful church. The altar is very beautiful. The church is Air condtioned so it is conducive to hear mass during summer time. Parking area is a bit...More"
	},
	{
		"User": "Dibyne",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 20, 2014",
		"ReviewTitle": "The wedding venue",
		"Review": "The first church in Davao that's airconditioned. Also, the edifice of the church was improved because of its popularity as wedding church for most couple."
	},
	{
		"User": "Davao City, Philippines",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 2, 2013",
		"ReviewTitle": "Amazingly perfect.",
		"Review": "It was quite some time when I last visited the shrine. Last week, we decided to hear mass there. Wow, it was totally like in heaven. The altar is so nice one would feel it's like in the clouds with the angels and saints. The...More"
	}
]
