[
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "March 4, 2018",
		"ReviewTitle": "Bought one nice orchid plant for home",
		"Review": "For a change we decided to come here and find out what we can see. Yes nice variety of orchids. They said they place also some flowers for exhibit during the Kadayawan festival in there booth. We came here just dropped by from a trip on our way back down to Davao City.."
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 4, 2018",
		"ReviewTitle": "if you like orchids this is the place",
		"Review": "if you dont like them, dont go over here. we spend a couple of hours and were well entertained by the owner who explained everything about this flower."
	},
	{
		"User": "redgotsohigh",
		"Location": "Manila, Philippines",
		"DateofReview": "November 26, 2017",
		"ReviewTitle": "Very nice place for Orchids Lover",
		"Review": "A very nice place especially if you love flowers specifically Orchids, you can also buy orchids from the cheapest to the most expensive one's that costs around P9000"
	},
	{
		"User": "Universaltraveler09",
		"Location": "Philippines",
		"DateofReview": "June 30, 2016",
		"ReviewTitle": "Very nice. For Orchid lovers",
		"Review": "We visited the place because we are all Orchid lovers. Very nice, i didn't buy orchids but bought Staghorn ferns instead. Place smells like pesticide though because they just sprayed. If I knew they were spraying that day, I wouldn't have gone."
	},
	{
		"User": "Asia A",
		"Location": "Narra, Philippines",
		"DateofReview": "May 11, 2016",
		"ReviewTitle": "Absolutely Beautiful",
		"Review": "You have to appreciate nature's natural beauty to enjoy these magnificent and colorful orchids. I could have spent hours there looking at and photographing the orchids. No explanation was needed by the guide through the nursery as beauty needs no explanation.\r \r The display area is filled with different varieties, artwork and sculpture. On your walk through the growing area there are orchids as far as the eye can see. \r \r If you love nature, beauty and color...then take the time to visit."
	},
	{
		"User": "Youncedl",
		"Location": "Meridian, Mississippi",
		"DateofReview": "April 13, 2016",
		"ReviewTitle": "Wouldn't waste your time UNLESS...",
		"Review": ".... you are into where and how they grow these flowers. You go in, pay your money, and someone takes you around the huge growing operations and tells this is that or this flower."
	},
	{
		"User": "Melba A",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "November 6, 2015",
		"ReviewTitle": "a huge orchid farm",
		"Review": "get to visit a working orchid farm that is just 45 minutes from the city proper. there's a tremendous variety of orchids. it is clean, orderly and it will make you want to buy."
	},
	{
		"User": "Magiting",
		"Location": "Sydney, Australia",
		"DateofReview": "March 26, 2015",
		"ReviewTitle": "Wonderful Orchid Farm",
		"Review": "Amazing orchids flowers all over the place. The staff are very informative about how to care an orchid plants"
	},
	{
		"User": "christa d",
		"Location": "Vienna, Austria",
		"DateofReview": "July 27, 2014",
		"ReviewTitle": "Enter a fascinating place",
		"Review": "See orchids big as you. Watch how they grow. Learn how to treet them well. And buy one only for your philippine friends, they need at least 80% humidity. Gardeners sharing all their knowledge about orchids."
	},
	{
		"User": "xsnia",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 1, 2014",
		"ReviewTitle": "Interesting flower farm",
		"Review": "The display hall is organized and feature the best orchids they have. But they need to have a guide who can explain what the farm is about, about orchids and its contribution to the city. It could have been a better experience."
	}
]
