[
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 22, 2017",
		"ReviewTitle": "Few water",
		"Review": "A good idea is maybe to go there in rainy season or after a few days of rain. Otherwise the fall is really small. \r Not so easy to come there. Rent a car then there's no hassle with the drivers on the islands. They will try to ruin you. Discussion are so tiring. Or ask locals for correct pricing.\r You should never and nowhere accept to pay too much because you're tourist. You make life expensive for the locals. Start with the \"famous\" habalhabal drivers on Samal. \r You should wear good shoes for this fall. "
	},
	{
		"User": "SimonDabbs",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "August 20, 2015",
		"ReviewTitle": "An interesting trek on Samal Island, but not all that spectacular",
		"Review": "We parked our vehicle, paid our admission fee and hiked to the falls. It's probably about 2km, but in places the path is steep and rocky, so not really suitable for young children or the old or infirm. In places, signposting is a little poor. Once the falls are reached, the viewing area is rather restricted, which could be a problem on busy days. The walk to and from provides some good exercise, but the falls are not really very spectacular. It's basically a single plunge into a pool."
	},
	{
		"User": "joy t",
		"Location": "Cebu City, Philippines",
		"DateofReview": "March 2, 2015",
		"ReviewTitle": "the other side of the island",
		"Review": "quiet far and small roads...we rented a motornike for 2 days and went around the island from paradise island resort to kaputian until we reach pangubatan beach resort all the way to Tagbaobo Falls ,,, we did not stop cause its getting late we just passed by... its like its in a hidden place"
	},
	{
		"User": "rubberunethical",
		"Location": "Dubai",
		"DateofReview": "August 10, 2014",
		"ReviewTitle": "Cool hydro massage spray & mist pleasure",
		"Review": "we would if we could camp there if we could arrange to iron out toilet and meal problems with our current friendly Pangubatan resort"
	},
	{
		"User": "BernardAllauigan",
		"Location": "Makati, Philippines",
		"DateofReview": "April 28, 2014",
		"ReviewTitle": "Rough road leading to falls",
		"Review": "Traveled about 20 minutes on a motorcycle. When you are near he falls, rough road and slopes lead you to the falls in Sitio Mangongawong, Barangay Tagbaobo in Samal Island, Davao del Norte."
	}
]
