[
	{
		"User": "Andrea Irinna V",
		"Location": "Panabo City, Philippines",
		"DateofReview": "1 week ago",
		"ReviewTitle": "Stunning",
		"Review": "Last April 21, 2018, I visited Prayer Mountain in Calinan with a friend. I like the place, it was really stunning and surprisingly cold. The best part of the whole tour were the European inspired houses with three different colors. Since it is a prayer mountain, you have to observe silence at all times and of course there's dress code. The people were accommodating and if you are an IG crazy person, this place is absolutely for you. The best time to go to Prayer Mountain is during day time as there few people and the heat of the sun is not a problem. We only commuted from downtown Davao and was able to secure an authorization letter thru email and we paid while we are already in Tamayong (because we only commute and to avoid the hassle of going to their office in Buhangin). We are very thankful to the staff of the Prayer Mountain as they understood our situation. This place is highly recommended to families."
	},
	{
		"User": "Acid P",
		"Location": "Tagum City, Philippines",
		"DateofReview": "March 16, 2018",
		"ReviewTitle": "Peaceful Haven in DC",
		"Review": "Nice place to visit when you need to relax from the hustle and bustle of city living. Nature tripping and good place to meditate as well. You really need to wear comfortable footwear since you'll be walking most of the time. Nice view, there are different varieties of plants and flowers too. They also have a cafeteria and souvenir shop to buy your pasalubong. "
	},
	{
		"User": "paulapple",
		"Location": "england",
		"DateofReview": "February 1, 2018",
		"ReviewTitle": "Odd ",
		"Review": "Strange walled enclosure high in the mountains everything immaculate. Maintained by his followers it seems. From housing to helipad. Felt good to get out"
	},
	{
		"User": "Merck66",
		"Location": "Philippines",
		"DateofReview": "January 17, 2018",
		"ReviewTitle": "An amazing garden in the city",
		"Review": "It's a must-see place! The plants, flowers and trees are superbly landscaped and well maintained. You can see some uncommon varieties of plants. You can buy plants at reasonable prices displayed outside the entrance gate. I will not tire visiting the garden over and over again."
	},
	{
		"User": "Brooke S",
		"Location": " ",
		"DateofReview": "December 6, 2017",
		"ReviewTitle": "The Feeling of Heaven",
		"Review": "Well maintained place. Very clean with all the wonderful trees and amazing different kinds of flowers. Clean and huge building like palace. Wonderful place to meditate with their very relaxing music. Very clean and cozy. \r There's Restaurant, Souvenirs Shop, Coffee Shop and you can also buy some of their flowers.\r when you come and visit the place, you should wear decent attire. No allowed wearing sleepers, naka sando."
	},
	{
		"User": "jedainz",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 6, 2017",
		"ReviewTitle": "Nothing to do except look at the garden",
		"Review": "If you like scenic views then this place is for you. Otherwise, nothing can be done here. No activities present at the premises.\r \r This isn't really a tourist spot but it has become popular with locals when they opened it for visitors who want to see the buildings that las if you are in a luxury village in the US."
	},
	{
		"User": "paulapple",
		"Location": "england",
		"DateofReview": "March 24, 2017",
		"ReviewTitle": "Disappointed ",
		"Review": "We visited expecting a spiritual retreat. More like Disney. High walls keep out the poor as does a strict dress code. Volunteers maintain immaculate gardens but military style parades of some of the followers left us all feeling uneasy"
	},
	{
		"User": "KatzT",
		"Location": "Manila, Philippines",
		"DateofReview": "February 25, 2017",
		"ReviewTitle": "Excellent place for retreat",
		"Review": "This place is actually named- Garden of Eden Restored Prayer Mountain. The area is far from Davao city downtown area. It's going up Tamayong, Calinan. Its best to bring your own ride. You have to book at least two days ahead just to make sure you will be accomodated inside. You cant tour the whole area without a tour guide from inside. No fee for the guide.\r Once you are inside, the long drive is all worth it. There's a wide variety of flowers and trees not found here in the Philippines. Different lovely colors of flowers. The green grass is so fresh smelling and evenly cut.The whole place is very clean and quiet. It's an ideal place to meditate or think. There is an entrance fee. They have a coffee shop,a restaurant, and a souvenir shop inside. The whole landscape is awesome.\r Reminder:slippers,shorts,sando,\r sleeveless shirts are not allowed. Decent clothing is a must. Definitely no smoking inside. "
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 19, 2017",
		"ReviewTitle": "the best maintained place in the philippines",
		"Review": "I went here and was suprised about a lot of things. the place is well maintained and just gorgeous. they have a wonderfull garden with soundsystem. gorgeous waterfall. its a sekt but they did not try to convert us. they had a nice gift shop. i was pleasently supprised visiting this place."
	},
	{
		"User": "Beth G",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "December 16, 2016",
		"ReviewTitle": "It's not called paradise restored for nothing! It feels Paradise indeed!",
		"Review": "Though we come from a different religion, our hosts said we will nevertheless love this place. It's a prayer mountain of another faith and they allow the public to visit but with strict adherence to dress code (no shorts for both men & women; revealing tops etc) and no boisterous laughter. We respect each other's faith. For a moment there, we were literally brought to another place & time! Truly the efforts of the staff to make it such a refreshing and serene place paid off!"
	},
	{
		"User": "jamessK7209AH",
		"Location": "Houston, Texas",
		"DateofReview": "September 11, 2016",
		"ReviewTitle": "Garden of Eden Restored",
		"Review": "Prayer Mountain is associated with a religious movement \"The Kingdom of Jesus Christ, the Name Above Every Name\". We were honored to have the opportunity to visit what is likely the most beautiful place in the Philippines. The location is less than 50 Km northwest of Davao in the foothills of Mt Apo. The highlights include beautiful gardens that convey serenity and actually have a spiritual feel My favorite place in Davao."
	},
	{
		"User": "renjumodequillo",
		"Location": "Singapore, Singapore",
		"DateofReview": "July 13, 2016",
		"ReviewTitle": "His Kingdom come",
		"Review": "Truly this place is amazing. You can find peace and rest. One of the best place to go when you are in Davao. Life is here."
	},
	{
		"User": "Miler15",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 25, 2016",
		"ReviewTitle": "Paradise inside",
		"Review": "The Prayer mountain is a bit far from the city proper. You need to have an appointment and pay the entrance fee at the Jose Maria College to set a schedule of visit. There are rules when inside. The place is nice, green and refreshing. A nice place to meditate and relax for a few hours. Food is inclusive of the package. The staff are nice."
	},
	{
		"User": "iamatopmodel",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 3, 2016",
		"ReviewTitle": "Food ain't that good.",
		"Review": "After a little more than a year I get to revisit this paradise. We opted to get a plate in lunch. Chicken was dry. Noodles tasted ok. But it was their dessert that gave them a saving grace. It's your typical sweetened banana but was very flavorful with plenty of cheese. The whole place was still very well maintained."
	},
	{
		"User": "Mikee2525",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 26, 2015",
		"ReviewTitle": "Nice but wouldn't go back",
		"Review": "Pro: The whole scenery is lovely and the people are nice to you. The tour guide that was assigned to us was quite welcoming as well. She led us to the great spots of the place.\r Cons: They keep on asking for donation. I don't mind giving some help at all but they keep on handing you envelopes for you to put in some money. The lunch also costs 250 which is slightly overpriced for me."
	},
	{
		"User": "rey m",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 25, 2015",
		"ReviewTitle": "They will squeeze every penny you got",
		"Review": "I never wanted to go here but my mom already bookes us tickets for christmas. The place is nice, yah, but they will squeeze every penny you have. Starting from their entrance fee of 150/pax. Then the 1st security guard that greeted us at the entrance handed us an envelope asking for \"pinaskohan\". Then at the coffee shop after the orientation, teenage girls handed over envelopes again asking for \"pinaskohan\".. Wow, just wow. Not to mention their very strict rules on your attire. NOT. COMING. BACK. EVER."
	},
	{
		"User": "Laking D",
		"Location": " ",
		"DateofReview": "December 15, 2015",
		"ReviewTitle": "Truly the Eden restored",
		"Review": "European ambiance with fresh air... I am with my son Agila when I came here. Just a suggestion. If your planning to multi place here in calinan ang your planning to visit Malagos Garden. I will suggest that you schedule your visit in Malagos first then after that here in Eden Restored. Eden easily overlap the beauty of Malagos. But Malagos is a good place it's just that for save for the last thing."
	},
	{
		"User": "Kaye214",
		"Location": "Davao",
		"DateofReview": "November 11, 2015",
		"ReviewTitle": "Serenity in the mountains",
		"Review": "The moment you enter this place, you feel transported to a place thats serene and the dream of the founder. The whole place has lots of flowers and trees and is very clean. Houses remind you of being in the US. Its a great place to visit to get away from the hustle and bustle of city life. \r \r You have to book in advance in the city to enter the garden."
	},
	{
		"User": "Elaine J",
		"Location": " ",
		"DateofReview": "August 30, 2015",
		"ReviewTitle": "The Gardens are manicured to perfection",
		"Review": "The100 yard road to the parking area is fit only for off-roaders. Piped music played everywhere. Disabled facilities are poor, my father was so looking forward to the visit but spent the duration in the coffee shop as it was not suitable for a disability scooter as too many steps."
	},
	{
		"User": "Sally C",
		"Location": "Butuan, Philippines",
		"DateofReview": "May 6, 2015",
		"ReviewTitle": "A Taste of Heaven",
		"Review": "I heard a lot of good things about the \"Prayer Mountain\" in Tamayong. I became curious so I included it in one of our itineraries when my family went to Davao. Tamayong is a bit far from Davao City but the distance wouldn't matter once you see the place. It's all worth the visit. Your eyes would feast on looking and appreciating their well manicured lawns, the lush gardens, the colorful plants, the landscape architecture, and the European-inspired houses. You would also feel the feeling of serenity, tranquility, and calmness. Truly, it's a place for meditation. Once you decide to visit the place, don't forget to secure a clearance from Jose Maria College. The minimal entrance fee of 100 pesos is solely for the maintenance of the place. They also strictly imposed dress code. Wearing of sleeveless, slippers, and shorts aren't allowed for both men and women. \r If given the time and chance, I love to go back to Tamayong Prayer Mountain (which they called now Garden of Eden Restored). It seems like you'll have an advance taste of heaven."
	},
	{
		"User": "yasameen_desu",
		"Location": "Manila, Philippines",
		"DateofReview": "February 19, 2015",
		"ReviewTitle": "A breath of fresh air!!!",
		"Review": "Directions from downtown: Ride a jeep to Bangkerohan market. Look for Calinan-bound L300 vans and pay 45php. Tell the driver that you will go to Quiboloy. The ride from downtown Davao to Calinan is about an hour. Get off at Botika Carina in Calinan where habal habals going to Philippine Eagle Center are parked. Tell the driver to take you to Tamayong Prayer Mountain (or Quiboloy). Habal Habal fare per person is 35php. It is about 30-45minutes habal ride. It could get cold so bring a jacket with you.\r \r Note: There are also jeepneys that travel straight from downtown Davao to Calinan. \r \r Fee & Authorization Letter: It is best to secure the authorization letter in Jose Maria College (beside Francisco Bangoy International Airport). You will be asked to pay 100php for the entrance and 50php donation for the Church. Once you have the authorization letter, you can easily enter Tamayong Prayer Mountain. The guard at the gate will ask you for that auth letter.\r \r Tour: Present the authorization letter to the guard. He will ask you to wait in the cafeteria for a quick orientation/briefing. The briefing is just a quick presentation about how Tamayong Prayer Mountain was built and the do's and dont's inside the premises. A tour guide will be assigned per group. No fees will be collected. There is a toilet/washroom inside the premises should you need to use one.\r \r The place is serene so it would be best to be considerate and not make unnecessary noise while roaming the area. It's just a short walk since the entire area is only 2 hectares. \r \r Our tour guide is really nice. He didn't say much. I think the guide is only present to ensure that the guests walk in the designated pathways and to avoid picking of flowers and plants. The place is really well-maintained.\r \r Place to eat: We rested in their cafeteria, the place is really nice and fancy. We ordered a 3-in-1 coffee since it was cold, it was drizzling when we visited. We were expecting to sit outside but the staff provided a table for us. A nice ambiance for a 25php coffee. \r \r Overall, I think this is a great place to visit in Davao. A breath of fresh air, literally and figuratively. It seems like you are taken in a different dimension inside, kind of a European feel. The air is fresh and cool unlike the hot and dry temp in downtown Davao. Worth a visit!"
	},
	{
		"User": "axlefoley",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 30, 2015",
		"ReviewTitle": "Heavenly!!!!",
		"Review": "One of Davao City's hidden secrets. A sight to behold not only for its beauty and cleanliness but also for the people staying there. Love this place. Check out my blog for more pictures."
	},
	{
		"User": "Lurenn S",
		"Location": " ",
		"DateofReview": "January 1, 2015",
		"ReviewTitle": "Beautiful and clean everywhere...",
		"Review": "One of the nicest place I have visited. This place is very beautiful, peaceful and clean. The people here are very nice and accomodating, their smiles are infectious. Even the food in their restaurant is very good. Prayer Mountain is just so beautiful... I highly recommend this place as a must to visit when you get to Davao. And I will be coming back for sure."
	},
	{
		"User": "Petron L",
		"Location": " ",
		"DateofReview": "December 8, 2014",
		"ReviewTitle": "Everybody's welcome!",
		"Review": "I would say come and experience it first-hand :) Some advice to those who want to visit the place--they accept walk in visitors if they comply with the dress code. No shorts,sleeveless, or above the knee skirt and ordinary house slippers. Also be ready to pay P100 per pax for maintenance fee. However, it is best to secure a permission either online or at their office beside the airport at Jose Maria College, booking can also be done by calling or online.\r \r For booking and reservation, please contact:\r Office landline: 304-0647 or 234-2866 local 123\r Mobile No: 09163789619 (Globe) | 09491359173 (Smart)\r Fax: 234-7277\r Email: info@kingdomofjesuschrist.org"
	},
	{
		"User": "Gary T",
		"Location": "London, United Kingdom",
		"DateofReview": "September 10, 2014",
		"ReviewTitle": "They ruined my day!",
		"Review": "We arrived at this place and they said, oh sorry there is now a special event going on and you cannot come in, but you can come back next week. So although we had travelled for a few hours and spent good money to get there, they would not let us in. They even wanted us to go to another office which would have been another 3 hours round trip before we start to go to the garden. Do not be fooled by the nice words on their website, they do not give good information and are not visitor friendly. They do not care, they just said we are a private garden and can do what they like. A nice christian attitude !"
	},
	{
		"User": "HellenK",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "August 30, 2014",
		"ReviewTitle": "Paradise on Earth......",
		"Review": "I'm glad to have visited Tamayong Prayer Mountain. It is a beautiful place with lots of trees and flowers. The lawns are well manicured and the place is well kept. Very relaxing and serene place. The people there are very nice and accommodating. \r \r They have a restaurant where you can have your lunch but you should make a reservation in advance. Entrance fee plus family setting lunch is P 400.00. The food is delicious and worth the money. \r \r Overall, I highly recommend that you should visit Tamayong Prayer Mountain. I would definitely love to come back again."
	},
	{
		"User": "winterdates",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 25, 2014",
		"ReviewTitle": "beautiful scenery",
		"Review": "Its a nice place, a lot of beautiful flowers and trees. The comfort room is so clean and smell fresh I really can't imagined that I was the inside of the CR. If you love natures this place is suit to you.."
	},
	{
		"User": "iamatopmodel",
		"Location": "Davao City, Philippines",
		"DateofReview": "July 24, 2014",
		"ReviewTitle": "serenity at its finest",
		"Review": "i adored how well manicured this place was. but more than the beautiful scene it offers, i admire the hard work of people who voluntarily stayed in keeping and restoring this place they consider their garden of eden. we had reservations a day before but for some reasons it wasnt reflected on their records. we need not prod them to let us in as we were welcomed right away just like any of their guests. just be ready to pay the entrance fee of php100. they strictly adhere to certain rules; no slippers, shorts and sleeveless allowed inside."
	},
	{
		"User": "slyvargas",
		"Location": "Bacoor, Philippines",
		"DateofReview": "July 13, 2014",
		"ReviewTitle": "Holy Grounds",
		"Review": "Felt like paradise, or at least some peaceful European village... They (very) rarely accommodate walk-in visits though, so better get in touch with their contact person or see their office near Davao-airport (Francisco Bangoy International Airport). You need to have that \"authorization letter\" to get in apart from the maintenance fee of P100 per person.\r \r Lastly, you need to observe their dress code when visiting the place."
	},
	{
		"User": "Maria C",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 26, 2014",
		"ReviewTitle": "Excellent Garden",
		"Review": "This is the most beautiful garden I've ever seen. From flowers to grass and the cleanliness of waters, paths. Thumbs up!..This is a must visit place."
	},
	{
		"User": "Dibyne",
		"Location": "Davao City, Philippines",
		"DateofReview": "March 20, 2014",
		"ReviewTitle": "A must-be visited place",
		"Review": "This is the Europe of Davao City. In an 8 hectare property, you will be amazed with several palaces plus great landscapes of flowers and river. The place is open for tourists, but they dont entertain walk-ins. Better reserve in their school, beside the airport."
	},
	{
		"User": "2trevor",
		"Location": "Whanganui, New Zealand",
		"DateofReview": "January 27, 2014",
		"ReviewTitle": "Beautiful",
		"Review": "Absolutely amazing gardens in the middle of nowhere, everything clean and pristine, worth a visit. Lovely water features, paths, seats, plants, flowers, shrubs and trees all arranged and manicured beautifully."
	},
	{
		"User": "lizl0ves2travel",
		"Location": "Manila, Philippines",
		"DateofReview": "October 26, 2012",
		"ReviewTitle": "One with God and Nature",
		"Review": "This was the only place in Davao City that hooked my interest. It wasn't as touristy as the others and that's more like it. Getting to this place takes time and effort. You'll be required to register first in order for you to be allowed...More"
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "August 13, 2012",
		"ReviewTitle": "Excellent place to meditate and commune with nature",
		"Review": "This is one of a kind in the city of Davao. Far from the crowded places. Fresh air, great ambiance and a wonderful garden to commune with nature. Looks like you are in a foreign country. Some buildings for housing visitors and groups with religious...More"
	},
	{
		"User": "Dannielle v",
		"Location": "Oklahoma City, Oklahoma",
		"DateofReview": "July 8, 2012",
		"ReviewTitle": "Europe in the Philippines",
		"Review": "This place is the best ever in the Philippines. Unknown to many, this is open to all people of religious background. No entrance fee, and most of all, the roads are now paved. Entering its amazingly maintained gardens is a once in a lifetime experience....More"
	},
	{
		"User": "avidfinalcut8",
		"Location": "Vancouver, Canada",
		"DateofReview": "March 16, 2012",
		"ReviewTitle": "Paradise on Earth!",
		"Review": "Very nice place for meditation and relaxation. It's like your in a far away county."
	},
	{
		"User": "Maribel N",
		"Location": "QC",
		"DateofReview": "March 14, 2012",
		"ReviewTitle": "Self Dicovery at Tamayong Prayer Mountain",
		"Review": "It's a very nice experience at the Tamayong Prayer Mountain. It was a rough ride but it was really worth it. I would reccommend it for meditation and self discovery as well."
	}
]
