[
	{
		"User": "looklikecris",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "Reviewed January 24, 2018 ",
		"ReviewTitle": "I thought we were out of the country",
		"Review": "It is my first time to visit Mindanao and I was so impressed with their culture. It felt like I was not in the Philippines. \r \r We missed to see the Fireshow because of the rain but the cultural show was enough to keep us entertain. This is a must if you will visit Davao. \r \r You must come here 30 minutes before the show starts, the place was just small and really crowded during the show. So you can get a good spot."
	},
	{
		"User": "vmdr90",
		"Location": "Cagayan de Oro, Philippines",
		"DateofReview": "Reviewed November 11, 2017 ",
		"ReviewTitle": "On Fire",
		"Review": "Witness some awesome Fire Dancing and Tribal songs and Dances performed by the Tribu K Mindanawan . Filipinos can will be able to have a deeper appreciation our culture afterwards. Very recommended for foreigners too."
	},
	{
		"User": "lionlamica",
		"Location": "Florida",
		"DateofReview": "Reviewed November 3, 2017 ",
		"ReviewTitle": "Fire show was awesome'",
		"Review": "If you are in the area you should stop. They do this fire show that will blow your mind and is worth the trip.If you like exotic stuff they also have food you might like' There are also gift shops right across the street if you want to get something to remember your trip. This place is free with your admission to the croc park, just save your ticket stubs."
	},
	{
		"User": "Ronnarie",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed October 25, 2017 ",
		"ReviewTitle": "Best fireshow everrr!",
		"Review": "Goosebumps everytime I watched the show! This is one of the highlights of Davao tour, so never ever miss this. Awesome peeps, will never get tired of you."
	},
	{
		"User": "Hykes D",
		"Location": " ",
		"DateofReview": "Reviewed October 18, 2017 ",
		"ReviewTitle": "Best Place to Eat and Witness Cultural Dance",
		"Review": "A friend recommended me to go there and eat Crocodile Meat :)\r So I went there to try their Croc Meat Sisig... To my surprise, it taste great especially together with a mug of beer :) Plus there is a bonus, the Fire Dancers did a world class performance when I went there :)"
	},
	{
		"User": "familyvagary123",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed September 20, 2017 ",
		"ReviewTitle": "The most Amazing Fire Show Ever!",
		"Review": "The Fire Dance choreography is the best here. We like the tricks and the surprises during the dance. They were able to make a green flame that is exceptional. I've never seen it before. We're glad we came here. The restaurant offers native Filipino cuisine plus the steaks made of crocodile or ostrich meat. Entrance to this place is free when you buy tickets at crocodile park."
	},
	{
		"User": "HanaCarrera",
		"Location": "Pangasinan, Philippines",
		"DateofReview": "Reviewed April 17, 2017 ",
		"ReviewTitle": "Exceptional fire dance, average food!",
		"Review": "I went here with my sister because I've heard positive reviews about their fire dance performance (I heard that they also performed cultural dance presentations but we didn't get to witness that on the day of our visit, which was a Friday)! The entrance fee for the show was included in our Crocodile Park ticket (Php 250.00, inclusive of entrance to the Butterfly House, too). The reviews weren't wrong because it was amazing! It was unique, spectacular, and well-executed! The only thing that peeved was that the show did not start on time (supposed to have started at 5:45, but it was 35 minutes delayed).\r \r My sister and I ate dinner while watching the show. The food was quite average. We intended to order the news-worthy \"sungka meal\" but were very disappointed when the waiter informed us that they stopped serving it a long time ago. So we ended up ordering calamari, pork sinigang (Php 160.00), lechon kawali (Php 240.00). The serving sizes were too small (good for 2 or less), and the taste and presentation were common.\r \r To put it simply: stay for the show, not the food."
	},
	{
		"User": "Sheilzy1972",
		"Location": "Melbourne",
		"DateofReview": "Reviewed March 27, 2017 ",
		"ReviewTitle": "amazing fire dance",
		"Review": "This is a must see The dancers were amazing, something different to watch Great skills for cultural dancers We don't mind coming back to watch the show"
	},
	{
		"User": "Mercy888",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed February 3, 2017 ",
		"ReviewTitle": "Nice cultural place",
		"Review": "You can get inside when you have an entrance ticket at the Crocodile Park. The place is nice, clean and very cultural."
	},
	{
		"User": "Davao City",
		"Location": "Davao City",
		"DateofReview": "Reviewed October 22, 2016 ",
		"ReviewTitle": "Fire Dance!",
		"Review": "I've been here several times already but last month was my first experience to watch fire dance. It's amazing that I regret those times i didn't wait for the show"
	},
	{
		"User": "musickaren",
		"Location": "Mandaluyong, Philippines",
		"DateofReview": "Reviewed August 25, 2016 ",
		"ReviewTitle": "awesome fire dance show!",
		"Review": "watched the show after our visit at the crocodile park(which is located a few meters away).\r \r emcee/host was funny. acknowledged the audiences from all over ph and all over the world. \r \r they had a game before the show and the audience loved it. \r saw a 6 (or was that 10-minute) fire dance show. awesome tricks and skills!"
	},
	{
		"User": "Oliver T",
		"Location": " ",
		"DateofReview": "Reviewed August 23, 2016 ",
		"ReviewTitle": "Educational Visit",
		"Review": "This place makes you appreciate the culture of Mindanao even more as it showcases the lifestyle and habitat of some of the Mindanao tribes."
	},
	{
		"User": "Lawrence A",
		"Location": "Quezon City, Philippines",
		"DateofReview": "Reviewed July 24, 2016 ",
		"ReviewTitle": "Fire dance!",
		"Review": "You wouldn't wanna miss the amazing fire dance performed at about 6pm. It's a fascinating experience for the senses! One of the best."
	},
	{
		"User": "nprila",
		"Location": " ",
		"DateofReview": "Reviewed June 19, 2016 ",
		"ReviewTitle": "Lunch before visiting crocodile farm",
		"Review": "Food was good. Place is colorful - I can see Mindanao. They have the sungka meal but since we are only 2 adults and a kid, we didn't order it. I think the main attraction is their band which plays during the night, so I suggest go there during dinner."
	},
	{
		"User": "Constantin106",
		"Location": "Constanta, Romania",
		"DateofReview": "Reviewed June 14, 2016 ",
		"ReviewTitle": "Interesting!",
		"Review": "Interesting, but not fabulous. It probably become more interesting late in the evening, when the shows begin."
	},
	{
		"User": "Medy1950",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed May 23, 2016 ",
		"ReviewTitle": "An attraction within the city",
		"Review": "If you are in the city and want to just enjoy the day, a trip to the Crocodile park is what you can do, And for lunch, you can try the various Tribu K dishes offered at the Tribu K Mindanawan"
	},
	{
		"User": "wildlfower777",
		"Location": "Al Ain, United Arab Emirates",
		"DateofReview": "Reviewed February 25, 2016 ",
		"ReviewTitle": "Mindanao Cultural Heirtage Within Your Reach",
		"Review": "The place is housed inside the famous Crocodile Park which is very accessible by Taxi Ride within the city of Davao. The place showcases a typical native house and its environment which serves native foods cooked the native way during evenings. There is also a regular show in the evening featuring ethnic dances and dramas performed by trained artists complete with authentic costumes and props. One can sit, dine and discover a the rich culture of Mindanao in this place."
	},
	{
		"User": "Ralph S",
		"Location": "San Antonio, Texas",
		"DateofReview": "Reviewed January 14, 2016 ",
		"ReviewTitle": "Nice to visit while at the Crocodile Park.",
		"Review": "This place is right next to the Crocodile Park and is a good place to buy souvenirs at a good price."
	},
	{
		"User": "ingmar b",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed November 8, 2015 ",
		"ReviewTitle": "Crocodile is the best over here",
		"Review": "the place is simple and so is the food. there was a lot out of stock. the crocodile was good but i never like it when there is a service charge."
	},
	{
		"User": "Rina S",
		"Location": " ",
		"DateofReview": "Reviewed October 13, 2015 ",
		"ReviewTitle": "Dance in the fire",
		"Review": "I honestly underrated the fire dancers, until I witnessed them with my two eyes. Im used to this kind of performers in Boracay but Tribu K Mindanawan nailed it. Great performance."
	},
	{
		"User": "John Elbert H",
		"Location": " ",
		"DateofReview": "Reviewed October 10, 2015 ",
		"ReviewTitle": "Great Experience!",
		"Review": "It was after the crocodile farm shows when we visited this place. Their performance was awesome!! the Fire Dance amazed everyone!! and the cultural show as well.. A Davao tour won't be complete without experiencing this."
	},
	{
		"User": "robmaghinang",
		"Location": "Valenzuela, Philippines",
		"DateofReview": "Reviewed September 14, 2015 ",
		"ReviewTitle": "One of Davao's Highlights!",
		"Review": "I went here after my river rafting tour that gave me a complimentary entrance ticket to the Davao Crocodile Park and Tribu K'Mindanawan. The fire dance is long enough and is well-organized. The team by the way has been featured on national TV during Kadayawan...More"
	},
	{
		"User": "Mits A",
		"Location": "Taguig City, Philippines",
		"DateofReview": "Reviewed August 10, 2015 ",
		"ReviewTitle": "Very memorable experience!",
		"Review": "A few minutes of waiting is worth it because the performers gave a good show. They even let us take their picture while inside their ring of fire. I love it!"
	},
	{
		"User": "mayi p",
		"Location": " ",
		"DateofReview": "Reviewed July 26, 2015 ",
		"ReviewTitle": "A must experience in Davao",
		"Review": "I had second thought whether i should bring my guests from iloilo here to witness their firedance as they already have it in boracay. Good thing we went there and was just in time for their 6pm show. They are so great that we kept...More"
	},
	{
		"User": "Sheena F",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "Reviewed July 6, 2015 ",
		"ReviewTitle": "Amazing! Highlight of the visit!",
		"Review": "Youll never see a fire dance as good as theirs. Dont miss their show at 5.45pm after your Crocodile Farm visit. So awesome!"
	},
	{
		"User": "Jan B",
		"Location": "Davao City, Philippines",
		"DateofReview": "Reviewed June 12, 2015 ",
		"ReviewTitle": "a nice place to visit on Ma-a",
		"Review": "we traveled there with my 5 month old son, (that time was a little bit raining) we eat there and bought a couple of souvenirs . place so good and so clean that you won't even want to leave the place."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "Reviewed June 7, 2015 ",
		"ReviewTitle": "Fun and entertaining ",
		"Review": "Your visit to the Davao Crocodile Park won't be complete without getting a cultural fix at Tribu K. Here, u can find replicas of abodes of the different tribes in Davao Region. Cultural performances are also done during weekends. They also have a restaurant where...More"
	},
	{
		"User": "Zendel1234",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed June 7, 2015 ",
		"ReviewTitle": "Nice show",
		"Review": "The tribu k mindanauan is consisting of young people who are fire dance performers. They offer fire dance show at night, this is after the people tour around at crocodile park at 7:30 pm. This is also an additional experience when you are in Davao."
	},
	{
		"User": "Hilary B",
		"Location": "Cagayan de Oro, Cagayan de Oro, Philippines",
		"DateofReview": "Reviewed May 29, 2015 ",
		"ReviewTitle": "Fire dance show beside Crocodile Park",
		"Review": "After visiting the Crocodile Park, we went to watch the fire dance show at the Tribu K'Mindanawan starts around 6PM. You can eat while watching the fire dance and also can take pictures with them after the show. On the way, you will pass by...More"
	},
	{
		"User": "Manila",
		"Location": "Manila",
		"DateofReview": "Reviewed May 27, 2015 ",
		"ReviewTitle": "Talent and culture! Great mix!",
		"Review": "The cultural presentations are excellent and unique. Audiences are very much entertained by the way the host handled the program. No dull moment. Great showcase of Filipino talents."
	},
	{
		"User": "wenlong3788",
		"Location": "Bacolod, Philippines",
		"DateofReview": "Reviewed May 10, 2015 ",
		"ReviewTitle": "Excellent fire dancers",
		"Review": "Didn't have the time to go around, just waited for the fire dance. It was spectacular! Not your ordinary poi fire dance. A must go."
	},
	{
		"User": "sweethomes",
		"Location": "Cebu Island, Philippines",
		"DateofReview": "Reviewed April 29, 2015 ",
		"ReviewTitle": "amazing",
		"Review": "We had a very timely arrival for we were able to witness the amazing fire show !!should have come earlier to tour the whole area.."
	},
	{
		"User": "adangoyjr",
		"Location": "Dubai, United Arab Emirates",
		"DateofReview": "Reviewed February 12, 2015 ",
		"ReviewTitle": "Cultural Place",
		"Review": "A simple cultural place in Davao City. Actually located just adjacent to Davao Crocodile Park. A good side trip if your visiting Davao Crocodile Park. Suggest to go there late afternoon as there are cultural shows sometimes."
	},
	{
		"User": "MijnlieverdFH",
		"Location": "Amsterdam",
		"DateofReview": "Reviewed January 18, 2015 ",
		"ReviewTitle": "Awesome experience!",
		"Review": "The best fire dance show so far compared to what i witnessed in some other beach parks. though this is in an inland park (beside the crocodile park) the show was awesome. Stay more for some eating experience too. You come and see it for...More"
	},
	{
		"User": "AsanSiDiwaAtShiela",
		"Location": " ",
		"DateofReview": "Reviewed January 10, 2015 ",
		"ReviewTitle": "Cultural Dining Experience",
		"Review": "Best time to go here is Friday or Saturday between 5-7PM. Why? Because they have a 15 or 30-min fire show with about 30-40 crews. They also have games with prizes before the show starts. After the show, you can listen to ethnic singers dressed...More"
	},
	{
		"User": "Meinard V",
		"Location": "Singapore, Singapore",
		"DateofReview": "Reviewed January 7, 2015 ",
		"ReviewTitle": "Great Show, A bit short though",
		"Review": "The fire dance show was amazing. This is more than your average fire dance shows. The stunts and performance are one of a kind. Each act is a delight to the eyes that at the end of it, you'll feel it's a bit short and...More"
	},
	{
		"User": "Chrnzke",
		"Location": "Makati",
		"DateofReview": "Reviewed December 2, 2014 ",
		"ReviewTitle": "Performance",
		"Review": "Not your typical fire dance in Boracay or Puerto Galera. They take their performance to a higher level than those of their counterparts in other location. Their performance will leave you at awe if you have time to watch. Beside Crocodile Park."
	},
	{
		"User": "AppleVManila",
		"Location": "Manila",
		"DateofReview": "Reviewed November 14, 2014 ",
		"ReviewTitle": "This is not about the show. This is about the food served on the restaurant.",
		"Review": "Food is good but service took more than 30 minutes when they promised it to be served for 15 minutes. Wish they have a manager to oversee."
	},
	{
		"User": "AbiBermudaFernandez",
		"Location": "Quezon City, Quezon City, Philippines",
		"DateofReview": "Reviewed November 1, 2014 ",
		"ReviewTitle": "Best Fire Dances!",
		"Review": "I love the performance of fire dancers! Very spectacular. The tribu k'mindanawan needs to have a renovation, some statues and miniatures are destroyed."
	},
	{
		"User": "Oobeth P",
		"Location": " ",
		"DateofReview": "Reviewed August 28, 2014 ",
		"ReviewTitle": "Eating Place",
		"Review": "Good to go here at lunch and enjoy the culture of Mindanauans. Eat and dine with Mindanao specialty food. It shows the vast art of Mindanao"
	},
	{
		"User": "shellyespinelli",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed August 12, 2014 ",
		"ReviewTitle": "Awesome Fire Dance",
		"Review": "Loved the fire show!! Very intense, I think i was the one who felt nervous for the fire dancers! Food was great, decent prices too. Efficient service."
	},
	{
		"User": "Cherrymay D",
		"Location": "Pasay, Philippines",
		"DateofReview": "Reviewed June 30, 2014 ",
		"ReviewTitle": "Intense fire dance!",
		"Review": "Fire dance is the show you shouldn’t dare missing after visiting the Crocodile Park. World-class Filipino talents! Better seat in front (unless you are bringing a kid with you) for a closer view and to experience warmth of a real fire."
	},
	{
		"User": "nav795",
		"Location": "Manila, Philippines",
		"DateofReview": "Reviewed May 14, 2014 ",
		"ReviewTitle": "High energy show",
		"Review": "The fire show in the afternoons should not be missed. Dancers go about their dance routine while manipulating and rotating around their bodies paraphernalia with flames. The heat from the flames is enough to drive people seated in the front row of the small amphitheater...More"
	},
	{
		"User": "BGonzalez1973",
		"Location": "Jewett City, Connecticut",
		"DateofReview": "Reviewed December 17, 2013 ",
		"ReviewTitle": "Nice",
		"Review": "I didn't get to tour the village but ate at the restaurant after going to Crocodile Park. The setting is nice. The food is very affordable and taste good. They had 2 types of entertainment. One was a reenactment of traditional tribal dancing and singing...More"
	},
	{
		"User": "Davao City",
		"Location": "Davao City",
		"DateofReview": "Reviewed December 5, 2013 ",
		"ReviewTitle": "Cultural Village in the City",
		"Review": "For a city rich in cultural diversity, Tribu providea guests a quick tour of tribal life by presenting replicas of abodes of indigenous groups based in Mindanao. They also serve tribal-influenced dishea in their restaurant. Watch out for fore dance and cultural shows on late...More"
	}
]
