[
	{
		"User": "jonsapon121",
		"Location": " ",
		"DateofReview": "March 5, 2018",
		"ReviewTitle": "Two things",
		"Review": "I am fortunate to have a boat and Abel to go and chill there. If you like white sand then go and relax and chill there. If you just want to see it. Do it but be warned, not much there"
	},
	{
		"User": "jeckli",
		"Location": "Cebu City, Philippines",
		"DateofReview": "August 29, 2017",
		"ReviewTitle": "Just Can't Get Enough",
		"Review": "This attraction is in its simplicity. Electricity is limited to lights & water is plenty due to their stocks of barrels of water. The accommodation has two verandas, two comfort rooms & three bedrooms. As to food, you have to bring cooked or for cooking...More"
	},
	{
		"User": "Jason D",
		"Location": " ",
		"DateofReview": "May 5, 2017",
		"ReviewTitle": "Private. Serene.",
		"Review": "When we visited the place, it was during high tide so we just parked the boat somewhere near the location on crystal-clear waters 6-15 feet deep, all for our own consumption away from the hussle and bustle of the city. The experience was one of...More"
	},
	{
		"User": "Leiann L",
		"Location": " ",
		"DateofReview": "March 2, 2017",
		"ReviewTitle": "Must go place in Samal",
		"Review": "To get a better experience, ask the guides for the best time to visit, usually when low tides. Very clear and clean sand and water. Lots of small star fishes. Very relaxing. Highly recommended."
	},
	{
		"User": "Yanyan C",
		"Location": " ",
		"DateofReview": "February 21, 2017",
		"ReviewTitle": "Okay.. ",
		"Review": "It was really nice. I thought it was small but its not. Went there in the morning and got really tired from walking.i wanted to go back to the resort because it was sooo hot but had to wait for a boat... No boats available...More"
	},
	{
		"User": "jan j",
		"Location": "makati city",
		"DateofReview": "February 14, 2017",
		"ReviewTitle": "sandbar with crystal clear water",
		"Review": "Just a short boat ride from Island French Resort, you will find the vanishing island. It has a sandbar with mangroves on one side and crystal clear water ideal for swimming. There is a floating store where you can buy drinks and chips. Not sure...More"
	},
	{
		"User": "DonDan16",
		"Location": "Hamburg, Germany",
		"DateofReview": "January 22, 2017",
		"ReviewTitle": "Nice, but",
		"Review": "If you have the chance to go there, go there. Boats are not going at any time. You must negotiate hard with the boaters, they will always try to get p1k from you. The Island itsself is ok, could be nicer without garbage. This side...More"
	},
	{
		"User": "Jelle V",
		"Location": " ",
		"DateofReview": "January 21, 2017",
		"ReviewTitle": "beautiful place",
		"Review": "one of the must-see in Samal Island. i suggest that you should go here early in the morning to witness the beauty of this place."
	},
	{
		"User": "Stuart H",
		"Location": " ",
		"DateofReview": "September 23, 2016",
		"ReviewTitle": "Family visit",
		"Review": "This island is accessible only by boat, it is of fine shell and the surrounding water extremely shallow for safe bathing"
	},
	{
		"User": "jaquinne",
		"Location": "Davao City",
		"DateofReview": "August 11, 2016",
		"ReviewTitle": "Total Solitude",
		"Review": "Stayed here for two nights and three days and found this place to be a right place for solitude. Away from the city, right in the middle of the sea. No one could come and pick me up. A nice place to be away from...More"
	},
	{
		"User": "Mimmy_Nicolas",
		"Location": "Davao City, Philippines",
		"DateofReview": "August 9, 2016",
		"ReviewTitle": "So where did my P375.00 took me?Exploring Samal Islands at a low cost....",
		"Review": "Just last sunday, I went on an Island hopping tour exploring the beautiful Islands of Samal. We started with Babusanta, then Angel Cove, then passed by Pearl Farm, then went to the Vanishing Island, stop over at Samal's Sand bar, then to Diaz Island then to Wishing Island.. A lot right.. So this is where my P375.00 took me.. A short but a remarkable trip away from Davao City.. It's a must when you're going to drop by at Davao City,never miss to visit the island.."
	},
	{
		"User": "Drew W",
		"Location": " ",
		"DateofReview": "July 20, 2016",
		"ReviewTitle": "Good but nothing especial",
		"Review": "Average. Generally, i was expecting that the bankero would ask me to pay more but i'm glad i only paid 300 for the boat. We're 2"
	},
	{
		"User": "jeckli",
		"Location": "Cebu City, Philippines",
		"DateofReview": "July 17, 2016",
		"ReviewTitle": "Communing with Nature ",
		"Review": "The island is still in its simplest form. Though habited for the purpose of spending a night with friends & family yet still the simplest with all its basic necessities. \r \r The sand if low tide will appear & if high tide, it would submerge. It still is the best way to spend it without any pompous elegance besotted to an exclusive island resort."
	},
	{
		"User": "HelenaGuerra",
		"Location": "Washington DC, District of Columbia",
		"DateofReview": "July 9, 2016",
		"ReviewTitle": "Nothing much",
		"Review": "Just an island that is submerged with the tide... We came here and snorkelled when the island was gone. You see some fisha fb there is some coral too, but nothing special."
	},
	{
		"User": "Andrew P",
		"Location": "Swansea County, United Kingdom",
		"DateofReview": "June 26, 2016",
		"ReviewTitle": "Brilliant to see. ",
		"Review": "The vanishing island literally is what it says. It's an island that vanishes below the sea when the tide comes in. It's truly a brilliant place to see and a must for anyone travelling"
	},
	{
		"User": "Charlie J",
		"Location": " ",
		"DateofReview": "June 22, 2016",
		"ReviewTitle": "Island hopping with my wife highschool batch",
		"Review": "The water is crystal clear the sand are very fine and white, so if you want to go on swimming in a good weather condition, with your family and friends i highly and gladlly reccomend this island for you, just bring your own food on the boat you are rented.\r \r Charlie J."
	},
	{
		"User": "Christine Gay B",
		"Location": " ",
		"DateofReview": "May 7, 2016",
		"ReviewTitle": "old, squeaky house",
		"Review": "The place itself is captivating because we've seen a lot of starfish however the house that we stayed in is sooo old and squeaky"
	},
	{
		"User": "AnNe Y",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 19, 2016",
		"ReviewTitle": "Amazing Place!",
		"Review": "Beautiful and very nice place! Relaxing and peaceful..Far away! beautiful island..white sand, you can see fishes swimming anywhere."
	},
	{
		"User": "tainted_canvas",
		"Location": "Philippines",
		"DateofReview": "March 7, 2016",
		"ReviewTitle": "Go there just to see what's up",
		"Review": "If you will be going on an island hopping trip, might be okay to skip this. It's just a small island. The best part was the star fish. LOTS of tiny star fishies which i love. It's also a great spot for a romantic photoshoot."
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "February 8, 2016",
		"ReviewTitle": "Nice",
		"Review": "It is nice place to visit with your family, friends and loveones If you have timeyou should visit this place and enjoy while you are there."
	},
	{
		"User": "Kates A",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 30, 2016",
		"ReviewTitle": "An ideal adventure site when visiting the Babak part of Samal Island",
		"Review": "This sand bar will surely entice you when you are on the plane. So I really took effort to research about this place and how can I possibly go here. This is like the famous sand bar of White Island in Camiguin, but just within your reach. You can contact a boat operator in barangay Tambo in Babak district to bring you here. Php500 for a round-trip boat transfer. Then you can bring food, just dont leave your trash here. There are government employees that mandates in the area, so an environmental fee is collected from tourists. A ideal time to visit is early morning. More sand bars appears at the middle of the day. There are also a lot of resorts along the shoreline of Babak that faces the Vanishing island. Our favorite is the island french, its a good stop to have lunch, swim, and to play with their pets."
	},
	{
		"User": "Denver P",
		"Location": "Cavite City, Philippines",
		"DateofReview": "January 26, 2016",
		"ReviewTitle": "Must visit Samal wonder",
		"Review": "We're super lucky we visited there during low tide. Check the tide calendar or ask your boatman to leave early in the morning. Its close to Babak town and only one boat/banca ride away.\r \r The sand is white. You need to experience the very breathtaking sandbar. There are lots of shells, sea urchins and starfishes around. There are area with trees and theres an old building where you can rent to eat and stay. Honestly, i wanna try that next time.\r \r The boatman can bring you to the area where you can snorkel and see more starfishes. Its there where i saw a black starfish.\r \r See it for youself: REALLY WORTH IT. It will complete your Samal tour."
	},
	{
		"User": "Harvey T",
		"Location": " ",
		"DateofReview": "December 20, 2015",
		"ReviewTitle": "Love that place!",
		"Review": "I've been there! Wow! So amazing, it can vanish itself! Yey! Must try! I can't wait to go back there!"
	},
	{
		"User": "SimonDabbs",
		"Location": "Davao City, Philippines",
		"DateofReview": "December 18, 2015",
		"ReviewTitle": "Don't forget your sunblock",
		"Review": "Vanishing Island is few minutes away from Samal reachable though a banca. The area is good for swimming and snorkeling and it has a good stretch of white-ish sand bar. There is no facilities or food available onsite. Do not forget your sunblock because it could get very hot late in the morning until afternoon. Also, leave the mangrove alone! And bring your garbage as you go! \r \r Keep the island clean and beautiful."
	},
	{
		"User": "Mark B",
		"Location": "Melksham, United Kingdom",
		"DateofReview": "August 20, 2015",
		"ReviewTitle": "Interesting view of mangrove coast",
		"Review": "We visited on a voluntary mangrove-planting day. It was fun. The facilities are a bit primitive, but it gives a good insight into the coastal mangrove habitat, with some good snorkelling experiences."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Lake Arrowhead, California",
		"DateofReview": "August 1, 2015",
		"ReviewTitle": "Jump into the ocean from your room.",
		"Review": "This island is Part of Pearl Farm...Take the boat out to the island for a delicious lunch. They have the best salads in the Philippines."
	},
	{
		"User": "Doug H",
		"Location": "Davao City",
		"DateofReview": "June 28, 2015",
		"ReviewTitle": "Sliver of white sand",
		"Review": "This sandbar is great place for swimming, snorkeling and dipping. Just 3 minutes away from mainland Samal. No facilities here, this bring whatever is necessary. Mangroves are planted in the area for a good reason, so don't pluck the young ones out or cut the branches of the older ones. Bancas are available to get you here. "
	},
	{
		"User": "Nece Jean T",
		"Location": "Seattle, WA",
		"DateofReview": "May 1, 2015",
		"ReviewTitle": "Nice visit on our Island Hopping Trip",
		"Review": "Decent beach and nice stop for snorkeling. I preferred the Coral Garden near Talikud Island. But, for any island hopping trip, Vanishing Island is a must stop."
	},
	{
		"User": "MijnlieverdFH",
		"Location": " ",
		"DateofReview": "April 22, 2015",
		"ReviewTitle": "Worth-while visit",
		"Review": "A nice place to visit...though swimming is not that great near the island..there were a lot of sea urchins and the water is not that totally clear."
	},
	{
		"User": "grace175",
		"Location": "Davao City",
		"DateofReview": "December 31, 2014",
		"ReviewTitle": "Being \"Robinson\"",
		"Review": "Ocean - tropical atmosphere - you alone - far away from civilization - fishes - sunrise - sunset - Robinson Crusoe - an amazing and awesome adventure."
	},
	{
		"User": "abudhabiTravELogUe",
		"Location": "Davao del Norte Province, Philippines",
		"DateofReview": "October 22, 2014",
		"ReviewTitle": "Like A Paradise",
		"Review": "woah!!. im lost for more to say..but its so wonderful like a paradise :))) i wanna go back there with friends....."
	},
	{
		"User": "wyn0nna",
		"Location": "Al Ain, United Arab Emirates",
		"DateofReview": "September 4, 2014",
		"ReviewTitle": "high tide or low tide? ... make a difference! help preserve the sanipaan or vanishing island!",
		"Review": "I live in Samal Island and it has been a normal routine to enjoy the serenity of the place everytime I go home for holidays. My recent visit (august), was different this time. WE coordinated our trip to the brgy. officer of Tambo to help...More"
	},
	{
		"User": "Reyosabajr",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 8, 2014",
		"ReviewTitle": "an island very near to the city",
		"Review": "The beach is nice but i was expecting more of the place. I thought the infinity pool is very wide but it is not in person. the service is very slow. however, the bathroom is clean."
	},
	{
		"User": "summer q",
		"Location": "Paranaque, Philippines",
		"DateofReview": "April 7, 2014",
		"ReviewTitle": "Wow!...",
		"Review": "We had a lot of swimming from different beaches and this one I should say is one of the best....white sand beach...in the middle of the sea/river.....we went there in the morning so the water was up to knee to belly-deep....water was so clean!..Even just...More"
	},
	{
		"User": "nyle_river",
		"Location": "Manila, Philippines",
		"DateofReview": "March 15, 2014",
		"ReviewTitle": "Great view!",
		"Review": "I just saw this place from a distance but it was breathtaking.great view and i heard a good place for snorkeling."
	},
	{
		"User": "My26",
		"Location": " ",
		"DateofReview": "February 24, 2014",
		"ReviewTitle": "nice cream colored sands",
		"Review": "I've been to many islands but only the vanishing island has the biggest star fish I've seen so far. I bought a snorkeling gear just for this trip and I'm just okay with what I've seen. Nothing much to see but seaweeds, grass and starfish."
	},
	{
		"User": "Unica Hija V",
		"Location": " ",
		"DateofReview": "September 14, 2013",
		"ReviewTitle": "nice white beach",
		"Review": "you need to know if its low tide otherwise there's nothing to do there besides swimming. No nice corals for snorkeling also. No cottages or tables where you can sit & eat. No entrance fee."
	},
	{
		"User": "466Neo",
		"Location": "Makilala, North Cotabato, Philippines",
		"DateofReview": "May 27, 2013",
		"ReviewTitle": "side trip",
		"Review": "my friends and i stayed at the japanese cave house at camudmud. the caretaker there told us about the vanishing island. he took us there via a fishing boat.hahaha! we enjoyed it so much there that i didn't let the chance of capturing moments pass...More"
	},
	{
		"User": "Pieter-Jan V",
		"Location": "Luzon, Philippines",
		"DateofReview": "August 18, 2012",
		"ReviewTitle": "The Lost Paradise",
		"Review": "I shall return! > be right back to write my first review about my solo backpacker's visit to what I wanna call the lost island of Samal....;) >I just need to have an account here"
	},
	{
		"User": "CheParacuelles",
		"Location": "Samal, Davao, Philippines",
		"DateofReview": "August 10, 2012",
		"ReviewTitle": "White sand",
		"Review": "In high tide this island vanishes. You rent a boat going there in precious garden of samal. This hotel is in front of vanishing island. Nice white sand good for picture taking."
	},
	{
		"User": "ccduckie",
		"Location": "Davao City, Philippines",
		"DateofReview": "April 26, 2012",
		"ReviewTitle": "A weekend activity in Vanishing Island",
		"Review": "April 21, 2012 is the day that I planted five (5) Mangrove tree seedlings in Sanipaan Marine Park in Vanishing Island after which we enjoyed swimming. The place is so nice and amazing because the Vanising Island in the middle of the sea. If it...More"
	}
]
