[
	{
		"User": "gabbyxiu",
		"Location": "Surabaya, Jawa Timur, Indonesia",
		"DateofReview": "July 1, 2016",
		"ReviewTitle": "hill top zip city",
		"Review": "climb the stair and enjoy the beautiful view of davao ^^ more fun, amazing place, have canteen in upstair"
	},
	{
		"User": "TravelingKano",
		"Location": "Asuncion, Paraguay",
		"DateofReview": "March 10, 2016",
		"ReviewTitle": "Travel a long Zip Line overlooking Davao City",
		"Review": "A fun ride and great view as you ride the Zip Line from the top of the mountain into one of the valleys below."
	},
	{
		"User": "Myrhael A",
		"Location": " ",
		"DateofReview": "January 23, 2016",
		"ReviewTitle": "I was expecting more",
		"Review": "There is just few things here but it's like more for the kids. There is no extreme things but again you can enjoy here if with you are good friends etc. Have a good time."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 22, 2015",
		"ReviewTitle": "Zip with a city view",
		"Review": "It's no extreme zip line ride but it's got something that other ziplines don't: a great view of the city. It's a zipline that allmembers of the family can enjoy, from kids to your lolos and lolas. Just a relaxing, short zip while enjoying the view. "
	},
	{
		"User": "surfinraw",
		"Location": "Canada",
		"DateofReview": "December 8, 2014",
		"ReviewTitle": "lacking",
		"Review": "Visiting zip city I was anticipating an enjoyable/exciting ride.\r Previously I have only visited two other zip line sites so I had\r somewhat of an idea what to expect. I must say I was fairly\r disappointed with Zip city and what it had to offer.\r Perhaps my other previous experiences with the other locations\r were just that much better. Taking that into consideration, I will\r just comment by saying this is a good place for a beginner that\r does not expect much.\r Needs improvement"
	},
	{
		"User": "Chrnzke",
		"Location": "Makati",
		"DateofReview": "December 2, 2014",
		"ReviewTitle": "Free",
		"Review": "We got to try the zipline for free as part of the package for the water adventure. It is a typical zip line but since it is for free, I really enjoyed the experience. Hehe."
	},
	{
		"User": "Tee T",
		"Location": " ",
		"DateofReview": "July 30, 2014",
		"ReviewTitle": "Zip City",
		"Review": "We challenged the 300 meters long zip-line in Davao City. Awesome experience with the beautiful \"birdeyes\" view of the Davao City. After overcoming the initial few seconds of uncertainty, you feel like an eagle soaring over the city... You Should Be Here!!"
	},
	{
		"User": "ramil q",
		"Location": "Manila, Philippines",
		"DateofReview": "May 20, 2014",
		"ReviewTitle": "First Time to Zip..",
		"Review": "the staff was accommodating and they make sure that their client is safe...for the first timer i recommend zip city. thankyou!"
	},
	{
		"User": "Mia S",
		"Location": "Cebu City, Philippines",
		"DateofReview": "January 5, 2014",
		"ReviewTitle": "The price isn't worth it but good thing they gave extra coupons and a free picture.",
		"Review": "It was fun but not too special. If you want to have your picture taken for trying out a Zipline, then yeah...it might be worth it. It was certainly a good experience but there is nothing much to talk about."
	},
	{
		"User": "Jrak907",
		"Location": "Sydney, Australia",
		"DateofReview": "December 13, 2013",
		"ReviewTitle": "Just Fine..Nothing Extra Special",
		"Review": "Its just fine...no excitement...just a short ziplining. Nothing special with the view and the experience. Php 300.00 fee not worth. I think it is only designed for first-timers."
	},
	{
		"User": "xChaLeex",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 6, 2013",
		"ReviewTitle": "Zipline for beginners",
		"Review": "Nothing much. This is just your regular zipline which they claimed to be safest definitely to attract first timers. I happened to try this because my friend is a little afraid of heights plus the fact that outland is temporarily closed. Fee is 300 which includes 100 worth of food to nearby restaurants which I presume is owned by Dizons."
	},
	{
		"User": "igga200",
		"Location": " ",
		"DateofReview": "August 3, 2013",
		"ReviewTitle": "regular zipline",
		"Review": "it's not that long a zipline & the view is not really picturesque. it was my first time doing a solo so it was a little nerve wracking at first but i got over it. the personnel were helpful & courteous & even helped us get a taxi back to our hotel."
	},
	{
		"User": "ilyn_03",
		"Location": "Doha, Qatar",
		"DateofReview": "September 20, 2012",
		"ReviewTitle": "Exciting and fun!",
		"Review": "all i can say is that we had loads of fun! it was exciting, scary at the beginning but once you finally go for it the scene is just breathtaking and simply worth trying. the crew were very conscious of the safety and they were so encouraging. the only thing for me is that I think 300 is a bit expensive although it was consumable (100 php) there were no other activityin there and you will go through the zip line only once, and that costs you 200 php."
	},
	{
		"User": "ccduckie",
		"Location": "Victoria, Canada",
		"DateofReview": "December 11, 2010",
		"ReviewTitle": "A little scary!",
		"Review": "Zip City is one of many ziplines open now in the Davao area. This is advertised to be the\r most scenic, accessible and the friendliest to all ages. But I did not feel very safe on the little harness and clasp, and I have ziplined before in other countries and felt quite safe in the past! Nonetheless, it was pretty fun, and with our ziplining ticket we got a coupon for Dencio's sa Hilltop that was just right there. It made for a fun night out. We did it at night to see the city lights, but in the daytime there is quite the view as well!"
	}
]
