[
	{
		"User": "adolf t",
		"Location": "Abu Dhabi, United Arab Emirates",
		"DateofReview": "November 23, 2017",
		"ReviewTitle": "Very secure city",
		"Review": "All I can say is that phillipines Davao is best seconded by cebu , I love the park and everyone there was friendly and helpful to talk to me.management to keep the good service up and will surly come back again"
	},
	{
		"User": "nim-nim03",
		"Location": "Zamboanga City, Philippines",
		"DateofReview": "June 24, 2017",
		"ReviewTitle": "Closed",
		"Review": "Too bad this is already closed. We went to crocodile park for this zorv ride as we were about to pay for the fee,the cashier told us that they already closed it three years ago."
	},
	{
		"User": "havegutwilltravel",
		"Location": "Alor Setar, Malaysia",
		"DateofReview": "July 3, 2016",
		"ReviewTitle": "need a good head rolling",
		"Review": "Situated near crocodile park.... try rolling transparent zorb park ..ending at the bottom of the slope with your head downward ...a fun screaming ride...just give a try"
	},
	{
		"User": "nightrider3315",
		"Location": "Las Vegas, Nevada",
		"DateofReview": "April 20, 2016",
		"ReviewTitle": "Visit to a zoo",
		"Review": "The park has a large area devoted to it's namesake. There are all sizes of crocodiles for viewing. There are monkeys, peacocks, a variety of parrots, snakes and several other animal groups. This is a good place for the kids and is interesting for the adults who like being outside. It was cloudy the day we went which helped as this is a hot and humid country and if one can stay out of the sun it is better."
	},
	{
		"User": "WanderLustDavao",
		"Location": "Davao City",
		"DateofReview": "June 25, 2015",
		"ReviewTitle": "Zorb of fun",
		"Review": "It's whole lot of rolling fun. Never fails to excite us. Best of all, it's inside the Davao Crocodile Park complex where there are other fun and dining activities are found. It's also just 20 minutes away from the city center."
	},
	{
		"User": "Van J",
		"Location": "Davao City, Philippines",
		"DateofReview": "June 18, 2015",
		"ReviewTitle": "FUN FUN FUN!",
		"Review": "My cousins from Manila enjoyed it very much! They even tried the sport three times! The guides were patient as well telling us how to enjoy the Zorb something! Thumbs up!"
	},
	{
		"User": "gabbyxiu",
		"Location": "Surabaya, Jawa Timur, Indonesia",
		"DateofReview": "September 6, 2014",
		"ReviewTitle": "Extreme , Asyik, Keren !!!",
		"Review": "Kinda expensive, short time but nice game !!! Just recommended for people with good healthy. This game use 2 persons inside the ball and we will be tied. then the ball will sliding from up to down place. maybe 1-5 minutes"
	},
	{
		"User": "Ma S",
		"Location": " ",
		"DateofReview": "September 3, 2014",
		"ReviewTitle": "Oh man, just the best!!",
		"Review": "First time for the kids to do this. It is inexpensive and great fun. My kids are 10 and 12. They loved it and loved going on the water balls. Take the children here, they will love it. So will the adults for that matter!"
	},
	{
		"User": "geofhaar",
		"Location": " ",
		"DateofReview": "July 28, 2014",
		"ReviewTitle": "Zorb away",
		"Review": "You can or spend some time in a flooting zorb, quite fun actualy and demands some skill, or you can \"zorb\"down a hill. Both will keep you occupied less then 1/2h , so better combine with , for example, crocodile park"
	},
	{
		"User": "Makati, Philippines",
		"Location": "Makati, Philippines",
		"DateofReview": "March 5, 2014",
		"ReviewTitle": "This place has closed down.",
		"Review": "Unfortunately, it was only when we got there that we found out. It was news to the cab driver too. There was a sign on the site that said \"A mall to be built here soon!\" or something or the other (*groan*, no thanks!). Sms'd the number on the Zorb Fb site and they replied saying that yes, they're closed for good."
	},
	{
		"User": "xChaLeex",
		"Location": "Quezon City, Philippines",
		"DateofReview": "September 6, 2013",
		"ReviewTitle": "Unique experience without going too far",
		"Review": "This is by far one of the best adventures I have experienced. My first time here is really great, comparing to my first zipline experience. It wouldnt take that long, less than a minute. You should never miss this for sure! Fee is 200 each, minimum of 2 each ride. Bring along your loved one, bestfriend or anyone and zorb all your stress away!"
	},
	{
		"User": "KimuTan",
		"Location": "Davao City, Davao City, Philippines",
		"DateofReview": "August 7, 2013",
		"ReviewTitle": "For dare devils, not for those with heart ailments...",
		"Review": "SHOUT! Otherwise, you will die of heart attack. It's an experience you should experience at least once in your life. Just be ready to shout all you can."
	},
	{
		"User": "Patty M",
		"Location": "Manila, Philippines",
		"DateofReview": "July 26, 2013",
		"ReviewTitle": "my first time to zorb - great!",
		"Review": "i really enjoyed the zorb. it was a novel experience. if you like the idea of being pushed down a hill in a see-through giant ball, you'd love this."
	},
	{
		"User": "nasmej11",
		"Location": "Iloilo City, Philippines",
		"DateofReview": "March 30, 2013",
		"ReviewTitle": "no lines!",
		"Review": "we went there on a whim. the fee is 200 pesos. they gave us a free voucher for the water ball activity located at the butterfly garden. rolling down the hills inside the zorb was an exhilarating experience albeit short. the water ball activity could have been better if they have bigger space for the water balls to move around."
	},
	{
		"User": "Loco E",
		"Location": "Makati, Philippines",
		"DateofReview": "February 23, 2013",
		"ReviewTitle": "Huge ball of fun!",
		"Review": "At first I thought it was a waste of money (P200/pp) for a 15-sec. ride! \r However, our friend gave us 1 free voucher, so my wife & I rode and had an awesome roll down the make-shift hill. We were dizzy at the end, but it was all good!"
	},
	{
		"User": "stephanie072789",
		"Location": "Davao City, Philippines",
		"DateofReview": "January 12, 2013",
		"ReviewTitle": "it was fun!!",
		"Review": "i super hate extreme sports or any activities like this but thanks to my dearest friends, i enjoyed it a lot..it was fun..."
	},
	{
		"User": "ap0lz",
		"Location": "Makati, Philippines",
		"DateofReview": "December 31, 2012",
		"ReviewTitle": "And around we go!",
		"Review": "It was a great experience! Initially, we thought the distance for the ball to drop was too short and it would not be worth the PHP200.00 that we'll be paying. But when we tried it, we had a blast! Plus, we even got free tickets to try the water zorb! Cool!"
	},
	{
		"User": "Zhira T",
		"Location": "Makati, Rizal, Philippines",
		"DateofReview": "December 18, 2012",
		"ReviewTitle": "zorby experience",
		"Review": "it think this is by far my most fear-wrecking experience. you're strap inside the zorb and all you need to do is hold-on to the bar while screaming or laughing or like me i laughed all out my fear while you feel like you're about to fall. but it was my greatest ride in davao. wanna try this again.."
	},
	{
		"User": "suyen l",
		"Location": "singapore",
		"DateofReview": "November 22, 2012",
		"ReviewTitle": "love the place a lot",
		"Review": "this place gives a me a good sense of adventure... i love this place just dont forget to bring your water for ur ull be thirsty all the time"
	},
	{
		"User": "Davao city, Philippines",
		"Location": "Davao city, Philippines",
		"DateofReview": "September 30, 2012",
		"ReviewTitle": "What an adrenaline rush!",
		"Review": "Booking was hassle-free, staff were very friendly and it was one thrill downhill ride! I only experienced it for a few minutes but it was one of the best \"few minutes of my life\". :)"
	},
	{
		"User": "getright",
		"Location": "Metro Manila, Philippines",
		"DateofReview": "September 25, 2012",
		"ReviewTitle": "Fun while rolling under the sun!",
		"Review": "I've rolled down inside the zorb ball at least five times now! And riding it again always feels like riding it the first time. :)\r \r For first time zorbers, get ready to feel your tummy being displaced. So don't eat before riding the zorb ball.\r \r Also, when you're starting to roll... start shouting until the ball stops."
	},
	{
		"User": "bracomo",
		"Location": "San Diego, California",
		"DateofReview": "July 30, 2012",
		"ReviewTitle": "Ok",
		"Review": "somaething to do that what this is ok fun if your young but any other reason it just well small place and get easy crowded"
	},
	{
		"User": "maia_cyllene",
		"Location": "davao",
		"DateofReview": "May 29, 2012",
		"ReviewTitle": "Fun thing to do",
		"Review": "It is fun to ride the zorb at the zorb park. Kids love the feeling of being inside it and spinning downhill. New experience for first timers"
	},
	{
		"User": "MattAussie",
		"Location": "Cebu City, Philippines",
		"DateofReview": "May 24, 2012",
		"ReviewTitle": "Inside the Zorb",
		"Review": "My friends and I tried this controversial zorb, and hahaha we had a great time. For only P200 you will experience a 1-minute over-the-top shouting and laughing inside the rolling zorb. Very safe for children too."
	},
	{
		"User": "MattAussie",
		"Location": "Sydney, Australia",
		"DateofReview": "April 15, 2012",
		"ReviewTitle": "Fun dizzy adventure",
		"Review": "jump in a huge ball and get spun around down a hill with a friend. Try not to vomit lol. So fun I will go back some time to do it again."
	},
	{
		"User": "Ponchit_gardenworx",
		"Location": "Sydney, Australia",
		"DateofReview": "April 15, 2012",
		"ReviewTitle": "Fun but hard",
		"Review": "They stick you in a big plastic ball and then throw you into a pond. Its fun but super hard to stand up and you will find yourself tired and covered in sweat in 5 minutes worth a look its close by crocodile park and zorb ball"
	},
	{
		"User": "Iampinoy",
		"Location": "Davao City",
		"DateofReview": "April 10, 2012",
		"ReviewTitle": "good",
		"Review": "a pretty good activity, Kid friendly and good value for money. very near other points of interest such as the crocodile park"
	},
	{
		"User": "CheParacuelles",
		"Location": "International",
		"DateofReview": "March 4, 2012",
		"ReviewTitle": "You have to try it at least once!",
		"Review": "I have to agree with one of the other reviewers. It can be a dizzying experience. However, it was fun. I don't think my stomach was strong enough to do it more than once. But It was fun and if you can you should do it. It's a fun experience. It cost 200php per person. You are strapped in and its a feeling of like being weightless and being on a ride that spins kind of fast. If you know you have a weak stomach, close your eyes. But you will feel the urge to open your eyes."
	},
	{
		"User": "daveblinx",
		"Location": "Davao City, Philippines",
		"DateofReview": "February 7, 2012",
		"ReviewTitle": "Experienced ZORB Twice in a DAY :-)",
		"Review": "It was one of the craziest bonding and adventure we had with my friends.\r My friends and i were laughing after we had our exhilarating zorb experienced because I did ZORB TWICE....Yeah folks, One was not enough so I did for the second round. It was very fun, exciting and will make your world go round and round. The 40 seconds was really exciting and full of shouting and calling for Help.hahahhaha, Yes when we are inside the zorb ball and in starts rolling we also start shouting for \"Oh MY GOD\"...You can let your heart out, you can shout all you want and as loud as you can make. If you love adventure, go for it but I don't advise it for those who has weak hearts. Try ZORB and have a new experience."
	},
	{
		"User": "childhood-amusement",
		"Location": "makati",
		"DateofReview": "September 13, 2011",
		"ReviewTitle": "Fun adventure and educational!",
		"Review": "We went here at crocodile park, water and ball, butterfly garden and zorv park. Its a subdivision where in all these are near to each other. I would suggest you take the taxi ride for about 170 bucks instead of hiring a van for 3k in 10 hrs,because spending your time here in 4 parks will just consume all of it. For these 4 location we spent 5-6 hrs with lunch break., and just ride a tricycle for p7 for two in transferring to another locations/park. Go around the crocodile park entrance fee of 150 per adult and read the to know of certain animals, it will amuse u.i will never forget the pigeon i saw ,it make a sound like the sound u make in a bottle,read the to knows;-) With zorv park, try the zorv ball for 200 per ride! It will give you a fun stomach turning ride! Water n ball and Butterfly garden has no entrance fee if you entered crocodile park and zorv park. We ate in a place near d croc park,it was ok. Then we hired a motor for around 200 going to zipline, for 300 (100 is consumable at dencio's) its the highest here in ph i think,and its really an adventure! Overall it was fun going here and i would recommend these to all of you ;) dont forget to bring towels and sanitizers/soap. See it for yourself!;-)"
	},
	{
		"User": "ccduckie",
		"Location": "nanjing, china",
		"DateofReview": "June 16, 2011",
		"ReviewTitle": "water walking ball great fun",
		"Review": "walk on the water, indeed interesting and great fun Childhood amusment"
	},
	{
		"User": "ccduckie",
		"Location": "Victoria, Canada",
		"DateofReview": "December 11, 2010",
		"ReviewTitle": "Very cool - never saw anything like this before!",
		"Review": "The Zorb ball is a giant inflated ball that you get strapped into and then roll down a hill while inside the ball. There is not much more to say! See the pictures! It was a lot of fun, we were laughing all the way down the hill. I would take any of my (younger) friends here!"
	}
]
