[
	{
		"User": "Ciarra",
		"Review": "The entire resort feels like your personal little beach house. The place is a bit small so it might get a little crowded when all the villas are filled up. There's nothing much to do but relax, swim and bond with friends and family. If you want a quiet resort where you can relax and have some quiet time then it's definitely for you. Might be a bit boring for the teens though. "
	},
	{
		"User": "PATRICK",
		"Review": "all was great. the beach need some cleaning though."
	},
	{
		"User": "frank",
		"Review": "the hotel was very special small , quiet , but it lacked the resort style , i also believe that they are not marketing it well enough i.e. dinner , lunch and breakfast are included but nobody new about this , it is also not ala cart, but because the food was really great this wasn;t a problem , that is if you fancy asian food ! very nice lay out ( landscaping ) , the beach than again like most places on samal is a dirty place with rubbish in the water and an access to the sea where you really cannot swim at all because of stones , sea urchins , coralls , and rubbish . furthermore if low tide you need to walk a mile to stand in the water to yoru knees. overall however very friendly place , price quality excellent , but there are some draw backs so i would only recommend it as a place for 1 or 2 nights max "
	},
	{
		"User": "Wade",
		"Review": "Our first night there we were the only ones there which was nice and relaxing. That night it actually felt like we were in the middle of nowhere with no one around. We would have preferred a few more people around since it was almost too quiet. The resort only has 6 cottages in total. It was overall very clean and food was pretty good except you had to eat what they made. No menu. Staff were nice and friendly. It has a small beach but it is not ideal for swimming since its too rocky but it was still nice sitting down by the water. There is also a nice big pool. A couple negatives was that they are currently building a larger cottage so they were doing construction during the day with more workers around then guests. They stopped at 5pm so there was minimal annoyance. Also we found that local kids were all over down by water so its not totally private. I would recommend if you just want to relax. We went there just for that a place to relax so we enjoyed it. Not much else to do and no internet access so bring your own wireless card."
	},
	{
		"User": "choleen",
		"Review": "The one night stay was overwhelming..it was so relaxing yet fun..the food was delicious and served right on time... one of the waiters was very helpful with us...The heated pool was very relaxing because you can enjoy the swim without the chills...the view was amazing and the rooms are very clean..i'm planning to celebrate my birthday there..."
	},
	{
		"User": "Brent",
		"Review": "Great location on Samal Island. I just found that the rooms were not so private or quiet as they were all looing onto the swimming pool. I could here if anyone was in the pool and the kids were very noisy when we were there at new year. Food was plentiful but a set menu."
	},
	{
		"User": "Lowela",
		"Review": "The resort is pretty far especially that we took the bus and public transportation to get there since the boat transfer was not included in the package we took. Our stay was good. The garden villa and the pool were great. The only thing that disappointed us was that there was no TV inside the room."
	},
	{
		"User": "Jaime",
		"Review": "My wife and I had a very enjoyable and memorable stay in this lovely small resort. It's well managed and set-up. We especially liked that the resort was empty our first night and day as this added to the serenity and specialness of the occasion. We stayed in the Oriental Villa. The room was spacious and clean with a kingsize bed. The outdoor bathroom was spacious and well laid. Unfortunately no kettle or tv in the room, which is a little surprising and does mean this is a 3* and not a 4*. We also had to change rooms after the first night as the water heater was faulty and electrified the sink tap water which meant a jolt every time we touched or used it. We were 'upgraded' to a larger villa but it only had a queen size bed and the bedding wasnt as comfortable. Again, no tv or kettle. And no wifi in the entire resort due to its location off the beaten track. All meals are included in the price and we were fully satisfied with the food prepared for us. Our first meal consisted of grilled tuna belly, stir-fried prawns, pork kebabs and a fruit salad. What wasnt mentioned was that soft drinks were not included in the full board and we were charged for them even though we were not informed AND they asked us what drinks we would like with the meal. I would have expected some notice and a menu of drinks to be provided so at least we would be aware of this and could make a choice based on that knowledge. For one of our dinners we asked that the fruit provided in the fruit salad be mixed in to a fruit juice. And even though the fruit is paid for in the meal we were still charged for the juices. Service wise they are very attentive and even allowed us to use their boat and go snorkelling nearby for free. We were also taken on a half day tour around the island on a motorbike. All in all it is a very nice place and the staff are friendly but it's not in the class it purports to be based on the pricing and I'm sorry to say I feel it is overpriced for the area. "
	},
	{
		"User": "Walter",
		"Review": "Das Hotel ist nur über eine extrem schlechre Strasse zu erreichen, die Privatfähre kostet Hotel aus; Frühstück nicht amerikanisch/europäisch; kein Müsli keine Milch, selbstverständlich kein bacon - sehr schwach. Im Zimmer gibt es weder TV noch www noch Kühlschrank - in dieser Hinsicht deutlich unter Zweisterneniveau. Nur etwas fü+r Individualisten, die total überteuerte Hotels lieben. Am besten war der Pool: wunderbar warmes, sauberes Wasser; der Strand/Meeresbuch hingegen eine Müllhalde: nicht nur harmloser Plastikmüll, sd. auch Holplanken etc; Felsgrund zT messerscharf - nicht ohne.... Verletzungsgefahr! Am schlimmsten die Hinfahrt: die Strasse eine einzige Katastrophe. Insgesamt also: 200-300% overprized."
	},
	{
		"User": "Uwe",
		"Review": "Das Hotel liegt sehr abgelegen an einem Sandweg ca. 3 km vom nächsten Supermarket entfernt und hat 8 DZ (einzelne Hütten). Die Übernachtungskosten sind völlig überzogen.Wir haben ein DZ bewohnt, die anderen 7 DZ wurde von 48 Asiaten belagert, also eine 7 köpfige Familie pro DZ. Karaoke bis weit nach Mitternacht, Frühstück kalter Fisch und kalter Reis. Wir bestellten frisches Obst und Spiegelei, was auch am nächsten Morgen serviert wurde. Allerdings kam das Spiegelei aus dem Kühlschrank (vermutlich vom Vorabend). Das Personal kümmert sich gar nicht, sitzt lieber vor dem einzigen Fernseher in der Rezeption. Die Zimmer werden nur auf Anfrage gereinigt und dies wurde auch zusätzlich berechnet. "
	},
	{
		"User": "myriam",
		"Review": "Na 2 nachten in het drukke Davao was dit voor ons een verademing, een klein paradijs om te relaxen, zwemmen,... in één woord genieten."
	},
	{
		"User": "HIDEKI",
		"Review": "まず、砂浜がゴミだらけ。文句言ったら片付け始めたが、棄てた場所は隣地の波打ち際。明日の朝はゴミは海に流れて、やり直し。貴重な位素晴らしいビーチなのに、フィリピン人は根本的対策を取らない。小型の重機と、魚漁の網でさらえば半日で素晴らしいビーチなのに、残念です。食事に関しては、ミネラルウォーターすら、用意されておらず、島の環境から、買い物は至難であり、フロントには、コンビニ並みの品揃えが欲しい所だ。シャワー室や、トイレに、小動物が出てくるようで、大きな糞が床やシンクに繰り返し落ちてきて、悪臭をはなっていた。環境が最高なだけに惜しまれる。シャンプー、リンス、石鹸、ミネラル、歯ブラシ、朝食の食材等は、フェリーを降りた角で買い揃えて向かいたい。"
	},
	{
		"User": "HIDEO",
		"Review": "ホームページには、WiFiの有無の表示がなかった。 agodaからの予約は手数料が高く歓迎してないのか、フロントのおばさんは最初から感じが悪かった。"
	},
	{
		"User": "KIYOTAKA",
		"Review": "ダバオ在住の友人を訪ねるついでに2泊3日で行ってきました。 到着日、先ず驚いたのが、まさかの・・・客は私一人だけ。 部屋はかわいらしく暖かな感じのする内装。 テレビも冷蔵庫もなく、ただ寝るだけの部屋。 ホテル内にはミニエアホッケー、ビリヤードぐらいしか娯楽設備はなく、 ロビーにも部屋にもネット環境ゼロ。島巡りやバナナボート、パラセイリング等のアクティビティも皆無！！！ ｢終わってるな｣と思う人もいらっしゃるかもしてませんが、 あくまでも今回の私の旅の目的は“ゆっくりする”こと。 その目的を満たすにはこれ以上ない最高の環境でした。 主に三人のスタッフが私の世話をしてくれましたが、みんな優しく、とても親切で、アットホーム感満点。 滞在中は、常にビールを片手に釣具を借りて釣り、シュノーケイリング、ipadで読書、プールで水泳、ホテルスタッフとビリヤード、エアホッケーなどをして過ごしました。 ハワイやグアム島の高級リゾートとは違った“特別で貴重な体験”をすることができました。ゆっくりした時間を過ごしたい人にはお勧めです。 ただ、時間を潰すためのツールは自分で用意していく必要があります。"
	},
	{
		"User": "DAYE",
		"Review": "펄팜보다 저렴하게 즐길려면 여기도 추천한다. 2박3일 이상은 즐기지 않도록 한다. 하지만 식사 및 모든 부분에 있어서 만족한다. "
	},
	{
		"User": "HYUNGSOO",
		"Review": "페리터미널에서 반대편 섬으로 가는 배편은 아주 자주 있지만 리조트로 접근하기 위해선 트라이시클을 이용해야 합니다. 흥정에 따라서 200-250페소.. 드라이버 전화번호 받아두셨다가 나갈때마다 부르시면 할인 가능합니다. 리조트 자체는 조용하고 좋습니다."
	},
	{
		"User": "sangeun",
		"Review": "\r 넓고 깨끗한 객실, 이쁜 수영장, 깔끔한 음식"
	},
	{
		"User": "Seo",
		"Review": "\r clean,mood"
	}
]
