[
	{
		"User": "Angelique",
		"Review": "I booked this hotel for 3 days. We arrived on Sunday and I was shocked because the location is really beside the port and the resort has so many people literally bec its a public resort and they accept day tour guests so basically we just stayed inside our hotel room the entire day. Good thing, our hotel room is nice but no wifi. Very spacious, has own balcony, nice aircon and king sized bed. It's nice also that they have their own restaurant. The next day, I was happy to see that the resort was super quiet and calm. I enjoyed the serenity. We were able to enjoy the pool and beach though we don't like the beach. Mahapdi sa balat and the shore and beach area is just small. I enjoyed the infinity pool though. What bothered is me in our entire stay is that they are doing the xmas decorations and there are carpentry works done. Nagigising kami dahil sa pukpok ng walls etc. Receptionists can also improve their customer service skills. "
	},
	{
		"User": "Emily",
		"Review": "The facilities are good and location of the resort is very convenient. Although, some of the staff in the restaurant/dining area needs a little of training on customer service to improve their efficiency and sensitivity to the guests' needs (e.g. putting candles in the dining table or turning on ceiling fan as we are already bombarded with flies and insects without the request coming from the guests)"
	},
	{
		"User": "Earl",
		"Review": "It is conveniently located adjacent to the ferry wharf. Nice view of the pool by the beach. There's a nearby convenience store for necessities. Not recommended during peak season as it could get crowded."
	},
	{
		"User": "Wing",
		"Review": "Good option but not luxury vacation resort"
	},
	{
		"User": "marites",
		"Review": "WE WILL DEFINITELY GOING BACK AND I ALREADY BRING NEW BATCH OF FAMILIES"
	},
	{
		"User": "Melody",
		"Review": "value for money. clean & large room. very comfortable"
	},
	{
		"User": "Kristine",
		"Review": "We spend a night there because my son loves to swim.. we woke up early to swim in the pool but sad to say the availability of the pool is 9 am.. 😞"
	},
	{
		"User": "Catherine",
		"Review": "We are regulars here and my family! We love this place. Affordable clean and fun and close to the ferry boat. I just hope hope they offer breakfast buffet ..."
	},
	{
		"User": "Melody",
		"Review": "No wifi available "
	},
	{
		"User": "Anna",
		"Review": "We just booked this hotel in the last minute and thank God it did not disappoint. The place is very accessible and the staff were very accommodating"
	},
	{
		"User": "Darren",
		"Review": "Staff amazing, accommodation excellent, facilities perfect...food wonderful Love it"
	},
	{
		"User": "Wowie",
		"Review": "the resort was very near the pier... no problem checking in.. we juat left our bags at the reception so we can start our tour of the island"
	},
	{
		"User": "April",
		"Review": "I paid for 2 single beds,they gave us one matrimonial bed. The beach looks ordinary,Ive seen better-looking beach in Saranggani."
	},
	{
		"User": "Karen",
		"Review": "dapat open ng mas maaga ang time ng childrens pool kawawa ibang bata na overnyt nag hihintay ma open na ang pool"
	},
	{
		"User": "johan",
		"Review": "good Hotel for backpackers or Budget holidays"
	},
	{
		"User": "Anna",
		"Review": "Our fave family get away. The beach itself is not that fab, but overall for a good relaxing stay, specially if kids are around - a highly recommendable place❤️ "
	},
	{
		"User": "JEFFREY",
		"Review": "very good location and affordable food"
	},
	{
		"User": "Isabelita",
		"Review": "This accomodation is only good for the younger ones who love singing and the noice; for those on vacay who values serenity , this place is not for you as the karaoke goes until 1:00 AM on Sats and Suns."
	},
	{
		"User": "Regina",
		"Review": "near the wharf. food is good. staff are accomodating"
	},
	{
		"User": "Lillian",
		"Review": "If you need a place to have an overnight stay and leave for Davao city the next day, it's definitely the perfect one. Room is big enough and clean, restaurant food and beverages are good, staff is helpful. Though it's near the wharf, it's quiet inside it."
	},
	{
		"User": "Geoff",
		"Review": "The hotel has a good infinity pool for checked in guest. But the beach side is not that good. The beach is gone during high tide. The rooms is spacious. The place is clean. Only several minutes from the port. Walking Distance. The food is good."
	},
	{
		"User": "Rona",
		"Review": "I love the ambiance, accessibility and the staff are accomodating. The one big problem that we experienced was the bedbugs bite. It's itching until Now. "
	},
	{
		"User": "Lua",
		"Review": "We had avoided this place for the longest time because it was right next to the pier. We thought it would be noisy and that the beach would be dirty. But it was the exact opposite! It was not exactly quiet but it was very peaceful. It was also very, very clean and all the staff exuded positive energy. They always smiled. Only thing we would change would be the speed of service for food. It took a bit longer than usual. Other than that, this place is the perfect getaway. We would definitely be coming back and we would recommend this to our friends. Thanks, Camp Holiday! :)"
	},
	{
		"User": "Andrea",
		"Review": "The location is good since it's just beside the port. They also have infinity pool but if your looking for a beach where you can walk and play, this is not the resort for you. The beach is small,the sand is just like 10 meters and you cant even lie down to do some sun bathing..But the infinity pool is really good ,the water is not too cold and not too deep..it would be better if they have room service 24/7..the restaurant is only open till 11pm and opens at 6am.."
	},
	{
		"User": "Willy",
		"Review": "NICE HOTEL GOOD SWIMMINGPOOL VERY FRIENDLY STAFF LIKE THE PLACE MUCH"
	},
	{
		"User": "Patryk",
		"Review": "You may like it or not, just should be aware. On weekends there are a hundreds of \"day-use\" guests (especially locals) who makes a lot of noise and are everywhere. There is no beach in terms of sand. Just a concrete. Staff is very kind but not really helpful. You have to ask 3 times. But they are really nice."
	},
	{
		"User": "Hannah",
		"Review": "The place and recreation area."
	},
	{
		"User": "Alexandra",
		"Review": "Very accessible (Near Port, Besides Nest Convenience Store, and Tricycle & Habal Habal Association), Clean Room, Nice Staffs and Security Personnel, and Amazing view from Infinity Pool. Highly Recommended when in Samal Island. "
	},
	{
		"User": "Abigail",
		"Review": "It's just beside the port. The resort is really nice. Our room is big!! i love the food in their restaurant with very affordable price."
	},
	{
		"User": "Mary",
		"Review": "We liked our stay and we found the location to be perfect for us. Although the beach area is rocky, but pools are really nice. You can always go to other beaches, though. We're going back to Samal, and we'll be choosing to stay here again."
	},
	{
		"User": "Jesu",
		"Review": "At first we were hesitant to book this because we were afraid that it might not be up-to-par. After staying there, we were pleasantly surprised. The \"private beach\" is decent, maybe even better than some of the rocky beaches in the area. The view around the infinity pool area is also excellent. Minor issues with the room door being loose and toilet being hard to flush, but those aside, we had a great stay at Camp Holiday."
	},
	{
		"User": "Sheron",
		"Review": "accessible to the ferry port"
	},
	{
		"User": "Mac",
		"Review": "Affordable, near Port, infinity pool is nice, "
	},
	{
		"User": "reynaldo",
		"Review": "helpful staff,infinity pool is nice & clean, pls keep the beach area clean from trash & plastic, bedsheet ,linen, & towel in cottage looks and feels like rugs,"
	},
	{
		"User": "maria",
		"Review": "The place is clean and affordable, location wise- very near babak terminal. Downside: small beach front, and since the location is very near the ferry port, felt awkward to swim 😊 Over all: Good place to stay"
	},
	{
		"User": "Sheron",
		"Review": "accessibility, affordability "
	},
	{
		"User": "Andrew",
		"Review": "The hotel is accessible as it is situated beside Samal Ferry Wharf. It has a restaurant, playground, pool, infinity pool (for check in guests), bar and billiard tables. If you love beach with long shoreline, this resort is not for you. Though it is near the wharf station, they maintain the cleanliness of the beach. Beach is quite rocky. If you want to enjoy the resort, better visit from Monday to Thursday. Do not go here on a weekend as resort is flooded by day tourers. Though restaurant serves variety of food, better order ahead of time so not to end up waiting too long. Cable tv have bad signal. If you need assistance, you may send an sms or go to front desk as they do not have telephone lines in rooms. Staff are friendly but needs to be more attentive to guests. "
	},
	{
		"User": "Jelle",
		"Review": "Value for money - The price is reasonable. Their room is spacious. I liked their room. Location - It is easy to find because it's just outside the ferry terminal. There's a convenience store outside. Cleanliness - I can say that the resort is quite clean itself. Even our room was clean. Staff - Their receptionists and guards were accommodating and friendly. They have assisted us during our stay there. Facilities - Their pool is nice. Even the beach is also good considering that it's near the pier."
	},
	{
		"User": "Justine",
		"Review": "Worth the money! You wouldn't think that this gem would be placed just right beside the wharf! It's right under your nose! The 4.5 ft-deep infinity pool is exclusive to guests who are checked in, and the place is very well-maintained. There's a whole section where guests are encouraged to grill meet and/or vegetables and/or fruits (FOR FREE, YES!). The staff are accommodating and friendly, too. Also, you would think that the beach front would be disgustingly dirty as it's REALLY RIGHT BESIDE THE WHARF, but no, it's actually clean. You won't even smell fuel/oil from the barges/boats/ships, VERY minimal level of dirt, even. And again, the pool. The swimming pool! If not for my companions who wanted to get out of the pool because it was getting dark, I would've stayed until 9PM (closing). Seriously. Book this place. Now. Especially if you're going on a weekday. Seriously. "
	},
	{
		"User": "Hanneli",
		"Review": "Good location and facilities. Courteous staff."
	},
	{
		"User": "Werner",
		"Review": "A surprise to find this so near this resort so near ferry terminal. Only 50 meter walk It's very easy to go here. Boat from Davao to Babak cost 10 pesos and take 10 min only If you have low budget go with Bus from Ecoland bus terminal. Bus going to Tagum. Ask driver or conductor to stop near ferry terminal it's only 100 meter walk It's really beautiful here. Nice small house. Basic but all you need. Bed maybe not best bed I I slept but ok. It's like plastic at foam so bed sheet don't want stay. But for a night or 2 it's okay I stay here 2 night but no signal for tv under my visit. No signal they told me. No real wifi. It's ok to me because i don't go here for looking TV and I survive without Internet If you want look at tv bring a laptop and your own wifi. Smart and Globe have both 4G/LTE here. Beach area is very clean. One of best I seen here in Mindanao. Small but not so much people. They have 2 pools. Very clean and fresh. It's beautiful here. Clean and fresh. Green gras"
	},
	{
		"User": "Marc",
		"Review": "Pros. Facilities are good. Worth paying Cons. Wall socket is far from the bed. Cable tv is not working properly. No telephone in the room. It's either you call their cellphone number that will cost you money or you walk to the lobby"
	},
	{
		"User": "Melody",
		"Review": "Just ok"
	},
	{
		"User": "jonald",
		"Review": "the place is near the port, but the staff is very accomodating and always smile at you food is also good but only negative is when you eat at the restaurant there a lot of insect or bug."
	},
	{
		"User": "Maurice",
		"Review": "It is just near the port, I would say a 10-minute walk. They have a beautiful infinity pool but forget about swimming in their tiny beach. Rooms are clean and spacious. I mean it was one of the most spacious room I have ever rented for a very friendly price. But if you are looking for the nice beaches of Samal Island, this is not the place to go. There are other options to choose from. The island actually is not small so it's best to plan where you want to stay. I suggest you do more research and consider your budget as well. "
	},
	{
		"User": "Hendra",
		"Review": "Spacious room and clean. The downside of the room is the bed is not comfortable and the design looks like old. Maybe best to modify the room tt looks better"
	},
	{
		"User": "Melody",
		"Review": "No phone or intercom for room service.. Added tax fee is 293.22 pesos. The tax is More than 20% from total amount of 1,274.85.. And No room service staff available during midnight"
	},
	{
		"User": "Sharon",
		"Review": "We had to wait until check-in time at 3pm so we went for an island day tour.. Went back to the hotel at 4pm and was able to get the room but the extra beds were not set up and toilets were dirty! We already have waited long enough but the rooms were not prepared according to our booking!"
	},
	{
		"User": "Cristina",
		"Review": "I stayed here with my 5 year old son. I booked it because it has amenities that kids would enjoy like the playground. The place is awesome and so as the food! It's reasonable, affordable and it was really good! I will surely come back here with more company😍 Try their lomi.. Oh my.. ❤️"
	},
	{
		"User": "Gabrielle",
		"Review": "We booked last minute, but the resort was able to give us adjacent rooms to our friends'. Very near the wharf and is a great pick up point for touring the island. The food was great and cheap, we had all our meals at the resort and they had variety. Exclusive infinity pool near the beach was clean, but the beach is small so don't expect too much. Will definitely stay again!"
	},
	{
		"User": "Kristine",
		"Review": "Check in time is very late at 3pm. And they charge additional 300Php for early check in. Babak area is not really a good beach area considering the number of resorts here. It is because each resorts has very limited beach front. They put fences on lot boundaries, extending to the beach! Hence, this resort has only about 4m-5m wide beach front! We came here for the beach and was very very disappointed. Good thing they have a pool which sort of made it up a bit. Our room is big but the toilet is so so. It doesn't drain fast and easily. The exhaust doesn't work well as the always feel damp and humid. Cable signal is very slow. It feels like watching a youtube video that buffers every 5 seconds. "
	},
	{
		"User": "Archie",
		"Review": "Very Good"
	},
	{
		"User": "Archie",
		"Review": "The facilities are great, the staff are accomodating, nice and always smiling, infinity pool is 💙💙💙. The rate is okay. The rooms should have electric kettle, mugs and glasses."
	},
	{
		"User": "Melody",
		"Review": "No intercom or phone line to call housekeeping or front desk.. No free shampoo and toorhpaste"
	},
	{
		"User": "EDEN",
		"Review": "Near to the Port and affordable :)"
	},
	{
		"User": "Sarah",
		"Review": "The staff, as always, were courteous. We were given cottage nearest to the front desk so Wifi access was somehow stronger. Connection is feeble so take a pocket-wifi with you or just stay in the lounge if you need to internet access.The room and toilet and bath are quite old but clean, bed was big, a/c functioned well.We needed hot water and we had to ask it from the restaurant who referred us to housekeeping and waited thirty minutes for the water to arrive.I think they will do better if they can provide an electric pot and complimentary water for the guests.The pool can easily get crowded with eager swimmers wearing cotton shirts and shorts. They are not strict with attire. The beach water offers a better option though.It was a pleasant stay nonetheless, away from the buzz of the city."
	},
	{
		"User": "David",
		"Review": "Had a lovely time at Camp Holiday . Booked location as my wife had a school reunion arranged at resort . Read a few reviews prior to booking & was not expecting too much . The resort turned out to be great . Restaurant worked well & food was good . Swimming pool is for checked in guests only so not crowded. This was midweek not over a weekend . We had a cottage which was good value although the mattress was not that comfortable . Would certainly stay again . "
	},
	{
		"User": "Sheva",
		"Review": "\r staff room and pool"
	},
	{
		"User": "Madonna",
		"Review": "\r Near Port, clean, accommodating staffs"
	},
	{
		"User": "Ramel",
		"Review": "Staffs are accommodating. Place is very clean. Spacious room for cheaper price. BUT: No slippers. No WiFi. Beach is not that good because it's near the port."
	},
	{
		"User": "honrado",
		"Review": "\r Swimming pool,beach,accessibility"
	},
	{
		"User": "Angela",
		"Review": "\r I dunno"
	},
	{
		"User": "Alain",
		"Review": "\r 1. Great location 2. Affordable but great food 3. Very big room for its price"
	},
	{
		"User": "Gemmali",
		"Review": "\r comfy rooms, delicious food, clean pool"
	},
	{
		"User": "Jonaliz",
		"Review": "\r Location is very convenient, staff is very accommodating, rooms are comfortable "
	},
	{
		"User": "maria",
		"Review": "\r location"
	},
	{
		"User": "Mary",
		"Review": "\r Room Cleanliness, nice location and affordable price"
	},
	{
		"User": "Diosdado",
		"Review": "\r Food portion and cold beer; hardworking staff; balcony"
	},
	{
		"User": "Michelle",
		"Review": "\r Value for Money. Location. Convenient."
	},
	{
		"User": "Ken",
		"Review": "\r good location"
	},
	{
		"User": "HIROSHI",
		"Review": "\r location. small private beach."
	},
	{
		"User": "Maria",
		"Review": "\r Pool"
	},
	{
		"User": "RICHARD",
		"Review": "\r LOCATION,SWIMING POOL,RESTURANT ON SITE"
	},
	{
		"User": "ELVIE",
		"Review": "\r location, pool, room"
	},
	{
		"User": "Lea",
		"Review": "\r staff are friendly, facilities are good nut their towels are old"
	},
	{
		"User": "Anwar",
		"Review": "\r Location, known, swimming pools "
	},
	{
		"User": "herjo",
		"Review": "\r swimming Pool, restaurant and location"
	},
	{
		"User": "Darren",
		"Review": "\r Location, Views, Comfort"
	},
	{
		"User": "Joseph",
		"Review": "\r Near to pier and 15 minutes far from Hagimit falls. Very nice staff. Rooms are big with balcony."
	},
	{
		"User": "Marie",
		"Review": "\r accessibility, comfortable and clean facilities"
	},
	{
		"User": "Gene",
		"Review": "\r Clean and big rooms, nice inifinty pool and comfortable beds to sleep"
	},
	{
		"User": "Koko",
		"Review": "\r Food, Hotel, near the places"
	},
	{
		"User": "Christian",
		"Review": "\r Spacious Room, Good environment, Very expensive CORKAGE."
	},
	{
		"User": "Edna",
		"Review": "\r highly accessible, comfortable, simple+"
	},
	{
		"User": "Byungkon",
		"Review": "\r Nearby Ferry Terminal"
	},
	{
		"User": "Jonathan",
		"Review": "\r CLEANLINESS"
	},
	{
		"User": "Charisse",
		"Review": "\r simple, relaxing, quiet"
	},
	{
		"User": "anna",
		"Review": "\r Accesible to the city. Cheap but comfortable. You get more than what you pay for. The food is cheap but tastes good. "
	},
	{
		"User": "stella",
		"Review": "\r Near public transport, nice pool and big rooms"
	},
	{
		"User": "Gerard",
		"Review": "\r near the wharf. Cheap and clean"
	},
	{
		"User": "marie",
		"Review": "\r the place, the price, and the staff---the best."
	},
	{
		"User": "Julito",
		"Review": "\r environmental friendly and vacation place for family specially during summer"
	},
	{
		"User": "Fritzie",
		"Review": "\r nice place , convenient and quiet"
	},
	{
		"User": "Ed",
		"Review": "\r Clean and peaceful surroundings, infinity pool exclusive for hotel guests, very accessible"
	},
	{
		"User": "Danielle",
		"Review": "\r Food is cheap, nice place and very big"
	},
	{
		"User": "VIVIAN",
		"Review": "\r Beach, playing with kids, relaxing"
	},
	{
		"User": "Ma",
		"Review": "\r Friendly staff, gr"
	},
	{
		"User": "Ruth",
		"Review": "\r Location, staff, rooms..."
	},
	{
		"User": "mogens",
		"Review": "\r its was direct to the sea"
	},
	{
		"User": "Baudouin",
		"Review": "\r Good location, nice pool, good food."
	},
	{
		"User": "Priscilla",
		"Review": "\r walking distance from the port, good swimming pools, clean beach"
	},
	{
		"User": "Daynard",
		"Review": "\r walking distance from the port, heated pool & reasonably-priced food"
	},
	{
		"User": "Kathrine",
		"Review": "\r location and staff"
	},
	{
		"User": "david",
		"Review": "\r cheapfood, very freindly , good fun"
	},
	{
		"User": "Mark",
		"Review": "\r Quiet, comfortable surroundings, access to the beach"
	},
	{
		"User": "Billy",
		"Review": "\r budget hotel yet comfortable room plus with swimming pool"
	},
	{
		"User": "Grace",
		"Review": "\r cleanliness, staff, big rooms"
	},
	{
		"User": "Shaharaine",
		"Review": "\r affordable rates, friendly staff & convenient location"
	},
	{
		"User": "Rolan",
		"Review": "\r Pool beach front.."
	},
	{
		"User": "james",
		"Review": "\r Great staff, great facilities, great price."
	},
	{
		"User": "Melvin",
		"Review": "\r relax, clean and comfortable"
	},
	{
		"User": "Atty.",
		"Review": "\r clean, comfortable and secured"
	},
	{
		"User": "Sheryl",
		"Review": "\r Good location, friendly staff, clean sorroundings"
	},
	{
		"User": "William",
		"Review": "\r This place has a \"Corking Fee.\" They charge you for any food and drink. So, your stuck there eating there overpriced crappy food. And, They inspect your baggage upon arrival...."
	},
	{
		"User": "William",
		"Review": "\r This place has a \"Corking Fee.\" They charge you for any food and drink. So, your stuck there eating there overpriced crappy food. And, They inspect your baggage upon arrival.."
	},
	{
		"User": "Andrea",
		"Review": "\r near ferry terminal, nice beach, relaxing"
	},
	{
		"User": "NANETTE",
		"Review": "\r Location is perfect"
	},
	{
		"User": "MELLITA",
		"Review": "\r relaxing, nature friendly ,nice view"
	},
	{
		"User": "Phillip",
		"Review": "\r Billards, Good food and service, Large kiddie swimming pool"
	},
	{
		"User": "john",
		"Review": "\r location and facilities"
	},
	{
		"User": "john",
		"Review": "\r cottages are close to everything , great for the kids, easy to keep your eye on them"
	},
	{
		"User": "Kadelle",
		"Review": "\r  "
	},
	{
		"User": "Marlon",
		"Review": "\r room is big and clean"
	},
	{
		"User": "Sherwin",
		"Review": "\r The beach and it accessibility to transport"
	},
	{
		"User": "Amelia",
		"Review": "\r I like the swimming pool."
	},
	{
		"User": "MANFRED",
		"Review": "\r Clean beach, good pool and play ground, food was also very good."
	},
	{
		"User": "Vincent",
		"Review": "\r 2 minute walk to the ferry which takes you back to Davao mainland"
	},
	{
		"User": "Thomas",
		"Review": "\r Good playgrounds for children"
	},
	{
		"User": "Arcturus",
		"Review": "\r The resort was nice to go around, Stylish landscape and accomodations"
	},
	{
		"User": "Luc",
		"Review": "\r Clean, friendly staff, playground for kids"
	},
	{
		"User": "Janice",
		"Review": "\r cool live band music on weekends.wide area for children to play and enjoy.beach cottage is free "
	},
	{
		"User": "Trent",
		"Review": "\r Great Customer Service!"
	},
	{
		"User": "Arnfinn",
		"Review": "\r Close to the sea"
	},
	{
		"User": "Phillip",
		"Review": "\r Good rooms, food, pool, and billard tables. Beach is ok for swimming"
	},
	{
		"User": "MARICHU",
		"Review": "\r big pool for kids"
	},
	{
		"User": "karl",
		"Review": "\r city centre for nightlife"
	},
	{
		"User": "Mohammad",
		"Review": "\r i all thinhgs like there"
	},
	{
		"User": "Pat",
		"Review": "\r rooms are larger than most"
	},
	{
		"User": "Anthony",
		"Review": "\r swimming lagoon and outdoor restaurant"
	},
	{
		"User": "G.",
		"Review": "\r Nice room, very quiet. Food excellent."
	},
	{
		"User": "enrico",
		"Review": "\r out door campimg, great location"
	},
	{
		"User": "Daniel",
		"Review": "\r Thinks to do"
	},
	{
		"User": "Fabien",
		"Review": "\r 2 piscines plages au pied de l hotel"
	},
	{
		"User": "Bernd",
		"Review": "\r Gut: Reservierter Pool nur für Ressortgäste (gesperrt für Tagesbesucher), Kabelfernsehen in Zimmern"
	},
	{
		"User": "Stefan",
		"Review": "\r freundlich, sauber, gepflegt"
	},
	{
		"User": "Olaf",
		"Review": "\r Freundlichkeit,hilfsbereit,relaxen,Sport,Party alles was das Herz wünscht"
	},
	{
		"User": "natsuki",
		"Review": "低予算、連泊希望、お子様連れとかならいい所だと思います。宿泊専用プール、小さいけどホワイトサンドのビーチ二十四時間遊泳可能。フェリー乗り場の出口付近に立地。トライシクルで少し行けば中心街なので、飲んだり食べたり出来ていいと思います(ᵔᴥᵔ)"
	},
	{
		"User": "ITO",
		"Review": "レストランの料理が出て来るまでの時間が掛かる。 部屋に、小さくても、冷蔵庫があると嬉しい。 "
	},
	{
		"User": "HIROYUKI",
		"Review": "フィリピン人嫁と子供達が行きました。すごい楽しかったみたいです。 次回ダバオに帰ったら行きたいです。 5ヶ月の息子も初海で楽しんだみたいです。"
	},
	{
		"User": "Morita",
		"Review": "初サマール島でしたが、フェリー降りてすぐなのにはびっくりした。これはコンビニエントだ。 プールは独占させて頂いた。というかオフシーズンでだれもいなかった。 ビーチは狭いが、ホワイトサンドとクリアーウォーターで綺麗。ただしリゾート感に乏しいかな。 コテージの方はバッチリリゾート感あり。全て問題なし。"
	},
	{
		"User": "Hiroyasu",
		"Review": "ローカルな雰囲気を味わいたいなら良いと思う。 ただ、自分が泊まったコテージは急にエアコンが壊れ(夜中)少し暑かったが、フィリピンでは許せる範囲内"
	},
	{
		"User": "okamoto",
		"Review": "\r 綺麗　近い　快適"
	},
	{
		"User": "TOSHIO",
		"Review": "\r のんびりとできる、アクセスがよい、たばこが吸える"
	},
	{
		"User": "Kazuhiro",
		"Review": "\r 価格からすると快適、ダバオと違い喫煙できるのが良い"
	},
	{
		"User": "HIROMI",
		"Review": "\r 低価格にしては、ロケーション、雰囲気が良い"
	},
	{
		"User": "toshiyuki",
		"Review": "\r 料理はおいしかったです"
	},
	{
		"User": "fumie",
		"Review": "\r 船着場からすぐ、孫達がプールや遊具で遊べる。プールや遊具がコテージの目の前"
	},
	{
		"User": "ERABU",
		"Review": "\r フェリーターミナルから近い"
	},
	{
		"User": "HIROSHI",
		"Review": "\r こじんまりとしたガーデン内コテージ、小鳥のさえずりで目覚める心地よさ。"
	},
	{
		"User": "Taehun",
		"Review": "평일이라 한산했음. 방은 큰편. 깔끔함. 에어콘 있음. 어린이 수영장 잘 되어 있음. 어른 수영장은 부유물이 떠다님. 리조트 내 작은 해변을 조성해서 바다수영 가능함. 바닷속에 물고기도 많고 크진않으나 수영하기 좋음 다만 가시있는 성게같은 생물이 있어서 신발은 필수. 사말 섬 내에 가격대비 좋은 곳. 다만 주말에는 사람이 많아서 복잡하다니 참고하시길."
	},
	{
		"User": "kyungsam",
		"Review": "객실마다 무료와이파이 있다고 나와있으나 로비만 됨 위생상태엉망 , 별로인듯 "
	},
	{
		"User": "Blomqvist",
		"Review": "\r Ferry, ferry and ferry "
	},
	{
		"User": "Kjell",
		"Review": "\r Svømmebasseng, hage og bra rom"
	},
	{
		"User": "KYONGSUK",
		"Review": "\r 어린이를 위한 놀이터,수영장, 맛있는 음식"
	},
	{
		"User": "samoon",
		"Review": "\r 다바오시와 접근성이 좋다. 배가 24시간 운항한다. 수영하기 좋다"
	},
	{
		"User": "kyung",
		"Review": "\r samal island 해변에 위차한 호텔"
	},
	{
		"User": "YUYI",
		"Review": "\r 交通便利、附沙灘、服務親切"
	},
	{
		"User": "Alexandra",
		"Review": "\r С понедельника по пятницу очень тихо"
	},
	{
		"User": "hongwei",
		"Review": "\r 环境优雅，服务周到"
	},
	{
		"User": "HYUN-SUB",
		"Review": "\r 정원과 숙소의 시설이 좋았음"
	},
	{
		"User": "INSOOK",
		"Review": "\r 바지선 터미널 바로 옆에 위치한 호텔"
	}
]
