[
	{
		"User": "teodoro",
		"Review": "my kids enjoy it and my parents are ok with it, food are good, staff are friendly, clean room and nice design.. very relaxing... just the rough road going down to the resort is very steep and my wife was scared about it.. specially we are on the tricycle.."
	},
	{
		"User": "Christian",
		"Review": "I would recommend this resort. I will be back."
	},
	{
		"User": "Ada",
		"Review": "cottages are cozy. staff is superb! water was clean, clear, and very swim-friendly? :) it even has a saltwater pool for those iffy about the big dark blue sea. they are actually expanding! one more pool solely for guests staying with them. the surroundings are very zen! it's like bali in samal. i hope the daytrippers will be more mindful of their behavior though, most of them leave trash lying around. not just an eyesore but also bad for our seas! please, let's help keep chema's beautiful"
	},
	{
		"User": "Richard",
		"Review": "Place is quiet and good for an overnight stay. Nothing more. Food is mediocre and not much option. No potable water to drink; you have to purchase bottled water. No wifi. No coffee/tea/kettle in the room. Water in the bathroom is weak; sometimes there's no water at all. You can swim at the beach during early morning or early evening when the water is high. Otherwise, it's just a patch of sand and rocks."
	},
	{
		"User": "Ann",
		"Review": "The resort is well-maintained, and staff was friendly and accomodating. TV channels are limited and no wifi provided. Our room was clean and housekeeping was efficient. They also provided extra blankets for free. Pool was relatively clean, although could be improved. Beach area was small but clean, and good for swimming. However, it can be a bit crowded on weekends as they also have day tours. In terms of food, it was a bit pricey as expected. Breakfast (coffee and drinks not included) and combo meals were good, but skip the pica picas. Also, they provide bottled water everyday to checked-in guests, but do not provide service water at their restaurants which is a con. Boat service to/from Waterfront hotel is also fairly efficient but is a separate charge. Overall, a great relaxing stay."
	},
	{
		"User": "Trent",
		"Review": "We were looking for a very chill place and Chemas was just that. The food was good. The staff was great & I loved our little cottage overlooking the beach. It is a perfect place for a very laid back and relaxing vacation. "
	},
	{
		"User": "Lady",
		"Review": "If you are looking for value for money and a place to just chill.. this the place to be!"
	},
	{
		"User": "Andrew",
		"Review": "Agoda web site says - TV and Internet. WRONG !! Rooms not cleaned for 3 days. Bar could or would not serve liqueur from the bar - owner only ?? Food - Typical Filipino. no variation. UK and other non Filipinos do like the choice sometimes of a steak and chips !! \ The chef and staff did a great job for us as we took ( by prior agreement) our own Turkey for Christmas day lunch. and also the chef managed to cook a traditional British Xmas dinner ( no sprouts though !!) great beach, sea - very clean - kids had a great time. and so did our entire family of 10. We shall return !!"
	},
	{
		"User": "Justine",
		"Review": "I love how peaceful the resort is.We went there on weekdays and its not crowded.Perfect for family relaxation getaway.The pool uses salt water.The beach is well maintained.They have a staff picking trashes,rocks and sea creatures that will harm the guest like sea urchins. I just noticed that staff assigned in the tables in the beach did not clean up immediately the tables used by previous guest. I saw it in the afternoon it is still there in the evening. The roomhas a balinese style. I just dont like the smell of the room and the bathroom because of the smell of shower curtain.The towels are worn out.The assigned staff to our room named \"Honey\" is excellent in providing service to us.She is a soft-spoken young lady who attended our needs right away.And foods in the restaurant taste so good.Thumbs up!Sinigang belly,sisig,grilled malasugue,maruya,halo-halo,even their fruit juices like mango,calamansi and calamansi shake taste so good.We enjoyed our vacation in your resort."
	},
	{
		"User": "Mellissa",
		"Review": "Run by housemaids even the manner of service. No leadership present. Service standards were non existent. Came in a cabana without electricity. No amenities except for a bar of soap. Only 1 bottle of water was given free throughout my 3 days stay. Leak in the toilet and on the roof. Poorly maintained rooms. Food was so ordinary, nothing to wow about. Was getting sick of it on my 2nd day."
	},
	{
		"User": "Novaline",
		"Review": "1. easy check-in 2. they are willingly answer your inquiries thru phone 3. they can provide/arrange you with the pick-up/drop off for a minimal cost 4. linens with good smell and i love them because it is all white :) 5. rooms are very balinese-feel-like 6. spacious room and area 7. location was quiet very ideal for relaxation and calmness 8. Staff and food are good .9. pool with salt water CONS: 1. comfort room sink has leak, 2. needs to replenished the toiletries daily by not asking for it 3. needs to clean the tiles of the pool. there are parts that is slippery maybe due to moss 4. no discount even you don't use the extra bed and still we paid for it. overall, it is recommended for everyone who wants to experience quiet, calmness and relax vacation with your family."
	},
	{
		"User": "Denzel",
		"Review": "Value for Money - too much high, Location - excellent, cleanliness - just fine, staff - very accommodating, Facilities - Just Fine"
	},
	{
		"User": "Sarah",
		"Review": "Consistent with its rustic theme up to the bathroom,no phone in the cottage to call roomservice, you have to use a bell. Perfect for quiet and intimate getaway. Not much food choices though plus the corkage on anything you sneak in. Overall, it's worth the price considering how it is accesible. Both beach and pool is its best appeal."
	},
	{
		"User": "Ma.",
		"Review": "Less people, nice beach and pool, good food choices and nice cabanas. Great place to relax!"
	},
	{
		"User": "Olive",
		"Review": "If you're looking for a peaceful and quiet place to stay, this is the best! "
	},
	{
		"User": "Melanie",
		"Review": "The place was easy to go to with the resort’s boat from Waterfront Insular Pirate Bay. The place is super relaxing and the food there is delicious. Downside would be the serving size of a few items like Pork Inihaw (150 for a meager serving) and Calamares of only 8 pcs or so. Some servings were okay such as the Sisig. These are just to name a few but overall we were still satisfied. Attendants are attentive and fast. However, one glitch is when they did not reserve the umbrella hut which we asked them to reserve. Also, drinking water cannot be brought to the resort, else you pay corkage fee. You have to buy from them at 30 pesos per 500ml bottle (as of Oct 14) Other than that, the cottage which has seen better days is still comfortable and cozy. It’s also great that you can eat in your cottage. Very pleasant experience. Points for improvement: Quality of the towels (we were given torn towels), Toilet flush was always open, and should have in-room coffee and tea making facility"
	},
	{
		"User": "Mina",
		"Review": "wondering why checking out at 12 noon means that the beach huts are no longer free in the afternoon "
	},
	{
		"User": "Mauricio",
		"Review": "The staff, especially Icel, are all nice. Except for the trash floating on the sea area and the garbage along the coast, the property is a relaxing one. The pool is a relaxing place. "
	},
	{
		"User": "Ma.",
		"Review": "Chema's By the Sea is great for travelers looking for a quick getaway from the hustle and bustle of the city. It offers solitude and relaxation especially because they only have a few cottages/villas for accommodation, meaning less people, and they don't have wifi, too. The staff were very welcoming and attentive, although I was bummed about the massage therapist (there's only one so this is upon availability) who cancelled on me on the last minute. PROS: Clean and spacious cottages, salt water pool (to die for!!) CONS: Shuttle boat transfer (putting this unders cons because I was lead to believe it was for free until I received my bill upon checkout), quite expensive menu"
	},
	{
		"User": "Katherine",
		"Review": "Beth, the staff who assisted us during our 3 day stay was very accommodating and helpful."
	},
	{
		"User": "Shenna",
		"Review": "We enjoyed our stay at the resort. Will definitely be back soon."
	},
	{
		"User": "Maureen",
		"Review": "Pros: The place was beautiful and perfect for relaxing. It wasn't crowded. The staff was very helpful and nice. Quiet and peaceful. Cons: No Wi-Fi. Not much to do besides go swimming in the pool & on the beach so 1 night is enough. Make sure to bring mosquito spray. "
	},
	{
		"User": "Jerome",
		"Review": "Service and facilities are just standard nothing special about this resort."
	},
	{
		"User": "Josephine",
		"Review": "The place is hidden, good ambiance and friendly people. This is my nth time i was here and i would highly recommend this place. Clean room and nice beach and pool"
	},
	{
		"User": "Deane",
		"Review": "Stayed here with a group overnight. Quite close to the city proper, so it's wonderfully accessible. The service was good, and I love the fact that they assign a \"butler\" to each guest room, to attend to your needs. The food was satisfactory. I wish they arranged tours for guests though, as I wanted to explore the surrounding islands more. Nonetheless, would stay again."
	},
	{
		"User": "Scott",
		"Review": "This place was difficult to find. We hired a trike after exiting the fairy to take us to the resort. He had to ask another driver for directions, and when we arrived, there were no obvious indications that we were at the right place. The staff also did not greet us upon pulling up. This felt really unsettling as it felt like we might be trespassing in the middle of nowhere. Once we were in the resort, the staff was great. They were very accommodating, and they scheduled an impromptu tour of the island so that we were able to explore most of the attractions in a day. I really appreciated this. However, the staff could have been a little friendlier. It wasn't the type of place where the staff acknowledged guests whenever they were in proximity. The room looked gorgeous, but it didn't feel clean. The bathroom had a few bugs and there was a lizard in the room. The bed was nice though. All in all, I think that it is too expensive for what you get, but my stay was generally pleasant. "
	},
	{
		"User": "Iris",
		"Review": "A nice and quiet resort with a good Bali-inspired ambiance. The food was okay but they don't serve complementary water. They should clean the beach in the afteroon, a lot of debris and some plastic gets washed up on shore late in the day. "
	},
	{
		"User": "Ryan",
		"Review": "totally enjoyed our stay here even though if its very hard to find the place as they didn't have a sign posted along the road. small but very clean beach front with mt. apo as the backdrop. will definitely return."
	},
	{
		"User": "KRISTHINE",
		"Review": "Awesome place! the room is very relaxing especially the bed! :) The ambiance is superb! :) the staff are very friendly and accommodating! We will be back here next time! :) this resort is highly recommended!"
	},
	{
		"User": "DEIRDRI",
		"Review": "Boat fare of Php200 was not specified, too bad for guests checking in if they dont have extra cash for payment."
	},
	{
		"User": "SHEILLA",
		"Review": "It was a good stay at Chemas! Although we wish to have at least complimentary/ service water in the room."
	},
	{
		"User": "Mervin",
		"Review": "Our family (4 pax) spent our first Christmas together away from home..just for a change. It was just a spur of the moment when we booked our stay at Chema's and we're very satisfied with the stay. We booked the 2-bedroom Cabana , the first room on the ground and 1 room on top. It was cozy and relaxing.The beach was great as well as the affordable food. You can just order the food and have it served in your room or prefer to be served in their dining hall. The ambience is quiet and serene, maybe for improvement, they can offer water sports or outdoor activities."
	},
	{
		"User": "Alma",
		"Review": "Perfect place to have a short vacation. The place is so relaxing, so quiet and so peaceful. The beach is just a few steps away from the rooms. "
	},
	{
		"User": "Florence",
		"Review": "The cottage was nice (4 persons). It was clean. The area wasn't nice though. Hard getting there. Getting back was even worse. No vehicles were here because it's a bit far from the main road. Staff didn't help to get us a trycicle or anything. And the small \"beach\" the resort had was viewing Davao City, so it wasn't pretty. For 1 night it was fine. But won't come back here anymore. The beautiful beaches are at the other side of this island."
	},
	{
		"User": "Jeeka",
		"Review": "Must serve water for free, complementary for ordering food to there resto"
	},
	{
		"User": "Clarence",
		"Review": "I will make my review short, straight to d point and simple.. very well maintained resort, food is very affordable and delicious.. every guest have their own assigned staff and ours is ATE LET a worth to keep employee, we are very speechless on her care, assistance and friendliness to the guest even we request a lot of stuff.. Their resort is clean, organize and quiet.. To Sir Juaqin (not sure if i spell it right) from the bottom of our hearts THANK YOU for being a very friendly and nice owner.. Belatee Happy Birthday din po.. We wont forget how you share your success in life and inspired us on how to plant things in life.. Again Chema's by the Sea 2thumbs up and you let us crave to come back again there.. God bless!!! Salute!! "
	},
	{
		"User": "Rio",
		"Review": "Clean and quiet place. Perfect place to relax. Beach is clean and gorgeous!❤ staff are very polite and helpful. Food has good value for money. Easy to go to. My family loved it!"
	},
	{
		"User": "Darwin",
		"Review": "Best value to your money"
	},
	{
		"User": "Josephine",
		"Review": "Staff very friendly, good food, clean room and nice beach n pool over all Happy will Definitely come back"
	},
	{
		"User": "Rachelle",
		"Review": "The place itself is like where island mountain meeting the sea. Cabanas, cottages and rooms are well designed. The design theme makes me feel like I'm somewhere in Cambodia or Thailand. They assign a lady \"butler\" for each cottage on a 2 - 3 to 1 butler ratio. The service we got from Beth is great. She checks us in, cleans up the cottage, takes our orders, serves us our meals and she said she will also be booking tours for us if we opted to."
	},
	{
		"User": "Rosario",
		"Review": "the place is very nice,private and relaxing...if given the chance, will definitely come back..."
	},
	{
		"User": "Meldy",
		"Review": "A must stay place especially for family. They have a swimming pool and beach. Food is good too. Highly recommended."
	},
	{
		"User": "Jazel",
		"Review": "My friends and I had so much fun in this private resort. The owner was so nice to us! Great service, helpful staff and good food!"
	},
	{
		"User": "michelle",
		"Review": "The place is simple, laid back and worth the trip. It has a very private vibe, with a personal touch as the staff are always ready to help or assist with whatever you need. The facilities, room and food are also fabulous. I'm already planning my next trip there. "
	},
	{
		"User": "rommel",
		"Review": "Good service great area il be comming back"
	},
	{
		"User": "Kristiaan",
		"Review": "A truly relaxing place to be a worry free vacation everything you need from the food to the drinks and a staff that is so accomodating thanks to Leziel one of the staff that is always there to make sure everything we need is being taken care off..a highly recommend resort"
	},
	{
		"User": "Trisha",
		"Review": "The place is perfect for a relaxing vacation. Good food and value for money. The room where we stayed is also very cozy and the AC works well. My only issue was the bidet in the toilet was leaking. The staff are all very attentive to our needs and the owner was also very nice to the guest, he even hung out with us. Truly and amazing time and would love to go back with to bring my kid. "
	},
	{
		"User": "Abdul",
		"Review": "the beach was clean and white and it is near to davao"
	},
	{
		"User": "reviemelyn",
		"Review": "No maintenance ,lots of cats , overrated , 'My rate is 6.0 needs improvement, expensive room rate with old and dirty place , no maintenance at all . "
	},
	{
		"User": "Melanie",
		"Review": "Our stay there was very accommodating and relaxing. The staff are friendly and they assisted you whenever you have some concern. The food was delicious and reasonable but I do hope they have much more choices to choose from. I will recommend this resort to my relatives and friends."
	},
	{
		"User": "Wilfred",
		"Review": "Filled with trees thus very relaxing"
	},
	{
		"User": "Sierra",
		"Review": "This is a fantastic place! Their staff are very nice and smiling all the time. They made sure our stay was enjoyable. Value for money. Beds are comfortable and beach is nice. Will stay here again! "
	},
	{
		"User": "Gloreina",
		"Review": "Hope that there would also be shampoos and toothbrushes/paste included in the bathroom."
	},
	{
		"User": "Alain",
		"Review": "This is my 2nd time to stay at Chema's. First time was in 2014. Similar to 2 years ago, the place remains to feel like a secret rustic beach resort for those who just want serenity and relaxation away from everything. You can swim in the pool or in the fine sand beach. You can also sit/lie down and relax in the shore or in your villa. The rooms look very rustic but are kept clean and well maintained. The beach shore is quite short but is sufficient since they resort only accommodates few people anyway. Food service might take a while so you just have to order around 30 minutes earlier. I'll definitely be back here another time when I want a quick beach getaway."
	},
	{
		"User": "Jessica",
		"Review": "Relaxing stay. Weather was great so we got to swim in the pool and the beach. Food was yummy. Staff was very accommodating. It's my second time and will definitely go back for a third. "
	},
	{
		"User": "David",
		"Review": "Nice place but a bit far to get too . Staff were very friendly especially Beth . Food was good , reasonably priced . Location views were good , beach was good and could swim in the ocean and also the pool .Would go back there ."
	},
	{
		"User": "Ariann",
		"Review": "The place is underrated. If anyone is looking for a place to just relax, chill, enjoy the company of your family, group---this is the place to be. The family cottage where we stayed is not very big but is enough for a short comfy stay. We all loved the beach and the salt water pool! The shore isnt much but the area is just perfect for a nice swim. We enjoyed the place a lot because it's very private and the service is personalized. They should add some more dishes in the menu though as there isnt much options."
	},
	{
		"User": "Hershie",
		"Review": "Excellent place if you're looking for a place to really just relax and enjoy the sun, sand, and sea. Very private setting where you'll feel that you're secured. I guess rooms are relatively new and lacked the normal amenities you'd find in a Hotel. (e.g. no side tables, cabinet too small, shower area inside the bathroom a bit small, no phones/intercoms to call for service). Another issue was the numerous blackouts. They have an emergency generator but not really enough to power the a/c units. Although this, as what we have been told, is an island wide problem, so... But overall, we loved the place. We especially loved the service of one of the staffs. her name is Lenlen. Very accomodating and welcoming. "
	},
	{
		"User": "VERNETTE",
		"Review": "My only concern is no free drinking water. 150 pesos corcage, drinking water. Anyways, overall satisfactory-good. "
	},
	{
		"User": "Maria",
		"Review": "Food prices are reasonable. Each cottage has own private helper, who are very friendly and very willing to make your stay memorable. Not crowded, we had the beach all to our selves for most of the day."
	},
	{
		"User": "Blesilda",
		"Review": "We were there when the entire Samal Island had no electricity (the electricity cable that connected the island to the mainland got cut off). During our stay, the resort management implemented rotational brownouts (they were using two generators)during the day, at night they provided continuous supply of electricity, which is a relief to us since it's already summer. The staff assigned to us (every cabana has its own attendant) was very attentive which makes our stay comfortable. I would definitely return in the future."
	},
	{
		"User": "Darrin",
		"Review": "\r Staff service, good food, seaside location and saltwater pool."
	},
	{
		"User": "Divina",
		"Review": "Memorable stay - we loved the food, staff, landscape, beach and its proximity to tourist spots in Samal and Davao. Will definitely go back!"
	},
	{
		"User": "Tonny",
		"Review": "God stay"
	},
	{
		"User": "Paula",
		"Review": "\r Just average overall service"
	},
	{
		"User": "Teri",
		"Review": "\r 10 minutes from davao, private beach, nice resort"
	},
	{
		"User": "Teo",
		"Review": "we feel like kings and queens, sobrang accommodating at bait ng staff. will definitely go back :) "
	},
	{
		"User": "GRACE",
		"Review": "\r Location, nice beach front, ambiance"
	},
	{
		"User": "Josephine",
		"Review": "clean and nice hotel.food is delicious too.friendly staffs and quiet place. beach is clean and nice with an small cute infinity pool"
	},
	{
		"User": "Sarah",
		"Review": "\r Serenity , interior design, fine sand"
	},
	{
		"User": "joanne",
		"Review": "Please improve linen sheets and provide clean drinking water without a fee"
	},
	{
		"User": "Maria",
		"Review": "\r privacy, ease, comfort"
	},
	{
		"User": "Richard",
		"Review": "\r Cozy, relaxing, and good food"
	},
	{
		"User": "Chona",
		"Review": "\r 1. room presentation"
	},
	{
		"User": "Dorothy",
		"Review": "\r The grounds are well-kept, the houses look dainty especially at night, the beach was clean and nice especially during high tide when you can just jump from the seawall into the clear blue sea."
	},
	{
		"User": "Lois",
		"Review": "\r Beachfront, food and room"
	},
	{
		"User": "Charis",
		"Review": "\r Beach. Beach. Beach."
	},
	{
		"User": "Angelica",
		"Review": "\r Comfort, relaxed, quiet"
	},
	{
		"User": "Hanna",
		"Review": "\r Food, Staffs and rooms"
	},
	{
		"User": "colin",
		"Review": "\r The cottage was great, the staff were excellent, the location was a thrill"
	},
	{
		"User": "Nicholas",
		"Review": "\r Staff, cleanliness, pool"
	},
	{
		"User": "IVY",
		"Review": "\r Privacy, accessibility, relaxing"
	},
	{
		"User": "daisy",
		"Review": "\r ambiance, clean beach, attentive staff"
	},
	{
		"User": "Todd",
		"Review": "\r The rooms and the resort grounds are very lovelt"
	},
	{
		"User": "Princess",
		"Review": "\r relax"
	},
	{
		"User": "ANNA",
		"Review": "\r White sand, clear water, nice room"
	},
	{
		"User": "Kadelle",
		"Review": "\r Rooms "
	},
	{
		"User": "Angeleen",
		"Review": "\r service, room"
	},
	{
		"User": "Nilda",
		"Review": "\r Very peaceful, accomodating staff & great food"
	},
	{
		"User": "Kadelle",
		"Review": "\r 1.) Not crowded 2.) Scenery 3.) Ambiance "
	},
	{
		"User": "Antoniette",
		"Review": "\r Staff service, room design, infinity pool"
	},
	{
		"User": "Perwin",
		"Review": "\r Service, the resort is not crowded, and location"
	},
	{
		"User": "graeme",
		"Review": "\r Staff location price"
	},
	{
		"User": "israelito",
		"Review": "\r privacy, comfort"
	},
	{
		"User": "Rosalie",
		"Review": "\r it's always great when staff are helpful and attentive without hovering too much"
	},
	{
		"User": "Rosalie",
		"Review": "\r the staff were great. attentive and always accommodating"
	},
	{
		"User": "kevin",
		"Review": "\r location, location, location"
	},
	{
		"User": "Salud",
		"Review": "\r It's very clean, the staff was helpful & there was a safe beach area where kids can play "
	},
	{
		"User": "Jeafrey",
		"Review": "\r Quite, clean and friendly staff"
	},
	{
		"User": "ANGELICA",
		"Review": "\r clean beach, not crowded, a lot of greens and trees"
	},
	{
		"User": "Me",
		"Review": "\r I like there rooms and the ambiance but the stuff "
	},
	{
		"User": "Don",
		"Review": "\r Beautiful grounds, attractive accomodations, nice private beach"
	},
	{
		"User": "Honey",
		"Review": "\r Quiet surroundings, nice hotel interior and exterior, cleanliness"
	},
	{
		"User": "Bassam",
		"Review": "\r beach"
	},
	{
		"User": "Julie",
		"Review": "\r close to beach, comfortable bed and room facilities"
	},
	{
		"User": "Ma.",
		"Review": "\r Clean, Exclusive & Close to nature."
	},
	{
		"User": "maria",
		"Review": "\r beautiful, friendly, clean"
	},
	{
		"User": "Cristine",
		"Review": "\r Good food, affordable, well kept"
	},
	{
		"User": "Pascal",
		"Review": "\r romantic, the garden"
	},
	{
		"User": "Maria",
		"Review": "\r peaceful, relaxing and clean"
	},
	{
		"User": "Francisco",
		"Review": "\r Quiet / Beautiful Gardens / Friendly Staff"
	},
	{
		"User": "Thomas",
		"Review": "\r Friendly staff, location, quiet"
	},
	{
		"User": "Dennis",
		"Review": "\r The Staff, the Location, The room"
	},
	{
		"User": "Jonathan",
		"Review": "\r Clean, good service, friendly owner"
	},
	{
		"User": "Joanne",
		"Review": "\r nice room design, friendly staff, relaxing atmosphere"
	},
	{
		"User": "Dorothy",
		"Review": "\r Great Villa. Fine White Sand. Serene Place"
	},
	{
		"User": "Ann",
		"Review": "\r Lovely rooms, attentive staff, good location"
	},
	{
		"User": "Peter",
		"Review": "\r Relaxation, natural landscaping, friendly, attentive staff"
	},
	{
		"User": "Joanne",
		"Review": "\r Quite, nice beach front, friendly staff"
	},
	{
		"User": "ROSAN",
		"Review": "\r view,beach,cottage"
	},
	{
		"User": "Irene",
		"Review": "\r Room, Staff, Food"
	},
	{
		"User": "LAWRENCE",
		"Review": "\r Beach View, Big Balcony and Cute Cottage"
	},
	{
		"User": "MICHAEL",
		"Review": "\r GARDENS, BEACH & PERSONALIZED SERVICE"
	},
	{
		"User": "MIKOUNG",
		"Review": "\r a quiet, a close to island, "
	},
	{
		"User": "Maria",
		"Review": "\r Peaceful, friendly and attentive staff, delicious and cheap food"
	},
	{
		"User": "Dennis",
		"Review": "\r quiet setting, attentive staff, nice design"
	},
	{
		"User": "ANGELICA",
		"Review": "\r beach, white sand, saltwater pool"
	},
	{
		"User": "Ana",
		"Review": "\r The lush garden. The design of the cottages. The attentive and ever so friendly staff."
	},
	{
		"User": "Markus",
		"Review": "\r Beautiful garden, kind stuf and owner, clean environment"
	},
	{
		"User": "Jose",
		"Review": "\r Lovely room. Quiet and very relaxing place. A well kept/maintained resort"
	},
	{
		"User": "Margaret",
		"Review": "\r Loved the saltwater pool and the beach and garden setting "
	},
	{
		"User": "Yu",
		"Review": "\r 風景"
	},
	{
		"User": "Maria",
		"Review": "\r Controlled number of guests, butler service "
	},
	{
		"User": "Ana",
		"Review": "\r by the sea, its landscape, friendly staff, great tasting native food, sea-water infinity pool"
	},
	{
		"User": "Daryl",
		"Review": "\r Ambiance, location, gardens, rooms."
	}
]
