[
	{
		"User": "Elmer",
		"Review": "Friendly and accomodating staff. Big pool for big kids. A very good value for money for a family."
	},
	{
		"User": "Dennis",
		"Review": "Room is kinda dark, too far from airport and hard to find."
	},
	{
		"User": "ma",
		"Review": "The suite has a living room, kitchenette (complete with kitchen implements and appliances), small fridge, TV, aircon and telephone downstairs. Upstairs, it has 2 large rooms with equally large closets and plenty of chest of drawers and bureaus. Both rooms are equipped with A/C. Bathroom is shared. Drawback is the paneling of the toilet and shower is made of opaque glass and the mirrored lavatory is directly across. So it's pretty uncomfortable sharing the bathroom with another. The master has a king bed with TV and telephone but no view, but lots of space still for an extra bed. The other room has 2 double beds and has a small terrace overlooking the pool. Pool is until 10pm. Not much tables or beach chairs to laze around though. Smoking is prohibited. The room comes with its own garrage. Breakfast food is ok, not great. But those that we ordered from the kitchen were good. The hotel asks for a refundable deposit. You need to walk a short distance to reach the main road to get a ride. "
	},
	{
		"User": "Bradley",
		"Review": "The accommodations are in very poor shape. The bathrooms are in Terrible shape. Nothing works . Very bad odors .the only thing that is Ok there is the staff. Very helpful ."
	},
	{
		"User": "Francine",
		"Review": "Staff are helpful and very approchable..buffet breakfast is good but needs to add more options..facilities needs more improvement (kitchen wares must be available always and not upon request). Overall rating: Satisfied!"
	},
	{
		"User": "Maricris",
		"Review": "Staff are friendly, facilities are very good."
	},
	{
		"User": "Minna",
		"Review": "Good"
	},
	{
		"User": "james",
		"Review": "Out if way but nice location"
	},
	{
		"User": "Jeamar",
		"Review": "The only \"off\" or awkward with this hotel is the venue/place. You need to pass thru that motel drive"
	},
	{
		"User": "ramin",
		"Review": "No fridge in the room, restaurant little pricey but still a good place .."
	},
	{
		"User": "Judy",
		"Review": "The service is good but the towel provided in our room are tattered. "
	},
	{
		"User": "Juliet",
		"Review": "the standard rooms looks old, smelly and creepy :( the staff were very nice and accommodating we upgrade to a villa accommodation even though we're just two."
	},
	{
		"User": "uzzielyn",
		"Review": "People needs to be more pleasant"
	},
	{
		"User": "Joelrey",
		"Review": "Old place needs renovation "
	},
	{
		"User": "Adam",
		"Review": "Nice hotel , pool little small. Rooms clean and decent size without being big. Breakfast was good. Small high roller casino ($150us min ) and small pagcor pokie room. Nice restaurants in hotel and not super pricey. Busy area , big mall 200 m away. many clubs and bars close . Would stay again. Just watch the local pick pockets. "
	},
	{
		"User": "Aileen",
		"Review": "But not recommendable"
	},
	{
		"User": "christopher",
		"Review": "Satisfied stay... Good supportive and understanding staff. Free pinoy breakfast . Clean room and Facility. 7/ 10 Will definitely come back."
	},
	{
		"User": "Nesty",
		"Review": "Family villa is very spacious for four people. There's a living room, dining table, kitchen and restroom on the first floor. A space for car parking is located at the back of the villa, while the front is facing the swimming pool. Second floor has 2 rooms, one with twin bed and the other-queen size. I travelled with senior citizens so having all rooms upstairs is not very ideal. They have friendly staff, though the amenities is not so new. We had broken TV switch, and shower. But then it was all functioning, so nothing major. Getting a taxi from the hotel is easy as they have a taxi line outside, and the reception staff can call it for you anytime."
	},
	{
		"User": "Archie",
		"Review": "Very Good"
	},
	{
		"User": "abdulrahim",
		"Review": "Location is very good"
	},
	{
		"User": "Michelle",
		"Review": "Order took more than an hour. Sinks clogged. Microwave oven not provided with plate. Tapwater was rusty; though they did label it as non potable, shouldn't be that yellow and filthy. Fixtures need renovation and maintenance. Rugs requested for slippery floors came in the next day. Lights busted. Very different experience from years back when we really enjoyed staying here... Guess good things never last..."
	},
	{
		"User": "mike",
		"Review": "If in Davao will stay there again"
	},
	{
		"User": "Christoph",
		"Review": "Pool is dirty, even my Filipino friends told the same. You can hardly see ground! About 6-7 years ago Jacuzzi had hot water but ever since I've been there the water is colder than in pool. Seems heater died but they do not feel it's necessary to repair/replace. I was there this time a bit than more than 2 weeks and once out of 3 beer brands 2 went out of stock. It took 2 days to refill! Same with Whiskey. I finished Jack Daniel's first first couple of days then Johnnie Walker and finally last brand. In 2 weeks no signs to have anything refilled. I had to pump my toilet for 2 weeks. One day 3 Houskeepking guys and 2 Maintenance guys were working on it but I still had to continue pumping! Housekeeping forgot sometimes to put shampoo, soap, complimentary water and coffee. One day they did not change towels and they said they are in laundry wet and will replace 15:00 afternoons but nothing happened. Often when you opened tab they was brown water running! Balcony door was hard to open/close. I needed 2 hands and 1 feet! Bowles outside room where most people put empty bottles, dirty dishes from roomservice as well as leftovers, was not removed sometimes for almost one day. In the heat the leftover food start smelling! Entrance doors as well as some inside doors are squeaking. I could hear my neighbours doors squeaking as well. Annoying when you try find your sleep and you always hear that kind of noise. Connection pool side of Wifi always dropped and got stuck! it was best sitting on balcony but some years ago I could use Wifi in the master bedroom which is backside of hotel. Reception told me they know they have problem with poolside router and I should go to restaurant (different router). I said it is hassle to to restaurant every time. She said they don't know when problem solved. Why they promote FREE Wifi? Every time I stay there it got worse. Also some furniture damaged but they don't fix or replace. TV was not working for about 2 hours. Houskeeping guy was there th"
	},
	{
		"User": "Elmer",
		"Review": "Very affordable and welcoming staff"
	},
	{
		"User": "Angelica",
		"Review": "The internet is only available in the pool area, cafe, front desk and other rooms but not in the family villa we rented. We had to rely on the wifi in the pool area but very slow inside our room."
	},
	{
		"User": "Khrizel",
		"Review": "Everything is not okay except for the staff"
	},
	{
		"User": "Eric",
		"Review": "This hotel really need a makeover. I was very disappointed in regards to the impression of the rooms. Just imagine a really wormed out hotel that the 70ies called and wanted back. Sorry, but I will not stay there again and I will not recommend anyone to do too. You can find just as good hotel for less money in Davao."
	},
	{
		"User": "cynthia",
		"Review": "Size is GREAT"
	},
	{
		"User": "CARLOS",
		"Review": "simply horrible. rooms have no maintenance at all. standard rooms are dark rooms. no windows.. if you are in the standard room... you will have to walk through a restaurant to get to your room hallways are dark at all times... wi-fi in crown regeny davao is totally useless. front staff has is not friendly and not welcoming the only good thing about the this hotel is the kind helpful and nie housekeeping staff other than that its a big CERO.. we had booked for several days. after hours we checked out. my wife and me could not handle it. horrible experience.... big mistake to book a room at crown regency davao"
	},
	{
		"User": "Barry",
		"Review": "\r Can't think of any "
	},
	{
		"User": "Raymond",
		"Review": "\r Clean ,conveyent, hospitality"
	},
	{
		"User": "Carl",
		"Review": "\r Size is great and the pool and restaurant are nice."
	},
	{
		"User": "AILEEN",
		"Review": "\r Location-✔️ Staff- accomadating and friendly, "
	},
	{
		"User": "hefin",
		"Review": "\r Room size very good over 2 floors"
	},
	{
		"User": "Ambrocio",
		"Review": "\r Location, rate and staff"
	},
	{
		"User": "Ambrocio",
		"Review": "\r Location, rate and staff"
	},
	{
		"User": "Don",
		"Review": "It used to be a good hotel. Surprised when I saw how it got worn out. Will not come back until they renovate. "
	},
	{
		"User": "Paul",
		"Review": "\r I cannot think of any best featuresi"
	},
	{
		"User": "Mark",
		"Review": "\r staff..food..pool"
	},
	{
		"User": "Mark",
		"Review": "\r The 3 things about the hotel is its close to the airport .. great staff and good service"
	},
	{
		"User": "Flora",
		"Review": "\r big, comfortable, "
	},
	{
		"User": "ANABI",
		"Review": "\r old, lack of maintenance"
	},
	{
		"User": "ashley",
		"Review": "\r Everything"
	},
	{
		"User": "Daniel",
		"Review": "\r Staff, price, location"
	},
	{
		"User": "Roy",
		"Review": "\r swimmingpool , nice staff, good room"
	},
	{
		"User": "arturo",
		"Review": "\r clean, quiet, afforadable"
	},
	{
		"User": "OLLIE",
		"Review": "\r 50's cafe on site, attentive staff, fitness center"
	},
	{
		"User": "Regina",
		"Review": "\r kind "
	},
	{
		"User": "Noreen",
		"Review": "\r Air conditioning, pool and adequately sized villas"
	},
	{
		"User": "Drew",
		"Review": "\r Price"
	},
	{
		"User": "Drew",
		"Review": "\r location"
	},
	{
		"User": "Neil",
		"Review": "\r value for money, best for family, big rooms"
	},
	{
		"User": "Mark",
		"Review": "\r staff, location, price"
	},
	{
		"User": "Jari",
		"Review": "\r close to the airport, and ens"
	},
	{
		"User": "Suzette",
		"Review": "\r comfortable"
	},
	{
		"User": "Suzette",
		"Review": "\r comfortable, staff, food"
	},
	{
		"User": "MADHUKAR",
		"Review": "\r cheap & 24/7 restaurant"
	},
	{
		"User": "BOBBY",
		"Review": "\r Limited number of rooms if you like the not so crowded hotel."
	},
	{
		"User": "Christoph",
		"Review": "\r friendly staff, off of main streets, quite good choice of different dishes"
	},
	{
		"User": "Roberto",
		"Review": "\r large room. amentities such as pool and gym. friendly staff"
	},
	{
		"User": "Ivor",
		"Review": "\r Nice Staff, Nice Location and Big Room"
	},
	{
		"User": "Roberto",
		"Review": "\r Staff. Basic amenities. Value for money"
	},
	{
		"User": "Vincent",
		"Review": "\r service,location,price"
	},
	{
		"User": "Jose",
		"Review": "\r Good location, easy access to public transport, free wifi"
	},
	{
		"User": "Mary",
		"Review": "\r near to the city, big place and ice for shopping"
	},
	{
		"User": "David",
		"Review": "\r staff friendly and accomodating,pool,bar and restaurant open 24 hours"
	},
	{
		"User": "Mario",
		"Review": "\r location, spanish feel.//50s bar"
	},
	{
		"User": "Robert",
		"Review": "\r It was conveniently accessible to go to my meeting places."
	},
	{
		"User": "Gazelle",
		"Review": "\r staff, room, amenities"
	},
	{
		"User": "Roberto",
		"Review": "\r Comfortable rooms. Friendly staff. Amenities available"
	},
	{
		"User": "Fernando",
		"Review": "\r Food, atmosphere, people"
	},
	{
		"User": "Roberto",
		"Review": "\r Clean rooms. Amenities. Design and ambiance. "
	},
	{
		"User": "Gregory",
		"Review": "\r There were'nt 3 best anything about this hotel"
	},
	{
		"User": "Gregory",
		"Review": "\r great food, attentive staff, lovely rooms with great aircon"
	},
	{
		"User": "Rolando",
		"Review": "\r Antiques, courteous staff, peaceful and close to DavaoCity"
	},
	{
		"User": "Michael",
		"Review": "\r pool pool pool"
	},
	{
		"User": "Timothy",
		"Review": "\r pool, size of room, kitchen"
	},
	{
		"User": "Ray",
		"Review": "\r Food, staff, price"
	},
	{
		"User": "Kevin",
		"Review": "\r nice rock and roll themed restaurant."
	},
	{
		"User": "Mark",
		"Review": "\r Clean , helpful, fast service"
	},
	{
		"User": "Andy",
		"Review": "\r Location, spacious room, cordial employees."
	},
	{
		"User": "shahid",
		"Review": "\r nothing to say"
	},
	{
		"User": "Marilou",
		"Review": "\r Big room but the hotel shared the same entrance with their motel."
	},
	{
		"User": "Sean",
		"Review": "\r Cheap villas"
	},
	{
		"User": "April",
		"Review": "\r great location, friendly staff"
	},
	{
		"User": "scott",
		"Review": "\r Pool"
	},
	{
		"User": "Christoph",
		"Review": "\r at times not many guests"
	},
	{
		"User": "Ronald",
		"Review": "\r Great and helpful staff, lots of amenities."
	},
	{
		"User": "Maria",
		"Review": "\r it has large rooms,ammenities are good"
	},
	{
		"User": "ALAN",
		"Review": "\r good price , big room , fair breakfast"
	},
	{
		"User": "Mohammad",
		"Review": "\r good"
	},
	{
		"User": "Lani",
		"Review": "\r Nice pool. Good food. Comfortable room."
	},
	{
		"User": "Alan",
		"Review": "\r Very Polite, friendly staff"
	},
	{
		"User": "Jason",
		"Review": "\r Not far from the airport or the center of the city, nice pool, good breakfast"
	},
	{
		"User": "Teofila",
		"Review": "\r Best amenities of the hotel is the swimming pool"
	},
	{
		"User": "Vernon",
		"Review": "\r Nice place with ecellent staff!"
	},
	{
		"User": "Janette",
		"Review": "\r Carries a prestegious name"
	},
	{
		"User": "Christoph",
		"Review": "\r friendly staff, quiet location"
	},
	{
		"User": "cheryl",
		"Review": "\r Pool, fitness room, buffet breakfast"
	},
	{
		"User": "JEAN",
		"Review": "\r Not far from anything"
	},
	{
		"User": "Wai",
		"Review": "\r  "
	},
	{
		"User": "jean",
		"Review": "\r service"
	},
	{
		"User": "Michael",
		"Review": "\r Clean, nice rooms, decent gym, great staff"
	},
	{
		"User": "Robert",
		"Review": "\r Front Desk & Bell Boys were very friendly and service was excellent"
	},
	{
		"User": "Robert",
		"Review": "\r Service was excellent."
	},
	{
		"User": "George",
		"Review": "\r Friendly reception area"
	},
	{
		"User": "Karl",
		"Review": "\r Price, location, facilities"
	},
	{
		"User": "MOON",
		"Review": "\r safe"
	},
	{
		"User": "Atsushi",
		"Review": "\r free wireless"
	},
	{
		"User": "william",
		"Review": "\r Ffriendly staff, nice atmosphere."
	},
	{
		"User": "Atsushi",
		"Review": "\r free internet"
	},
	{
		"User": "Ernest",
		"Review": "\r not so expensive"
	},
	{
		"User": "Gordon",
		"Review": "\r Friendly staff Clean "
	},
	{
		"User": "Hau",
		"Review": "\r Quaint and comfortable. Cable TV has almost everything :) Interesting fifties themed cafe Hideaway from the main road. Quiet and restful until the guests come out to play by the pool. Only 1.50 usd from airport taxi fare. Robinsons supermarket is 5 minutes away by taxi. Posturepedic mattresses. Shower rooms on both floors."
	},
	{
		"User": "Gilbert",
		"Review": "\r The location was a real plus for me. The helpful staff especially Avs and the swimming instructor. Bobby the executive in charge took a great personal interest to see if I was being taken care of."
	},
	{
		"User": "Dominique",
		"Review": "\r Spacious rooms availability with kitchenette. Enjoyed my stay."
	},
	{
		"User": "Brian",
		"Review": "\r Nice pool. Good rates online. "
	},
	{
		"User": "Lorenzo",
		"Review": "\r Typical suburban hotel. Not big like in the main city but great people. "
	},
	{
		"User": "HIDEO",
		"Review": "\r cheap"
	},
	{
		"User": "Ernest",
		"Review": "\r location is hidden like you were in a country setting yet you're right in the midle of the city"
	},
	{
		"User": "Dick",
		"Review": "\r 50's restaraunt was great, hotel service great, and close to what we wanted to see."
	},
	{
		"User": "Melinda",
		"Review": "\r Staff friendly."
	},
	{
		"User": "michael",
		"Review": "\r Nice pool, good friendly staff, breakfast good. cost of the other meal fair but drinks are a bit costly. "
	},
	{
		"User": "Christian",
		"Review": "\r people friendly, great location, secure, great accomodation. Outstanding Service! The room was very large to my expectation. A full funerished kitchen made it feel like i was at home. "
	},
	{
		"User": "Merrill",
		"Review": "\r Employees were fantastic. "
	},
	{
		"User": "Michael",
		"Review": "\r great pool and always clean, wonderful staff, if you want something or have a complaint, tell them. Follow the staff they will lead you to where to eat"
	},
	{
		"User": "Christopher",
		"Review": "\r Service, Cleanliness of rooms and hotel overall, Accessibility to the city."
	},
	{
		"User": "Michael",
		"Review": "\r swimming pool, nice staff, small gymn for small workouts"
	},
	{
		"User": "russell",
		"Review": "\r everything was perfect food was great employees very friendly i would recommend thr regency to everyone"
	},
	{
		"User": "Paul",
		"Review": "\r Price"
	},
	{
		"User": "Glende",
		"Review": "\r Swimming pool, now with unrestricted daytime access, some people were using it after 7pm!"
	},
	{
		"User": "Peter",
		"Review": "\r not too bad for the price"
	},
	{
		"User": "Herbert",
		"Review": "\r good food"
	},
	{
		"User": "COLIN",
		"Review": "\r Truly superb; excellent value, in every way; fully recommend!!"
	},
	{
		"User": "arben",
		"Review": "\r nice hotel and very well positioned"
	},
	{
		"User": "Romeo",
		"Review": "\r Hotel atmosphere from outside seems alright and the services are broader than most small hotels - with convention halls, meeting places, etc."
	},
	{
		"User": "Gonzalo",
		"Review": "\r Staff is amazing, friendly and on top of any request..."
	},
	{
		"User": "David",
		"Review": "\r Friendly staff - nice swimming pool."
	},
	{
		"User": "Jeff",
		"Review": "\r Great service, breakfast buffet, clean"
	},
	{
		"User": "jerry",
		"Review": "\r none "
	},
	{
		"User": "Jeff",
		"Review": "\r Breakfast buffet, clean rooms and facilities, friendly professional service."
	},
	{
		"User": "Jeff",
		"Review": "\r Breakfast buffet, clean rooms, friendly professional service."
	},
	{
		"User": "Jeff",
		"Review": "\r Great breakfast buffet. Attractive courtyard and pool. Friendly professional service."
	},
	{
		"User": "joseph",
		"Review": "\r the entire hotel and restaurant staff, the location is very accessible, the price is reasonable, the free breakfast was good."
	},
	{
		"User": "joseph",
		"Review": "\r everything about the hotel"
	},
	{
		"User": "CARWIN",
		"Review": "\r The people are its greatest assets. Some of the nicest you will find in the Philippines. Free breakfast is also a treat and their pool is excellent."
	},
	{
		"User": "CARWIN",
		"Review": "\r Great pool good airconditoning you will need it they kept room clean everyday nice free breakfast and everyone very helpful as you would expect with any philippine hotel"
	},
	{
		"User": "John",
		"Review": "\r Love the staff, very pleasant and polite, and a great breakfast."
	},
	{
		"User": "Jeff",
		"Review": "\r Friendly professional service. Provides most services one would look for in a hotel. Very good value for the price. Quiet restful stay."
	},
	{
		"User": "william",
		"Review": "\r Friendly staff, good room service, good maid service."
	},
	{
		"User": "Pei-Tsung",
		"Review": "\r The location is in the center of Davao city. The staffs are very friendly."
	},
	{
		"User": "Hisashi",
		"Review": "\r Good employee know how to treat guests."
	},
	{
		"User": "Glende",
		"Review": "\r Swimming pool with Jacuzzi, \"free\" welcome soft drink, good breakfast buffet, and overall quality dining. "
	},
	{
		"User": "Jimmy",
		"Review": "\r nice pool, gym and spa"
	},
	{
		"User": "Andrew",
		"Review": "\r Friendly and helpful staff. Good accomodation."
	},
	{
		"User": "Paul",
		"Review": "\r Good Value, Friendly Staff"
	},
	{
		"User": "Dirk",
		"Review": "\r very big nice rooms, cool Restaurant, always taxi´s waiting outside."
	},
	{
		"User": "WONG",
		"Review": "\r The spa is nice with professional massage."
	},
	{
		"User": "Jeff",
		"Review": "I would recommend Crown Regency Residences to anyone looking for nice accomodation with great value. Very good breakfast buffet included in price. "
	},
	{
		"User": "Paul",
		"Review": "Overall satisfied with hotel. Enjoyed pool with family."
	},
	{
		"User": "pierre",
		"Review": "\r Le personnels fait de son mieux et l'hotel est situe en retrait de la route "
	},
	{
		"User": "Christoph",
		"Review": "\r ruhige Lage, grosser und sauberer Swimmingpool"
	},
	{
		"User": "WALTER",
		"Review": "\r DIE FRUNDLICHKEIT DES PERSONAL WAR SEHR GUT."
	},
	{
		"User": "Marc",
		"Review": "\r vriendelijk personeel,nette kamers,"
	},
	{
		"User": "KATSUYUKI",
		"Review": "スッタフの笑顔が良かったです レストランも美味しかったです"
	},
	{
		"User": "Yuuichi",
		"Review": "\r スタッフが親切で、プールやスポーツジムがあり、ショッピング施設や空港へのアクセスが比較的良い。"
	},
	{
		"User": "Yosefu",
		"Review": "\r 若干安めの料金、プルがある、立地"
	},
	{
		"User": "Masafumi",
		"Review": "\r 散歩出来る"
	},
	{
		"User": "Yoshitomo",
		"Review": "\r プールとジムと朝食"
	},
	{
		"User": "AKIHIRO",
		"Review": "\r 部屋が広く快適"
	},
	{
		"User": "KEIZO",
		"Review": "\r 通りから少し入っているので静かである。 ホテル内にはプールもあり自由に泳げるため夕食前に利用した。"
	},
	{
		"User": "junichi",
		"Review": "\r 周りも静か、道路からも奥まっていて更に静か。 "
	},
	{
		"User": "ENDOU",
		"Review": "\r 安い・朝食付き・プール付き。 "
	},
	{
		"User": "makoto",
		"Review": "\r リゾート感覚で泊まれる"
	},
	{
		"User": "Daisuke",
		"Review": "\r スタッフの対応が良い。 朝食もいい！ "
	},
	{
		"User": "Hiroshi",
		"Review": "\r 安い"
	},
	{
		"User": "Hiroshi",
		"Review": "\r 僕のことを覚えてくれて、お帰りといわれたのがとても嬉しかった"
	},
	{
		"User": "Katsumi",
		"Review": "\r 家族で行くのには良いと思う。"
	},
	{
		"User": "ADEL",
		"Review": "\r الاستقبال الغرف كبيرة المسبح "
	},
	{
		"User": "ADEL",
		"Review": "\r البحر الاستقبال بجوارة مصنع ازعاج"
	},
	{
		"User": "ADEL",
		"Review": "\r البحر الفند ق قديم الفطور سيء"
	},
	{
		"User": "Gwang",
		"Review": "\r 빠른 서비스, 잘 갖추어진 주방, 귀여운 수영장"
	},
	{
		"User": "Tony",
		"Review": "\r Trevligt hotel trevlig personal möjlighet till spa massge med mera och ett mindre gym"
	},
	{
		"User": "Lars",
		"Review": "\r Framför allt dem fina servicen. Personalen gör sitt allra bästa för kunderna. Jag har svårt att se vad som skulle vara bättre ur service synpunkt. "
	}
]
