[
	{
		"User": "Melissa",
		"Review": "The staff, service and the food."
	},
	{
		"User": "Mila",
		"Review": "The resort was nice 12 years ago. The natural beauty of the place was destroyed. The kitchen is situated near the water. I‘m wondering where they throw the waste."
	},
	{
		"User": "Christopher",
		"Review": "Pros: the place is clean and the beach is lovely. Its good that they have their own ferry boats to take guests to the mainland. Food is ok. Cons: if you arrive in samal island past 5pm and you take the barge from the mainland, the roads from the port to the resort is very very bad. if I had known, I would not have booked the place since I had a child with me. Also, my experience in the hotel was that it felt like with every move we made we were reminded of the cost. They have leaflets where the prices of amenities and services can be seen and I think that should be enough for the guest. But in our experience, when we asked for pressing, we were reminded of the cost per garment. when we sat at an empty table by the beach one morning because my daughter wanted to swim, we were told that the tables were for rent. when we ordered room service, we were reminded of the percent service charge. Just to be clear, I have no issues with paying for these things. I just wasnt comfortable"
	},
	{
		"User": "Frank",
		"Review": "We have been going to Paradise for years and enjoy the simple rooms, the beautifully manicured gardens, the beach, the fresh food- just about everything about it. It is a great place to get away, spend time alone and or rest."
	},
	{
		"User": "Keith",
		"Review": "Everything was wonderful. Fantastic, friendly staff!! The property is extremely well maintained Good food and great drinks for reasonable prices. All areas are very clean. Great value. It is a perfect holiday get away for relaxing near the beach. Perfect for families, couples and relaxing. I will certainly be back and highly reccommend Paradise Island Resort."
	},
	{
		"User": "Pia",
		"Review": "Good beach -- has water even at lowtide. Cottages are excellent! You have your own gate, walkway, yard and porch! Cottage areas are quiet but access to the beach is not so good. They blocked of the direct access and you have to go around to the crowded restaurant area to get to the beach. Food tastes great and is reasomably oriced for the quantity. However, all food is for 2-3 persons. Apart from breakfast, there really is no option for solo travelers except to waste food. Staff are very helpful but bordering on rude when they keep asking if you are alone, traveling solo, reconfirming several times that you only need place setting for one... and yet again giving you two sets of plates, glasses and utensils every meal. The staff should be taught not to be so intrusive. Also had a hard time booking the massages. Too few staff for too big a resort?"
	},
	{
		"User": "Renato",
		"Review": "Waited 15mins for bell boy to assist us from parking area to the reception, waiting in the sun with an wheelchair family member(security helped us later). At the gate they stopped us trying to charge us 250PHS for taking it in or even storing and same for the Ukulele(all these information wasn’t on the Agoda website). They didn’t want to help or give us an option, but to pay for storage of wine. The welcome drink they gave me had an insect when I pointed that out they took the glass away and never even bothered to offer a different one.The next day when we were leaving for sight seeing the security stopped us saying that they want us to get a pass to be able to leave(Felt like prisoners).The WiFi which was complimentary never worked and the technician couldn’t solve the problem.Stop treating your guest like they are going to run away without paying while the room was paid in full in advance.With all the experience I had and pointing that out to the duty manager Carlos they did nothing"
	},
	{
		"User": "Warren",
		"Review": "This was our second visit and we look forward to our third visit! The staff work very hard, but the place was packed yesterday for Labor Day so some things slipped through the cracks. The view is nice of the water, but Davao is so close, it would just be nicer to have an expansive view of ocean as far as the eye can see, but these are minor points in the big picture. This is a great value, a very fun place with great live music and a very fun, clean atmosphere, and we love the rooms! The landscaping is gorgeous and I love their attention to detail. This is such a happy place for my family! When we left yesterday, I asked myself “how much would it cost me to just live here for a month!?”"
	},
	{
		"User": "Salina",
		"Review": "Would like to suggest to have Muslim food choices to attract more foreign visitors from other Islam countries. Aside from that all are OK."
	},
	{
		"User": "Jerikka",
		"Review": "All was accommodated with them, boat to their hotel, room, activities and attraction. A very family friendly hotel. Rooms was very spacious and facilities were very practical and convenient. We were not able to avail their water activities but land tours were smooth sailing. Food a bit pricey but delish! Entertainment was amazing! Will definitely go back here. :)"
	},
	{
		"User": "Craig",
		"Review": "The down side the food serving size is a problem. \" good for 2\" is good for 1...good for 10 is good for 5. I am australian my family filipino...the serving size was questioned by my father in law as we have stayed many times at this resort and serving were larger..... he was informed by staff the serving size is small as i am a foriegner...what i call \"skin tax\". The small serving forces us to order more and extra profit for the food suppliers. This will back fire on them, however, as i will be reluctant to stay again. Based on this The second issue is \"the rules\". Alcohol is not allowed at you room? This really does spoil the holiday as to relax with just family and enjoy time in private together, have a beer in family only environment is impossible. If you wish to enjoy a beer it MUST be in common spaces. This is ridiculous really. The above is enough to stop me returning to paradise island resort in the future and will most likely look for other options."
	},
	{
		"User": "Miguel",
		"Review": "I don’t understand the need to even forcibly search your personal belongings To check if you are bringing in food to the resort."
	},
	{
		"User": "Stephen",
		"Review": "We like Paradise as it is in a nice setting and scrupulously clean. I haven't back checked, but it seems to be a bit cheaper than last time, possibly because the number of new resorts on the island is picking up. The kids will play in the sea all day (it's not deep), and there are paddle boats and canoes that can be hired, along with a banana and also scuba diving. They also have day tours to places such as Hagimit Falls, the Bat Caves and a Citrus Farm (the latter being owned by Paradise). The chalets are nice and clean, pretty to look at and in a garden setting. Quiet, air conditioned, with seating at a table on the verandah. There is also an aviary with a selection of birds. You can barbecue your own food on the communal barbie. They have strict rules on taking your own food to the chalets; they won't give you the keys until you have either eaten it all or lodged it with them for retrieval the next day. This is probably a good idea to keep down the risk of cockroaches etc."
	},
	{
		"User": "Patcharee",
		"Review": "good place, many activities "
	},
	{
		"User": "Michael",
		"Review": "Modern clean tidy and spacious rooms so top notch there. Room could have had a kettle in it and basic tea and coffee. Maybe a few more western meals on the menu or even pitza. Thinking the only thing that this resort really needs is a pool it has a beach however for the overnight guests I do think a pool is required. This property is butflfuly looked after and is so clean . Also the entertainment when we stayed. band and fire dancers where seriously very good. Thanks so much guys. I wasn’t really 100% How paradise island resort would be however all six of use had a excellent stay. Just a mention again 100% to all the staff."
	},
	{
		"User": "Peter",
		"Review": "First thing I noticed about this place was how clean and well kept the resort was. This resort is ideal for family, groups, and people who just want to enjoy the white sand beach without going too far. It's easily accessible and has its own port. There are a lot of activities for kids including games, billiards, chess. At night there's a live band and fire dance which was very entertaining. The only negative part is the maximum people they will allow in 1 room is 3 so with a group of 4 they'll force you to get a second room."
	},
	{
		"User": "Katty",
		"Review": "very clean, there are staffs ready to clean the areas, very attentive life guards, accessible by barge or boats. food are not so expensive. boutique is open for basic beach needs."
	},
	{
		"User": "MELVIN",
		"Review": "No doubt of the great facilities/amenities for the kids to enjoy, foods for us Muslims (foreigner) is our concern as we are not allowed to bring our own foods. Suggest to consider halal foods to attract more foreign tourists in the region."
	},
	{
		"User": "Mae",
		"Review": "We had a great time. Nice place for couples and families"
	},
	{
		"User": "Josan",
		"Review": "Every bit of this Holiday is very good every money we spend was worth it . We enjoy the Clean Beach and Its Garden surrounding . I cant wait to go back to it . There is music, firedance . Amazing Time It so Clean everything is So clean "
	},
	{
		"User": "henry",
		"Review": "Great service from all the hotel staff. Big and clean rooms. Good food and great live band music and fire dance performance at the restaurant. "
	},
	{
		"User": "Karen",
		"Review": "I never thought that our stay would be this awesome. I wish I stayed longer. The resort was a few minutes away from the barge unlike other resorts which were quite far. We stayed in a deluxe room which exceeded my expectation. It was very clean and well mainntained and looked liked a bungalow. The cr was also clean and had all the basic toiletries needed for a short stay. By the way, the food tasted awesome also! We specially liked the mango shake. We'll definitely come back. "
	},
	{
		"User": "Noelle",
		"Review": "The photos on the site needs to be updated. i was quite hesitant at first to book here because the photos look like the room are old. But to my surprise the rooms look newly renovated and are like small villas which feels like you have your own little house. And they have their own pier to get to their resort which you only have to pay 20pesos per person and there was somebody waiting for us in the isalnd to help us carry or bags (which was a nice surprise as well) The staff are very helpful and accommodating."
	},
	{
		"User": "Lester",
		"Review": "Customer service is a bit awful. We reserved 1 room because we have two kids. We understand that the reservation we had was only for 2 adults and just so happen that we have other company. We follow rules and we know that other people cannot sleep in the room, just like what they were thinking. Because of that, they won’t allow our other company to stay overnight. They got their names and said that they will be block from the gate (othr frnds are still coMing over).The manager suggested that we can cancel our reservation on the spot because we are not satisfied with this rule(w/c we can’t do bcOz we hav kds).our frndz staying overnayt w/o room brought foods, but they deposited it. They also threaten our friends if her company won’t arrive, they will send her home. It was so unfair for those people who will follow a resort rule will be judge because of other’s doing. Our friends and family who have rights to stay overnight without a room is being bridge because of their judgement. "
	},
	{
		"User": "Chris",
		"Review": "I have literally no complaints about Paradise Island - it is literally a paradise. The staff were incredible and so friendly. You would be crazy to stay anywhere else "
	},
	{
		"User": "Jennete",
		"Review": "Location"
	},
	{
		"User": "dundee",
		"Review": "Relaxing Place good food, just the right prices"
	},
	{
		"User": "trexie",
		"Review": "I highly recommend this resort among the other nearby resorts in Samal especially if you are with a child or kids. The staff are well trained when it comes to customer service. The room is clean and cozy. The entire place is clean with a perfect ambiance that can be enjoyed by the entire family, couple or group of friends. Worth the price. Kudos! "
	},
	{
		"User": "Honey",
		"Review": "The place is nice and clean. Lots of things to do. Delescios food and nice people. "
	},
	{
		"User": "Abegail",
		"Review": "PROS: -nice beach -accessible -clean & spacious room (including bathroom) -well maintained surrounding CONS - food is so-so. Serving size is small (breakfast meals are good though) - the extra 350 fee for a child is unnecessary when our kid shared a bed with us. - their freebies are useless. - this place is nice but too commercialized. Rates are no longer family friendly as it used to."
	},
	{
		"User": "Barry",
		"Review": "Large Open verandah and great cabins with nice garden surrounds"
	},
	{
		"User": "Flora",
		"Review": "We generally enjoyed our 2-night stay here. We were entertained by the bands and firework shows. The staff assigned to our room was responsive and on-time. The ambience surrounding our room was aesthetic--well-trimmed garden and clean walkways. What we disliked was that some of the staff were not cordial. They were not consistent in their treatment to guests who were not adults.--they were indifferent at times. I think that's an area in need of improvement. "
	},
	{
		"User": "Christie",
		"Review": "Such an awesome place to stay. Good food, music, beach and breathtaking view. The staffs were very accommodating."
	},
	{
		"User": "Darwin",
		"Review": "Lady Staff ( Kissy) has no respect for elders. My group were not treated like customers. 👎🏻👎🏻👎🏻👎🏻👎🏻"
	},
	{
		"User": "Arlys",
		"Review": "I;ve been going to Paradise Island for over 30 years. It has changed, but the staff, freindliness and service orientation are very good. "
	},
	{
		"User": "David",
		"Review": "I really enjoyed my time there. The bedroom was very comfortable and I got the best sleep I have had in a long time. I like that they have private cottages and I didn't have any neighbors. The only thing that I do not like about this resort is that there is not swimming pool, but for the price I paid it was very nice. The beach was very clean and I enjoyed swimming in the ocean. There was also jet skis and banana boat rides that were excellent too. Next time I will go scuba diving here as well."
	},
	{
		"User": "nerissa",
		"Review": "the food is ok but the breakfast is too expensive. they told us the food is good for 2 to 3 but they served it good for 1 person only. I stay here every time I went to samal. but this time I don't like the water. its dirty. not so clear same before. maybe because its rainy season. but overall we love to stay here"
	},
	{
		"User": "felicia",
		"Review": "Pros 1. location 2. cleanwhite sand Cons: 1. management will not allow you to check-in if you have food. We booked 4 rooms and two in our party were not feeling well after the 5-hour drive. They were directed to the clinic which was more like a booth with no AC. They do not bend their strict policies for the welfare of their paying guests. It was 3pm and we were forced to discard all our food left over from lunch to allow the two to rest in the cottage. 2. Booking can't be mixed. If one person in a group books a cottage, the rest of the group have to do likewise. They are very strict with the number of guests that enter into the cottages. If one books for outside overnight (sleeping under the trees) then everyone else must follow. This was an inconvenience since we either had to pay so much to accomodate 20 people in cottages or sleep under the skies, which is not good for chikdren or the elderly. Management said that this strict policy of no mixing is posted on Agoda."
	},
	{
		"User": "Rodrigo",
		"Review": "Facilities are excellent. "
	},
	{
		"User": "Cesar",
		"Review": "Very friendly staff and very clean facility "
	},
	{
		"User": "Mary",
		"Review": "Friendly staff. Slow service in the restaurant."
	},
	{
		"User": "Candido",
		"Review": "Resort policy is not good and fair to guest especially for my first time overnight. As for my understanding bringing food is allowed but to certain designated tables only. Therefore i brought some foods. But in the entrance they all take out for deposit and they told me to claim when we checkout the following day. I explained that we will consumed that night all the foods we brought at the designated tables not on the living cottage. But they will insist that not allowed and they advised us to eat our food outside the perimeter fence which is very dark and not safe around 8.30pm and we are very hungry that time. No choice but to go out.. eat inside the car at very dark area outside their premises.."
	},
	{
		"User": "Patricia",
		"Review": "We had a great time staying here. Our room is spacious and clean. The food is great, its a bit pricy though. Overall I would recommend this to our friends who will visit Davao. :)"
	},
	{
		"User": "Angela",
		"Review": "Rooms are very clean and It is worth every money spent."
	},
	{
		"User": "Charles",
		"Review": "Everything was fantastic but the food was not as good as I expected. Some had very little flavor. Not what I expected being in the Philippines. "
	},
	{
		"User": "ANNALIZA",
		"Review": "good customer service thumbs up for the staff...good and cleaned environment...nice stay..."
	},
	{
		"User": "ANNALIZA",
		"Review": "we had a good stay and enjoyed much our stay...the staffs are so friendly....good and cleaned resort we will definireky come back again..."
	},
	{
		"User": "Marieden",
		"Review": "I love our chic cabana room. It has its own backyard and the room is huge and beautifully decorated. It will be better is there's refrigerator inside the room though. The aircon worked, the shower is good and even the complimentary kits are decent. The beach is awesome and very clean. It was properly maintained although the shoreline is very small. We enjoyed swimming and the sands are white. There's a lot of staff so you'll feel secured and pampered. The front desk is accommodating and she helped us book our Samal City tour. The food is expensive but given you're in a resort, you should expect it. The food tastes good but alcoholic drinks should only be consumed in the restaurant. We want to order beer in our room but they don't allow it. All in all, it was a highly recommended resort when you're in Samal Island."
	},
	{
		"User": "Bernard",
		"Review": "I continue to return to Paradise because of many things... good value for money; location is easy to get to with its fleet of ferry boats; the staff is very service oriented; rooms are clean and you feel like you are in your own house and lot; food is good and reasonably price... Most important is that it's quiet with a nice beachfront and water. "
	},
	{
		"User": "Angelica",
		"Review": "The inn is a good place to stay for budget travelers. And you cannot expect that there was really such a clean and decent place despite the low price. It was a place in downtown with the nearest tourist spots such as the Museo Dabawenyo, D'Bone, and people's Park. "
	},
	{
		"User": "Johans",
		"Review": "I love beach and the reason i went in samal island is to have the beach.. enjoy the beach but in this particular place it is only until 7 pm. not recommended for beach lover.. expensive area compared with others. "
	},
	{
		"User": "RICHIE",
		"Review": "Facilities are excellent. Desk staffs/ customer service need more training/enhancement. No one attends to call during night hours, hence no one can assist you if you require anything. No visible security roaming the area during wee hours in the night. Kitchen/Restaurant staff are not so keen on delivering the food fast."
	},
	{
		"User": "Jose",
		"Review": "Awesome location great view of sunset and great food! Staff pleasant and attentive!"
	},
	{
		"User": "David",
		"Review": "Almost all comments from me are greatly positive. Some very small ant-like insects would form on the floor or desk area looking for food - especially at night, but that may be a necessary trade off for the tropical hut we stayed in with woven walls. Air conditioning and mini refrigerator were much appreciated. Along with excellent service from very caring staff members. Convenient table and benches on front porch. Instant coffee and water pitcher delivered every morning to the front porch for the kettle. 9.5 out of 10!!!"
	},
	{
		"User": "Princess",
		"Review": "The place was good. Everything was clean and the staff were very nice and hospitable. The food was delicious with a reasonable price. We'll definitely come back again. "
	},
	{
		"User": "Vanessa",
		"Review": "It was a very pleasant overnight stay. The rooms were clean and you get to have free sleepers which you can bring home with you. Free pomelo also. The beach is clean and the food is good. "
	},
	{
		"User": "Juanito",
		"Review": "Great Price for location.Good Food "
	},
	{
		"User": "John",
		"Review": "Its nice and the rooms are nice. But compared to the other resorts along the same beach with the same view this one is 3-4x more costly and they still charge a entrance fee and corkage. So much staff running around it can seem so busy"
	},
	{
		"User": "Olaf",
		"Review": "A well oiled machine on the back of an immaculate setting and buildings."
	},
	{
		"User": "nerissa",
		"Review": "nice place nice room nice beach but expensive food"
	},
	{
		"User": "Arlina",
		"Review": "Would have preferred if we could also stroll in other beaches whilst staying at Paradise Resort, just like in other superb beaches like Boracay, and Bali. But other than that, I really like Paradise. Nice food as well, and people from different classes can equally enjoy the facilities. Equal treatment is accorded to everyone, rich and poor. Would love to come back."
	},
	{
		"User": "naniebeth",
		"Review": "we had a nice time in paradise with my family. we will come back,for sure!"
	},
	{
		"User": "Joy",
		"Review": "Whether you are taking a day trip or an overnight stay, Paradise offers easy access, good food, a lovely beach, and staff who are friendly and helpful. High tide is awesome and low tide ~ well, it doesn't last long. :)"
	},
	{
		"User": "Anthony",
		"Review": "We visit here every time we come home to Philippines, and they always make you feel welcome very friendly staff and good variety of food on menu not overpriced like some hotels in Davao /.samal area thank you to all the staff for making it another great holiday "
	},
	{
		"User": "Sheila",
		"Review": "There are more reasons why we definitely recommend this place to other travelers who wanted to enjoy Samal Island. 1. Prior to booking, their staff from Davao courteously attended to our queries. 2. The cottage that they gave us is so spacious, where the bathroom has separate bath, toilet and dressing area. It has its own yard where we could hang our wet clothing, a lanai where we could have our breakfast or dinner al fresco, and its own gate. 3. The staff are very accommodating and polite that you could feel their sincerity in giving delightful service to their guests. 4. They have good amenities such as playground for the kids, an aviary, dining area on the shore, indoor sports (giant chess, table tennis, darts, billiards) as well as water sports (kayaking, aquabike, etc) which you can enjoy. Although, it would also be great if they have a wading pool. 5. Entertainment during weekends while having dinner is also spectacular. They have an acoustic singer, fire dancers & fireworks display. 6. The have dedicated staff who ensures that there are no floating garbage, not even dry leaves in the ocean. They even rake the sand evenly regularly. We enjoy our stay and will go back here again! "
	},
	{
		"User": "Tollis",
		"Review": "My family has been going there for years and love the place. This trip was a poor trip do to fact that there was no hot water to shower with and no cable Tv, they checked out early no refund for day early checkout. My family still had a good time but we might start looking at other resorts."
	},
	{
		"User": "Jackylyn",
		"Review": "Not our first time here but still everything here is just great Service Beach Accommodation Cleanliness Location Food Value for money Entertainment Relaxation"
	},
	{
		"User": "Philip",
		"Review": "Never go again "
	},
	{
		"User": "Genevieve",
		"Review": "a quick weekday getaway from the city. less crowded than on weekends. good food. better than average facilities and water right at your feet during high tide."
	},
	{
		"User": "Annaliza",
		"Review": "We really love the beach and how their facilities are managed. We literally have everything we need and the food in the resto is just good for its price. You don't need to bring money as you can charge everything in your room! The massage is very good as well!"
	},
	{
		"User": "Aimee",
		"Review": "This hotel resort was great. I'd definitely stay here again. The rooms were great with their little patio/balcony. Great gardens, landscaping and curb appeal. They have a lot of activities and the beach is nice. The restaurant dining was good. We took a trip to the bat caves and the falls using their service and our guide was great. Highly recommend this place when in Samal."
	},
	{
		"User": "Sweethelda",
		"Review": "This place was very clean, facilities are very nice, staff are very helpful, accommodating, and welcoming. I was with two small boys and the only thing they were able to do for free was to play in the playground and swim on the beach. Only a small area towards the shallow part was swimmable for the boys otherwise if you go a little farther out, there are too many rocks shells and hurts their feet to walk on. All the rest of the other activities cost money. I stayed in Samal island for two weeks & only three of those days at Paradise Island and the rest of the days were in another resort. The amenities as well as food are expensive compared to the other resort I stayed, which is equally as nice and the boys actually enjoyed it much better and cost a fraction of the price I paid at Paradise. Family living locally came to visit and had to pay to come by to see me. Any food is not allowed either. "
	},
	{
		"User": "Andrew",
		"Review": "This place was fantastic, the rooms appear really old in the photo's but they are actually really nice in real life. We stayed in the better room and its your own separate bungalow. Food and drinks were cheap, staff were very accommodating and the beach was lovely to swim in. great time"
	},
	{
		"User": "Marlyn",
		"Review": "Stood out for us : the cleanliness the beauty of the sorroundings. We loved the serenading while having breakfast. Tha band, the carnival shows funny! In the night they have some kind of show while having dinner. The food really excellent! See for yourself. "
	},
	{
		"User": "richard",
		"Review": "Very nice and caring staff"
	},
	{
		"User": "Vicki",
		"Review": "Treat westerners like second class citizens "
	},
	{
		"User": "Leo",
		"Review": "Pros: Accommodation: The Deluxe room we booked was in a fairly new building. Spacious, clean with new linens. Beautiful well maintained garden. Beach restaurant: good menu of Filipino food reasonably priced for a resort. There were day&night live sound entertainment. Cons: The room has a noisy window type aircon. Not appropriate for the price of the room. No basic coffee/tea facility. Everything you have to order from the restaurant making the cost of your stay to almost double. Beach resort- maybe too crowded during weekends. The over-extended canopy and tables destroyed the natural beauty of the beach. "
	},
	{
		"User": "Brian",
		"Review": "You must not bring in outside food and I did not like their food. The tent over the beach overwhelmed the otherwise good view and feel of the beach and ocean. The rooms were clean and had a large patio area with a highly maintained garden around it. This premium room was a separate structure with a fence and some privacy."
	},
	{
		"User": "Jonathan",
		"Review": "Perfect restful get-a-way for a couple to enjoy at the ocean with a beautiful beach, tasty food, interesting zoo, and plenty of activities"
	},
	{
		"User": "Chathelaine",
		"Review": "Value for money👍🏻"
	},
	{
		"User": "John",
		"Review": "Very very busy place! Entrance fee is quite a lot and not aloud to bring own food. Rooms are very large and comfortable."
	},
	{
		"User": "Luisa",
		"Review": "Pros: Clean Value for money Cheap hotel Spacious rooms / villa type Friendly staff Cons: Expensive food Lack and limited activities to do here Location is remote Beach is Not for swimming"
	},
	{
		"User": "Coleen",
		"Review": "Food was great ! Live band was amazing ! The staff are very accomodating ."
	},
	{
		"User": "Eline",
		"Review": "Friendly staff, white sand beach, Mother Nature "
	},
	{
		"User": "Marwa",
		"Review": "this place have pros and cons pros: very very clean. from the parking, to the reception, to the room, even the sand on the beach and pathways. very entertaining program at noon and night. the kids loved it. mini bird zoo that add up to the natural ambiance of the surrounding, and makes the kids excited, the rooms are spacious and well designed for sandy set up. faucets are placed everywhere to wash up sands. very hospitable staff and receptionist. you will receive welcome drink, necklace, and cold face towel. the linens and towels are white and fresh. cons: no pool. the prices are high and you will add up for extra persons in the room even if using existing beddings. they strictly don't allow food and all your baggage will be inspected. again you will add up for meals. the food is ok and the prices are above average. the security staff are a little rough and less welcoming compared to the receptionists. you will be asked hundred times about your head count. overall expensive but good."
	},
	{
		"User": "Ian",
		"Review": "Been to the resort many times in the past but this had to our worst experience. We experienced problems right from the get go. From the resort being unable to find our reservation to the waiters who told us they couldn't make us what we had ordered off of their menu as they were, \"to busy to make it.\" As bad was going for breakfast at 8 am only to be told all of the tables had been reserved for outside guests so we were unable to sit there. Most of the tables remained vacant well into the early afternoon. Ridiculous!"
	},
	{
		"User": "Joni",
		"Review": "Give up the service fee, 7%. Just hit it to prizes and be open. Anyways, food was too expensive vs. The quality. Room was ok, even thou it was my first time to see cockroach, live, death luckily. Service personnel were super nice and helpful. It's a doable place for wheelchair if you can just get into boat ;) "
	},
	{
		"User": "arnel",
		"Review": "I was really disappointed after we checked-out to find out that i was bitten by bed bugs "
	},
	{
		"User": "silvio",
		"Review": "You don t feel safe there the army is there to protect people but only a day time"
	},
	{
		"User": "Arthur",
		"Review": "The place is a ghost town after 10pm. Everything is closed except a snack shop that doesn't even sell cup noodles; only biscuits and simple hot beverage. No room service after 10pm. I didn't know all the above and when I arrived late and was tired, I took a nap till 10ish and woke up to a quiet place. What's good is the fire dance that run 3 sessions from 7pm, clean isolated resort houses (privacy), courteous staff, good security, an access to their ferry service which I found out only on the way back. "
	},
	{
		"User": "Venus",
		"Review": "See you again beautiful island of samal"
	},
	{
		"User": "Bjørn",
		"Review": "Arrived at Paradise Beach at noon. Welcome was nice, as well as security and staff helping us in. We were assigned a \"premier\" room, which we chose because of the in-room WiFi, bathtub and frigde these rooms should have. All of these makes having a 2-yearold with jetlag a bit easier to handle as you can get her a cold drink, cool her off in the bathtub and let her enjoy Youtube cartoons until she can sleep. Well, our room had none of these. Worse still was that after a thunderstorm 5 days previous, the whole site had NO mobile or landline phone connection. After raising complaints of the lacking amenities we paid for, all we got was a mobile prepaid WiFi modem. Which turned out to have an expired simcard. Then we thought \"what if the kid gets sick/hurt so we need medical attention?\"..with no phones to reach mainland, that would be impossible. Too much of a risk for us, so we left the island after 6 hours. We feel a resort of this size should be serious enough to always have a backup satellite modem, as probably a full week without phone connectivity and the possibility of reaching medical support being zero, should be on their absolute \"fix-instantly\"-list. And to give their customers what they actually pay extra for. That being said, the live band was nice, the food was good, the beach flawless and everything was clean and atleast looked like it was well organised. If it had been a bit better organised than it was, most of our complaints would never happen. I guess this is partly because the concept of planning ahead of the day you are in hardly exist in the Philippines.."
	},
	{
		"User": "hiroshi",
		"Review": "Everythig was perfect, but \"bring drink and food noprohibited\" rule was too strict,not good. No hot water in my shower room..."
	},
	{
		"User": "Walfredo",
		"Review": "Nice Food, Good Service, Music while Dining, Guests doesn't mind how stubborn my 2 year old son, as everyone are in the good mood. It is the atmosphere of smiles. However, No Cable TV. Needs bidet in the Toilet. And extra Security to verify if those roaming around the occupants area are really guests. Yet lastly, we should been prepared to stay longer. Am going back and bring the rest of my kids, surely they will enjoy here."
	},
	{
		"User": "Venus",
		"Review": "Definitely we will go back here! Highly recommended. "
	},
	{
		"User": "Maria",
		"Review": "..."
	},
	{
		"User": "zachary",
		"Review": "Plant trees @ beach! Why cant i have a beer/drink at my room? I like to relax! Gardens and rooms are nice! Water/swimming good!"
	},
	{
		"User": "Carlos",
		"Review": "thanks to our friend who referred this place to us. Thumbs up to the staff. Napaka-attentive sa needs ng clients."
	},
	{
		"User": "Mary",
		"Review": "Friendly staff, clean facility, beautifully kept grounds..."
	},
	{
		"User": "christopher",
		"Review": "It was a great place to stay but comes with a Price. Felt safe knowing there's security 24/7. We arrived a bit early and expecting to check in 2pm but room wasn't ready. Asked for kettle first day for my 21 months old baby's formula but got it 2nd day. Water's really good for the kids. "
	},
	{
		"User": "Edgardo",
		"Review": "Going to the resort is convenient if you're coming from Davao city, just a few minutes of bangka ride and you'll be there. The place look secure and the check-in cottages area is just near the beach and has an atmosphere of serenity where one can truly rest and unwind. well-maintained cottages, well-manicured lawns and pleasant looking garden around the cottages. very-nice place. Food at the restaurant is good and okay. Service provided by its staff is just fine. The over-all stay is convenient except that we have to bring along extra drinking water for our room since they are serving only 350 ml bottled water. It would be more customer-friendly if they can accommodate their guests requests to order drinking water in large volume containers in their room, of course they can charge it to the guest's account. providing 350 ml bottled water to guests that consumes a lot of water is impractical, inconvenient and not helpful especially for senior citizen guests who will bring along their ex"
	},
	{
		"User": "Edward",
		"Review": "Overall a good place with lots of beach space. Weekends can get very busy with lots of locals spending the day there. Lots of good love entertainment. Clean and well kept. Lots of helpful staff. But they desperately need a pool and fridge and kettle in the rooms. Food is a bit too expensive. Security is great. Alcohol is not to be brought back to rooms. Too many rules. "
	},
	{
		"User": "Edward",
		"Review": "No pool. But great beach front. No fridge or tea/coffee making facilities in the room. High prices for food. Alcohol stops being served at 9. Bags will be searched for food. Alcohol will not be delivered to room. But good entertainment. And live music and fire shows. Lots of security with some military presence. Lots of good helpful staff. "
	},
	{
		"User": "Carl",
		"Review": "I had a great time though not so many activities"
	},
	{
		"User": "Vilton",
		"Review": "Great staff, clean rooms and a non stop Fiesta!!"
	},
	{
		"User": "Frank",
		"Review": "Beautiful beach resort! Quiet, clean, & enjoyable!"
	},
	{
		"User": "emie",
		"Review": "Food.staff.location.accomodation. all.deserves a 5 star rating. You can do bettr with a little reduction on food and drink prices and a bidet at the toilet please. Nevertheless..it has been a paradise during our stay. Thank you. We will definitely go back!!!"
	},
	{
		"User": "SHIRLEY",
		"Review": "A great place to relax with family"
	},
	{
		"User": "Zeus",
		"Review": "as always the staff and the service is great!"
	},
	{
		"User": "Rosario",
		"Review": "I have stayed overnight several times in this beach resort, in both deluxe and premier rooms,and thus I'm familiar with the size, amenities and overall ambiance of both room types, the difference of which is quite evident. For our stay the other day (20 August 2016) I booked for a premier room but to my surprise when I and my husband were shown our room, it looked exactly the same as the deluxe room, smaller in size, basic bathroom etc. When I called the attention of the receptionist about this, I was informed that they have given us a premier room (24D), that all rooms in that section are all premier! If that were true then they don't have the same standard! ...For those who will book for a premier room, be sure you will be given a room in the #27 row, if not just book deluxe."
	},
	{
		"User": "Kristine",
		"Review": "Needs an indoor pool and a fridge in the room. Food was good but a bit pricey. Everything else was great."
	},
	{
		"User": "Rolando",
		"Review": "It would be good if they have an inland pool"
	},
	{
		"User": "Edwin",
		"Review": "The food can be better. Although the pinaputok na bangus belly was excellent, the spaghetti with creamy tomato sauce was very sweet."
	},
	{
		"User": "Chad",
		"Review": "Everything perfect, except too many rules at the beach No swimming past 7pm, ridiculous. Too many rules in the day also. If they want to warn people , that's fine. preventing people from enjoying the water was very irritating. It's enough for me to want to go elsewhere. "
	},
	{
		"User": "Mary",
		"Review": "Need more electric outlet and fridge "
	},
	{
		"User": "Edward",
		"Review": "This a top resort. Great facilities, but lacking a pool, but lots and lots of beach front. Very secure with lots of staff, security, and military presence. Lots and lots of friendly helpful staff. Great rooms, great food, but they can be a bit tight with having to pay for every facility. Sunday's can be a bit busy with many Filipinos just coming for the day. But heaps of staff to accomodate for everyone. They have a bird zoo which is small but still ok. Definately will stay again. "
	},
	{
		"User": "Amador",
		"Review": "The staff was very hospitable! We were welcomed with the warmest of smiles, cold juices, paradise island necklaces and cold towels. More than anything, they put their customers first - doing anything to satisfy your needs. Service and facilities were incredible. The food, though, was ok. Nonetheless, we will definitely come back to paradise island. One more thing (if you're coming from the airport): do tell the taxi driver to drop you off at the paradise island dock. We made a mistake of going to the barge, which made our trip more expensive and tedious."
	},
	{
		"User": "Jojie",
		"Review": "clean, courteous staff, good food"
	},
	{
		"User": "Andrew",
		"Review": "Paradise is clean and well-run with some fun, small-scale entertainment and lovely grounds. The staff is helpful and kind and the food isn't bad. It's a bit expensive for the quality level and the view off the beach is a bit industrial, but a nice place to spend a day or two. "
	},
	{
		"User": "Alan",
		"Review": "The facilities were new and functional. The staff and crew did their job as such. Food was great. Beach front clean with white and powdery sand. But that day we came by was busy day and crowded. Restaurant area was clean but the covering roof woudl have been tropical-inspired structure like nipa or cogon. "
	},
	{
		"User": "Jill",
		"Review": "They offer good service as their staff are very accommodating. They also serve good food in the resort though some may think that it's too pricey. The only thing we are disappointed with us their beach/swimming area which seems dirty unlike what you're seeing in their website. Maybe its due to crowd of people but I think they need to do something to maintain cleanliness in the beach water. Satisfied with the service and room but really disappointed with the beach."
	},
	{
		"User": "Maria",
		"Review": "Please promote activities and advertise the schedule of trips and rates"
	},
	{
		"User": "stefano",
		"Review": "We really enjoyed our stay in this beautiful place "
	},
	{
		"User": "Dohyun",
		"Review": "This resort needs to consider a indoor swiming pool. The sun is too strong so that it can cause damage to skin. Some people like me to look for a swiming pool. "
	},
	{
		"User": "SHIRLEY",
		"Review": "We had so much fun."
	},
	{
		"User": "SHIRLEY",
		"Review": "Nice resort. Very clean beach...you can swim in the shaded beach..kids enjoy sand playing"
	},
	{
		"User": "Jose",
		"Review": "Enjoyed the food serve in the restaurant. Love different choices with Durian! "
	},
	{
		"User": "Nyra",
		"Review": "Staff are very courteous and accomodating. "
	},
	{
		"User": "Maria",
		"Review": "Most of the employees especially the young ones are not couteous. These employees are expected to greet visitors once they meet somewherelse. As if they dont see somebody. They should be taught of this kind of costumer service( i know this because i am also an employer and i demand my employees to be couteous to anybody regardless of the status of the costumer). An eye opener for your HR."
	},
	{
		"User": "Armando",
		"Review": "Very clean and hospitable employee, so nice.. "
	},
	{
		"User": "Rodney",
		"Review": "good"
	},
	{
		"User": "Cristine",
		"Review": "Everything was great except the Internet.kindly work on your terrible WiFi. "
	},
	{
		"User": "michelle",
		"Review": "friendly staff,comfy and clean rooms."
	},
	{
		"User": "ruel",
		"Review": "Friendly Staff, cleanliness of everything "
	},
	{
		"User": "les",
		"Review": "awesome for young families clean single huts great staff "
	},
	{
		"User": "jennifer",
		"Review": "The place and rooms are clean...food are delicious although the beverages are too pricey...the beach is great my kids enjoyed it very much. Cons are you can't bring any drinks like water, softdrinks or juices and the extra payment for every kid are 350php it would have been better if it was said before at their booking policy in agoda."
	},
	{
		"User": "Adela",
		"Review": "We allways enjoy our stay at the Paradise Beach resort. It's close to Davao City. The rooms are nice and clean. Meals are good and reasonable priced. Every day and night there is live music and a during diner a fire dance. A bit crowded during the weekend because it is cheap for a day trip. "
	},
	{
		"User": "adrian",
		"Review": "One of the best experience"
	},
	{
		"User": "Zachary",
		"Review": "We have vacationed here at least a week a year for the past several years. A great spot for couples or families alike. Lots to do and an easy commute to the city for business or entertainment. I'm sure we will be back again on our next visit to the PH. "
	},
	{
		"User": "Mary",
		"Review": "\r Friendly Staff, cleanliness of everything and the rooms"
	},
	{
		"User": "Jacinth",
		"Review": "Room 21 was spacious, comfortable and the bathroom smells great! All staff were courteous. The water at the beach felt cool and it doesn't smell. It even looked pristine in the photos. Mom and I truly enjoyed our overnight stay. Special mention to the best mixed vegetable dish. We had it every meal."
	},
	{
		"User": "Heidelynn",
		"Review": "\r Cleanliness, Great Staff performance and Good Value for money"
	},
	{
		"User": "Maria",
		"Review": "\r clean rooms, common toilets and approachable staff"
	},
	{
		"User": "Edilbert",
		"Review": "\r Courteous staff, cleanliness and it's peaceful"
	},
	{
		"User": "Julie",
		"Review": "The resort is hands down beautiful. Huge open spaces and spacious rooms. Very good beach frontage and top notch in cleanliness. Staff are ok. My only discomfort is the skyrocket prices of food. The resort does not allow bringing of food, not even junk food. Everything is served ala carte so you order everything individually. The menu says good for two, but the servings its actually just for one adult or perhaps two kids. I was hopeful that the restaurant will make up for the expensiveness with taste but the taste is very ordinary. It was very contradicting to earlier reviews that the food in the restaurant is very good. Im no chef but, i disagree. The taste is nothing but ordinary. The tinolang manok we ordered during our first day was even bloody and malansa. No complimentary coffee or tea in the room (again, bringing of food is not allowed). Bottled water is at P25 on a one-gulp sized bottle. Pandesal at P90. A small plate of spaghetti is at P240. I would love to return to the resort but because of the food prices, maybe not for a very long time. "
	},
	{
		"User": "Rachel",
		"Review": "\r Food, beach and staff "
	},
	{
		"User": "Rosario",
		"Review": "\r Proximity to Davao City, clean, good amenities"
	},
	{
		"User": "Chris",
		"Review": "\r Staff incredibly friendly, rooms very clean and comfortable, food great"
	},
	{
		"User": "Fadhel",
		"Review": "\r Clean beach , great food , friendly staff"
	},
	{
		"User": "Filip",
		"Review": "Nice place, but service was so poor, especially room and beach service was unacceptable. Lazy and reluctant!!!! I was so surprised from their attitude! No smile, no thank you. So Disappointing! I'm not coming back to this resort anymore!"
	},
	{
		"User": "CHI",
		"Review": "\r Clean, staff was nice and food was good!"
	},
	{
		"User": "Jamie",
		"Review": "\r Excellent Location, Well Maintained Resort, Good Food "
	},
	{
		"User": "Sheila",
		"Review": "\r Staff are super warm & friendly, Food is good, Nice ambiance too. "
	},
	{
		"User": "Kristina",
		"Review": "\r The rooms are amazing; very clean (even the bathroom), spacious, and homey. The resort is conducive for all types of travelers. The staff are wonderful."
	},
	{
		"User": "Caricel",
		"Review": "\r V. Clean"
	},
	{
		"User": "nurbilal",
		"Review": "\r Location,Cleanlines,Child-Friendly"
	},
	{
		"User": "Marianne",
		"Review": "\r Staff was very accommodating. Value for money. Good service."
	},
	{
		"User": "Kai",
		"Review": "\r The frendliness of the staff, the perfectly arranged garden, overall cleanliness of the entire resort including the beach"
	},
	{
		"User": "David",
		"Review": "\r room , service, grounds"
	},
	{
		"User": "Elise",
		"Review": "\r They stayed on top of things. Always friendly. Always willing to help."
	},
	{
		"User": "Judy",
		"Review": "\r Very good customer service ,safe, clean"
	},
	{
		"User": "Tracy",
		"Review": "\r Affordable, clean, & relaxing"
	},
	{
		"User": "Judy",
		"Review": "\r All of the staffs were genuinely friendly , helpful and pleasant"
	},
	{
		"User": "JOEL",
		"Review": "\r Staff were very nice "
	},
	{
		"User": "william",
		"Review": "\r Garden, good beach, lagoon"
	},
	{
		"User": "Annabelle",
		"Review": "\r Cleanliness and ambiance, spacious rooms, good food, live performers"
	},
	{
		"User": "Bryce",
		"Review": "\r Resort was just okay. Clean and okay, nothing I would call spectacular or memorable."
	},
	{
		"User": "Melita",
		"Review": "\r Location. Hospitality of staff room perfect location"
	},
	{
		"User": "Margarita",
		"Review": "\r 1. The staff are very accommodating. They seem to live what they are doing. 2. Food is great! 3. Place is comfotable."
	},
	{
		"User": "Ronan",
		"Review": "\r staff are good"
	},
	{
		"User": "Rogelio",
		"Review": "\r Accessibility, excellent staff and general ambiance"
	},
	{
		"User": "analyn",
		"Review": "\r Staff, food and room"
	},
	{
		"User": "Hansjoerg",
		"Review": "\r close to city, easy access, informal atmosphere"
	},
	{
		"User": "obaid",
		"Review": "\r Staff,rooms,surroundings"
	},
	{
		"User": "Anwar",
		"Review": "\r Location, cleaning and night activities "
	},
	{
		"User": "Harrison",
		"Review": "\r The staff was very friendly and helpful. The kids loved the activities. The live music at lunch and dinner made for a great atmosphere."
	},
	{
		"User": "Gina",
		"Review": "\r Service, the place itself, staff"
	},
	{
		"User": "Francie",
		"Review": "\r Location, food and wonderful staff."
	},
	{
		"User": "HIDEO",
		"Review": "\r beach, food, nature"
	},
	{
		"User": "Maria",
		"Review": "\r Their superior cottages are best! Very good food and staffs are nice "
	},
	{
		"User": "John",
		"Review": "\r Food, staff and neatness of the grounds"
	},
	{
		"User": "Darryl",
		"Review": "\r Location, beachside, gardens"
	},
	{
		"User": "Cherry",
		"Review": "\r Good food, good facilities but service sucks. Their massage will have to be booked at the reception. The spa did not entertain us even when we went there already for massage."
	},
	{
		"User": "Theresa",
		"Review": "\r The whole place is just so clean. The staff treat guests really well. And the bird park is really nice!"
	},
	{
		"User": "Mohammad",
		"Review": "\r View, cleanness, location "
	},
	{
		"User": "James",
		"Review": "\r Food, Staff, Transport"
	},
	{
		"User": "Christopher",
		"Review": "\r Location, water, accommodation"
	},
	{
		"User": "Carel",
		"Review": "\r beach, food, cottage"
	},
	{
		"User": "Jacques",
		"Review": "\r LOCATION, ROOMS, STAFF"
	},
	{
		"User": "Mario",
		"Review": "\r clean nice and kids enjoyed"
	},
	{
		"User": "Roland",
		"Review": "\r the room is nice, the staff fantastic"
	},
	{
		"User": "REYNALDO",
		"Review": "\r Customer service and room ambiance and great transportation service"
	},
	{
		"User": "douglas",
		"Review": "\r clean safe environment"
	},
	{
		"User": "Jonathan",
		"Review": "\r so so so accomodation expensive thant marco polo"
	},
	{
		"User": "joan",
		"Review": "\r Resort alone is a great experience, i love the place our room is like we r stying in our house it is comfortable. We can really relax; relaxing place indeed"
	},
	{
		"User": "hefin",
		"Review": "\r Location, location, location"
	},
	{
		"User": "hefin",
		"Review": "\r Excellent location."
	},
	{
		"User": "Maria",
		"Review": "\r Location, amenities, staff"
	},
	{
		"User": "Marian",
		"Review": "\r Cleanliness"
	},
	{
		"User": "allan",
		"Review": "\r cleanliness, "
	},
	{
		"User": "Dennis",
		"Review": "\r Everything was excellent"
	},
	{
		"User": "Eberhard",
		"Review": "\r Room were nice grounds were immaculate .beach was decent"
	},
	{
		"User": "Ian",
		"Review": "\r good people, good food, very clean"
	},
	{
		"User": "JOHN",
		"Review": "\r The staff were excellent, food was very good, accommodations were fine"
	},
	{
		"User": "Cecilia",
		"Review": "\r Nice"
	},
	{
		"User": "Ma",
		"Review": "\r Clean beach; friendly staff; comfortable room"
	},
	{
		"User": "ERLINDA",
		"Review": "\r Privacy is respected and security"
	},
	{
		"User": "Vina",
		"Review": "\r Massage, Location, Food"
	},
	{
		"User": "laurie",
		"Review": "\r food, room, staff"
	},
	{
		"User": "Gerardo",
		"Review": "\r Room, location to mainland, shows"
	},
	{
		"User": "Corne",
		"Review": "\r Clean, nice surroundings, good service"
	},
	{
		"User": "khristine",
		"Review": "\r nice staff, cleanliness and food"
	},
	{
		"User": "Muriel",
		"Review": "\r best service, food is great, and very affordable"
	},
	{
		"User": "John",
		"Review": "\r Food, Nice room and Ambiance"
	},
	{
		"User": "Michael",
		"Review": "\r Room was clean, gardens were nice, some staff good"
	},
	{
		"User": "LEIDEN",
		"Review": "\r Location, place, staff are awesome :)"
	},
	{
		"User": "Christine",
		"Review": "\r Clean, close to nature, and peaceful"
	},
	{
		"User": "shirley",
		"Review": "\r room, service and the place its very relaxing "
	},
	{
		"User": "Lee",
		"Review": "\r The white sand beach, Wide range of food and very good & clean rooms. My family and I thoroughly enjoy our stay there even though the food and way pricier than other parts of Samal island. Overall gd."
	},
	{
		"User": "robert",
		"Review": "\r Location was great, food was good, entertainment and activities were good."
	},
	{
		"User": "love",
		"Review": "\r Clean, nice and relaxing"
	},
	{
		"User": "Cherryl",
		"Review": "\r Pure bliss, clean, nice getaway from the city"
	},
	{
		"User": "Virginia",
		"Review": "\r Close to the airport and nice garden"
	},
	{
		"User": "Rachelle",
		"Review": "\r Service, Excellent Food, Comfortable"
	},
	{
		"User": "Geoff",
		"Review": "\r None, none and none"
	},
	{
		"User": "MaryAnn",
		"Review": "\r Friendliness of staff, beauty of the area, cost"
	},
	{
		"User": "Christine",
		"Review": "\r clean beach, good food, quick boat ride from the city"
	},
	{
		"User": "michael",
		"Review": "\r food; location; beach"
	},
	{
		"User": "Glende",
		"Review": "\r Very good seevice, food are brilliant and very clean hotel "
	},
	{
		"User": "SHIRLEY",
		"Review": "\r Clean room.yummy food. Nice beach"
	},
	{
		"User": "guevara",
		"Review": "\r attentive staff, accessible from the city, garden"
	},
	{
		"User": "Kenneth",
		"Review": "\r Food, location, cleanlines"
	},
	{
		"User": "Annie",
		"Review": "\r The boat ride"
	},
	{
		"User": "Andrew",
		"Review": "\r Security, Staff, Room"
	},
	{
		"User": "Willie",
		"Review": "\r The Beach, The Staff and the Whole Package"
	},
	{
		"User": "Anthony",
		"Review": "\r good quality cheap food; attentive staff"
	},
	{
		"User": "Ruchelly",
		"Review": "\r Friendly staff"
	},
	{
		"User": "Rene",
		"Review": "\r white sand, fish feeding and snorkeling/diving, all within 10 minutes of the city"
	},
	{
		"User": "lolita",
		"Review": "\r food, nature and staff"
	},
	{
		"User": "Bernardine",
		"Review": "\r Garden Comfort "
	},
	{
		"User": "Sheryl",
		"Review": "\r Friendly staff, nice huts, very clean"
	},
	{
		"User": "shiela",
		"Review": "\r Quiet, economicsl, stress,free envieonment"
	},
	{
		"User": "arian",
		"Review": "\r Easy access, very clean, delicious food"
	},
	{
		"User": "Anthony",
		"Review": "\r Service , cleanliness , area, beach activities , "
	},
	{
		"User": "Romeo",
		"Review": "\r beach, senery, ambience"
	},
	{
		"User": "MA",
		"Review": "\r Just by the beach, decent cottage with huge T&B, menu variety"
	},
	{
		"User": "Jocelyn",
		"Review": "\r Super friendly staff, live band and entertainment, clean rooms surroundings"
	},
	{
		"User": "Cynthia",
		"Review": "\r big space, cleanliness, beach is.near"
	},
	{
		"User": "Francis",
		"Review": "\r location,security and nature."
	},
	{
		"User": "Everita",
		"Review": "\r clean"
	},
	{
		"User": "rohann",
		"Review": "\r nice beach and rooms"
	},
	{
		"User": "JOHN",
		"Review": "\r Close to the beach; with basic amenities, attentive staff"
	},
	{
		"User": "Meynard",
		"Review": "\r Garden and beach"
	},
	{
		"User": "Aileen",
		"Review": "\r near the beach, great service, huge area"
	},
	{
		"User": "LEIDEN",
		"Review": "\r relaxing place, great food, friendly staff"
	},
	{
		"User": "Darren",
		"Review": "\r FOOD, LOCATION, CATERING / WAITING STAFF"
	},
	{
		"User": "prinya",
		"Review": "\r location, food, amenities"
	},
	{
		"User": "Abraham",
		"Review": "\r Location, beach, staff"
	},
	{
		"User": "Arlene",
		"Review": "\r delicious food, friendly and efficient staff, relaxing atmosphere"
	},
	{
		"User": "Jagger",
		"Review": "\r Huge, Beach resort, Friendly Staff"
	},
	{
		"User": "ANDREW",
		"Review": "\r The layout is superb,both for guests and daytrippers. Fresh food,clean,lovely water etc"
	},
	{
		"User": "Peter",
		"Review": "\r Location, attentive staff, good quality side entertainment"
	},
	{
		"User": "florence",
		"Review": "\r Beach, paella, beach activities"
	},
	{
		"User": "ALLAN",
		"Review": "\r Great Service, Friendly/Helpful Staffs And Nice Beach!"
	},
	{
		"User": "kevin",
		"Review": "\r nice rooms, spacious and clean"
	},
	{
		"User": "mark",
		"Review": "\r beach front, courteous staff, clean room"
	},
	{
		"User": "geoffrey",
		"Review": "\r good gardens and beach, rooms good size"
	},
	{
		"User": "Jonathan",
		"Review": "\r Good food. Lots of entertainment. Grounds impeccably maintained."
	},
	{
		"User": "Edil",
		"Review": "\r wide room, quiet place, relaxing"
	},
	{
		"User": "Robert",
		"Review": "\r staff, food, peace and quiet"
	},
	{
		"User": "BELINDA",
		"Review": "\r beach, room, food selections"
	},
	{
		"User": "Brian",
		"Review": "\r Snorkling, swimming, views "
	},
	{
		"User": "RHODORA",
		"Review": "\r beach, nightlife, firedance, fireworks"
	},
	{
		"User": "Eric",
		"Review": "\r Nice Gardens"
	},
	{
		"User": "Sheron",
		"Review": "\r the cotage and the yard, beach, food"
	},
	{
		"User": "david",
		"Review": "\r Food, room and beach"
	},
	{
		"User": "Zachary",
		"Review": "\r beach, location, activities"
	},
	{
		"User": "Vincent",
		"Review": "\r Cleaniness,hardworking and friendly staff.I will want to visit again."
	},
	{
		"User": "Jovy",
		"Review": "\r nice beach"
	},
	{
		"User": "Susan",
		"Review": "\r Paella, porch, staff"
	},
	{
		"User": "HYEOJUNG",
		"Review": "\r I think was foods, beach and activities"
	},
	{
		"User": "Hansjoerg",
		"Review": "\r Location not too far from Davao City Shopping Malls, good size Bungalow, good food"
	},
	{
		"User": "Moe",
		"Review": "\r Big spacious rooms but the bathrooms were of a lower standard."
	},
	{
		"User": "Zachary",
		"Review": "\r Easy access to city, great snorkeling beaches, lots of activities"
	},
	{
		"User": "ansbert",
		"Review": "\r well organized, efficient, attentive staff"
	},
	{
		"User": "David",
		"Review": "\r Nice beach,good staff,great entertainment."
	},
	{
		"User": "James",
		"Review": "\r Clean Beach, Good Food, Good Prices"
	},
	{
		"User": "Lucila",
		"Review": "\r 1) nice surroundings, garden, beach area. 2) excellent service. 3) food/drinks choices"
	},
	{
		"User": "Marilyn",
		"Review": "\r Nice food,Friendly staff,Good ambience"
	},
	{
		"User": "Saida",
		"Review": "\r Clean room with balcony, beautiful garden, nice beach, friendly and accomodating staff."
	},
	{
		"User": "Roselyn",
		"Review": "\r Nice room, great view and clean"
	},
	{
		"User": "Alexis",
		"Review": "\r cleanliness, food, pleasant staff"
	},
	{
		"User": "Robert",
		"Review": "\r Staff, room, and meals"
	},
	{
		"User": "jennifer",
		"Review": "\r the beach, garden and bathroom"
	},
	{
		"User": "Romina",
		"Review": "\r Beach, Water and the location"
	},
	{
		"User": "Marcia",
		"Review": "\r grounds/location, entertainment, staff"
	},
	{
		"User": "HAZEL",
		"Review": "\r food, beach and accomodation"
	},
	{
		"User": "brent",
		"Review": "\r fast service, a medium sized menu, many activities, large beach area"
	},
	{
		"User": "PIUS",
		"Review": "\r Great Beach Area Clean Rooms"
	},
	{
		"User": "Mark",
		"Review": "\r Amenities are abundant for families with kids, staff is very accomodating, accessing from Davao City is very convenient"
	},
	{
		"User": "Sylvia",
		"Review": "\r many service crew"
	},
	{
		"User": "BEATRIZ",
		"Review": "\r The aviary, the landscape, the hospitable and courteous personnel, their way of welcoming their guests, sumptous food and relaxing ambiance of the rooms. "
	},
	{
		"User": "Alwin",
		"Review": "\r Clean spacious rooms"
	},
	{
		"User": "Grant",
		"Review": "\r The peace and quiet of it all. Although there were a lot of young, backpackers there, they were well controlled and kept away from the guest areas for the higher paying guests. "
	},
	{
		"User": "Kjell",
		"Review": "\r Nice Beach and service"
	},
	{
		"User": "Lee",
		"Review": "\r Nice rooms, plenty of things to do, well organised."
	},
	{
		"User": "ADELINO",
		"Review": "\r Nice hotel wher you can relax and unwind with all the busy schedules"
	},
	{
		"User": "Tricia",
		"Review": "\r covered beach area and nice layout of cabanas"
	},
	{
		"User": "Michael",
		"Review": "\r Large room and big bed set in a cottage style accommodation "
	},
	{
		"User": "stuart",
		"Review": "\r Easy to get to, clean and well maintained"
	},
	{
		"User": "Liza",
		"Review": "\r nice cottages"
	},
	{
		"User": "Jason",
		"Review": "\r Convenient, Clean, Safe and Secure"
	},
	{
		"User": "Jason",
		"Review": "\r Great place to relax with young kids"
	},
	{
		"User": "christine",
		"Review": "\r comfortable accommodations, okay beach "
	},
	{
		"User": "Emmaleen",
		"Review": "\r the resort itself"
	},
	{
		"User": "Glende",
		"Review": "\r Beach Gardens Watersports Activities Hot Sunny"
	},
	{
		"User": "israelito",
		"Review": "\r the food is good"
	},
	{
		"User": "israelito",
		"Review": "\r good food, great service"
	},
	{
		"User": "israelito",
		"Review": "\r there is a beach, the staff are friendly"
	},
	{
		"User": "Karen",
		"Review": "\r Many fun filled activities, gracious staff and awesome food!"
	},
	{
		"User": "Nihaya",
		"Review": "\r They had freebies"
	},
	{
		"User": "Nelio",
		"Review": "\r The Hotel is clean, well maintained. I like the rooms and the locations of the rooms. Good for people looking for a Quiet Place for the Family."
	},
	{
		"User": "Benedick",
		"Review": "\r Plenty of activities"
	},
	{
		"User": "Wei",
		"Review": "\r Location and Privacy of the Chalets"
	},
	{
		"User": "MISHAL",
		"Review": "\r room"
	},
	{
		"User": "Jesus",
		"Review": "\r Hotel are ,very clean foods best cook and good service"
	},
	{
		"User": "edith",
		"Review": "\r it was nice"
	},
	{
		"User": "David",
		"Review": "\r Accomadation and food "
	},
	{
		"User": "Ben",
		"Review": "\r on the beach"
	},
	{
		"User": "Ben",
		"Review": "\r Restaurant on the beach, private houses, friendly staff"
	},
	{
		"User": "shawn",
		"Review": "\r staff"
	},
	{
		"User": "Piyawon",
		"Review": "\r Right on the beach, activities, outdoor patio area"
	},
	{
		"User": "Fristine",
		"Review": "\r Excellent service "
	},
	{
		"User": "Brian",
		"Review": "\r The staff is extremely helpful and friendly, the grounds are kept impeccably clean. The food is varied, plentiful, and delicious. The setting is quiet, serene, and impressive."
	},
	{
		"User": "Angelo",
		"Review": "\r Nice cottage, good resto"
	},
	{
		"User": "Kawano",
		"Review": "\r Good food ,good music!"
	},
	{
		"User": "Jihan",
		"Review": "\r 7minutes boat ride away from the city, fun activities and picnic for the family, clean and has complete amenities"
	},
	{
		"User": "Rosario",
		"Review": "\r Great service, beautiful cottages with lovely spacious rooms."
	},
	{
		"User": "tkwan",
		"Review": "\r own house.."
	},
	{
		"User": "Michael",
		"Review": "\r nice beach, good service and food, nice setting/landscape and beach"
	},
	{
		"User": "Ronald",
		"Review": "\r food and terrace of the hotel"
	},
	{
		"User": "MARK",
		"Review": "\r New rooms and nice location"
	},
	{
		"User": "Eric",
		"Review": "\r Good food, very reasonably priced"
	},
	{
		"User": "Francesc",
		"Review": "\r servicio"
	},
	{
		"User": "Christian",
		"Review": "\r Rien. Dégoûté. Décu."
	},
	{
		"User": "Christian",
		"Review": "Sehr freundlich und hilfsbereit "
	},
	{
		"User": "Franz",
		"Review": "Schöne, gepflegte Anlage. Das Preis-Leistung Angebot stimmt hier. Sehr gute Lifeshows am Abend. "
	},
	{
		"User": "Burkhard",
		"Review": "Sehr gepflegtes Resort, parkartige Anlage, überaus aufmerksames und freundliches Personal. Das etwa größere Premier-Doppelzimmer für ca. 4000 Pesos pro Nacht ist mit ca 30 m2 sehr geräumig (angegeben waren für den Standardraum nur 18 und den Premier-Raum 23 m2, zumindest letzterer ist deutlich größer, incl. Bad). Strand sehr gepflegt, kinderfreundlich. Bootssevice zur Überfahrt nach Davao (bis 17 Uhr). Gut bewachte Anlage, wie das auf den Philippinen so üblich ist."
	},
	{
		"User": "Nathalie",
		"Review": "Das Resort liegt in optimaler Lage.Es könnte noch ein paar mehr Angebote schaffen wie beispielsweise Morgengymnastik, ein abwechslungsreicheres Abendangebot und was besonderes für Gäste aus Europa interessant wäre-ein ruhige Strandecke, in der mal keine Musik gespielt wird.Ansonsten ermöglicht das philippinische System viele Menschen einzustellen. Seid so nett und gebt jedem einfach mindestens umgerechnet einen Euro Trinkgeld, denn nur dann lohnt sich der Job dort. "
	},
	{
		"User": "Elizabeth",
		"Review": "Bestes Ressort in Davao / Samal"
	},
	{
		"User": "Tino",
		"Review": "\r Essen Zimmer Strand "
	},
	{
		"User": "David",
		"Review": "\r Bingalow, Umgebung, Personal"
	},
	{
		"User": "Andreas",
		"Review": "\r Beach, Schnorcheln, Jetski"
	},
	{
		"User": "Walter",
		"Review": "\r Restaurant, Badestrand, große Zimmer"
	},
	{
		"User": "Udo",
		"Review": "\r Strandnähe, parkähnliche Anlage, Livemusik"
	},
	{
		"User": "Rafty",
		"Review": "\r Strand, Essen,Schwimmen"
	},
	{
		"User": "Johann",
		"Review": "\r flaches geschütztes schwimmen, "
	},
	{
		"User": "Juergen",
		"Review": "\r Schöne Bungalows, wirklich gutes Essen,schöner Strand"
	},
	{
		"User": "Volker",
		"Review": "\r Die Ruhe und der Abstand nach Davao"
	},
	{
		"User": "fabrizio",
		"Review": "\r Camere spaziose persona"
	},
	{
		"User": "kenneth",
		"Review": "Nice place but overpriced. The employees do a good job cleaning the water and the beach however there's a lot of coral. For smokers....only 2 places allowed on the whole resort. Super friendly employees and a personal approach. We had a great (bit boring) time for 5 days."
	},
	{
		"User": "Ronnie",
		"Review": "\r Eigen huisje, super service, personeel staat altijd voor je klaar"
	},
	{
		"User": "Reiji",
		"Review": "It was good, the accomodation was far from the beach."
	}
]
