[
	{
		"User": "Per",
		"Review": "LARA&PER: Based on our 5th time vacation and all gatherings spent here, we always and always will love this place...feels like a real home. We love the simplicity of the rooms, the quietness of surroundings, all foods are very tasty (try our fave “chili con carne”), they plant their own fresh chillies and limes, nice pool area, very humble owners and super accommodating and friendly staffs - they will all assist you as much they can. Thumbs up to their service!!! If you want a room with a feeling of a Filipino Style - choose their Original rooms near the pool area. And if you want a Modern Style - choose the New Building near the street. We love both but I must admit that I fell inlove with the new one!!! Thank you RKG!!! See you again and again! ♥️♥️♥️"
	},
	{
		"User": "Hermela",
		"Review": "I left the charger of my iphone 6plus. I went back to check on it. At first, the receptionist told me that there was nothing turned over in the counter by the one assigned to checked the room when we went out. Then, when she called the staff, she was told that she kept the charger somewhere. The receptionist went to get it. They returned the charger with the same adaptor but changed the cord with a disfunctional one. I regret giving those who checked the room, the rice and the eggs in the tray. They are unworthy."
	},
	{
		"User": "Hussain",
		"Review": "No issues except that they should consider putting microwave ovens in "
	},
	{
		"User": "Per",
		"Review": "The Hotel is a very nice family owned one. The rooms are accommodating and simple, but comfortable. It's our 3rd time here and we continue coming back due to the coziness, the friendly staff and the garden "
	},
	{
		"User": "Isaac",
		"Review": "This is a perfect place if you are travelling with children to Davao. New and very well maintained small hotel. I highly recommend this place to family travelers..."
	},
	{
		"User": "Maureen",
		"Review": "We booked the 2-bedroom suite. I informed the hotel staff that we have a PWD together with us and she was glad to provide a room for us on the 1st floor. Room was clean. Everything was convenient on our part because small equipments and utensils for cooking and eating were provided such as rice cooker, electric kettle, big refrigerator, even electric iron was provided. The room had 2 separate bedrooms and 2 separate bathroom/cr. One was located inside one of the bedrooms for esy access so my father didn't have difficulty in using the comfort room because it is located as part of the master's bedroom. All in all the stay was a thumbs up for us. I wish we could have stayed longer."
	},
	{
		"User": "Mitchel",
		"Review": "This hotel was very clean and modern. The room was very clean and modern. Clear picture on the TV. The swimming although a little small was clean without smelling of a chemical bath. The food was excellent and staff very friendly. It was a very quiet relaxing place to be."
	},
	{
		"User": "Anna",
		"Review": "Quiet neighborhood and facilitative staff!"
	},
	{
		"User": "Darren",
		"Review": "Upgrades needed in both accommodation and staffs ability to cope with basic logic steps to achieve excellent customer service. At this moment there is an essence of a diluted form of service."
	},
	{
		"User": "Mye",
		"Review": "The only cons was the glass coffee table. i suggest you dont put glass furnitures especially those that are prone to break. The coffee table broke and our baby is near. Glad there were no injuries..laptop was damage which was on top of the table. We paid for it , its no problem with us but please next time dont use glass coffee tables or if you use , use those with four legs and is secured its really not a good idea if you have family with toddlers. Thanks"
	},
	{
		"User": "ronnie",
		"Review": "Stafff are super friendly.... clean room... i’ll surely stay here again next time im in DAVAO...."
	},
	{
		"User": "Peter",
		"Review": "Although it was a little way out of town the closest SM was only P80 in Taxi and taxi's are not expensive so getting around was fine, Nice pool and meals were very nice although a little expensive"
	},
	{
		"User": "Karla",
		"Review": "The staff were very accommodating. They even help their guests find cab/taxis whenever someone needs one, but you can also use the Grab app in case you have it. It is located inside Guadalupe Village so it is far from the hustle of the city. Their suites were spacious and they even provide utensils and cooking essentials. I just hope that they also provide dish washing liquids and sponges to ensure the cleanliness of the utensils. We had a problem with the bathroom where the shower area overflowed, but they quickly fixed it. They also provided rugs for the bathroom when we needed it. As for the internet, we stayed at their new extension just in front of the main building and it didn't reach our room so we weren't able to connect. Overall though, we had a pleasant and relaxing stay. Would definitely book again. "
	},
	{
		"User": "Kaye",
		"Review": "I chose Red Knight due to its proximity to the venue of the wedding that we attended. However, we had difficulty finding it due to road blocks put up by the subdivision management. What we liked: Fast internet connection New and clean facilities Spacious units Friendly staff Responsive to Facebook messages Cable TV and kitchen utilities available There were also unexpected changes with our booking but they informed us ahead of time and handled us professionally. What could be improved: Answer the landline phone Provide towels (even for a fee) Place room numbers on the doors Additional hooks in the CR"
	},
	{
		"User": "Wendell",
		"Review": "Confirmed monthssss ahead. Including the type of Room/ Floor Location - already into their booking system. Re-confirmation 2 weeks prior to date of arrival. But only to find out on the day of that we have been move to another floor plus the other room was change to another type though equivalent 2 rooms. They did not even bother to contact us. The owner/ manager did not even tried to come out initially to talk to us why the sudden change because they gave it to someone else even though it was already mark in their booking system as reserved.."
	},
	{
		"User": "Marvin",
		"Review": "When we got in the place, we were told that they are fully booked and they dont have our 2 bedroom apartment anymore. We were given the option to take a 1 bedroom apartment + studio room. We told them that the reason we rented is because we wanted to spend Christmas together with my extended Davao family and giving us separate rooms would defeat the purpose of why we took the place. Aiza one of the staff empathized with us and was able to make arrangements to upgrade us to a 2 bedroom suite without any additional charge. The room is big and very nice. No aircon unit for the living room but we were able to manage to make it cooler using the AC units of the 2 rooms. Place is not accessible to any stores so make sure to buy everything you need ahead of time unless you have a car so you can get out of the subdivision easily. We enjoyed our stay and would recommend the place."
	},
	{
		"User": "laurent",
		"Review": "nice, good food, relax, tranquil good adress"
	},
	{
		"User": "Anna",
		"Review": "Location is not too accessible with the mall or restaurants. Staff are friendly. Just a slight problem is the room that I have stayed, the aircon is directly blowing to us because it is located beside the bed and my friend got sick because of this. "
	},
	{
		"User": "Robert",
		"Review": "I give this hotel a higher mark because the beds are excellent, rooms are spacious, breakfast are delicious, and staff friendly. This is a great place to stay."
	},
	{
		"User": "Imelda",
		"Review": "Highly recommended."
	},
	{
		"User": "Diana",
		"Review": "It was quite ok but rooms was small... location too far in. Need to get a taxi everywhere."
	},
	{
		"User": "STEVE",
		"Review": "Overall, we enjoyed our short stay at Red Knight Gardens, the food was good and our suite was huge! The front desk staff were very helpful and friendly too, and the airport is only a 15 minute taxi ride away.. Negatives were the foreigners smoking in the restaurant, clearly in violation of Davao's strict anti-smoking law ... unpleasant as we had young children with us and the smoke really affected our meal. There were quite a few cockroaches in our suite too."
	},
	{
		"User": "Cherry",
		"Review": "The pool is sooo small"
	},
	{
		"User": "Douglas",
		"Review": "Good value for money"
	},
	{
		"User": "Ray",
		"Review": "We rented a 3-bedroom apartment. One bedroom, the AC is not working. All bathroom the shower is always malfunctioning."
	},
	{
		"User": "zona",
		"Review": "The units are big enough to fit a family of 10... but the living room needs air conditioning, the airconditioning provided are just enough for the rooms and cannot reach the living area. There is not enough ventilation. "
	},
	{
		"User": "maricel",
		"Review": "Poor water system. Improve! "
	},
	{
		"User": "haruwe",
		"Review": "Will definitely stay at their accomodation again. The place is definitely worth it. Their food is good and it's worth the price. But there were no complimentary drinks provided, no mini bar nor electric kettle, cups nor drinking glasses provided. I kind of think it's an apartment not a hotel. But overall our stay was good, tho the bed isn't really comfortable, because it keeps on making noise if you try to move even a little. The staff was nice, their security was really helpful."
	},
	{
		"User": "Trevor",
		"Review": "Excellent "
	},
	{
		"User": "Marco",
		"Review": "I will comeback agin"
	},
	{
		"User": "Timo",
		"Review": "nice place for vacation"
	},
	{
		"User": "May",
		"Review": "We had a hard time finding this hotel because its in a private subdivision. Room was ok big space but not comfortable. At night pool area is very dark as there was no lights, you can only see the lights in the bar beside the pool. there was alot of mosquito outside our room even in the pool area. Check-In was quick but check-out was terrible we cant find any staff to check our room so we can finish the checkout. "
	},
	{
		"User": "Roland",
		"Review": "they upgraded the room, but they gave us a room across the street"
	},
	{
		"User": "ramin",
		"Review": "I stayed there for a few nights and it was nice place with very friendly staff , value for the money . Will be back there if I come back to Davao again "
	},
	{
		"User": "ramin",
		"Review": "Worth the money you pay for it , location is little far from centre and the food is not excellent but I still enjoyed it "
	},
	{
		"User": "Loranne",
		"Review": "101 percent bad experience to this hotel. i will not come back! Everything was not pleasant during our stay!"
	},
	{
		"User": "GUITING",
		"Review": "good"
	},
	{
		"User": "michael",
		"Review": "It is basically an apartment complex turned in to a hotel of some sort. The location (it is inside of a village) is bad because getting any transportation to get in and out of the place is quite difficult. The swimming pool is so small that a small number of people can over crowd it and good only for kids. Price is not the great for what you're getting. "
	},
	{
		"User": "Galbos",
		"Review": "Safe surrounding as it is inside the guarded subdivision but far from the center of the city / attractions. "
	},
	{
		"User": "Bryan",
		"Review": "Perfect for family getaways"
	},
	{
		"User": "Miroslav",
		"Review": "good and friendly"
	},
	{
		"User": "Andrew",
		"Review": "We had a very enjoyable stay. The Resto food was great. The staff are super friendly, helpful & efficient. We'll be back!"
	},
	{
		"User": "Carl",
		"Review": "* Clean and big room * Airconditioned * Lively and attentive staff * Towel will be change after a single request * Fast wi-fi connection 5mps * Check-in and check-out w/o hassle * Has basic toiletries except of toothbrush so bring your own * Good ambiance, quiet place, safe place, and located near the Malls. -I will surely come back here. You can expect higher from the price you paid."
	},
	{
		"User": "john",
		"Review": "Good starf and nice place to be "
	},
	{
		"User": "Nescel",
		"Review": "Staffs are so nice.. They keep the place neat and clean. Love the pool and the bar. "
	},
	{
		"User": "YUMYEONG",
		"Review": "I'll be back :)"
	},
	{
		"User": "clyde",
		"Review": "I have stayed red knight gardens about 4 times, with no problems, but this time I was not so happy, poor internet could only get in bar area and slow.. Found when ordering a meal very slow..rooms very dark, have to ask for clean towels not replaced daily, sorry red knight gardens I will not return"
	},
	{
		"User": "JOHN",
		"Review": "THEY ADVERTISE WIFI BUT IT ONLY WORKS IF YOU ARE SITTING IN THE BAR VERY LIMITED TV TOO. THEIR FOOD IS OK BUT IT TAKES ABOUT AN HOUR TO PREPARE IT. JUST DID NOT SEEM THAT GOOD "
	},
	{
		"User": "Rachelle",
		"Review": "I'm a backpacker and not hard to please. I chose RKG for its reviews. First impression lasts, but we were dryly greeted as we checked-in and everything went wrong after that. They checked us in a room across the hotel which gives you the feeling of being aloof from the hotel. It's good for a group party, but doesn't really make you feel like part of the hotel. I requested for an early check-in but we came late in the afternoon and expected that the room was ready, but no! It was stinky and hot when we stepped in the room that we had to request for air freshener. There were only 2 towels for the 2-bedroom, 4 guests, that I booked. I had to request since they just gave us the key with no further information on what's going on. I tried to use the phone but there was no directory that I had to go all the way down again and asked for the front desk number and wifi password. I finally got the number but then the phone line was not activated that I have to go down and ask again. It was just stressful especially when you get there from a long trip. I expected to have a comfortable and relaxing feeling. It was also far from everything. It was inconvenient. We forgot to bring a toothpaste but there are no nearby convenient stores and the hotel does not provide, nor do they have the basic toiletries. The management is pretty bad. The only good thing is that the place we stayed in was spacious but musty and dusty. "
	},
	{
		"User": "Marillo",
		"Review": "The hotel is located near the shopping district and good if you are travelling im a group"
	},
	{
		"User": "Maria",
		"Review": "Hotel is located in a quiet subdivision. The room we booked was quite spacious and relatively clean. Good location. Near SM Lanang."
	},
	{
		"User": "John",
		"Review": "This is our third visit .I am not at all impressed.We had no water for three days.and the owner made no attempted to help at all.We had electricity failure three times with no assistance at all.My wifes son and grandaughter visit and used the pool and we had to pay a 250 peso fee. Not exactly what I had come to expect from the Red Knight .We will not be using this resort again."
	},
	{
		"User": "Per",
		"Review": "Once again a relaxing stay thanks to the always friendly staff and nice environment "
	},
	{
		"User": "Julito",
		"Review": "Staffs need more customer service skills seminar and cleanliness. Its a mess up garden not nice. Will not go back ever."
	},
	{
		"User": "MA",
		"Review": "It can be a safe place for senior citizens when railings are installed in the comfort rooms and rubber mats provided. "
	},
	{
		"User": "Daniel",
		"Review": "\r location, food and service"
	},
	{
		"User": "Daniel",
		"Review": "\r Staff,pool and ambience"
	},
	{
		"User": "LENARD",
		"Review": "\r location is central, cooking area is big, family room is spacious"
	},
	{
		"User": "SAI",
		"Review": "\r Quiet environment with Geen & swimming pool "
	},
	{
		"User": "Bryan",
		"Review": "\r pool/grounds/kitchette"
	},
	{
		"User": "Klaus",
		"Review": "\r 2 floors, kitchen and the bar"
	},
	{
		"User": "kim",
		"Review": "\r Spacious 3 bedder, swimming pool and a bar."
	},
	{
		"User": "allan",
		"Review": "\r freindly staff quiet location, nice cold beer"
	},
	{
		"User": "Daniel",
		"Review": "\r KK, , Bethy and kat :-)"
	},
	{
		"User": "Claridad",
		"Review": "\r Spacious room, workable kitchen space"
	},
	{
		"User": "Nerlyn",
		"Review": "\r Quiet, friendly staff"
	},
	{
		"User": "Nerlyn",
		"Review": "\r Friendly receptionist, quiet area"
	},
	{
		"User": "Melissa",
		"Review": "Booked for 2 nights but decided to leave the next day coz the place was not up to my standard. The shower and toilet dirty. The aircon not working. Overall I am not coming back here. It' s a wrong decision to book in this hotel."
	},
	{
		"User": "MUZAIN",
		"Review": "\r Clean room, helpfull staff and nice location"
	},
	{
		"User": "MUZAIN",
		"Review": "\r Clean room, helpfull staff and nice location"
	},
	{
		"User": "LENARD",
		"Review": "\r close to shopping centers, in house stove and fridge for cooking and storing foods, use of cooking utensils and cookware, "
	},
	{
		"User": "Kenneth",
		"Review": "\r clean pool area & grounds ; great staff; great food"
	},
	{
		"User": "julian",
		"Review": "\r Very good staff, Nice Gardens and very clean pool, large rooms"
	},
	{
		"User": "Toby",
		"Review": "\r kitchen, pool,food and bar"
	},
	{
		"User": "Per",
		"Review": "\r The staff very friendly and good service a place you like too return to again "
	},
	{
		"User": "Karl",
		"Review": "\r Location, facilities and value"
	},
	{
		"User": "Jennifer",
		"Review": "\r Location, Has a kitchen and living room, affordable"
	},
	{
		"User": "mario",
		"Review": "\r Clean and functional. A jewel hidden with a nice pool side restaurant, great service and good at a reasonable price. Friendly staff that speaks good English and is attending to you and your family. "
	},
	{
		"User": "christoher",
		"Review": "\r near airport , malls and easy to get taxi"
	},
	{
		"User": "wang",
		"Review": "no good"
	},
	{
		"User": "Christine",
		"Review": "\r large space in the living room; space to hang the laundry; affordable"
	},
	{
		"User": "Victor",
		"Review": "\r Large rooms, pool, secure area."
	},
	{
		"User": "Josephine",
		"Review": "\r very quiet"
	},
	{
		"User": "Lord",
		"Review": "\r Location, no giant dinosaurs, no unicorns"
	},
	{
		"User": "Ramon",
		"Review": "\r It is cheap and good room with good TV "
	},
	{
		"User": "Ramon",
		"Review": "\r Its Cheap its complete and very quiet place"
	},
	{
		"User": "Rob",
		"Review": "\r Location, staff and rooms"
	},
	{
		"User": "Rob",
		"Review": "\r Staff, location and clean"
	},
	{
		"User": "Rob",
		"Review": "\r Staff, location to airport and mall"
	},
	{
		"User": "Daniel",
		"Review": "\r Staff, Pool area and Bar"
	},
	{
		"User": "Daniel",
		"Review": "\r staff, price, pool area"
	},
	{
		"User": "Daniel",
		"Review": "\r staff, pool area, price"
	},
	{
		"User": "Daniel",
		"Review": "\r Staff, pool area, staff"
	},
	{
		"User": "alvin",
		"Review": "\r Location, Trip help,staff"
	},
	{
		"User": "Eric",
		"Review": "\r friendly staff"
	},
	{
		"User": "Nawawi",
		"Review": "\r 1. Spacious and clean rooms 2. Can cook in apartment. Especially for those with young children. 3. Friendly and helpful staff"
	},
	{
		"User": "Mariflor",
		"Review": "\r child-firendly swimming pool, you can cook your own meals in the kitchen provided in the apartment, apartment unit has 2-3 toilet/bathrooms plus 1 living room"
	},
	{
		"User": "Jingfeng",
		"Review": "\r In a quiet community, friendly and helpful staff, apartment with a kitchen."
	},
	{
		"User": "michael",
		"Review": "\r quiette comfortable roomy good price clean"
	},
	{
		"User": "michael",
		"Review": "\r Meeting with others peaceful friendly safe"
	},
	{
		"User": "william",
		"Review": "\r friendly staff beautifull garden nice pool"
	},
	{
		"User": "joel",
		"Review": "\r Clean Room Affordable Rate Near the City"
	},
	{
		"User": "Dave",
		"Review": "\r Staff, building consruction, view"
	},
	{
		"User": "Gregory",
		"Review": "\r great location and fairly quiet"
	},
	{
		"User": "Gregory",
		"Review": "\r nice pool well maintained.. great little restaurant and bar"
	},
	{
		"User": "Gregory",
		"Review": "\r nice garden view and great menu"
	},
	{
		"User": "Gregory",
		"Review": "\r large room with great garden view"
	},
	{
		"User": "Gregory",
		"Review": "\r Inclusive restaurant and nice bar"
	},
	{
		"User": "Grahame",
		"Review": "\r Price, location, quiet"
	},
	{
		"User": "Grahame",
		"Review": "\r Price, quiet, friendly"
	},
	{
		"User": "CHRISTOPHER",
		"Review": "\r Pool, staff, clean room"
	},
	{
		"User": "Eric",
		"Review": "\r friendly staff, comfortable room, pool"
	},
	{
		"User": "Gregory",
		"Review": "\r comfortable bed good service friendly staff"
	},
	{
		"User": "Gregory",
		"Review": "\r very convenient location, great and friendly staff"
	},
	{
		"User": "Gregory",
		"Review": "\r clean pool friendly staff great food"
	},
	{
		"User": "frank",
		"Review": "\r the price,the space,the privacy"
	},
	{
		"User": "David",
		"Review": "\r Safe, clean and comfortable"
	},
	{
		"User": "Jurico",
		"Review": "\r proximity to airport, swimming pool, quiet neighborhood"
	},
	{
		"User": "Vallut",
		"Review": "\r food was good"
	},
	{
		"User": "Regina",
		"Review": "\r Close to the airport, kitchenette for cooking, quiet neighborhood"
	},
	{
		"User": "Ramon",
		"Review": "\r Great pool, quiet and unique "
	},
	{
		"User": "Gregory",
		"Review": "\r Great little pool.. great staff"
	},
	{
		"User": "Cindy",
		"Review": "\r friendly staff, budget friendly and great place to stay if u travel with family and small kids."
	},
	{
		"User": "William",
		"Review": "\r staff,security, friendliness"
	},
	{
		"User": "Daniel",
		"Review": "\r Staff, Gardens, Food"
	},
	{
		"User": "Callum",
		"Review": "\r Staff, Price, Access"
	},
	{
		"User": "Fe",
		"Review": "\r Well maintained swimming pool,quite and relaxing area,friendly and helpful staff"
	},
	{
		"User": "peter",
		"Review": "\r price accessability and nice food"
	},
	{
		"User": "Avelino",
		"Review": "\r This hotel is in the center of all the places you want to go ie. beaches, malls , restaurants etc."
	},
	{
		"User": "Maria",
		"Review": "\r Friendly staff, clean rooms,great pools"
	},
	{
		"User": "Gregory",
		"Review": "\r clean pool, good food, great staff"
	},
	{
		"User": "Gregory",
		"Review": "\r nice clean pool"
	},
	{
		"User": "toby",
		"Review": "\r nice pool , kitchen , affordable price"
	},
	{
		"User": "SOHYUN",
		"Review": "\r very quiet, calm surronding and cosy swimming pool with pool side bar also large living room"
	},
	{
		"User": "Taichiro",
		"Review": "\r Location, friendly staffs and cozy poolside restaurant"
	},
	{
		"User": "Callum",
		"Review": "\r shepards pie, tacos, beer"
	},
	{
		"User": "mark",
		"Review": "\r cheap but thats about it"
	},
	{
		"User": "Brad",
		"Review": "\r 1) Large, comfortable room. 2) Small, but well-maintained pool. 3) Pleasant landscaping and quiet area."
	},
	{
		"User": "sean",
		"Review": "\r good location, comfort, friendly staff"
	},
	{
		"User": "CHIAN",
		"Review": "\r Reasonable Price, Nice Garden & Quiet Environment"
	},
	{
		"User": "Grace",
		"Review": "\r The spacious rooms, far from the noise of city life and i felt like i was staying in my own home."
	},
	{
		"User": "PELUCHE",
		"Review": "\r quiet, centrally located, near airport and malls"
	},
	{
		"User": "Gregory",
		"Review": "\r nice gardens comfortalbe surroundings friendly staff"
	},
	{
		"User": "Osamu",
		"Review": "\r very quiet, nice garden, nice staff"
	},
	{
		"User": "Juancho",
		"Review": "\r Garden, swimming pool, big rooms"
	},
	{
		"User": "Rein",
		"Review": "\r Quiet surrounding, nice staff and value for money"
	},
	{
		"User": "James",
		"Review": "\r Staff is good"
	},
	{
		"User": "ADY",
		"Review": "\r Accessible to Shopping and Attractions, Good Internet Connection and Friendly Staff"
	},
	{
		"User": "Taichiro",
		"Review": "\r Cozy rooms in a quiet environment, friendly staffs and accesibility to airport and beach resorts in samal"
	},
	{
		"User": "nicholas",
		"Review": "\r massive apartments, great food and drink and nice pool"
	},
	{
		"User": "Michinori",
		"Review": "\r Clean room ,Beautifuk garden with pool, kichen for self cook"
	},
	{
		"User": "Mohd",
		"Review": "\r Safe, Peaceful & Clean"
	},
	{
		"User": "john",
		"Review": "\r price location and room"
	},
	{
		"User": "Julius",
		"Review": "\r poo/rooms"
	},
	{
		"User": "james",
		"Review": "\r Bar & Pool"
	},
	{
		"User": "Rolf",
		"Review": "\r nice pool and pool bar, and food is good, love the baguettes"
	},
	{
		"User": "Derek",
		"Review": "\r The pool and friendly staff"
	},
	{
		"User": "LOIDA",
		"Review": "\r big rooms"
	},
	{
		"User": "Stuart",
		"Review": "\r Pretty garden and pool for kids"
	},
	{
		"User": "rey",
		"Review": "\r Very private place"
	},
	{
		"User": "Mark",
		"Review": "\r The bar, hang out with so many different nationalities,"
	},
	{
		"User": "Craig",
		"Review": "\r The staff were very professional and friendly."
	},
	{
		"User": "Keith",
		"Review": "\r Pool, gardens, food"
	},
	{
		"User": "Ian",
		"Review": "\r great service friendly staff extremely helpful "
	},
	{
		"User": "GLEN",
		"Review": "\r the peace and quiet and the staff"
	},
	{
		"User": "Rainer",
		"Review": "\r smoking everywhere allowed"
	},
	{
		"User": "Rainer",
		"Review": "\r Small and beautiful"
	},
	{
		"User": "Taichiro",
		"Review": "\r Quiet atmosphere and friendly staffs"
	},
	{
		"User": "jean",
		"Review": "\r big apartment"
	},
	{
		"User": "robert",
		"Review": "\r nice pool"
	},
	{
		"User": "Edecio",
		"Review": "\r good location, and security."
	},
	{
		"User": "john",
		"Review": "\r Big rooms "
	},
	{
		"User": "stephen",
		"Review": "\r the cosy atmospher"
	},
	{
		"User": "Karl",
		"Review": "\r has nice staff in a good location and quite"
	},
	{
		"User": "Dion",
		"Review": "\r Good bar and pool, nice landscaped gardens, relaxing atmosphere, good food"
	},
	{
		"User": "Julius",
		"Review": "\r Great Room, safe area."
	},
	{
		"User": "LOIDA",
		"Review": "\r Now its good"
	},
	{
		"User": "Ian",
		"Review": "\r owner and staff are flexible with booking schedule changes"
	},
	{
		"User": "Greg",
		"Review": "\r The hotel was cheap"
	},
	{
		"User": "Stephen",
		"Review": "\r Clean - attractive - convenient"
	},
	{
		"User": "Roland",
		"Review": "\r swimming pool and safe area"
	},
	{
		"User": "Roland",
		"Review": "\r swimming pool and quiet"
	},
	{
		"User": "RESTY",
		"Review": "\r Internet Connection"
	},
	{
		"User": "GLEN",
		"Review": "\r peacefull and quiet "
	},
	{
		"User": "SHIRLY",
		"Review": "\r the pool"
	},
	{
		"User": "Taichiro",
		"Review": "\r Cozy restaurant with nice foods and friendly staffs"
	},
	{
		"User": "SHIRLY",
		"Review": "\r the pool"
	},
	{
		"User": "Alan",
		"Review": "\r Very friendly staff, very clean, great service nice clean rooms"
	},
	{
		"User": "glenn",
		"Review": "\r quiet room , clean."
	},
	{
		"User": "Bradley",
		"Review": "\r Hard Beds, No Air Con"
	},
	{
		"User": "Randall",
		"Review": "\r Good service and good food"
	},
	{
		"User": "Nathan",
		"Review": "\r pool, television and cheap"
	},
	{
		"User": "reuel",
		"Review": "\r quite"
	},
	{
		"User": "Wei",
		"Review": "\r quiete"
	},
	{
		"User": "marybeth",
		"Review": "\r great location for a couple or a family"
	},
	{
		"User": "Minsoo",
		"Review": "\r good price"
	},
	{
		"User": "Minsoo",
		"Review": "\r quite and safe place"
	},
	{
		"User": "Michael",
		"Review": "\r Quiet location, friendly"
	},
	{
		"User": "adel",
		"Review": "\r l like it because of the hotel in quite place and romantic "
	},
	{
		"User": "Alford",
		"Review": "\r Nice gardens, friendly staff and great value for money"
	},
	{
		"User": "GLEN",
		"Review": "\r the peace the and quiet - u cant buy that in the philippines - no karoake"
	},
	{
		"User": "Donald",
		"Review": "\r pool and bar"
	},
	{
		"User": "Richard",
		"Review": "\r Friendly staff and affordable"
	},
	{
		"User": "george",
		"Review": "\r all good"
	},
	{
		"User": "Michael",
		"Review": "\r Location"
	},
	{
		"User": "Martin",
		"Review": "\r private atmosphere. off from the city center. locate in a green garden"
	},
	{
		"User": "Richard",
		"Review": "\r nice and quiet"
	},
	{
		"User": "Neil",
		"Review": "\r Clean rooms, reasonable size, beautiful gardens and a well run restaurant bar. "
	},
	{
		"User": "Bo",
		"Review": "\r In a subdivision, quit."
	},
	{
		"User": "Lorraine",
		"Review": "\r cleanliness"
	},
	{
		"User": "abdulmajeed",
		"Review": "\r the location"
	},
	{
		"User": "Stefan",
		"Review": "\r calm, lots of space"
	},
	{
		"User": "David",
		"Review": "\r Friendly service, excellent food at reasonable prices"
	},
	{
		"User": "Roger",
		"Review": "\r Quiet, clean rooms and a very friendly staff"
	},
	{
		"User": "Sterling",
		"Review": "\r Sooo qiet and Clean!!!!"
	},
	{
		"User": "David",
		"Review": "\r Security, Service and Quiet"
	},
	{
		"User": "terence",
		"Review": "\r the food and setting"
	},
	{
		"User": "Stefan",
		"Review": "\r secure, calm, clean"
	},
	{
		"User": "Clifton",
		"Review": "\r great rooms, large and comfortable"
	},
	{
		"User": "Clifton",
		"Review": "\r location is great, close to many things and places to go"
	},
	{
		"User": "Christopher",
		"Review": "\r Great rooms, beautiful setting and very professional staff"
	},
	{
		"User": "gary",
		"Review": "\r enjoyed bar-restaurant and pool"
	},
	{
		"User": "ares",
		"Review": "\r Quiet, Nice big room, good food"
	},
	{
		"User": "Magtangol",
		"Review": "\r neat,friendly staff and tranquil surroundings, extremely private"
	},
	{
		"User": "jevgenijs",
		"Review": "\r grreat location"
	},
	{
		"User": "Darrin",
		"Review": "\r it has kitchen utensils such as plates, spoons & forks, electric stove, casseroles, etc."
	},
	{
		"User": "Richard",
		"Review": "\r The Gardens - The Food - The friendliness of the owner and staff"
	},
	{
		"User": "laurent",
		"Review": "Bon restaurant, piscine, cadre sympathique. "
	},
	{
		"User": "Alain",
		"Review": "\r Personel attentif, disponibilite et repas ."
	},
	{
		"User": "frederic",
		"Review": "\r belle chanbre avec une belle picsine"
	},
	{
		"User": "Kurt",
		"Review": "auf grund der relativ guten Rueckmeldungen gebucht aber....der Aufenthalt war eine einzige riesige Enttaeuschung.Das Zimmer ok mit vielen Ablageflaechen das Bett gut die Dusche ebenfalls aber... ein Kampf mit Kakerlaken war nicht zu vermeiden...das Zimmet wurde nicht regelmaessig gereinigt .Die Badetuecher wurden zum Teil nicht gewechselt oder erst auf Auforderung.Zum Teil fehlte dad Toilettenpapier. Das Fruehstueck...war sehr sehr klein. Vor allem am Reis wurde gespart und die angebotene Wifi Verbindung im Zimmer war nicht wirklich vorhanden. Anfangs wenn ich an der Eingangstuere stand erhielt ich Verbindung.Nach ein paar Tagen war aber ueberhaupt keine Verbindung mehr möglich .Weder in den Zimmern noch in der Rezeption. Eigentlich muesste der Besitzer fuer diese unanehmlichkeiten einen Preisnachlass gebrn.. und noch zum Abschluss. Das Fruehstueck fand zwar im freien (ueberdacht) auf sehr kleinem Raum statt.Leider wurde dabei zum Teil geraucht was ich beim Essen nicht gerade gut fand. Das beste waren die beiden Damen beim Empfang welche jederzeit freundlich und sehr hilfsbereit reagierten "
	},
	{
		"User": "Robert",
		"Review": "Gutes Essen, freundlich He Bedienung sauberes zimmer"
	},
	{
		"User": "Klaus",
		"Review": "Die Zimmer verfügen über eine kleine Küche doch ist diese mangelhaft ausgestattet, so dass man diese nicht wirklich zum Verpflegen gebrauchen kann. Allerdings ist wenigstens ein Kühlschrank vorhanden.Das kleine Poolrestaurant bietet gute Speisen, die aber auch finanziell keine Sonderangebote sind. Leider kann man in diesem Hotel kein Frühstück buchen."
	},
	{
		"User": "Andreas",
		"Review": "...wir waren nun inzwischen das 7.Mal im RKG und kommen immer wieder gern hier her. "
	},
	{
		"User": "Andreas",
		"Review": "\r freundliches Personal, sauberer Pool, familiäre Atmosphäre"
	},
	{
		"User": "Klaus",
		"Review": "\r Große, saubere Zimmef, freundliches Personal, schöner Pool in einem gepflegten Garten"
	},
	{
		"User": "Andreas",
		"Review": "\r Pool, Bar, Ruhe"
	},
	{
		"User": "Timo",
		"Review": "\r Pool / Klima/ Ruhe"
	},
	{
		"User": "Uwe",
		"Review": "\r Zimmer, Pool, Bar"
	},
	{
		"User": "Thomas",
		"Review": "\r Gutes Bett , ruhige Lage , nette Staff "
	},
	{
		"User": "Juergen",
		"Review": "\r Kühlschrank, Kochplatte, Töpfe und Geschirr im Zimmer"
	},
	{
		"User": "Andreas",
		"Review": "\r Ruhig gelegen"
	},
	{
		"User": "Beat",
		"Review": "\r schön gelegen in einem wunderschönen Garten mit Pool"
	},
	{
		"User": "Rein",
		"Review": "\r De locatie, de rust en de atente personeel"
	},
	{
		"User": "Yoshiaki",
		"Review": "部屋に冷蔵庫が無いのはイタイ！ 近くにコンビニとか無いので、タクシーでの行き帰りなので、冷えたビールとかダバオ名産の果物類を入れておきたいので。 唯一そこが気になった。"
	},
	{
		"User": "norimichi",
		"Review": "２ベットルームスイートに５泊しました。 綺麗なように見えますがそうでもないです。 毎日掃除もしてくれますが、自分でもしました。 キッチン付きはいいですね。旅先でみんなで料理するのは楽しいです。 皿とコップとフライパン炊飯器ナイフ、フライ返しは揃ってます。 他に必要なものDAMOSAのマーケットで購入。 ダバオの中心部には遠いです。毎回タクシー。 大通りまで３００Mくらいあるのですが トライシクルが走っています。７？８ペソ？だったかな。 外国人とおもってぼったくってくるドライバーもいますので気をつけて。 私は４０ペソとふっかけられました。 いいホテルに泊まりたいのならマルコポーロやアブリーザですが広い部屋は高いですからね～。 次回もありかなしかと聞かれれば 十分ありですね。　　楽しい旅行でした。"
	},
	{
		"User": "HIDEYUKI",
		"Review": "彼女の家族と一緒に３泊しました。 当初３ベッドルームを予約しましたが、手違いがあると言われて、２ベッドルームと１ベッドルームを勧められました。（料金は事前に支払っていたので、正直理解に苦しみましたが、言い争いはしたくなかったので、あきらめました。アゴダに問題があったのでしょうか？それとも、ホテルに問題があるのでしょうか？） 建物については、設備も古く、トイレの故障等もありましたが、スタッフ等の対応は良かったです。 プールもあり、家族以外の親戚もゲストとして利用できたことは、よかったです。 当初は、手違い等もあり、不愉快な思いもしましたが、スタッフの対応は良かったので、次回もまた、利用したいと思います。 "
	},
	{
		"User": "kiri",
		"Review": "年末年始に行きました。立地はタクシーを使わないと市街地には行けませんが、のんびりするには良いです。大晦日はタクシーは来ません。市街地に、行きたいなら早めに行くことをお勧めします。 スタッフはみな親切でした。部屋は清潔です。キッチン設備はフライパンしかなかったので、せめてオーブンか電子レンジがあると良いなぁと思いました。 それからお湯を沸かすためのものがないので苦労しました。空き缶に水を入れて電気コンロで温めました。"
	},
	{
		"User": "Katsumi",
		"Review": "ビレッジの中にあるホテルでしたが、静かでプールも有り雰囲気の良いレストラン＆バーが有り　大変良かったです。ただ何処に行くのもタクシーが必要で、トライシクルはほぼつかまりません。スタッフは日本語無理です。少しの英語とタガログ語が必要ですね。"
	},
	{
		"User": "Hiroshi",
		"Review": "ホテルと違い料金も比較的に安く部屋も広くゆっくり出来る｡ "
	},
	{
		"User": "masanori",
		"Review": "高給住宅街の中に有り車が無いと到達不可能。　　周りに食事をできるところは無い。　　しかしプールもあり部屋は広く清潔、冷蔵庫もcable tv も有り、値段以上と言える"
	},
	{
		"User": "haruhiko",
		"Review": "\r プールやバーの雰囲気がよい"
	},
	{
		"User": "Kazuo",
		"Review": "\r 料金の安さ。環境の静かさ。ビレッジの中のホテルなので安全・安心。"
	},
	{
		"User": "tatsuya",
		"Review": "\r 部屋の広さ。キッチン付きで便利。清潔度も高い"
	},
	{
		"User": "tomoaki",
		"Review": "\r 広々して綺麗な部屋。庭も綺麗に手入れされていて、プールもあり、とてもリラックスできた。"
	},
	{
		"User": "tatsumi",
		"Review": "\r フレンドリー、値段、清掃"
	},
	{
		"User": "inoue",
		"Review": "\r 部屋が広い　プールが綺麗　可愛いレストラン"
	},
	{
		"User": "Toshio",
		"Review": "\r こぎれいなプールと庭　くつろげるバー　きれいな部屋"
	},
	{
		"User": "SHIMOJO",
		"Review": "\r 部屋が広いくて静かです。"
	},
	{
		"User": "tatsumi",
		"Review": "\r 値段、無理を聞いてくれる"
	},
	{
		"User": "Masashi",
		"Review": "\r 手入れのゆきとどいた庭"
	},
	{
		"User": "kosuke",
		"Review": "\r 静かなところにある"
	},
	{
		"User": "Taichiro",
		"Review": "\r フレンドリーなスタッフ"
	},
	{
		"User": "Taichiro",
		"Review": "\r 静かな環境"
	},
	{
		"User": "Taichiro",
		"Review": "\r 静かで治安の良い環境"
	},
	{
		"User": "SHUNJI",
		"Review": "\r ビレッジの中で安全"
	},
	{
		"User": "Taichiro",
		"Review": "\r 静かで治安の良い環境"
	},
	{
		"User": "Taichiro",
		"Review": "\r 街中の喧騒を離れた静かな佇まい"
	},
	{
		"User": "minoru",
		"Review": "\r 小さいながらプールもある、静かな愛すべきホテル"
	},
	{
		"User": "kunio",
		"Review": "\r 一応清潔ですが、アメリカ風で郊外のモーテルみたいです。"
	},
	{
		"User": "Taichiro",
		"Review": "\r 静かな環境と居心地のいいプールサイドバー"
	},
	{
		"User": "Yoshihiro",
		"Review": "\r 周りが静か"
	},
	{
		"User": "kenji",
		"Review": "\r ３ベットルームアパートメントはキッチンがあり料理ができる"
	},
	{
		"User": "Masafumi",
		"Review": "\r シンプルな作りです"
	},
	{
		"User": "katsushige",
		"Review": "\r ダバオでもホテルでタバコが吸える。"
	},
	{
		"User": "kazunori",
		"Review": "\r 部屋の広さ"
	},
	{
		"User": "minoru",
		"Review": "\r 部屋は広く、静かな環境でプールまである。"
	},
	{
		"User": "Yoshitomo",
		"Review": "\r 部屋が広く、友達を呼んでパーティーをしました。この金額でこの広さは魅力的です。"
	},
	{
		"User": "sung",
		"Review": "체크인 시간 2시를 못맞춰 로비에서 40분이상 기다리게하고 침구에서 나는 냄새때문에 베게에 머리를 대는것도 힘들었네요 바꿔달라고 요청했지만 그것도 마찬가지였고요. 2박동안 온몸이 간지러워 정말 힘들었습니다."
	},
	{
		"User": "Anton",
		"Review": "Its very nice place and very good price/quality comparison. The only thing I didnt liked it that there were ants in the kitchen. "
	},
	{
		"User": "sunggill",
		"Review": "가격대비 훌룽하다. 취사가 가능하고 친절한 직원들... 하지만 택시기사들이 위치를 헤멘다"
	},
	{
		"User": "GUITING",
		"Review": "房间设施比较陈旧，卫生也不佳。 小院子环境还不错，有个小的游泳池。 可以烧饭，套间有煤气灶，单间是电炉，不太给力。 服务态度还不错。"
	},
	{
		"User": "YEONSEUNG",
		"Review": "베드버그가 아들의 온몸을 물어 피부병처럼 만들었다. 그럼에도 호텔에서 아무런 조치를 취하지 않았고, 호히려 다른곳에서 그런거라 화를내는 행동을 보이며 불친절의 극치를 보였다. 베드버그 말고도 개미, 바퀴벌레, 모기, 온갖 벌래들과 함께한 숙소였다."
	},
	{
		"User": "TIEBIN",
		"Review": "酒店属于别墅区的感觉。打车进去都要登记的。很安全在达沃这个地方。租的套房。可以自己做饭。很美味。"
	},
	{
		"User": "YUMYEONG",
		"Review": "Nice "
	},
	{
		"User": "sunggill",
		"Review": "택시 기사들이 찾기 어려워함...주택가 안에 위치하고 있어서 조용하고, 쾌적햿으며 직원들도 무척 친절함. 음식을 조리해 먹을 수 있어서 가족과 함께 라면 좋을 듯"
	},
	{
		"User": "Zoltan",
		"Review": "csak jó"
	},
	{
		"User": "YUMYEONG",
		"Review": "취사 도구와 취사 가능하고 놀기 좋은 점은 만족 하나 직원들 일처리가 느리고 수건교환 룸메이트업 몇번 요청해도 안되는 경우가 많아요, 바에 요리는 일품인데 조리 시간이 한참 걸리긴 합니다"
	},
	{
		"User": "YUMYEONG",
		"Review": "가드나 직원들 친절하고 풀장은 작습니다, 거실에 4인 식탁과 4인 식탁과 4인 쇼파 조리기구와 가스레인지 등 취사가능하고요(이것 때문에 선택) 화장실 겸 샤워실 있습니다(온수 강도 조절 불가). 단점은 에어컨이 침실에만 있어서 침실문을 열고 거실에 냉방 해야 하고, 이름은 호텔이지만 민박 또는 팬션 느낌이기 때문에 호텔 생각 하시는 분들은 다른 곳으로 가야 할것 같습니다. 장점은 취사 및 자유롭게 놀기 좋다는 것이 장점입니다. 참고로 아파트먼트가 조금 더 넓습니다"
	},
	{
		"User": "Jinhyeok",
		"Review": "7명의 가족수를 충족할수있는 넓은 객실이 아주 좋았음 시내 나가기도 편하고 물론 택시를 이용 호텔에서 언제나 콜택시를 부를수있고 아침 일찍 산책나가기도 좋았음 조용하고 "
	},
	{
		"User": "DONGSUNG",
		"Review": "\r 조용함"
	},
	{
		"User": "HOSHIN",
		"Review": "\r 얼려주는 맥주 저념한가격 직접음식을 해먹을수있는 주방시설"
	},
	{
		"User": "yu",
		"Review": "\r 友好的员工 房间很大"
	},
	{
		"User": "Alina",
		"Review": "\r Отношение персонала в баре, доброжелательность и увожение."
	},
	{
		"User": "JINJU",
		"Review": "\r 게?? "
	},
	{
		"User": "Kjell",
		"Review": "\r 3 soverom leilighet var bra, med kjøkken og kokekar "
	},
	{
		"User": "Kjell",
		"Review": "\r svømmebasseng og bar / resturant"
	},
	{
		"User": "Alexandra",
		"Review": "\r тихое место"
	},
	{
		"User": "jae",
		"Review": "\r 에어컨 좋고 조용함"
	},
	{
		"User": "youngsan",
		"Review": "\r 세븐일레븐"
	},
	{
		"User": "seungHwan",
		"Review": "\r 작지만 풀장도 있고 아기자기하고 저렴하고 좋았습니다."
	},
	{
		"User": "seungHwan",
		"Review": "\r 편하고 조용함... "
	},
	{
		"User": "mijung",
		"Review": "\r 조용한 빌리지내 위치"
	},
	{
		"User": "SUNGJIN",
		"Review": "\r 조용한 숙소"
	}
]
