[
	{
		"User": "Omar",
		"Review": "Internet not good.."
	},
	{
		"User": "Frances",
		"Review": "Very clean, comfortable beds and very central location . Staff are friendly"
	},
	{
		"User": "Denis",
		"Review": "The app was really useful. With regards their wifi, it’s strong but unfortunately it made of the apps I use not accessible since it doesnt detect the gps or location via their internet. In any case, nice stay. I just recommend giving complimentary breakfast to guests."
	},
	{
		"User": "Carl",
		"Review": "suggest to get family room to have larger space in the room it was also accessible going anywhere"
	},
	{
		"User": "CECILIA",
		"Review": "Great experienced"
	},
	{
		"User": "Maria",
		"Review": "Accessible, clean, near banks..good value for money."
	},
	{
		"User": "Villas",
		"Review": "My stay in the hotel was great. Room is okay. However, there is water being provided, no toot brush and toothpaste and no slipper. There is no 24/7 convenience store nearby where you can buy drinks. But related to hotel service and comfort is okay. "
	},
	{
		"User": "Serramae",
		"Review": "Kinuha namin Twin Room, Kaya ko first choice ang Red Planet kasi Affordable at gusto ko talaga malinis ang hotel. So, Na impressed naman ako kasi malinis kaso yung lalagyan nila ng shampoo at soap parang hindi ako sanay kasi iba sya from the hotel na nakasanayan ko. Sa kanila may lalagyan Na e press mo lang. Hindi ko alam kong anong tawag doon. Sa tingin ko yung lalagyan old na kaya hindi gaanong malinis tingnan. Sana baguhin nila. At yung floor ng CR Sana palitan na nila kasi medyo luma na sya. Regarding naman sa laki o liit ng Twin Room para sa akin Okay lang na ganuon sya ka cute kasi mura rin naman eh. Pero totally, For me perfect to stay sya kasi Napakalinis, Kind at Friendly din yung mga Staff, Guard, Housekeeper lahat sila napa ka friendly. Alam mo talagang gusto nila trabaho nila at mababait. "
	},
	{
		"User": "Blesilda",
		"Review": "love the comfy bed. linens are great. the bath towels smells nice and looks new. had a very good night's sleep."
	},
	{
		"User": "renz",
		"Review": "aircon automatically shuts down"
	},
	{
		"User": "Abigaile",
		"Review": "Locations is near to the area of our concerns and near to the malls. Transportation accesibility. We got a great price deal during our hotel booking."
	},
	{
		"User": "rose",
		"Review": "good to stay.. far from tourist spot but transportation are accessible because hotel is along the road."
	},
	{
		"User": "Elvin",
		"Review": "No comment"
	},
	{
		"User": "Christopher",
		"Review": "Stayed for one night on the next day before my flight back to Manila. Clean place. Customer service was excellent! The A/C of the room where I was staying had an error and I was promptly moved to another room with a working A/C. Value for money and clean too!!!"
	},
	{
		"User": "Ruben",
		"Review": "Good customer service"
	},
	{
		"User": "Serramae",
		"Review": "The room is very clean. The staff are very nice to their guest. "
	},
	{
		"User": "RUDOLF",
		"Review": "Compared to other budget hotels the best in Davao"
	},
	{
		"User": "RUDOLF",
		"Review": "Good hotel when attending to events in SM or Ayala"
	},
	{
		"User": "kimberly",
		"Review": "Lack of amenities."
	},
	{
		"User": "Lawrence",
		"Review": "Staff was very accomodating to our request and courteous to guest. They even let us check in on an earlier time. Location is perfect as its beside the highway. Easy to grab taxi and right beside a supermarket. "
	},
	{
		"User": "Maria",
		"Review": "This is my 3rd time to check into a Red Planet Hotel. Already been to the Cebu and Cagayan de Oro branches. Third time here in Davao. I have no complaints but the bathroom smelled like the sewer. It was on the 8th floor. Otherwise would still choose Red Planet again for future bookings."
	},
	{
		"User": "Mary",
		"Review": "very basic amenities. small room but very clean. If you only need a room to sleep in this hotel will suit you."
	},
	{
		"User": "Mae",
		"Review": "I love staying here!"
	},
	{
		"User": "materesa",
		"Review": "Very good choice if all you are after is a clean and comfortable place to sleep in after a day outside. There is a restaurant on the ground floor that offers a decent choice of meals. Bed is nice and clean but there is no table so forget about working with your laptop unless you do this on the bed. I will come back if looking for another no frills stay. "
	},
	{
		"User": "Marlyn",
		"Review": "I am satisfied with the service."
	},
	{
		"User": "Aleli",
		"Review": "Location always near the city center,affordable and comportablle in every aspect"
	},
	{
		"User": "Jacqueline",
		"Review": "Staff do not endorse what we needed to acquire3 upon checkout. The night shift said he will endorse to the morning shift , such that the folio shall have been ready by 6AM, but apparently did not, hence it was only prepared upon check out which delayed the travel to the airport. The toilet-shower room area was not cleaned well, there were stains and hair in the shower room the next morning, when it should have been cleaned the day before. In fairness, the bed and linens were still so soft and smelling good."
	},
	{
		"User": "Julius",
		"Review": "Keep up the good work."
	},
	{
		"User": "Julius",
		"Review": "Hotel didn't disappoint us. The Aircon is very cold and the service is great."
	},
	{
		"User": "Christopher",
		"Review": "I can't really fault the hotel. Those that do must have bad luck or be exceptionally fussy. Very clean,very comfortable, good modern air con out of the oppressive Davao heat. Excellent base for airport and in easy reach of two of the best malls in Davao (Abreeza & SM Lanang - in my humble opinion). For the money you can't beat it. Rooms are compact but that is never a consideration for us. Shower, modern and clean. Will stay again in future."
	},
	{
		"User": "Ana",
		"Review": "The room is of good size, i love their nice big bed, clean sheets and the room is well maintained. The only issue I had was the noise coming from the next door neighbors at past midnight. And since there was no in-room phone I had to go to the corridor for the phone to ask reception to call the other guests' attention. But since it was busy I had to pad down reception to report in person - a bit of a hassle. "
	},
	{
		"User": "annabel",
		"Review": "It was just a place to stay for the night. Service was satisfactory. I have already forgotten if they had toiletries for use during our stay. "
	},
	{
		"User": "Karen",
		"Review": "Bed space for couple is quite tight but just alright since we only needed an overnight just to catch a flight. Free breakfast is a plus."
	},
	{
		"User": "Gerald",
		"Review": "the Red Planet was great place to stay , room was small , though I just slept and showered there , everyone was great the talked and even odd joke , id stay there again , next year for sure "
	},
	{
		"User": "Rovie",
		"Review": "you have to pay for bathroom essentials and hotel slippers. also no water and did not honor my free breakfast"
	},
	{
		"User": "Angela",
		"Review": "we stayed here for 3nights. the room, linens, pillows are very clean and dainty. because we have a 2 year old who normally make some mess especially in the toilet, spill water everywhere etc, we normally leave the place in chaos but when we come back at night, the place seem to reset in its clean state! the cable has channels to keep my kid entertained. the staff are accomodating. the location is near the mall, airport and its easy to get a ride. keep it up!"
	},
	{
		"User": "leonida",
		"Review": "need to check the amenity like iron facility as the one issued didn’t work.."
	},
	{
		"User": "Darren",
		"Review": "As always The Red Planet Davao offers excellent service , clean comfortable rooms. Located close to 3 Shopping Malls and 10 minutes from the International airport. Thanks I will be back again soon"
	},
	{
		"User": "Andrew",
		"Review": "Great staff. Very friendly and helpful. Nice room and hotel is in a great location. Showing signs of age on the outside but very comfortable inside. My first choice for Davao City "
	},
	{
		"User": "Thomas",
		"Review": "Tried to get us to pay for a breakfast even though it was clearly paid for and covered in the booking details.. Booking details Occupancy: 1 Adult, 1 Child Breakfast: Included Nickle and dime you to death.. Tom"
	},
	{
		"User": "Thaisa",
		"Review": "toilet was not maintained well. sink was not working. "
	},
	{
		"User": "Stephen",
		"Review": "Great hotel for surfers as near Cloud 9, but if you want to be near the \"center\" stay in General Luna area. Room was big, great for big groups. Staff could have smiled more when being addressed."
	},
	{
		"User": "Karen",
		"Review": "Second time visit still of a VERY HIGH STANDARD and EXCELLENT VALUE with the BEST STAFF 😄"
	},
	{
		"User": "George",
		"Review": "Hope to have complementary foods nor drinks! In general, great comfort indeed!"
	},
	{
		"User": "Bryan",
		"Review": "One thing to note is that they have fast Internet/WIFI. The room was clean but the showerhead has black molds. The staff were courteous. To add, one day my wife left her wallet in our room, but when we came back all the money is still in there. Overall, our stay was great."
	},
	{
		"User": "Kharen",
		"Review": "They really have small rooms but nevertheless it was clean, neat and the staff are very accomodating..kudos!!"
	},
	{
		"User": "Sarah",
		"Review": "I booked this room for Family friend and he was so pleased to have a great night stay, good sleep. Always the room of choice for stop over in Davao. "
	},
	{
		"User": "Santiago",
		"Review": "This is the best hotel for business trips! The price is very reasonable, the rooms are spotless and new, and the staff is very pleasant to talk too. Will definitely use Red Planet for all my business trips!"
	},
	{
		"User": "Katrina",
		"Review": "This hotel is always our option when we want a cheap place to stay whilst in the city. Rooms may be small but we are always put most of the day anyway so doesn’t really matter. "
	},
	{
		"User": "Eleanor",
		"Review": "The staff was very accommodating and attended to our concerns immediately as well as the security guards."
	},
	{
		"User": "dundee",
		"Review": "clean and comfortable"
	},
	{
		"User": "Rose",
		"Review": "clean, great value of money and very accessible for everything..."
	},
	{
		"User": "Robert",
		"Review": "In any hotel, the staffs can add value to yout stay. Everyone here is polite and courteous. I had a wonderful stay in this business man’s hotel."
	},
	{
		"User": "Mary",
		"Review": "Fruits should be allowed except for strong smelling food. They should put cups for drinking. "
	},
	{
		"User": "andrew",
		"Review": "Staffs are very friendly. Location is perfect. Close to shopping center. Value for money! "
	},
	{
		"User": "Valeria",
		"Review": "Had been returning to this hotel many times. Everything was as expected."
	},
	{
		"User": "Annalyn",
		"Review": "Pros: value for money and location is okay. Cons: its very hard to talk to a giy receptionist when i ask him about my late check out with a fee of P500 (since this is the cost and policy amount) he said that he canot accomodate my late check out last april 9 due to he did not know the mass arrival. (And he didnt even care to check with the computer) he can only accomodate me if i book anothe night. Hehe Anyways, spoke with the pregnant receptionist when hes not around and she gladly accept my request promptly. Shout our to the preggy. Thank you. Over all it was okay and had fun in davao for our overnight stay"
	},
	{
		"User": "Anthony",
		"Review": "Best value of this hotel is their staff...... great service and details."
	},
	{
		"User": "Anthony",
		"Review": "hotel with great staff. location is central and have easy access to transportation."
	},
	{
		"User": "Shaun",
		"Review": "Having never stayed in the Philippines before only have UK standards to compare with. When the Internet did not work in my room I was immediately we located and was impressed with the service. Television broke once again it was sorted within minutes. Shame there is no coffee making facilities in the room and a little cramped but only needed bed and breakfast facilities not home comforts. "
	},
	{
		"User": "julie",
		"Review": "The place is a walking distance from Robinson’s mall and the staffs were very accomodating."
	},
	{
		"User": "Karen",
		"Review": "200Php from Ecoland Terminal to Red Planet 150Php from Red Planet to Davao Airport Walking distance to SM Lanang, Robinsons, Carmelite Church Near tourist spots also Will definitely come back if the price is the same or lower I hope they will have promotions and Davao Day Tour Package"
	},
	{
		"User": "Elizabeth",
		"Review": "I really love this hotel, near airport, clean and really accessible to all the tourist spots. Stayed here twice and will stay again in our future travel to Davao. :)"
	},
	{
		"User": "Ronald",
		"Review": "High Quality bed linens, strong shower. Limited parking so u will park outiside on tandem. They don’t provide free bottled water"
	},
	{
		"User": "cristina",
		"Review": "Clean, comfy, accessible. A business traveler's hotel."
	},
	{
		"User": "Ronald",
		"Review": "Comfortable linens, nice shower but no free bottled water."
	},
	{
		"User": "Larry",
		"Review": "Competive priced with clean smaller room and clean showers. Very modern and updated . Did not see a swimming pool "
	},
	{
		"User": "rowena",
		"Review": "Wish they have more tissues n toiletries"
	},
	{
		"User": "Maximillan",
		"Review": "My girlfiend’s gold bracelet were stolen when she left it on the side table because the safe were not working. When we reported the incident to the front desk we were informed that they will investigate and inform us while we are on our sight seeing trip of the outcome. That day, we received a text message that the person who entered our room who left fresh towels said that they didn’t noticed the bracelet when they entered our room. When we came back that night we informed the front desk that the result of the their investigation was unsatisfactory and that we will report the incident to the police for proper disposition and investigation. That following day while packing home she found the bracelet inside one of our drawstring bag who we found very strange since those bags were only used for footwear and that it won’t end up there even accidentally. We suspect that we staff returned it inside the bag when we said that we will reprt the matter to the police. "
	},
	{
		"User": "clement",
		"Review": "Rooms are clean and tidy. Very small and minimalist, but it got all the confort needed for a few days stay."
	},
	{
		"User": "Mary",
		"Review": "We like the bed"
	},
	{
		"User": "Catherine",
		"Review": "The hotel is clean and comfortable. Value for money."
	},
	{
		"User": "sherline",
		"Review": "its a good hotel, very clean and staff are friendly. Location is nice, near abreeza and sm lanang. about 25 mins ride to the airport. Only thing is they don't allow ironing, even flat hair iron."
	},
	{
		"User": "paul",
		"Review": "good value for money nice place to rest "
	},
	{
		"User": "George",
		"Review": "Nice & clean rooms.."
	},
	{
		"User": "MA",
		"Review": "Red Planet-Dvo has become our mainstay hotel everytime we are taking a flight to another place as location is most appropriate. Cleanliness is of utmost importance to us as well. Hotel Staff are accommodating and professional in their dealings with clients. "
	},
	{
		"User": "james",
		"Review": "Over priced for what you get."
	},
	{
		"User": "paul",
		"Review": "would stay here again "
	},
	{
		"User": "Rodney",
		"Review": "nice place to stay.."
	},
	{
		"User": "Faizza",
		"Review": "The hotel lobby is located at the second floor of the building. Though I checked in late, the check in process was quick and the front desk staff was nice. The wifi was also working well. I liked the hot shower and the water pressure. Overall an okay hotel but for the price, there may be cheaper options in Davao."
	},
	{
		"User": "MINHO",
		"Review": "good!"
	},
	{
		"User": "Verna",
		"Review": "Clean room... but bathroom door cannot close properly. I would like to extend for 9 more days but the front desk agent that I spoke to didn’t work well with our rate... inspite we are long staying guest! Seems like no considerations and no options given to meet the rate... kinda disappointed.. coz we like to stay."
	},
	{
		"User": "Ahmad",
		"Review": "Value for money, good location and they provide nice breakfast! "
	},
	{
		"User": "Gerlyn",
		"Review": "The place was great. Unlike other hotels, it's simple but you will have all your basic needs . Hot and cold shower with a good water pressure, strong wifi signal, towels, hangers, hair blower, and great linens. We did return to a clean room after a day from the convention, with new towels amd linens. Looking foward to stay in one of your hotels someday. Thank you"
	},
	{
		"User": "Joseph",
		"Review": "The other elevator didn't work for 6 days I was there so I was worried that, with all the events happening in Davao, it could malfunction for overusage. So could potentially be left with no working elevators and I pity the people who had rooms above the 2nd floor lobby. "
	},
	{
		"User": "Carissa",
		"Review": "It was very clean. Really a budget hotel. Plain room and shower. There was a tv. No ref. No Closet. If you are looking just for a room to stayin. This is it. "
	},
	{
		"User": "Jozarie",
		"Review": "the bed is too bouncy and at least there's should be complimentary mineral water. "
	},
	{
		"User": "Anthony",
		"Review": "All the room amenities were good, like the shower and bed. Clean room overall except for bed sheets looked a little old and dirty, some stains "
	},
	{
		"User": "Edward",
		"Review": "if you are here only to rest / sleep, then this is a very practical hotel. "
	},
	{
		"User": "Erika",
		"Review": "Best sleep I've had in a hotel! Perfect in simplicity, functionality, and practicality :) if there's one thing I'd change or suggest, it is to provide bedroom slippers or bathroom slippers. Will definitely go back!"
	},
	{
		"User": "Anisah",
		"Review": "Good place to for just resting after a day's out. Best to bring your own toiletries as they sell toothbrush & toothpaste instead of providing and the shampoo is 2in1 with soap. Otherwise, good enough room for short haul."
	},
	{
		"User": "Kevin",
		"Review": "Had to stay last minute due to missed flight. Great room for a night or city stay. Booked via Agoda app for 1200 Pesos. Price at FO was 1900 pesos."
	},
	{
		"User": "Hernan",
		"Review": "Security staff were friendly, helpful & kind! They should have been in front desk for staff there were exact opposite!"
	},
	{
		"User": "Graham",
		"Review": "staff are polite and attentive "
	},
	{
		"User": "Teresa",
		"Review": "Comfortable stay, clean, comfy bed, perfect toilets, great location"
	},
	{
		"User": "Noelle",
		"Review": "I have stayed in Red Planet Hotel in Manila, which is why i chose this hotel in Davao. The staff is very accomodating and nice. The rooms are clean and the space is just nice for 2-person who are just looking for a place to sleep in. The location is great also, you can just go out and hail a taxi or ride a jeep."
	},
	{
		"User": "Walfredo",
		"Review": "Room is very CLEAN. No restaurant and house Phone. Breakfast is always crowded in a Small Cafe at the ground floor. "
	},
	{
		"User": "Ronald",
		"Review": "Better if they will provide slippers, toothpaste. "
	},
	{
		"User": "Christina",
		"Review": "Bathroom tiles needed some repairs in our room. One tile in the shower area was loose. Water was seeping inside and gave off a foul smell. Soap dispensers needed repairs as well as the covers fall off when you push it."
	},
	{
		"User": "Anthony",
		"Review": "Clean and ample room for an overnight stay. Staff is always great and accommodating. "
	},
	{
		"User": "HELEN",
		"Review": "I stayed in cebu and cagayan red planet hotel i did not notice if they have a toothbush kit or not. But in davao they dont have any. if you stay here make sure you bring your own toothbrush and toothpaste because they dont have any."
	},
	{
		"User": "Suk",
		"Review": "Lobby smells good, room is clean, although it is a little small. Super comfy bed. Basic no frill hotel, great for a short stay. "
	},
	{
		"User": "Andy",
		"Review": "Good Place"
	},
	{
		"User": "Joan",
		"Review": "The location of the Hotel is good, walking distance to Malls. The room is clean and has comfortable bed with international comforter bedsheet that i am used too. Will surely booked here again. "
	},
	{
		"User": "Johnrey",
		"Review": "the hotel is nice and it is very well located and close to the malls and establishments of the airport, very clean and the bed is super soft and comfortable sleep you can really relax from a trip, and their security is really safe and they always check things before checking in and entering the hotel, keep it up Red Planet Davao for your good service."
	},
	{
		"User": "JUDE",
		"Review": "I shall return "
	},
	{
		"User": "Gawie",
		"Review": "Clean, affordable hotel. Friendly front staff, need to be more informative tough. Rooms are basic but comfortable. Location not that great. Would definitely book Red Planet Hotel for my next visit. "
	},
	{
		"User": "Johnrey",
		"Review": "the hotel is nice and it is very well located and close to the malls and establishments of the airport, very clean and the bed is super soft and comfortable sleep you can really relax from a trip, and their security is really safe and they always check things before checking in and entering the hotel, keep it up Red Planet Davao for your good service."
	},
	{
		"User": "Julito",
		"Review": "A lady staff was very helpful to me I forgot to get her name as I was so tired morning of January 9th between 8:30-9:30am."
	},
	{
		"User": "RUDOLF",
		"Review": "Strategic located near malls and airport"
	},
	{
		"User": "Melvin",
		"Review": "Drainage in my room was not okay "
	},
	{
		"User": "Torre",
		"Review": "Hotel is new, clean and bed is so comfortable. Good security and over all good value for money. Will come back next time we are in Davao City."
	},
	{
		"User": "George",
		"Review": "Very clean rooms & comfy pillows"
	},
	{
		"User": "Gerard",
		"Review": "Situated in the main road where Taxis and Multicabs are conveniently located"
	},
	{
		"User": "Gerard",
		"Review": "Just near SM Lanang and a ride away to Abreeza Mall and other tourist spots."
	},
	{
		"User": "Rodolfo",
		"Review": "Nice hotel but no fridge. You can't bring food in your room. Misleading information it says that free breakfast but when I printed out the voucher it shows that breakfast is not included."
	},
	{
		"User": "Paula",
		"Review": "The location was perfect, situated at the main road. There is a cafe downstairs and the supermarket is just a 3 minute walk. SM Lanang is only a 5 minute cab ride away. You get value for money with their facilities. The staff were very accommodating and helpful."
	},
	{
		"User": "Christina",
		"Review": "We had a great stay. The staff was friendly. Just a bit disappointed with the cleanliness of the toilet (was not cleaned well) and the towels (one had stains and one had a hole in it). The soap dispenser did not contain soap since we checked in and was never refilled."
	},
	{
		"User": "PAUL",
		"Review": "Very affordable"
	},
	{
		"User": "krizia",
		"Review": "Of course the shower, its amazing.. thr cleanliness of the room and most especially the linens. The staff was very helpful especially when you need something. "
	},
	{
		"User": "ARLENE",
		"Review": "Great location and Like the cleanliness "
	},
	{
		"User": "Jenette",
		"Review": "Excellent place to stay and not that pricy."
	},
	{
		"User": "Judyland",
		"Review": "Seems like the staff have not been well trained. "
	},
	{
		"User": "Jose",
		"Review": "Would have been the usual great experience but this time they forgot to put BATH TOWELS. So after showering, with no telephone in the room, had to install the damn app just to contact the front desk to give the towerl -_-"
	},
	{
		"User": "Benjie",
		"Review": "Super clean hotel. Small room but beds are comfy. Massage parlors are just few steps away from the hotel. Coffee shop is just next to the hotel."
	},
	{
		"User": "neil",
		"Review": "Good"
	},
	{
		"User": "Kiel",
		"Review": "First time to be able to stay here for induction and it's a great place to stay for those short or long term stay. Rooms are clean, front desk is approachable. It may not have so many amenities but it's enough. The breakfast place downstairs is great as well. It may be priced for tourists but I was satisfied with my American breakfast."
	},
	{
		"User": "Eunice",
		"Review": "I had a great stay. Will come back again"
	},
	{
		"User": "Cristina",
		"Review": ". I booked a room for my niece birthday for 2 nights and requested if they can do something for her. The staff at Red Planet made it so special. My niece was surprised! She loves the birthday balloons and a birthday cake. Thank you so much for making her birthday memorable. We stayed there 2 years ago and my niece requested this hotel again. The rooms were clean, location is great, there’s a massage place next door which i loved. Will definetely come back. "
	},
	{
		"User": "Diosal",
		"Review": "Always our first option when we travel back to Davao City. Great location- just along the highway, with parking space but a 1st come basis. Big plus- its comfortable bed! (Unlimited “ligid ligid”) 🤣 and its rain like shower! Only missing- No convenience store below, as compared to other Red planet branches. Staffs were accommodating, especially the sec. guards downstairs at the parking area 👍"
	},
	{
		"User": "Wabi",
		"Review": "The place is very clean and also just a nearby to shopping malls which makes it very convenient."
	},
	{
		"User": "ROLAND",
		"Review": "No coffee making facilities, no fridge, very bad mattress, very small rooms, very basic clean and cheap"
	},
	{
		"User": "Renato",
		"Review": "no phone in room. "
	},
	{
		"User": "Shiela",
		"Review": "The picture is different from the actual room. Akala mo malaki ang kwarto, pero no! Very disappointing. We cant get our money back so we just stayed there for the whole duration of staying in Davao. Ang staffs nila, they're like nice but they're not. They smile in your face but then seems like don't even want to serve you or give the service that you deserve to have. But ofcourse money talks. Kapag foreigner, they're nicer. Kapag mukhang wala ka lang or poor , wala lang. Ni greetings or smile wala. Lalo na jan sa restaurant nila, parang ayaw magserve eh. Parang matatakot ka tawagin sila or yung mga waitress kasi mukhang naiinis sila , ayaw nila magtrabaho. Very disappointing talaga. "
	},
	{
		"User": "Anthony",
		"Review": "Value for Money Hotel Clean and cozy atmosphere. Great Staff Good location"
	},
	{
		"User": "Randolf",
		"Review": "The location is good for the market, but for the clients it is so crowded. For the facilities and cleanliness with the average grade is 4 out of 10, the property is affordable for foreign guest unlike for those domestic guest. And for the staff many of them are lack of energy and heart on work."
	},
	{
		"User": "Donald",
		"Review": "I like Red planet hotels. I look for them wherever I travel in Asia. I can count on my stay being comfortable safe and pleasant."
	},
	{
		"User": "edward",
		"Review": "Value for money is a pro, con parking is limited at times. "
	},
	{
		"User": "Scott",
		"Review": "The staff was wonderful they cater to our every needs the room was a little small for me I am handicapped but they have a handicap room and I should have booked it for the money it was a great value especially serving breakfast every morning I needed a refrigerator for my insulin and they didn't have in room but they have at the front desk and anytime I needed to get they were available all in all it was a great value for the money and the staff was wonderful"
	},
	{
		"User": "Imelda",
		"Review": "Cleanliness, Location . . . 2 very important things in my hotel . . ."
	},
	{
		"User": "Herminia",
		"Review": "Easy to book, excellent service, very nice and helpful hotel staffs 👌🏻👌🏻👌🏻"
	},
	{
		"User": "Angelita",
		"Review": "Checking out is exceptionally fast."
	},
	{
		"User": "Brent",
		"Review": "mejo mahigpit lang pagka nag smoke ka sa room nila, nag ccharge talaga sila :) kahit may lysol pa :)"
	},
	{
		"User": "REGINE",
		"Review": "Value for money! The room is clean and staff are very accommodating especially the guards who are very informative on where to go and even gave fliers on who to contact whenever you wanted to avail tours."
	},
	{
		"User": "van",
		"Review": "the plqce is near the robinson and sm lanang.. friendly staff and SG.. "
	},
	{
		"User": "Vernon",
		"Review": "I really appreciate the immediate response of the staff when I’m in need of something. The internet connection is a bit poor. Towels have brown stains. "
	},
	{
		"User": "Allan",
		"Review": "not good"
	},
	{
		"User": "Jernell",
		"Review": "good place to stay. only problem during my stay was that im hearing faint noises like sound of a drill."
	},
	{
		"User": "Anthony",
		"Review": "great price and location. service of staff is 5star. lots of places of interest near-by"
	},
	{
		"User": "edward",
		"Review": "Pro-cost, location, beds, sume but all you need. Con-car park limited so do it before 6pm or it fills up. No ref in room ......all in all its worth it to me."
	},
	{
		"User": "Bylna",
		"Review": "Friendly and accommodating staff, clean and value for money. Always in a good location, accessible to restos and malls."
	},
	{
		"User": "Denise",
		"Review": "works for those who will be out most of the time. I love that there is also a ceiling fan aside from an air conditioner because this helped me dry my washed clothes overnight. "
	},
	{
		"User": "Dexter",
		"Review": "The most unbelievable learning I got from staying in Red Planet Davao is that it is a zero-star establishment, just because it lacks the basic amenities like fridge (which I do not mind). However, it can easily knockout other 3- or 4- or 5-star hotels with its cleanliness, coziness and presentation of itself. Linens are superb, super comfy, and super-clean. Truly, worth coming back to. Location is not that great, but you can take a ride to the nearest mall. Staff are super-nice and super-okay. They are accommodating and ever-smiling!"
	},
	{
		"User": "Khim",
		"Review": "no slippers, no hot water in room and staffs are smiling but not friendly"
	},
	{
		"User": "Mary",
		"Review": "Nice stay; though the room was small, limited space; amenities are limited like shampoo and soap are dispensed in one dispenser. "
	},
	{
		"User": "Alyzza",
		"Review": "Great and friendly staff! Very clean room! I’ll definitely book my hotel here again if I visit Davao again"
	},
	{
		"User": "Mary",
		"Review": "Water dispenser should be on common area. Had to go down to 2nd from 8th floor for a hot water."
	},
	{
		"User": "napoleon",
		"Review": "Left my wallet in my room after having checked out. Called them and they found it! Got my wallet back in no time!"
	},
	{
		"User": "edward",
		"Review": "Pro cost, con limited parking and noise bouncing off time floors"
	},
	{
		"User": "Dennis",
		"Review": "Pros - cheap. adequate room for the price. Cons - no potable water, no room service. "
	},
	{
		"User": "LIEGUI",
		"Review": "SM Mall is just 5mins walk away."
	},
	{
		"User": "Larry",
		"Review": "I use this hotel because the cleanliness is acceptable, it is ok for a 5:00 am flight, close to a couple of malls, has dependable WiFi and the price is ok. Room is small. Tv is small. Zero amenities. It is basically a clean room with a tv and shower and that is it."
	},
	{
		"User": "Henricus",
		"Review": "Im only unhappy that no have any ventilation in the room . The window is always locked even cant opened a small gap"
	},
	{
		"User": "Henricus",
		"Review": "Its no food if no any ventitalion. The window be full locked even a little. Just small ventilation toilet. Thats worst."
	},
	{
		"User": "MARIE",
		"Review": "Clean rooms. Near Robinson's and SM. Small room but comfortable bed and very good AC system. Good breakfast at the restaurant. "
	},
	{
		"User": "Anne",
		"Review": "I love Red Planet. My go-to hotel whenever I visit Davao. Very clean, simple and value for money."
	},
	{
		"User": "Christine",
		"Review": "This I a very bare bones kind of hotel. But what they lacked in space and facilities, they made up with super clean rooms PLUS very attentive and excellent staff! :) Thank you for accommodating my request even if it was last minute. "
	},
	{
		"User": "Alfred",
		"Review": "Nice hotel"
	},
	{
		"User": "Julito",
		"Review": "When in Davao, this is one of our go-to hotel especially when we hit the airport at dawn the next day! This hotel chain always exceeds our expectation. As a matter of fact in Manila, we also use Red Planet hotels. ♥️"
	},
	{
		"User": "Miriam",
		"Review": "The only thing lacking is Wardrobe Cabinet. & if you travel wt big luggage there's no space in the room. the room is too small. Light in the bed sides are too shiny ."
	},
	{
		"User": "Anthony",
		"Review": "Good Value Hotel with 5star Customer Service Good location with many places of interest near-by"
	},
	{
		"User": "WILLIAM",
		"Review": "The hotel really offers value for money for a quick overnight stay. The room is equipped with everything you'll need - TV, Air Conditioning, Bathroom with soap and shampoo, hangers, and a clean and comfy bed. Location is okay - around a 12 - 15 minute walk to SM Lanang and around 10 mins away by car to Abreeza Mall. There's a 7-11 convenience store around a 3 minute walk away. No problem to find a taxi too as the hotel is located along a main road."
	},
	{
		"User": "LEANNE",
		"Review": "Very nice Staff "
	},
	{
		"User": "Benhur",
		"Review": "Just a short walk to SM Lanang, where I attended an Expo. Also, very accessible to public transport."
	},
	{
		"User": "Lilian",
		"Review": "Room is too small and no space for guests luggages"
	},
	{
		"User": "Anthony",
		"Review": "Hotel Staff was great. Service is top notch. Clean and Budget Friendly Hotel with many place of interest around (Restaurants, supermarkets, etc)"
	},
	{
		"User": "Cherubim",
		"Review": "We will definitely stay in this hotel again."
	},
	{
		"User": "genevieve",
		"Review": "good service"
	},
	{
		"User": "princess",
		"Review": "Thumbs up 👍"
	},
	{
		"User": "Anthony",
		"Review": "Clean and Comfortable Hotel No frills and Value for Money. Great Staff "
	},
	{
		"User": "Olivia",
		"Review": "Hotel's Location is great...close to my areas of interests (biz meetings, quick errands to malls) However age is already starting to show on the hotel's equipment / facility. Was first assigned to a room with the aircon automatically shutting down after a few minutes & the bidet was broken, called it to the frontdesk...they sent a maintenance technician but the issues were not resolved. when i called back that the issue recurred was offered to transfer to another room. the nxt room had a working aircon & bidet but the bed's spring is already starting to surface to the top of the bed. lost wifi connection even before the check out time...tried contacting the frontdesk via their app (by this time I already shifted to my mobile data), but it wasn't connecting to their server (there is no phone inside the room, connection to the frontdesk / customer service is via their app)"
	},
	{
		"User": "John",
		"Review": "Fantastic place!! staff are amazing!.. Location is great! easy to get transport only thing it needs is a 7-11 close by like all the other red planets. Thank you :)"
	},
	{
		"User": "Jessica",
		"Review": "We were checked in on the 2nd floor but was really noisy on our first night. We asked to be transferred on the succeeding nights to other room and it was good. Just be sure not to be in the 2nd floor as these is where their lobby is ( their ground floor serves as the parking area)"
	},
	{
		"User": "Myra",
		"Review": "Clean, very convenient location."
	},
	{
		"User": "ARIEL",
		"Review": "great value for money..."
	},
	{
		"User": "Jure",
		"Review": "I guess something went wrong, so I have to write it again. I've had problems in room 817, which was near the stairs and noisy water heater could be heard 24/7. Also the wifi was extremely slow there. Only on the last day when they moved me to the 2nd floor I had a very good wifi and no noise. The staff are great in all Red planet hotels, they even helped me to break open my suitcase when the lock got stuck."
	},
	{
		"User": "Robert",
		"Review": "This is a very good business hotel. Everything was just perfect during my stay."
	},
	{
		"User": "Bernard",
		"Review": "Location is good, value for money, good staff, security and everything I need in a hotel room. "
	},
	{
		"User": "James",
		"Review": "Convenient downtown location, cleanliness, staff and security is excellent. Always stay here when in Davao and will continue to do so."
	},
	{
		"User": "CECILIA",
		"Review": "Nice and clean"
	},
	{
		"User": "PUI",
		"Review": "clean and very good staff "
	},
	{
		"User": "Mohamed",
		"Review": "The hotel is excellent and clean but the staff they need a lot of training about custmor services for the price u pay.."
	},
	{
		"User": "medardo",
		"Review": "Good experience 2 years ago that's the reason I came back w family."
	},
	{
		"User": "Anthony",
		"Review": "Great Staff! Restaurants and Malls near by easy to get public transportation."
	},
	{
		"User": "Mary",
		"Review": "I always book this hotel whenever I travel to Davao City. The service ang location is great."
	},
	{
		"User": "alta",
		"Review": "The restaurant downstairs served very economical meals. Suggestion to change the payment clause to cash payment upon arrival of guest in the hotel and not to charge automatically on the actual booking day without consent of guest. ..otherwise it was a restful stay. "
	},
	{
		"User": "Mariz",
		"Review": "The location is really good, it is in the middle of Sta Ana and Sasa wharf. It is also near to SM Lanang, just 5-8mins jeepney ride. The room is quite small but tidy. We really enjoyed our stay here :)"
	},
	{
		"User": "Blessy",
		"Review": "Red planet is a go to. Location-wise and price wise. "
	},
	{
		"User": "Ivy",
		"Review": "It's getting more than what you paid for. You get a very comfy bed, aircon is working, there's a fan, hair blower for the girls, shower pressure is strong, hot shower is working. Very good location, right beside it is a massage center that's cheap and a coffee shop. Further ahead are restaurants. so accessible"
	},
	{
		"User": "Veronica",
		"Review": "We are very satisfied with Red Planet Hotel..."
	},
	{
		"User": "Gretchen",
		"Review": "I was totally expected that everything goes ok.But Unexpectedly ,was so bad in my room inside .How could you be in the room without free complementary water which I book online a standard room.They should provide a water for there guest .People have a good reviews there online but I don't think so if you can have a good comment below if you could stay there.I have no reason to go back In Red Planet in Cagayan .Also I book online in Red Planet in Davao .I had not once bad experience but twice .In Davao Red planet ,is still same.No water no Telephone they're just hanging in the hall-way and also the Shampoo ,conditioner and shower they mix it up in one .Ive never meet that kind of stuff before ,Isn't wierd right!. I couldn't imagine they have a good ratings but when I go there was not so right of what I expect for .Forgive me but I just express my feelings as a normal guest who check in there and I am not so happy during my stay .Bed is ok but the area in the room is too small ."
	},
	{
		"User": "Azalea",
		"Review": "Not for a staycation, but good enough for a traveler passing thru. No usual hotel amenities (wardrobe, minibar, toiletries, pool, gym), just the basics. so if you're just needing somewhere to spend the night, this is okay, just don't expect much. The lobby is also on the second floor so it's a bit inconvenient. An app has to be downloaded to get front desk assistance (no landline in the room), so if the guest is not \"techie\" or does not have an android phone, they have to go down to the front desk to get assistance. But it's new, it's clean, and the staff are nice."
	},
	{
		"User": "HONORIO",
		"Review": "Do not have telephone in the room for room service Do not have compliments in the room like mineral water Do not replace tooth brush and paste Do not have soap Do not have coffee or tea in the room "
	},
	{
		"User": "Terry",
		"Review": "I have stayed at Red Planet hotels in a few different locations and they have always been modern and clean. They also have the best showers of any other hotel I've stayed at. The room is small but I have no hesitation in recommending the Red Planet to anyone."
	},
	{
		"User": "Grace",
		"Review": "Value for money, though a bit cramped, but for the price it's okay and comfortable. "
	},
	{
		"User": "Liza",
		"Review": "Place is cozy and clean and that is what I like especially the bathroom since I am particular with it. Location is at its best near to robinsons mall so if you have basic needs it is just beside the hotel itself. Staff is excellent and always greet you with a smile. Checking in is a breeze.. Will be back definitely."
	},
	{
		"User": "John",
		"Review": "Super nice cute staff, Friendly, professional, Great location to everything, and affordable. Thank You :)"
	},
	{
		"User": "John",
		"Review": "Best place throughout the Philippines.. Clean nice rooms, the staff are the best! always good location easy to access everything! will always stay here "
	},
	{
		"User": "Anthony",
		"Review": "Excellent Stay as always. Staff is attentive and gives excellent Service. Room Clean and tidy. Hotel is very near food establishment and Malls."
	},
	{
		"User": "Diana",
		"Review": "I like staying in this hotel because it is situated in a place with easy access. The room is very clean but I do not like the soup gadget on the wall. It falls off. Bathroom too tiny. But good Stay..."
	},
	{
		"User": "DIONEL",
		"Review": "The place overall was fair. Breakfast was good although they should offer a lot more than what they have on the menu. "
	},
	{
		"User": "John",
		"Review": "The staff help us carry our luggages and even calls a taxi whenever we're leaving the hotel."
	},
	{
		"User": "Glyn",
		"Review": "Clean. good all round. nice view. convenient."
	},
	{
		"User": "Avon",
		"Review": "No nonsense hotel, good security but no personal touch in anything. Could have been cheaper"
	},
	{
		"User": "Georgina",
		"Review": "Room was clean. Very comfortable one night stay. "
	},
	{
		"User": "Fritzie",
		"Review": "I booked my stay at Red Planet because the price is reasonable and the facilities inside the room is okay. I had a problem with their aircon but they immediately sent a bellman to assist me and transfer into another room. "
	},
	{
		"User": "JOI",
		"Review": "clean and tidy. bed are comfortable. but not much facilities."
	},
	{
		"User": "Karen",
		"Review": "Just ok. Nothing fancy or extra ordinary. Room is small, doesnt feel homey. Good for layovers for 1night stay. Near the airport."
	},
	{
		"User": "Noreen",
		"Review": "This is near SM Lanang in Davao. Free breakfast is a plus, although you have to go early because the space in the restaurant gets crowded during peak hours. "
	},
	{
		"User": "Fredrik",
		"Review": "It was a simple hotel, but for the price is great value for the money. I will come back in three weeks."
	},
	{
		"User": "Joel",
		"Review": "Simple, clean, good proximity to SM Lanang (shopping mall). Easy to get a taxi or ride public transportation. Room is clean and the wifi connection is good. Fast enough to stream Netflix at 480-720p. This is a budget hotel so there aren't any amenities worth noting."
	},
	{
		"User": "Gretchen",
		"Review": "Nice hotel, it was clean and pleasant to stay. the staff were so assistive to your needs. The security measured were excellent. "
	},
	{
		"User": "Katherina",
		"Review": "Good location & easy to find. The hotel room was spotless & modern. Its tiny but expected for a budget hotel."
	},
	{
		"User": "JOSEPHINE",
		"Review": "Loved the hotel! Location is also accessible. "
	},
	{
		"User": "Sheila",
		"Review": "I commend the cleanliness of the room although the space is quite small. During the time that we were there, we experienced an earthquake, however, they did not sound the alarm to inform guest of the incident. Nobody directed the guests about their evacuation procedure. I believe that staff should be oriented on these emergency procedure."
	},
	{
		"User": "Anthony",
		"Review": "Although the prices have increased, its still a good no frills hotel Staff always provides a great service with a smile."
	},
	{
		"User": "Hazel",
		"Review": "5-star service for a fraction of the price. Loved it here!"
	},
	{
		"User": "Jericson",
		"Review": "Value for money and clean"
	},
	{
		"User": "Mark",
		"Review": "The free breakfast is exceptional. You get to eat at the restaurant with nice choices."
	},
	{
		"User": "Giselle",
		"Review": "Every time there is a Red Planet in the city we're visiting, I booked them. Tried and tested. Clean room, just perfect for 2 people, courteous staff. My only problem on this branch was it was a bit far from the city center. And there was traffic going and coming here from/to the city center."
	},
	{
		"User": "Jaynor",
		"Review": "Near at SM Lanang were I had my convention. "
	},
	{
		"User": "Nove",
		"Review": "Clean and friendly staff"
	},
	{
		"User": "ramil",
		"Review": "Nice to stay, clean comfortable and secure."
	},
	{
		"User": "Rajeen",
		"Review": "Great stay n staff is good"
	},
	{
		"User": "ARIEL",
		"Review": "Secured, clean room, courteous staffs, great value for money"
	},
	{
		"User": "Duane",
		"Review": "I'm not accustom having my bags gone threw on arrival,Will never stay there again"
	},
	{
		"User": "Reinhard",
		"Review": "Was a decent stay. Small but clean room. No fridge but the front desk personnel was kind enough to store some of our cold items inside the fridge in their station"
	},
	{
		"User": "Julito",
		"Review": "Our company always use this hotel when in Davao City."
	},
	{
		"User": "Julito",
		"Review": "Love the location... just a couple of minutes to SM Lanang & Abreeza Mall. This is actually our go-to hotel when we have early flight the next day. Very clean rooms... plus, when much needed, they allow early check-in without extra charge (++++ points to moms like us who carry/bring our toddler along).. we have been using this hotel for many times as a family and for the company we are working for.."
	},
	{
		"User": "Henry",
		"Review": "The room is spacious even for three adults and the view is simple but not eye sore. Very close to the SM Premiere and the airport. Friendly staff."
	},
	{
		"User": "GRACE",
		"Review": "The hotel is very economical but I think they should still have phones in each room."
	},
	{
		"User": "Edwin",
		"Review": "Good location and clean. Space a little small but good for one pax stay. "
	},
	{
		"User": "Kashmir",
		"Review": "good place"
	},
	{
		"User": "Kashmir",
		"Review": "good place"
	},
	{
		"User": "Anthony",
		"Review": "Great location with Excellent Service. a lot of near by restaurants Clean and big enough for 2 person. "
	},
	{
		"User": "Regina",
		"Review": "Well located, close to airport and it's pretty centralised. Staff are alright but i feel that receptionist can more caring. I was there when a mini earthquake happened, it was the after shock. I was worried and checked in with the receptionist and was told that they are on standby for worse. However, there's NO FIRE ALARM! I asked how would we know if we would need to run, esp if we asleep.. she frowned with a worried look and said.. unfortunately, you got to feel and based on your intuition... oh man, if you want a safe hotel in case of emergency, this is a no go hotel. If you aren't worried, then this is good enough. "
	},
	{
		"User": "Ernelson",
		"Review": "Superb!! Very good staff and very comfortable bed! "
	},
	{
		"User": "Claire",
		"Review": "Nice location. The room was clean. "
	},
	{
		"User": "Valeria",
		"Review": "Not the first time here. enjoyed my stay as always"
	},
	{
		"User": "PAOLO",
		"Review": "No toiletries, the breakfast is not so good, i advice not to avail the breakfast inclusion. "
	},
	{
		"User": "Christy",
		"Review": "would love to go back 😊"
	},
	{
		"User": "Claro",
		"Review": "Good double bed, good linens, clean room functioning aircon, tv and heater. Bare essentials in the room but would be nice to have ref, drinking glasses and bigger room for the luggage or clothes."
	},
	{
		"User": "Norberto",
		"Review": "Red Planet Davao is my home away from home. Thank you! Norberto David Jr."
	},
	{
		"User": "RUDOLF",
		"Review": "Security checks at the entrance are annoying but just let them handle it ... Air con goes only down to 22 Degree Celsius, too hot"
	},
	{
		"User": "Nikki",
		"Review": "Clean rooms"
	},
	{
		"User": "JANGHYUN",
		"Review": "a little far from down town, but very clean and good bed"
	},
	{
		"User": "Mary",
		"Review": "Normally I would regret heeding someone else' recommendation but this time I definitely did not regret it and am very thankful that I booked into Red Planet Davao. I felt very secured with the security functions that were in place. And yes, I will definitely book in this hotel again in my future travels into Davao. Thank you!"
	},
	{
		"User": "Geraline",
		"Review": "Second time in this hotel, happy to be back as staff are still very friendly and courteous especially to the security personnel downstairs. Quick check-in and check-out (late checkout was a plus). I love how clean and simple yet modern the room was. I only hope they would have an electric kettle inside the room but otherwise everything was good. Will definitely come back. "
	},
	{
		"User": "Anthony",
		"Review": "Staff at this hotel is the best. Fast and Reliable. Wifi signal a little on the \"medium\" side. Hot showers and clear rooms. Many restaurants near by. "
	},
	{
		"User": "Kimberly",
		"Review": "Very good location with hospital, banks and supermarket all within walking distance. Easy access to public transportation. Staff were very friendly and accommodating. Room was adequate for short stay. Bathroom could use some improvements so that the water from the shower stall do not flood the whole bathroom. Thin walls also meant hearing all the conversations of noisy neighbors at any time of the day / night. "
	},
	{
		"User": "Terry",
		"Review": "Have stayed in Red Planet hotels several locations and was very happy, not over priced and always clean. Oh yeah the big shower head gives me the best shower I've had in the Philippines."
	},
	{
		"User": "Nestor",
		"Review": "Good Location, Room is small but clean. Facilities are basics. Friendly and Kind staff. Beside of the hotel there's spa. Near SM Lanang."
	},
	{
		"User": "Andrea",
		"Review": "Very clean and friendly staff"
	},
	{
		"User": "Larry",
		"Review": "This hotel has started getting cheap since it changed from a Tune Hotel. On the upper floors the showers are starting to drain slower which allows water to back up. They stopped giving shampoo and soap in the rooms and put a container on the wall that pumps a liquid that is supposed to be both soap and shampoo and conditioner. There is no such thing as a soap/shampoo/conditioner. Since I am limited to what I can take with me when I fly.... this matters. The staff is still pretty good. The internet is still pretty good. They need an ice machine because there are no refrigerators in the rooms. I am in the process of looking for an alternative hotel."
	},
	{
		"User": "Terence",
		"Review": "This was our second stay at Red Planet for my girlfriend and me. The rooms are kept clean and tidy and the staff are friendly and efficient. The hotel is convenient for shopping malls and attractions. "
	},
	{
		"User": "Jimmie",
		"Review": "The room is small but very, very clean.. Staff are also accommodating and their location is near the malls (one jeepney ride)"
	},
	{
		"User": "Anthony",
		"Review": "Excellent and Value for Money a lot of restaurants in the area Clean and comfortable rooms good for 2 persons Wifi Strength is average but usable Staff are excellent in giving 5star service! keep it up! "
	},
	{
		"User": "Alexa",
		"Review": "Good "
	},
	{
		"User": "Mary",
		"Review": "We liked our stay and we recommend to friends going to Davao. It's an affordable quality stay."
	},
	{
		"User": "Darius",
		"Review": "Pros: Clean, friendly staff, Cons: no pool"
	},
	{
		"User": "Boyd",
		"Review": "Value for money but room its too smal"
	},
	{
		"User": "RUDOLF",
		"Review": "The best hotel in the Chain, except the security measures on the Ground Floor ar annoying"
	},
	{
		"User": "Claire",
		"Review": "Clean room. Good location. "
	},
	{
		"User": "Celso",
		"Review": "This is a no \"frill\" hotel as far as you room amenity is concerned. However, you'll be more than please with what they have in the room. The room is quite new (the whole building for that matter), very strong hot/cold shower. The room is tidy. It has air con and a ceiling fan- it really gets cold that we have to turn off the air con; the ceiling suffice. Don't expect a desk/table or even a single chair, no phone and that's pretty standard with the several red planet we stayed in. When it comes to front desk staff, the security, and all other workers there - I score them with high compliments. Public transportation is right there, and taxi is readily available. Next door is a Thai massage. Their rate is very competitive. Over all, I am a very happy camper. I highly recommend this hotel. "
	},
	{
		"User": "Larry",
		"Review": "Like to stop in for a nice hot shower, a comfortable bed and good Internet before I proceed on to the farm. Flight from JAX to IAH to NRT to MNL to DVO.....35 hours in airplanes and airports. "
	},
	{
		"User": "Sandy",
		"Review": "connecting...last flight to Davao: already informed ahead for a late check-IN ... my luggage still intact, sealed and un-opened from the airport, but still i have to open for routine check before entering the building. NO proper table/chair for the inspection. I was there standing, tired, sleepy, thirsty and hungry as i stooped down to expose my luggage. "
	},
	{
		"User": "Harlene",
		"Review": "Great hotel"
	},
	{
		"User": "Ameerah",
		"Review": "the place is near a convenience store, malls, and other places where we can eat"
	},
	{
		"User": "Ameerah",
		"Review": "Clean room, kind staff. :) I feel that i paid for what i've got."
	},
	{
		"User": "Emma",
		"Review": "Clean, comfy and sufficient, although lacking in some facilities. Would book again"
	},
	{
		"User": "shiela",
		"Review": "It's really clean... i like the bathroom it's updated... bed is so comfortable... probably will stay here again... I will recommend this hotel... "
	},
	{
		"User": "Marian",
		"Review": "The room was worth the Agoda rate. It was small with no amenities, but clean and in a good location."
	},
	{
		"User": "Mary",
		"Review": "Red Planet has become a fave hotel of hours. They are consistent wherever we go. Room may not be big, but space is enough to move around. Beds are comfortable enough to give a good night sleep after a long day of touring. Best part is that the price we pay is super worth. Wifi speed is quite fast. We're looking forward to stay at Red Planet in our next trips."
	},
	{
		"User": "Sarah",
		"Review": "Always stayed here. Will recommend to those only looking for a room to rest, shower, store their luggages while exploring. Strong WIFI in the rooms I gave stayed in. Supermarket few meters from this building. Easy transport and good security. "
	},
	{
		"User": "Euna",
		"Review": "the room was very clean. and the staffs were kind but the parking place was a little narrow.. totally satisfied.."
	},
	{
		"User": "Kim",
		"Review": "Clean and comfortable room. I will be nice if bottled water is provided."
	},
	{
		"User": "Mary",
		"Review": "Room is small, tiny. No fridge, no coffeemaker, no electric kettles. However, bed is very comfy, AC is super cold and shower is strong. I have the best rest in this hotel during my stay in PI. I will definitely go back to Red Planet hotel next time I visit Davao. "
	},
	{
		"User": "Ibrahim",
		"Review": "Very near the airport and sm lanang but far from downtown. One should know jeepney routes to save from taxi fares."
	},
	{
		"User": "vincent",
		"Review": "Comfy bed, shower and internet its ok, "
	},
	{
		"User": "Jesrel",
		"Review": "Rooms are real clean, staff and security are kind and accommodating. Linens are clean. location is good as it is near shopping malls. A bit of a problem for parking space though as this is kind of limited considering the number of rooms they have. Apart from this though, i'd say all other aspect is to my liking and affordability as an ordinary \"Juan\".."
	},
	{
		"User": "John",
		"Review": "Very clean hotel, easy to get transport, very safe and friendly hotel! Walking distance to the mall Thanks :)"
	},
	{
		"User": "John",
		"Review": "Always a good stay! Very clean, very safe, easy to get transport, walking distance to SM Lanang and robinsons. The staff are always happy and helpful :)"
	},
	{
		"User": "Susan",
		"Review": "Even if the room was small, the bed was comfortable and the shower had hot water. There were enough mirrors and the room was not dark. Location was great. I requested for a higher room but was not given one."
	},
	{
		"User": "Cynthia",
		"Review": "ideal location, value for money, clean, corteous staff"
	},
	{
		"User": "William",
		"Review": "The wifi does not work. Apparently it only works on the first floor. The staff does not care to move you either."
	},
	{
		"User": "Anthony",
		"Review": "Value for Money Hotel Shampoo dispenser have no content. First time it happened after staying numerous times Staff service is always A+"
	},
	{
		"User": "Brian",
		"Review": "A good basic hotel"
	},
	{
		"User": "rebekah",
		"Review": "Love the location. Is a simple hotel, providing shampoo and shower gel. My friend was not permitted to use her hair straightener and it was kept at reception. Wish they had complimentary water in the rooms and also a toothbrush and paste pack. Still all rooms are very clean and I would stay here again."
	},
	{
		"User": "Francisco",
		"Review": "*** "
	},
	{
		"User": "Edvel",
		"Review": "very clean room. cleaned daily. consistently powerful shower. very comfortable bed, pillows and beddings. very kind staff. Though the internet wifi is not so fast. "
	},
	{
		"User": "Thomas",
		"Review": "2nd time staying here, as usual good price, staff was very helpful with wake up call and breakfast for very early flight..Will stay again..."
	},
	{
		"User": "RUDOLF",
		"Review": "Still best located near airport and malls"
	},
	{
		"User": "christopher",
		"Review": "The hotel is noisy as it is all tile and concrete. The shower and bathroom are excellent but cramped. The bed was large,clean with soft pillows and great sheets,the room small. The A/c was good as was the tv. Reasonably well located between the airport and downtown,access to Jeepneys and taxis is good, supermarket nearby but lacking in decent restaurants close by. "
	},
	{
		"User": "Gian",
		"Review": "Just stayed overnight so the bed was crucial and it delivered! It was clean and the pillows were also perfect! Breakfast was kinda sad but they didn't charge a lot for that anyway. Will definitely stay here again for the same purpose!"
	},
	{
		"User": "Anthony",
		"Review": "Been staying here almost 2x a month. No frills budget hotel Clean rooms and excellent staff Near-by restaurants and places of interest make this hotel excellent choice."
	},
	{
		"User": "Retty",
		"Review": "Wonderful experience"
	},
	{
		"User": "Shaun",
		"Review": "They have a great system . Efficient and fast service. Clean rooms clean bathrooms. Bang for your buck ."
	},
	{
		"User": "CHARO",
		"Review": "Basic Hotel with value for money. Near SM Lanang"
	},
	{
		"User": "Angeli",
		"Review": "I think I will come back in the future! The staff were polite and kind even though we're locals. If you know what I mean. Well, yeah I'll come back."
	},
	{
		"User": "Paul",
		"Review": "."
	},
	{
		"User": "guia",
		"Review": "The hotel location is very near the Ayala mall area. Room is compact but highly functional and very clean. A bit crowded for a big person otherwise it is alright. There is a good cafe on the ground floor. Surrounding area was in construction mode so could be challenging during the day as you can see workers at window level. This is a good business hotel if you don't need to be in downtown."
	},
	{
		"User": "Emma",
		"Review": "would stay again"
	},
	{
		"User": "Edwin",
		"Review": "The hotel is very clean and organized but the rooms are very small. Overall, its good enough "
	},
	{
		"User": "Waldron",
		"Review": "Nice and friendly. Very small room though but gets the job done. Also didn't like how showers do not have doors to close."
	},
	{
		"User": "Ian",
		"Review": "Very nice place to stay"
	},
	{
		"User": "Claire",
		"Review": "Clean room and good location. "
	},
	{
		"User": "Kriste",
		"Review": "clean and affordable"
	},
	{
		"User": "eric",
		"Review": "Price should be 800-1000 only for that room, 1100php if with breakfast "
	},
	{
		"User": "RUDOLF",
		"Review": "Hightened security at the entrance is annoying"
	},
	{
		"User": "RUDOLF",
		"Review": "Clean and easy to reach"
	},
	{
		"User": "RUDOLF",
		"Review": "Security annoying but otherwise good for safety"
	},
	{
		"User": "Chin",
		"Review": "The hot water need to request from front desk, it is not so convenience of it. Prefer to have the heater in the room for own hot water preparation."
	},
	{
		"User": "Giovanni",
		"Review": "Clean Room. Nice comfortable bed. Kind Staff"
	},
	{
		"User": "ROZANNA",
		"Review": "Location is near the airport, malls & boat transfer to samal island. Although the room is small, it is clean and well kept. Real value for the money. "
	},
	{
		"User": "Sie",
		"Review": "need more trained receptionist staff..not friendly at all!!"
	},
	{
		"User": "Lorraine",
		"Review": "Clean, modern, relaxing, affordable. Room is small though, no cabinets, not enough space. But if you're travelling on a budget and want an elegant room, Red Planet is great. "
	},
	{
		"User": "annalyn",
		"Review": "Everything is good everything is new and clean but there is no telephone for the frontdesk this hotel is perfect for solo bussiness traveler but not for family vacation traveler"
	},
	{
		"User": "myra",
		"Review": "Clean and safe place to stay with food security staff.."
	},
	{
		"User": "Vincent",
		"Review": "along the highway and very near to SM Lanang Premier."
	},
	{
		"User": "Clarissa",
		"Review": "Red Planet is one of the worth staying hotel in Davao. It is pretty much near the airport and malls."
	},
	{
		"User": "Mark",
		"Review": "Hotel is near airport and malls"
	},
	{
		"User": "Elizabeth",
		"Review": "Clean and convenient. Close to the malls and reataurants."
	},
	{
		"User": "George",
		"Review": "Nice Hotel, only very few parking space."
	},
	{
		"User": "Jherome",
		"Review": "People are nice And accessible to all places!"
	},
	{
		"User": "Leriza",
		"Review": "Water supply and cleanliness is so good! "
	},
	{
		"User": "SHIRWIN",
		"Review": "They are more strict in bringing things inside such as beer, durian fruit . And langka. They don't have closet, and personal ref. And the room is small but clean and nice."
	},
	{
		"User": "J.",
		"Review": "all ok!"
	},
	{
		"User": "Pearly",
		"Review": "Great value for money. The location is very good and near to shopping malls. "
	},
	{
		"User": "Anthony",
		"Review": "Hotel is near points of interest (Restaurants, Malls) Clean Room Helpful staff and Security Rated 3Star on facilities as water pressure was on the low side...."
	},
	{
		"User": "sonny",
		"Review": "basic accommodation but good value for money. There is no fridge or iron but is clean and easily accessible. Will definitely be back "
	},
	{
		"User": "Marietta",
		"Review": "Secure"
	},
	{
		"User": "Chen",
		"Review": "good lacation "
	},
	{
		"User": "Gipeom",
		"Review": "Only 1 card per room So uncomfortable And stuppid staff many Not recommand here"
	},
	{
		"User": "Cheng",
		"Review": "Simple but good"
	},
	{
		"User": "John",
		"Review": "Just do what you're doing now, the place is really nice."
	},
	{
		"User": "ROSABELLA",
		"Review": "Best experience and staff are accommodating keep it up you guys are awesome I even told my friends when they will have their vacation too"
	},
	{
		"User": "FLOR",
		"Review": "If you want to go to Davao major destinations, this place is recommended Staff are very friendly and accomodating"
	},
	{
		"User": "ARIEL",
		"Review": "Nice accomodation, courteous staff"
	},
	{
		"User": "ARIEL",
		"Review": "Good location and great value of money, nice staffs"
	},
	{
		"User": "Sarah",
		"Review": "Pleased to be back to a clean room, with clean towels and made up bed in the evening after exploring the city 🌃 for the whole day. It is still fairly new building so everything works well, linens are still fluffy and smells fresh. Bed is comfortable to sleep in. I took a double bed and the space is just adequate for myself. This is not a place to entertain visitors in your room, its amenities is designed for comfortable night rest with consistent hot water system, airconditioning, safe locker, cable Tv and electrical adaptor/switch ready to charge 2 devices at a time unless one carries an extention cord. The restaurant downstairs can't cope with a deluge of guests arriving at the same time, but if you have booked a room with meals then come down earlier so you won't be late with your appointments. Otherwise, look for alternative options. Security has been tighter than it used to be with bag checks everytime you access the building. Parking is available. Will recommend&stay nxt"
	},
	{
		"User": "Anthony",
		"Review": "Value for Money Hotel is near restaurants, malls and other place of interest."
	},
	{
		"User": "Julito",
		"Review": "we are into Red Planet chain! <3"
	},
	{
		"User": "Terry",
		"Review": "I have stayed at Red Planet hotels a number of times in different locations and have always been very happy. They are clean and modern also the staff have always been good to deal with. "
	},
	{
		"User": "Larry",
		"Review": "I t is starting to show some signs of \"value construction \" like slow drains and they don't give out soap and shampoo like before but they are still cheap and clean."
	},
	{
		"User": "NORMA",
		"Review": "Good location"
	},
	{
		"User": "NORMA",
		"Review": "Served the purpose"
	},
	{
		"User": "Bethsaida",
		"Review": "The rooms are clean as well as the bathroom. It is a basic hotel that caters to budget travelers without compromising comfortability. The location is good because there are readily available public transportations just outside the hotel. Overall it was a nice experience. "
	},
	{
		"User": "Levie",
		"Review": "7/10 rating. Red planet is very clean and our room smells good all the time. The staff is very accommodating, nice, friendly and helpful (our human map). The hotel location is quite far from tourist spot, but near to all malls, airport and port (to Samal Island). I would appreciate if our room has a small table if we wanted to eat and electric kettle if we wanted to drink coffee or hot chocolate. The hotel is perfect for travelers whose always out. It is perfect for travelers whose always out and just wanted to sleep in the hotel. "
	},
	{
		"User": "Andrew",
		"Review": "small rooms but fair enough with the price, resto downstairs and very near the supermarket"
	},
	{
		"User": "Aileen",
		"Review": "Small rooms. Clean. "
	},
	{
		"User": "clyde",
		"Review": "Good internet, Good staff, Good rooms A+++ "
	},
	{
		"User": "Rodalee",
		"Review": "Aside from its location, all the basic things you need from a hotel is there. Clean, safe, and great service. I'd probably stay here again for a quick business trip."
	},
	{
		"User": "ann",
		"Review": "Comfortable bed, clean room, good aircon. Easily accessible to major transport. Near robinsons supermarket, sm lanang and abreeza"
	},
	{
		"User": "Conradine",
		"Review": "The place has a good location. The room is not that spacious but it's not a big deal since we are just there to sleep and roam around the city during the day. "
	},
	{
		"User": "Bianca",
		"Review": "Room was very clean but small. Barely any space to move around. Located along the highway so it's easy to get a cab. Staff were not so helpful - with carrying bags, etc. "
	},
	{
		"User": "MA",
		"Review": "Clean room, comfortable bed, polite and helpful staff."
	},
	{
		"User": "ellarita",
		"Review": "Truly recommend for tourist"
	},
	{
		"User": "Hatem",
		"Review": "Rooms are very small No phone in room No water Just clean and cheap "
	},
	{
		"User": "jennifer",
		"Review": "Great value for money, clean comfort rooms and beds. Staff will always assist you."
	},
	{
		"User": "Claire",
		"Review": "Nice location. Clean hotel. "
	},
	{
		"User": "Claire",
		"Review": "Clean room. "
	},
	{
		"User": "RUDOLF",
		"Review": "For the budget the place to be"
	},
	{
		"User": "Steffanie",
		"Review": "The room was smaller than expected."
	},
	{
		"User": "clyde",
		"Review": "Great staff, nice modern clean rooms, I will be back well done red planet hotel"
	},
	{
		"User": "Manuel",
		"Review": "... lack of amenities and fixtures inside the room. When I checked in, there's only one staff in the reception/frontdesk, and several guest waiting. The same thing when I checked out. I won't recommend the free breakfast too from this hotel. Taste is not that good and I'm disappointed with the quantity."
	},
	{
		"User": "Raymond",
		"Review": "Lots of noise at night. Room was very small...could barely move...unable to walk anywhere from that location"
	},
	{
		"User": "Joanna",
		"Review": "Its just few meters away from the mall, everything is accessible. There is a restaurant on the ground floor that serves good food in reasonable price and btw the bed is comfortable. "
	},
	{
		"User": "Vladimir",
		"Review": "As expected from Red Planet, the room is simple but nice bed and well-designed bathroom. A bit far from downtown but close to airport and SM Lanang. "
	},
	{
		"User": "MARK",
		"Review": "I like the location. The rooms were very clean with comfortable bed. The staffs were very accommodating. "
	},
	{
		"User": "Harlene",
		"Review": "good"
	},
	{
		"User": "Korina",
		"Review": "When Im in Davao I always stay here at Red Planet. Aside from the room price being reasonable, the rooms are very clean and the bed is comfortable. The staff is is awesome. "
	},
	{
		"User": "Claire",
		"Review": "nice location. clean hotel."
	},
	{
		"User": "Cheryl",
		"Review": "Clean and good location, but no phones in room and not much amenities"
	},
	{
		"User": "JENNIFER",
		"Review": "Budget friendly"
	},
	{
		"User": "BYRON",
		"Review": "My only comment would be the stains in my comforter and bed sheet. I mean they're just small spots though but I must say, I had my best sleep in this hotel."
	},
	{
		"User": "Ravalyn",
		"Review": "The location gives you access to almost all major routes in the city. Since it's a relatively new hotel, the facilities are in great condition. The bathroom, sheets and pillows are clean. Security was good too!"
	},
	{
		"User": "Cheng",
		"Review": "Simple and clean"
	},
	{
		"User": "RUDOLF",
		"Review": "Located superbly between SM Lanang and Abreeza."
	},
	{
		"User": "Anthony",
		"Review": "Location of the Hotel is near restaurants and malls. Price is very reasonable. Clean rooms "
	},
	{
		"User": "Edwin",
		"Review": "Same as my previous review"
	},
	{
		"User": "Edwin",
		"Review": "Everything is good about this hotel, cleanliness to rooms to pricing. Easy to get a cab too and only 15mins to the airport. 5 minutes to shopping mall. However, some of the staff have been excellent and some of them needs improvement. Probably its new and the staff have varying standards. Other than that, it is excellent place to stay. "
	},
	{
		"User": "jemelie",
		"Review": "nice hotel"
	},
	{
		"User": "Jeffrey",
		"Review": "Will be my hotel for our next Davao trip"
	},
	{
		"User": "JENNIFER",
		"Review": "Clean and new."
	},
	{
		"User": "Joelrey",
		"Review": "Good facilities. New "
	},
	{
		"User": "Julito",
		"Review": "We always use this hotel whenever we have seminars in Davao City located near the place. Near Robinsons and SM Lanang Premier and Abreeza. Will definitely go back."
	},
	{
		"User": "Johnson",
		"Review": "affordable rate"
	},
	{
		"User": "Mei",
		"Review": "Before we arrive at Davao City, we booked this hotel because we have an early flight to Cebu. I was planning to stay at the same hotel in Cebu but glad I didn't since I found way much better and cheaper than this hotel. But all in all, it was okay. Just not what I expected. Would appreciate if the room has more space and a closet. "
	},
	{
		"User": "Michael",
		"Review": "My first stay at a Red Planet hotel, the Davao branch had an excellent location, along J.P Laurel Ave which houses many of the major shopping complexes. Public transportation was available kerbside (taxis or PUV). The public areas of the hotel were clean and well maintained. The rooms themselves were compact but also kept neat and tidy. My room had twin beds, flatscreen tv, a safe and an area where clothes could be hung. A small fold out table was also available where you could house a netbook/laptop. The bathroom had good lighting and a good strong hot water system. The wifi connection was of a high standard with no interuptions. The one downside was that the AC control was built into the main electrical panel located at the entrance. A remote control would of been more handy for mobility. Overall I think this is a fantastic budget hotel and I would stay there again in future travels."
	},
	{
		"User": "Malcolm",
		"Review": "Close to SM and for the price you can't beat it"
	},
	{
		"User": "harrison",
		"Review": "nice hotel, clean, good location"
	},
	{
		"User": "Ignacio",
		"Review": "Nice"
	},
	{
		"User": "Michelle",
		"Review": "Satisfied with my stay. Kind staff and security."
	},
	{
		"User": "alvira",
		"Review": "davao branch service not as good as other red planet hotels "
	},
	{
		"User": "Karen",
		"Review": "I like this hotel to be honest, I would recommend this to my friends. The location is quite a plus. Friendly staff and quick response to our requests. The downsides of this hotel are there are bed bugs and we got bites and we think they did not change the sheets. There was also no electric kettle available so you have to request every time you need hot water for coffee or tea. "
	},
	{
		"User": "Gregory",
		"Review": "It was Great to Have arrived,after Two Delayed Flights from Sydney and Manila.The Reception Staff are Always professional, at these Red Planet Hotels.The views out of my Room+in the Corridor windows was excellent.I like the Ceiling Fans in all of These Hotels.\"I\",Rarely use the Aircon,;in these Hotels!.The Two Girls at the Reception Counter Really appreciated my Gift of a Stuffed Kangaroo Each!."
	},
	{
		"User": "MICHELLE",
		"Review": "It's great alternative to expensive 3 stars and up hotels. The rooms are clean and pillows and mattress so clean white and fluffy. The restaurant downstairs serves delectable dishes. The staff are accommodating and helpful."
	},
	{
		"User": "Ma",
		"Review": "Nice place and staff but no available Telephone inside the room."
	},
	{
		"User": "Anthony",
		"Review": "Room are adequate, clean. Staff are sincere and helpful. very near to supermarket, restaurants. "
	},
	{
		"User": "Anthony",
		"Review": "The Breakfast menu some food not available.... The staff in red planet restaurant the face 😔..... "
	},
	{
		"User": "Sergio",
		"Review": "Worth it. "
	},
	{
		"User": "MARIA",
		"Review": "Recommended"
	},
	{
		"User": "AGNES",
		"Review": "Hard to call for staff"
	},
	{
		"User": "Fairly",
		"Review": "No cabinets and keetle in the room. These are just basic needs of travellers."
	},
	{
		"User": "Anthony",
		"Review": "Value for Money Hotel Stay in Davao Clean Rooms, Queen Size Bed, Great Location with local restaurants near by... "
	},
	{
		"User": "Anthony",
		"Review": "Value for Money Hotel Stay in Davao Clean Rooms, Queen Size Bed, Great Location with local restaurants near by... "
	},
	{
		"User": "Anthony",
		"Review": "Value for Money Hotel Stay in Davao Clean Rooms, Queen Size Bed, Great Location with local restaurants near by... "
	},
	{
		"User": "Brian",
		"Review": "GREAT VALUE"
	},
	{
		"User": "Aimee",
		"Review": "My sister, mom and I had a comfortable stay at this hotel. Everything about our stay went fine."
	},
	{
		"User": "Terry",
		"Review": "all good except tv reception wasn't the best and it froze every now and then."
	},
	{
		"User": "RUDOLF",
		"Review": "Never disappointed by red planet davao"
	},
	{
		"User": "Bobby",
		"Review": "Nice staff, clean room and we love the shower facility.. "
	},
	{
		"User": "john",
		"Review": "i have been staying in Tune hotel davao until it becomes redplanet davao, but the management doesnt even give me a steady or protection rate everytime i check-in your hotel. pls do something about this. im john ngo of butuan city. tnx"
	},
	{
		"User": "Gisselle",
		"Review": "rooms were clean but a bit small. near shopping but quite far from city proper. staff were friendly and accomodating. but will come back again"
	},
	{
		"User": "katherine",
		"Review": "Clean rooms, with parking lot and good breakfast"
	},
	{
		"User": "katherine",
		"Review": "Affordable rate with free breakfast. WIFI is available."
	},
	{
		"User": "Nikki",
		"Review": "Excellent Rooms and Services"
	},
	{
		"User": "Janica",
		"Review": "would love to come back!"
	},
	{
		"User": "Janica",
		"Review": "Great hotel, perfect for vacation in Davao"
	},
	{
		"User": "Hendra",
		"Review": "Everything good about the hotel. The security guard doing their job nicely and no complaint so far."
	},
	{
		"User": "Thomas",
		"Review": "Will stay there again, highly recommend. .."
	},
	{
		"User": "Claire",
		"Review": "it's a nice hotel with clean rooms."
	},
	{
		"User": "Brendon",
		"Review": "our stay with the hotel is super relaxing.amenities were all clean and organized. will stay there again for sure."
	},
	{
		"User": "Arthur",
		"Review": "Staff especially Manongnguard and the bellboys went out of their ways to assist us; be it in hailing a bigger cab or helping us store our fruits!"
	},
	{
		"User": "Abdel",
		"Review": "Good location. "
	},
	{
		"User": "jessa",
		"Review": "The location is near in sm lanang"
	},
	{
		"User": "ARIEL",
		"Review": "Good location , value for money"
	},
	{
		"User": "karen",
		"Review": "Good service,clean room and linens everyday..Honest housekeeping staff.I forgot my diamond ring on top of the table,came back at night the room was already cleaned up and my ring was still there untouched! Hopefully you can place a small area in the lobby where travellers can get hot water for drinking,since no electric kettle in the room.Like for me i travel with my kid and she still drink warm milk."
	},
	{
		"User": "Michael",
		"Review": "Red Planet CDO"
	},
	{
		"User": "Paul",
		"Review": "No one to help with luggage ! My wife was alone with 5 bags and no one on staff to help with her bags...."
	},
	{
		"User": "Giovanni",
		"Review": "All Red Planet Hotels around the world are the same and this is what I love. The beds are comfy. Location is always good."
	},
	{
		"User": "LAWRENCE",
		"Review": "I was delighted and pleased. =)"
	},
	{
		"User": "Rowence",
		"Review": "It was a nice stay. Friendly staff and very helpful. "
	},
	{
		"User": "Glenn",
		"Review": "The breakfast deal was perfect. "
	},
	{
		"User": "Helen",
		"Review": "The room is very small, no amenities like coffee and bottled water. The service was very basic and the breakfast is disappointing for a price likevthis compared to other hotels of this kind..."
	},
	{
		"User": "SUSUMU",
		"Review": "If you stay 1-2nights,this hotel is recommendable. Big shopping center(Robinson) is walking distance and massage shop is next to hotel. "
	},
	{
		"User": "evangelina",
		"Review": "Very clean we will be back again"
	},
	{
		"User": "Claire",
		"Review": "the hotel is clean, the staff is nice."
	},
	{
		"User": "Cynthia",
		"Review": "Good Place for traveller, comfy bathrooms and bed"
	},
	{
		"User": "상현",
		"Review": "i'm satisfied with this hotel "
	},
	{
		"User": "Luzviminda",
		"Review": "We asked the girl in front desk to check our safe as it was left the door open but the code for locked is on so we cannot use it. So she told us she will send someone, and we keep waiting for 2 hours no one came. So we message them through their app. And then she apologize telling the person in charge for maintenance is not around. She could have tell us that after few minutes not after hours!!. Then she rush to fix it. How hard it can be if she can also do it at the end after telling her we miss our dinner as we keep waiting."
	},
	{
		"User": "ma",
		"Review": "Check in and check out was a breeze. It would take longer for a person to cross the hall to the seats and walk back to the counter than it would to check in or check out. The bed is comfy but the room is pretty cramp and has no closet to stash away your things. No coffee or tea facilities or toothbrush kit. Shampoo, conditioner and body wash are 3-in-1, so better bring your own. There's a hair dryer beside the floor length mirror. No telephone inside the room but there's one mounted by the elevator. There's a mobile phone app that you can download for easy access to the front desk. Your booking should appear in the app once you have registered. I don't know why mine didn't though. Cable TV channels are limited, many of which are religious. Free extra pillows may be requested. Shower pressure is fantastic. Only that water tends to spread to the lavatory area because there's no door on the shower cubicle. Our room was on the 4th floor facing the main road. But for the occasional ambulance sirens, there was no traffic noise. Staff are friendly, very efficient and helpful. The doorman and security guard will get you a taxi in no time. Café is situated outside the hotel entrance. Breakfast consists of the usual set menu - Filipino, American or Continental. If your room does not come with free breakfast, you may order other food. The prices are reasonable and the food is quite good. There's a pizzeria nearby for light fare. Next to the hotel building is a massage and spa center convenient to the weary traveler. The hotel is situated in the Lanang area, a little out of the way from the poblacion district. Taxi from the airport to the hotel was Php350 by arrangement, more than double the meter rate. From the hotel to the airport, meter rate was less than Php120. Most taxi drivers give exact change so if you wish to give some tip but not much, just say the amount of change they should return if you're giving a bigger bill that the meter fare. All in all, I was sa"
	},
	{
		"User": "Susan",
		"Review": "Loved the crisp trendy feel. Booking went smoothly. Everything worked. Staff were helpful and efficient. Great place to stay while visiting Davao."
	},
	{
		"User": "Susan",
		"Review": "Clean, quiet rooms and efficient, helpful staff made for an easy stay. Easy to grab a taxi to get around the city. Convenient."
	},
	{
		"User": "Shauming",
		"Review": "The bed and mattress just too soft for , not friendly for those who has back problem like me😢😢😢"
	},
	{
		"User": "Benhur",
		"Review": "Red Planet Davao is really clean and conveniently located."
	},
	{
		"User": "AILYN",
		"Review": "The room is si clean :) the staffs are friendly. The place is very near in malls and airport. :)"
	},
	{
		"User": "joy",
		"Review": "great place and nice location"
	},
	{
		"User": "Flourgel",
		"Review": "The hotel has no water kettle which is important early morning, you need to go outside to drink hot tea, coffee or breakfast. The rest all fine. I like the security guards politeness. "
	},
	{
		"User": "WILLIAM",
		"Review": "Great price very clean hotel i love it."
	},
	{
		"User": "Caryl",
		"Review": "Booked for 4 nights. On the 2nd night, we had a problem on the flush of the toilet. The transfered us into a new room. Quick response and very efficient! Thanks..."
	},
	{
		"User": "julian",
		"Review": "In general OK but the rooms are just too small. OK for one at a push two nights "
	},
	{
		"User": "julian",
		"Review": "The place is good but the rooms are just too small, ok for one, at a push two nights "
	},
	{
		"User": "Adeliza",
		"Review": "Nice hotel and very accomdating staff"
	},
	{
		"User": "Bella",
		"Review": "Friendly and Efficient Hotel & Security Staff clean rooms"
	},
	{
		"User": "Renato",
		"Review": "I found the perfect place for me to stay! Just about the right place hotel to stay in Davao, not pricey , small rooms but enough for a good night rest. The staff are courteous , friendly and prompt to your needs. Above all safe with guards 24/ in the lobby and entrance. "
	},
	{
		"User": "Sarah",
		"Review": "it is clean and the staffs are accomodating it is also very accessible..👍"
	},
	{
		"User": "Johanna",
		"Review": "The hotel's location was convenient, in that it's near the places we had to go to. The rooms were a bit small but served their purpose, which is to provide comfortable sleep. Clean rooms."
	},
	{
		"User": "RUDOLF",
		"Review": "Enjoy my stay every time i m in Davao"
	},
	{
		"User": "Marie",
		"Review": "Gives value for money for business travelers; very comfortable"
	},
	{
		"User": "Marivic",
		"Review": "Very Clean and good customer service."
	},
	{
		"User": "Foon",
		"Review": "The room is clean and staff are friendly, wifi is ok! The only disadvantage is no kettle in the room so you cannot drink hot water in the room! "
	},
	{
		"User": "rodel",
		"Review": "Very good"
	},
	{
		"User": "Jude",
		"Review": "This Red Planet Hotel branch in Davao is just like the other Red Planet Hotels I have been to. Excellently clean!"
	},
	{
		"User": "Noel",
		"Review": "It is not so expensive enough to have a safe, clean, accessible hotel. The staff are all courteous, smiling, greeting and helpful."
	},
	{
		"User": "Harlene",
		"Review": "ok"
	},
	{
		"User": "Mary",
		"Review": "We had a comfortable stay. The Internet was really fast! The room was basic but was very clean. Breakfast was good too! Robinsons was walking distance and SM was minutes away. "
	},
	{
		"User": "alan",
		"Review": "Red planet is always my first choice hotel as it combines great value for money and comfort"
	},
	{
		"User": "cherry",
		"Review": "Value for money. Great location"
	},
	{
		"User": "EFRAIM",
		"Review": "No telephone inside the room so inconvenient to contact."
	},
	{
		"User": "Toni",
		"Review": "Modern and basic. Breakfast option not remarkable but affordable."
	},
	{
		"User": "Tiffany",
		"Review": "The beds were very comfortable, and the plCe was very very clean. It was quite small though, but since we only needed a place to sleep it was more than enough for ys"
	},
	{
		"User": "Nesen",
		"Review": "It was a really a good place to stay. I was there for 4 days and I'm really satisfied with the services and facilities. Easy to get public transport "
	},
	{
		"User": "Jose",
		"Review": "The hotel was very good except that they're periodically switching the AC and TV off and they have to wait for the guest to call to switch it back on."
	},
	{
		"User": "Anthony",
		"Review": "Clean, Budget friendly hotel. Plus side is their friendly and efficient staff. "
	},
	{
		"User": "Maria",
		"Review": "Free Bottled water per room "
	},
	{
		"User": "Ivy",
		"Review": "it's really value for money. Though the room is quite small but it's comfortable. And you don't need to pay for extra pillows. The bed is beyond what i expected. "
	},
	{
		"User": "mara",
		"Review": "Very good for the price "
	},
	{
		"User": "Maria",
		"Review": "Free Bottled water Bar soap not liquid 3in one. Soap"
	},
	{
		"User": "Maria",
		"Review": "No bottled water as welcome drink"
	},
	{
		"User": "Nini",
		"Review": "Great values for money"
	},
	{
		"User": "Richard",
		"Review": "Clean and fast internet. The price is worthy. Security is good. Check in is fast and easy. I will surely comeback."
	},
	{
		"User": "Cerilo",
		"Review": "one of my favorite hotel in Davao, affordable and very accessible. "
	},
	{
		"User": "bert",
		"Review": "frontdesk very OK"
	},
	{
		"User": "John",
		"Review": "Near the airport but far from City Center (due to traffic) . .. a great 24 hour Fast Food is just 5 minutes away . .. JOLLIBEE . .. "
	},
	{
		"User": "John",
		"Review": "Near the Airport by away from the City Center (due to traffic) otherwise the best of the lot."
	},
	{
		"User": "Agnes",
		"Review": "I'm impressed with the hotel's cleanliness and affordability. Suits everyone's budget. Friendly and very accommodating staff. "
	},
	{
		"User": "leah",
		"Review": "Friendly staff, courteous and well accomodating.. Fast response for our request.. Clean room (even without asking for room service, its automatic for them to clean the room) thou small space, im hoping for bigger space for my next visit.. Accesssible to public places.. Hoping for pool facility in other branch even in davao branch..👍🏻👍🏻👍🏻👍🏻👍🏻"
	},
	{
		"User": "Kenneth",
		"Review": "Our five-night stay in this hotel was the best I've ever had of any hotel in Davao. The staff was very accommodating and helpful, and the housekeeping staff was prompt in fixing up our room while we were away for the day. The washroom was incredibly clean and the hotel had excellent water pressure. Although the rooms are quite small, this is compensated by the excellent airconditioning and the humongous mirror which spans half the length of the room (above the headboard). The free breakfast (Filipino cuisine) provided actually seemed like a full-fledged lunch for most people as the servings are incredibly generous. The only problem I have is that the room does not contain the expected list of the TV channels which is often available in other comparable hotels. You have to channel surf through dozens of channels before finding the one you desire. "
	},
	{
		"User": "hsinchang",
		"Review": "near mall is most important"
	},
	{
		"User": "BOKYOUNG",
		"Review": "Lots of malls in the walking distance"
	},
	{
		"User": "DAN",
		"Review": "It's clean and located in a main road. Easy to find and known by cab drivers. Staff are great and always greet you with a smile. "
	},
	{
		"User": "Jason",
		"Review": "Great little escape from the noise and heat outside. Restaurant underneath nice as well"
	},
	{
		"User": "joey",
		"Review": "nice personnel"
	},
	{
		"User": "Shela",
		"Review": "comfortable stay... "
	},
	{
		"User": "ARIEL",
		"Review": "Great value for money"
	},
	{
		"User": "Zennia",
		"Review": "Comfy stay. One of the twin beds are roomy enough for 1 adult and small kid. Note though that jackfruit, marang and durian are not allowed in the hotel."
	},
	{
		"User": "Zennia",
		"Review": "Red planet delivers. Rooms are exactly as advertised. Aircon works well and it even has a celing fan. There's not a lot of restaurants around though. But there are a few within a block or 2 away. The front desk officers may not be the warmest, but they deliver what us needed. We're happy customers and will definitely recommend this to our friends"
	},
	{
		"User": "Mae",
		"Review": "near airport and nice location"
	},
	{
		"User": "Emo",
		"Review": "Staff is always good and location is convenient. I do have two matters I want to address: 1) the aircon in the elevator is off more often than not; 2) Why did Agoda stop issuing receipts online?"
	},
	{
		"User": "Emo",
		"Review": "Always enjoyed the stay because of the convenience of location."
	},
	{
		"User": "Emo",
		"Review": "Great shower pressure as always. And appreciate the good staff."
	},
	{
		"User": "Emo",
		"Review": "As usual, we find the staff to be very courteous and always helpful. This is one constant we value highly at Red Planet."
	},
	{
		"User": "hsinchang",
		"Review": "near lanang SM, easy to go to airport, near Abrezza"
	},
	{
		"User": "Yves",
		"Review": "Doors seems to be difficult to handle. Bathroom to bedroom floor gap, is a bit dangerous to elderly. "
	},
	{
		"User": "JI",
		"Review": "!!"
	},
	{
		"User": "Cherry",
		"Review": "No intercom for rooms. You have to go to the lobby for everything you need. No complimentary toiletries. Limited parking space. Courteous staff though. "
	},
	{
		"User": "Paul",
		"Review": "You arrive and everything works. WiFi, everything. Very professional. Bed a little soft of me but maybe others like it "
	},
	{
		"User": "Elmer",
		"Review": "Great Hotel"
	},
	{
		"User": "katrina",
		"Review": "Inexpensive yet has good service. Nice location, walking distance from malls and restaurants. Staff are nice and easy to talk to. The guard even gave us a lot of info about where to go and how to get to those places. The room is small but is really clean."
	},
	{
		"User": "Branimir",
		"Review": "The exhaust fan was not working, the door was so hard to opened. The rooms are so small. I was shock that the soap in the bathroom are 3 n 1! I never experienced like that! They don't have hand towels. The staffs & guards are ok, "
	},
	{
		"User": "Wolfgang",
		"Review": "As already seen in other Red Planet hotels in Philippines, the Red Planet in Davao offers the same standards: small but clean rooms, very comfortable bed, efficient and quiet aircon, free wifi on the rooms, safety box, cable TV, excellent shower, secure accomodation... Hotel staff was very friendly. The location of the hotel is not totally perfect, if you don't have a car. But at least a Robinson's supermarket is just around the corner, 3 minutes walk. But taking a ride with taxi or jeepney anywhere is quite easy, since many of them are passing by the hotel on J.P. Laurel Ave, which is one of the main roads in Davao city. Taking a ride to Abreeza Mall or to SM Lanang takes about 5 minutes by taxi, getting to the airport takes approx. 20 minutes. "
	},
	{
		"User": "Danielle",
		"Review": "Nice hotel. Good location. Comfortable bed and pillows. Friendly staff especially the security, always smiling"
	},
	{
		"User": "Joseph",
		"Review": "Impressive staff. Great location and price. "
	},
	{
		"User": "young",
		"Review": "Rest room of cafeteria was too dirty "
	},
	{
		"User": "Mildred",
		"Review": "Excellent...!!!"
	},
	{
		"User": "Jimminee",
		"Review": "value for money"
	},
	{
		"User": "Bea",
		"Review": "Booked this for my cousin and she said she's very happy and satisfiied with the service and the accommodation. The room is clean and new with great service. She said the value for money is very reasonable and satisfying. She would definitely go back to this hotel again and would recommend to her friends."
	},
	{
		"User": "Janice",
		"Review": "5 mins walk from robinsons supermarket. 5 mins taxi ride to sm lanang and penongs; 20 mins taxi ride from airport. Wifi very satisfactory. Staff very accomodating.i love the strong shower. A/C gets cool quickly. Definitely staying there again when i return to davao"
	},
	{
		"User": "Annabelle",
		"Review": "Affordable and clean. Will be coming back."
	},
	{
		"User": "Ramon",
		"Review": "They also have a smartphone app that lets you chat with front desk. The events and places are a bit out of date, though because they rely on an external service. Awkwardly located between Abreeza and SM Lanang. Although walkable, very uncomfortable under the summer heat."
	},
	{
		"User": "Benralph",
		"Review": "Great Stay!"
	},
	{
		"User": "eugene",
		"Review": "as always had a pleasant stay at red. from front desk friendly accompanying staffs to the guard getting me cab way airport.. thanks guys n keep up good job"
	},
	{
		"User": "Claire",
		"Review": "It is a clean hotel. Our staff always stay at this hotel whenever they visit Davao."
	},
	{
		"User": "Russil",
		"Review": "."
	},
	{
		"User": "NORMA",
		"Review": "Nice"
	},
	{
		"User": "Jerome",
		"Review": "Loved the location and the room itself. clean and looks great."
	},
	{
		"User": "Emo",
		"Review": "I had a good stay. However, I do not like the new Agoda policy RE not sending vouchers and receipts anymore. This has been a source of unnecessary tension between me and the hotel's staff when checking in. The hotel staff does not know that Agoda has stopped issuing vouchers and they continue to insist on presenting them a voucher. Also, I don't like paper copies of my receipts. I keep all my receipts for business travel in electronic form. So, I am not a fan with this new change in your policy. I do not like my booking being forwarded to booking.com where I have no access to the site as I refuse to open an acct with them. I'm not a happy camper right now. And I've been a loyal customer. SMH"
	},
	{
		"User": "Sergio",
		"Review": "Clean and good service"
	},
	{
		"User": "Emo",
		"Review": "Red Planet Davao is always an enjoyable stay for me. Staff is always good and friendly. For a minimalist hotel experience, this is most likely as good as it gets. But no complaints! "
	},
	{
		"User": "Emo",
		"Review": "Always felt good staying at Red Panet Davao. Food, leisure establishments are nearby. My only complain, which is very rare, is that I find that when I return to my room around mid-afternoon after meetings with colleagues, the room hadn't been cleaned yet. This has happened a couple of times in my recent stay. I hate complaining because there's hardly anything to complain RE service at Red Planet Davao but it adds unneeded stress."
	},
	{
		"User": "Maria",
		"Review": "Nice place to stay "
	},
	{
		"User": "john",
		"Review": "hotel staff specially the security personnel are courteous and accommodating."
	},
	{
		"User": "Elmar",
		"Review": "the room was very small for 2 people"
	},
	{
		"User": "edsel",
		"Review": "Best internet connection but poor cable reception. Change to cignalnfor better signal, clear, hd and crisp sounds"
	},
	{
		"User": "Randy",
		"Review": "Very pleasant and relaxing hotel"
	},
	{
		"User": "Bonn",
		"Review": "Easy to find and location is near good establishments. Small room but comfortable and clean. Pillow is also great. Bathroom is basic but Clean. Overall good stay. I would stay again. "
	},
	{
		"User": "steven",
		"Review": "Small rooms. But modern and walking distance to 2 malls"
	},
	{
		"User": "steven",
		"Review": "Small rooms but perfect for me"
	},
	{
		"User": "RUDOLF",
		"Review": "Friendly staff as always and i like the location."
	},
	{
		"User": "steven",
		"Review": "Clean n modern. Good price"
	},
	{
		"User": "Betty",
		"Review": "Family were happy with the accommodation. "
	},
	{
		"User": "jovensyl",
		"Review": "Clean and comfortly good, internet connection is strong. Downside only is they dont have toiletries set."
	},
	{
		"User": "Emo",
		"Review": "I've always enjoyed using your facility. It's convenient and its simplicity is its asset. It's also clean. The staff is very commendable."
	},
	{
		"User": "Emo",
		"Review": "I've always enjoyed using your facility. It's convenient and its simplicity is its asset. It's also clean. The staff is very commendable."
	},
	{
		"User": "Emo",
		"Review": "I've always enjoyed using your facility. It's convenient and its simplicity is its asset. It's also clean. The staff is very commendable."
	},
	{
		"User": "Emo",
		"Review": "I've always enjoyed using your facility. It's convenient and its simplicity is its asset. It's also clean. The staff is very commendable."
	},
	{
		"User": "Emo",
		"Review": "I've always enjoyed using your facility. It's convenient and its simplicity is its asset. It's also clean. The staff is very commendable."
	},
	{
		"User": "Emo",
		"Review": "I've always enjoyed using your facility. It's convenient and its simplicity is its asset. It's also clean. The staff is very commendable."
	},
	{
		"User": "Emo",
		"Review": "I've always enjoyed the simplicity of staying in this hotel. Very good value for my money. Staff is great!!!"
	},
	{
		"User": "COLIN",
		"Review": "Stayed here 4 nights in April. As with all Air Asia/Tune/Red hotels they offer an excellent stay for those who are budget conscious. The rooms have all the essentials : Cleanliness, air con, security, cable tv, fast free in room wi-fi for up to three devices, safe box. Bur what puts this hotel in a league of its own is the fantastic rain shower with excellent hot and cold water pressure."
	},
	{
		"User": "Allan",
		"Review": "Rooms were clean, bed was very comfortable, location was not far from town, staff were very friendly and helpful. Overall it was a very satisfying experience."
	},
	{
		"User": "Jeanette",
		"Review": "Nice bed and value for money though room is a bit small"
	},
	{
		"User": "Nino",
		"Review": "No toiletries. :("
	},
	{
		"User": "Sheriven",
		"Review": "Nice hotel, nice location & friendly staff"
	},
	{
		"User": "Maria",
		"Review": "Staff are friendly, responsive. Automatically do room service in the afternoon. Complete except our room (economy room) lacked the refrigerator. But all else were good. Even has a hair dryer. Exhaust in the bathroom smelled fishy at a time but was given action by the staff. If you would like to contact the receptionist from the room, you need to use their app (which was cool) but of course you need a phone which can download one bec there's no phone in the room."
	},
	{
		"User": "steven",
		"Review": "Always stay at red planet. Know wat ur gonna get"
	},
	{
		"User": "Ruby",
		"Review": "\r Price,comfort and clean"
	},
	{
		"User": "Czarinah",
		"Review": "\r Clean room, kind staff and security"
	},
	{
		"User": "Percival",
		"Review": "a"
	},
	{
		"User": "steven",
		"Review": "Clean. Modern. Good wifi. Good location. "
	},
	{
		"User": "Wilbert",
		"Review": "Small budget room with modern interiors. No frills. Just the basics. Bring your own toothbrush, though. Clean overall but I found stains on the towel. Staff is very helpful. Lots of taxis outside. Not bad for the price we paid. The restaurant downstairs is nothing to rave about. Just eat somewhere else. The city has plenty of good restaurants."
	},
	{
		"User": "Ihna",
		"Review": "Clean and quiet. Split type aircon, no noise"
	},
	{
		"User": "Patricia",
		"Review": "I always get excited when I find hotels that is affordable but provides a pleasant stay. Overall, the hotel was nice... it is located in a strategic location, they have complete amenities (inc. hairdryer). However, I just had an issue with the drainage in the shower and some stains in the sheets. Other than that, the hotel is still worth coming back to... I hope that I will have a better experience."
	},
	{
		"User": "Glenrose",
		"Review": "\r Location, cleanliness, friendly staff"
	},
	{
		"User": "Valeria",
		"Review": "\r Location, clean and convenient"
	},
	{
		"User": "Jaysun",
		"Review": "\r Location very accessable"
	},
	{
		"User": "Mae",
		"Review": "\r cleanliness, amenities, accessibility to nearest malls"
	},
	{
		"User": "Roberto",
		"Review": "\r Location, Affordable, Cleanliness"
	},
	{
		"User": "Peter",
		"Review": "Nice bed good air-conditioning nice shower. Can't fault it, very good value for money "
	},
	{
		"User": "Christine",
		"Review": "We were 3 of us in the group including 1 senior citizen. Upon booking, i requested to get a very accessible room near the elevator and the staffs were very nice to give us a room near the elevator. The room was super clean and nice. Bathroom was clean and has good space. The only problem is that there were no door for the shower area and the bathroom door is frosted glass door which means that after shower (naked) if we get any closer to the door, people in the room can see you naked in a blurred vision. There were no toiletries except for tissue papers so you really have to bring your own stuffs. Towels were clean and the bed was super comfortable. I would definitely stay in this hotel again when I visit Davao. "
	},
	{
		"User": "John",
		"Review": "good location and friendly staff. lots of spas around the hotel"
	},
	{
		"User": "Fe",
		"Review": "The Red Planet hotel is a very good hotel, very easy to check in, staff are helpful. What i liked in my room is the cleanliness,loved the bed, love the interior, love the toilet and bathroom coz' it is very clean. I'm hoping that they will put water dispenser in every floor to cater for the occupants in absence of refrigerator in each room. but overall, i will still book in this hotel."
	},
	{
		"User": "ARIEL",
		"Review": "Great location and comfort"
	},
	{
		"User": "Stephanie",
		"Review": "The area was really clean and nice. I just think that the bathroom needs to have cups 😊"
	},
	{
		"User": "RAFAEL",
		"Review": "We always look forward to every stay at Red Planet Davao. The place is always fresh. rooms are clean and staff are corteous. Red Planet Davao is different from other Red Planet Hotels we have stayed.,no smoking allowed in all rooms. we always consider Red Planet everytime we have a business or personal trip in Davao City"
	},
	{
		"User": "GANGULY",
		"Review": "\r LOCATION, ROOM COMFORT & BEST VALUE FOR MONEY"
	},
	{
		"User": "Jesus",
		"Review": "Value for money "
	},
	{
		"User": "aldrin",
		"Review": "\r Location, cleanliness and convenience"
	},
	{
		"User": "Eric",
		"Review": "\r price, location, staff"
	},
	{
		"User": "Ligaya",
		"Review": "Clean and accessible anywhere to go and value for money"
	},
	{
		"User": "Anthony",
		"Review": "If you want a no frills hotel. Convenient located in the City. Clean Comfortable and Budget Friendly"
	},
	{
		"User": "maia",
		"Review": "clean, accessible, accomodating staff"
	},
	{
		"User": "Maureen",
		"Review": "\r Best location very near in SM lanang."
	},
	{
		"User": "Ali",
		"Review": "\r Very clean, New, and new clean towels"
	},
	{
		"User": "Kristine",
		"Review": "Basic amenities, comfortable bed, clean room, bathroom cleanliness from a scale of 1 to 5 is 3 needs improvement, located near shopping malls, easy access to transportation. Overall good. "
	},
	{
		"User": "Kristine",
		"Review": "Basic amenities, comfortable bed, clean room, bathroom cleanliness from a scale of 1 to 5 is 3 needs improvement, located near shopping malls, easy access to transportation. Overall good. "
	},
	{
		"User": "Maureen",
		"Review": "LOcation is good but the price is too expensive for the room space. Rooms are very small. Barely no room to put stuff."
	},
	{
		"User": "Clarissa",
		"Review": "\r Accessible to airport, value for money, clean room"
	},
	{
		"User": "Clarissa",
		"Review": "\r Accessible, near airport, value for money"
	},
	{
		"User": "Davey",
		"Review": "Red Planet is a good place to stay. So clean and cozy. "
	},
	{
		"User": "Bert",
		"Review": "Clean,new building. Friendly staff "
	},
	{
		"User": "Danilo",
		"Review": "\r Cleanliness Staff Locational "
	},
	{
		"User": "Brian",
		"Review": "Very small rooms but if you're OK with that to great hotel very clean nice hot shower and very very comfortable bed. All the staff deserves five stars"
	},
	{
		"User": "Salem",
		"Review": "\r Location, clean, friendly staff"
	},
	{
		"User": "Salem",
		"Review": "\r clean, good staff"
	},
	{
		"User": "Angelica",
		"Review": "One of the cheap but well maintained hotel.. Location is good and service was excellent.. The only downfall is that they don't allow us late checkouts even if we booked 3 rooms but only used 2 rooms because 2 of our friends weren't able to join us due to some medical/personal issues.."
	},
	{
		"User": "Angelica",
		"Review": "One of the cheap but well maintained hotel.. Location is good and service was excellent.. The only downfall is that they don't allow us late checkouts even if we booked 3 rooms but only used 2 rooms because 2 of our friends weren't able to join us due to some medical/personal issues.."
	},
	{
		"User": "Richard",
		"Review": "\r 1. hospitable 2. good greetings 3. good service"
	},
	{
		"User": "Mitchell",
		"Review": "My stay here is worth the price. Comfortable, and clean. Short distance to malls. "
	},
	{
		"User": "Nhor",
		"Review": "Value for money."
	},
	{
		"User": "Judith",
		"Review": "\r Comfort, location and value of money."
	},
	{
		"User": "Terence",
		"Review": "We had a most enjoyable stay at Red Planet. The room was basic but very clean with good air conditioning. The staff were very friendly, efficient and helpful. The hotel is situated close to shopping malls and restaurants."
	},
	{
		"User": "kurt",
		"Review": "Cleaners very noisy if you sleeping in, you can hear them talking loudly. no soap provided at check in."
	},
	{
		"User": "Ma",
		"Review": "Cheap yet place is clean and nice"
	},
	{
		"User": "Emi",
		"Review": "\r comfort, security, accessibility"
	},
	{
		"User": "Jude",
		"Review": "\r Cleanliness, Booking Efficiency, Comfort."
	},
	{
		"User": "RUDOLF",
		"Review": "Professional operation"
	},
	{
		"User": "evelyn",
		"Review": "\r the best things i loved about this hotel are the location, the comfort and most eap. the value for money"
	},
	{
		"User": "joseph",
		"Review": "\r clean room"
	},
	{
		"User": "Kristine",
		"Review": "\r Great location. Small modern comfortable room. Value for money"
	},
	{
		"User": "WAN-YU",
		"Review": "\r good location, clean, kind staff"
	},
	{
		"User": "riza",
		"Review": "\r CLEAN COMFORT ENOUGH SPACE"
	},
	{
		"User": "Brian",
		"Review": "Having stayed at other Red Planet Hotels before, I knew what to expect and this time was almost no exception. However, there was a small crusty spill on the linen at about head level that was a bit disconcerting. Other than that, everything was wonderful and the hotel met all my other expectations. I will stay at a Red Planet again for sure!"
	},
	{
		"User": "Arvin",
		"Review": "\r value for money, convenient location, secure"
	},
	{
		"User": "JORGE",
		"Review": "\r Cleanliness, reliable staff, couteous guards"
	},
	{
		"User": "RAMMEL",
		"Review": "\r good location, well maintained & prompt service by the staff"
	},
	{
		"User": "Rio",
		"Review": "\r Comfortable, affordable and accessible"
	},
	{
		"User": "Rio",
		"Review": "\r Location is great, very near malls and accessible by public transport"
	},
	{
		"User": "James",
		"Review": "\r Value, staff friedliness and helpfulness, clean"
	},
	{
		"User": "James",
		"Review": "\r Value, staff friendliness and helpfulness, location"
	},
	{
		"User": "James",
		"Review": "\r Cleanliness, value, location"
	},
	{
		"User": "paul",
		"Review": "\r I was greeted with a happy smile on my arrival by the reception staff on my arrival. I found all staff to be very friendly and helpful ...very clean rooms "
	},
	{
		"User": "Annabelle",
		"Review": "\r cleanliness; comfort; and hospitable staff"
	},
	{
		"User": "Jeanette",
		"Review": "\r Value for money, comfy bed and helpful staff"
	},
	{
		"User": "Ernita",
		"Review": "\r location, cleanliness, staff are okay"
	},
	{
		"User": "Greg",
		"Review": "\r Excellent customer service. Clean rooms. Location"
	},
	{
		"User": "Joel",
		"Review": "\r Accessible, safe parking, clean rooms"
	},
	{
		"User": "Michael",
		"Review": "\r Location, staff, cleanliness"
	},
	{
		"User": "John",
		"Review": "\r Price, location and cleanliness"
	},
	{
		"User": "David",
		"Review": "\r bed, shower, cleanliness"
	},
	{
		"User": "Cerilo",
		"Review": "\r comfortable, Location, Hotel condition"
	},
	{
		"User": "Pablo",
		"Review": "\r Clean rooms, Clean bathroom, Comfortable double bed"
	},
	{
		"User": "CARLOS",
		"Review": "\r housekeeping crew so noisy in the mornings"
	},
	{
		"User": "Anthony",
		"Review": "\r Clean, Location, Budget Friendly"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Location, room rate, easy access"
	},
	{
		"User": "Bella",
		"Review": "\r cleanliness, friendly staff and location"
	},
	{
		"User": "CARLOS",
		"Review": "\r location"
	},
	{
		"User": "June",
		"Review": "\r Staff, location and security"
	},
	{
		"User": "MYRNA",
		"Review": "\r Clean and close to shopping malls"
	},
	{
		"User": "Alain",
		"Review": "\r 1. Very affordable price 2. Hotel Cleanliness 3. Comfortable bed and pillows"
	},
	{
		"User": "MYRNA",
		"Review": "\r Clean, nice staff and good location"
	},
	{
		"User": "MYRNA",
		"Review": "\r Nice room, clean and nice staff"
	},
	{
		"User": "Jee",
		"Review": "\r New, clean and not too expensive"
	},
	{
		"User": "Raveen",
		"Review": "\r staff,location,cleaness"
	},
	{
		"User": "John",
		"Review": "\r Clean, near, accessible "
	},
	{
		"User": "Andre",
		"Review": "\r Ambience, room standards, bathroom standards"
	},
	{
		"User": "John",
		"Review": "\r 1-clean 2-affordable 3-best location "
	},
	{
		"User": "Jee",
		"Review": "\r Along main road. No mini mark nearby"
	},
	{
		"User": "rowena",
		"Review": "\r Cleanliness, accessability, affordable"
	},
	{
		"User": "Mary",
		"Review": "\r Hot Shower, Television, Aircondition"
	},
	{
		"User": "CARLOS",
		"Review": "\r LOCATION, LOCATION, LOCATION"
	},
	{
		"User": "Jee",
		"Review": "\r Easy check in, easy access to transport, near to airport. Girl friendly hotel"
	},
	{
		"User": "joseph",
		"Review": "\r Near the mall"
	},
	{
		"User": "joseph",
		"Review": "\r Small room"
	},
	{
		"User": "joseph",
		"Review": "\r Near the mall"
	},
	{
		"User": "joseph",
		"Review": "\r Near the airport"
	},
	{
		"User": "January",
		"Review": "\r Clean, Affordable, Convenient"
	},
	{
		"User": "Joan",
		"Review": "\r Service, cleanliness, security "
	},
	{
		"User": "Gladys",
		"Review": "\r Staff were accommodating, food was okay"
	},
	{
		"User": "Rolando",
		"Review": "\r It's clean, good ac, friendly staff"
	},
	{
		"User": "helen",
		"Review": "\r Cleanliness"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Cleanliness, Location, Price"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Location, price, service"
	},
	{
		"User": "Ryan",
		"Review": "\r CLEAN, COMFORTABLE, AFFORDABLE"
	},
	{
		"User": "Cecilia",
		"Review": "\r Cleanliness, location, price"
	},
	{
		"User": "Darryl",
		"Review": "\r Clean, courteous staff, nice location"
	},
	{
		"User": "liezle",
		"Review": "\r value for money, cleanliness, nearness to airport"
	},
	{
		"User": "Rowan",
		"Review": "\r Location, room, accesibility"
	},
	{
		"User": "James",
		"Review": "\r Location, clean, good security"
	},
	{
		"User": "marc",
		"Review": "\r Location,Value for Money and Comfortable"
	},
	{
		"User": "Andrea",
		"Review": "\r Very clean and easy to locate. The staffs were very accomodating and friendly. Each room is very comfortable and well maintained."
	},
	{
		"User": "Jee",
		"Review": "\r Clean, frienly and good location"
	},
	{
		"User": "Jee",
		"Review": "\r friendly staff, clean and quiet"
	},
	{
		"User": "Carlos",
		"Review": "\r friendly and helpful staff, location, water supply"
	},
	{
		"User": "Winchelle",
		"Review": "\r Cleanliness, Staff, Location"
	},
	{
		"User": "Thomas",
		"Review": "\r the location was hood very close to the malls"
	},
	{
		"User": "Joseph",
		"Review": "\r Clean, efficient staff and price perfect"
	},
	{
		"User": "Abigail",
		"Review": "\r accessible. "
	},
	{
		"User": "Claire",
		"Review": "\r cleanliness, location, cleanliness"
	},
	{
		"User": "Brian",
		"Review": "\r Good location"
	},
	{
		"User": "Brian",
		"Review": "\r Good location"
	},
	{
		"User": "Carmel",
		"Review": "\r The comfort room was clean. Water pressure was very good. And although the room was small, it was just what we needed at that moment."
	},
	{
		"User": "Doris",
		"Review": "\r super clean, staff are friendly and polite, room is cozy and comfortable"
	},
	{
		"User": "liezle",
		"Review": "\r The hotel is ideally located near the airport and also to SM Lanang. It is consistent in terms of service and value for money."
	},
	{
		"User": "Jan",
		"Review": "\r Bed, cleanliness, quietness"
	},
	{
		"User": "PRISCILLA",
		"Review": "\r CLEANLINESS, WITH WARM TREATMENT FROM THE STAFF "
	},
	{
		"User": "George",
		"Review": "\r comfy rooms"
	},
	{
		"User": "Pauline",
		"Review": "\r Clean, accessible"
	},
	{
		"User": "JINPYO",
		"Review": "\r location, very clean, nice house keeping"
	},
	{
		"User": "Chito",
		"Review": "\r Cleanliness "
	},
	{
		"User": "Kristine",
		"Review": "\r Cleanliness, Location, Value for Money"
	},
	{
		"User": "Noel",
		"Review": "\r linen is fresh, room is clean, place is \"peaceful\""
	},
	{
		"User": "IAN",
		"Review": "\r location, cleanliness, value for money"
	},
	{
		"User": "Lorraine",
		"Review": "\r Staff, Value for money, location"
	},
	{
		"User": "christy",
		"Review": "\r Bed and linens, location "
	},
	{
		"User": "Sheilced",
		"Review": "\r Good value for money, in good location, near malls"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Fitzgerald",
		"Review": "\r I have a huge trust on their hotel lines. I love most is the comfort, hospitality, and value for money"
	},
	{
		"User": "Jose",
		"Review": "\r Price, location, cleanliness"
	},
	{
		"User": "ALDRIDGE",
		"Review": "\r Location , Cleanliness , Value"
	},
	{
		"User": "Jenette",
		"Review": "\r Cleanliness"
	},
	{
		"User": "MYRNA",
		"Review": "\r Clean, nice staff and good location"
	},
	{
		"User": "Kara",
		"Review": "\r Cleanliness, Value for Money and Location"
	},
	{
		"User": "ADRIAN",
		"Review": "\r Have stayed in a few different Red Planet Hotels now & all have been consistently Very Good."
	},
	{
		"User": "Ramon",
		"Review": "\r First, good location, with one jeepney ride to two major malls, and to the pier to get to Samal Island. Second, great value for money, comfortable bed, clean rooms. Third, friendly and helpful staff."
	},
	{
		"User": "Paul",
		"Review": "\r Cleanliness, friendly staff, location"
	},
	{
		"User": "Merhaya",
		"Review": "\r affordable, good location and nice staff"
	},
	{
		"User": "Jaypee",
		"Review": "\r Hotel is 5 mins walk to Robinsons Cybergate and a 10 mins jeepney ride to SM Lanang. There are fruit stand near the area where you can buy pomelo, mangosteen, durian, etc. Hotel is accessible. "
	},
	{
		"User": "Aldrin",
		"Review": "\r location, room, staff"
	},
	{
		"User": "rowena",
		"Review": "\r NEW, CLEAN, STAFF KIND"
	},
	{
		"User": "Jerome",
		"Review": "\r Location, Shopping"
	},
	{
		"User": "Michelle",
		"Review": "\r I've been a fan of red planet. All my stay here was like home. The location is always close to Big malls. Convenient store is also available. "
	},
	{
		"User": "CARLO",
		"Review": "\r Courteous staff, bed and linens and price"
	},
	{
		"User": "John",
		"Review": "\r Good nice and clean"
	},
	{
		"User": "Claire",
		"Review": "\r Cleanliness. Good location. "
	},
	{
		"User": "SHIRLY",
		"Review": "\r satifying with the value of money, comfortable in the room and the location is so nice."
	},
	{
		"User": "allan",
		"Review": "\r location, location, location"
	},
	{
		"User": "Charo",
		"Review": "\r A very clean room."
	},
	{
		"User": "Rencel",
		"Review": "\r Room, Location,Budget"
	},
	{
		"User": "Rencel",
		"Review": "\r Room, Location, Budget"
	},
	{
		"User": "Robert",
		"Review": "\r clean and reasonable price"
	},
	{
		"User": "Leandro",
		"Review": "\r Clean,, and new,,nice beds. etc."
	},
	{
		"User": "ADELFA",
		"Review": "\r Near to my shop, price is reasonable & clean toilet"
	},
	{
		"User": "Heintje",
		"Review": "\r Price, location and cleanliness "
	},
	{
		"User": "Chiqui",
		"Review": "\r clean, comfortable (luxurious,if I may say so) bed linens, great value for money "
	},
	{
		"User": "Ramon",
		"Review": "\r clean safe comfortable"
	},
	{
		"User": "Anthony",
		"Review": "\r Clean, Comfortable, No Frills"
	},
	{
		"User": "christopher",
		"Review": "\r later"
	},
	{
		"User": "HUIHUA",
		"Review": "\r the bed is comfortable，the Internet is good，the room keeps clean."
	},
	{
		"User": "Porzia",
		"Review": "\r The cleanliness, their beds and the airconditioning."
	},
	{
		"User": "Kirk",
		"Review": "\r High tech faacility at a very reasonable price"
	},
	{
		"User": "Winfred",
		"Review": "\r Free wifi, clean, near SM Lanang"
	},
	{
		"User": "RICARDO",
		"Review": "\r Its Location, good service and very clean rooms."
	},
	{
		"User": "Angela",
		"Review": "\r Cleanliness, Location and Staff"
	},
	{
		"User": "Marissa",
		"Review": "\r location, cleanliness and room"
	},
	{
		"User": "susan",
		"Review": "\r Price, clean, wifi"
	},
	{
		"User": "Magdaleno",
		"Review": "\r nice, clean and affordable"
	},
	{
		"User": "Eiffel",
		"Review": "\r location, safety and accessibility"
	},
	{
		"User": "Kathleen",
		"Review": "\r The color of the interior is nice; staff are very polite, rooms are clean"
	},
	{
		"User": "cyril",
		"Review": "\r not expensive, clean, good location"
	},
	{
		"User": "Martin",
		"Review": "\r Price, comfy bed, fast internet"
	},
	{
		"User": "Frances",
		"Review": "\r Very nice staff, Value For Money, Cleanliness"
	},
	{
		"User": "Patrick",
		"Review": "\r Well maintained room and Accessible"
	},
	{
		"User": "Jamie",
		"Review": "\r cleanliness, quality, staff"
	},
	{
		"User": "Anna",
		"Review": "\r value, location & staff"
	},
	{
		"User": "Abigail",
		"Review": "\r Clean, courteous staff and security personnel, inexpensive rate, no restaurants but within walking distance to other establishments"
	},
	{
		"User": "Stephen",
		"Review": "\r clean, good location, value for money"
	},
	{
		"User": "Ryzyl",
		"Review": "\r Clean Rooms, Good Quality Linens, Great Shower"
	},
	{
		"User": "Ryzyl",
		"Review": "\r Clean Rooms, Good Quality Linen's and Bath Towels, Great Shower "
	},
	{
		"User": "Marcus",
		"Review": "\r Shower, quiet, good security"
	},
	{
		"User": "Evelyn",
		"Review": "\r Good location,friendly staff,clean room"
	},
	{
		"User": "Aida",
		"Review": "\r clean, accomodating staff"
	},
	{
		"User": "John",
		"Review": "\r comfy, the feels :)"
	},
	{
		"User": "fil",
		"Review": "\r room linens clean"
	},
	{
		"User": "Imelda",
		"Review": "\r cleanliness,courteous staff,value for money"
	},
	{
		"User": "Rosario",
		"Review": "\r Clean, Comfortable and Affordable"
	},
	{
		"User": "Edgar",
		"Review": "\r Clean,comfort and satisfied"
	},
	{
		"User": "Harold",
		"Review": "\r Nice place to stay and relax."
	},
	{
		"User": "William",
		"Review": "\r Courtious Staff"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Alejandro",
		"Review": "\r Ideal location , clean, good facilities"
	},
	{
		"User": "Merhaya",
		"Review": "\r AFFORDABLE, GOOD LOCATION, CLEAN"
	},
	{
		"User": "richard",
		"Review": "\r the bed ofcourse. Soft and comfy. + the location"
	},
	{
		"User": "Mark",
		"Review": "\r clean, efficient"
	},
	{
		"User": "Karen",
		"Review": "\r Very clean excellent location very friendly and professional staff!! Would not hesitate to stay again when in Davao!!!"
	},
	{
		"User": "maria",
		"Review": "\r 1. Clean 2. Good Location 3. Good staff"
	},
	{
		"User": "Rubylyn",
		"Review": "\r cleanliness, location, lower rate"
	},
	{
		"User": "Mary",
		"Review": "\r The room is clean, great hotel staff and near the city center."
	},
	{
		"User": "alan",
		"Review": "\r Value for money is excellent as always with Red Planet/Tune hotels, location was v.good also 2 mins to Robinsons cybergate and 5mins taxi ride to SM Langnan, comfortable bed and good shower"
	},
	{
		"User": "Divina",
		"Review": "\r Location, staff, room"
	},
	{
		"User": "Charisse",
		"Review": "\r accommodation, staff, cleanliness"
	},
	{
		"User": "Eli",
		"Review": "\r Near the City Proper, Good Parking Area, Clean Room"
	},
	{
		"User": "Jose",
		"Review": "\r Price, cleanliness, location"
	},
	{
		"User": "Barry",
		"Review": "\r easy to book on agoda (rooms usually available), good price, good shower, a/c, tv. twin beds were a little too firm for my taste.."
	},
	{
		"User": "Jure",
		"Review": "\r great bed"
	},
	{
		"User": "Germaine",
		"Review": "\r accessible, clean and helpful staffs"
	},
	{
		"User": "Alicia",
		"Review": "\r good"
	},
	{
		"User": "Alicia",
		"Review": "\r good"
	},
	{
		"User": "Thomas",
		"Review": "bad. front desk lied about condition of room when I left and increased my bill 2000 pesos. When I confronted them about it they made more false claims. They said I left a cigarette butt in the bathroom sink. A LIE. I went to the room to see it and there was nothing but soap residue in the sink. Then they said ashes on the floor. Am I suppoosed to wash the bottom of my shoes to stay there? Never again. i left"
	},
	{
		"User": "taehyun",
		"Review": "\r clean, price, fast internet"
	},
	{
		"User": "Kenneth",
		"Review": "\r Clean | Accessible | Very Accomadating Staff"
	},
	{
		"User": "Paul",
		"Review": "\r Outstanding hotel for the price. Everything works perfectly. "
	},
	{
		"User": "Capt",
		"Review": "\r Clean"
	},
	{
		"User": "David",
		"Review": "\r All of the staff were great and always helpful. Very clean and tidy. Ideal location."
	},
	{
		"User": "Maria",
		"Review": "\r Friendly Staff, Very Clean Environment, & Affordable "
	},
	{
		"User": "Melvin",
		"Review": "\r Security, Location, Value for Money"
	},
	{
		"User": "TARUMALINGAM",
		"Review": "\r cleanliness, services and price"
	},
	{
		"User": "MARIE",
		"Review": "\r Location, Cleanliness, Staff"
	},
	{
		"User": "Ma.",
		"Review": "\r Accessible, clean and friendly staff"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) comfortable beds and pillows; 3) food and entertainment establishments are accessible"
	},
	{
		"User": "Beatriz",
		"Review": "\r accessible, friendly staff and clean room"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Location, Location Location"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Location, near SM Lanang and Abreeza"
	},
	{
		"User": "Jose",
		"Review": "\r Proximity, practical and fir for purpose"
	},
	{
		"User": "katherine",
		"Review": "\r price, clean"
	},
	{
		"User": "Janella",
		"Review": "\r Location, Staff, Cleanliness"
	},
	{
		"User": "DIVINAGRACIA",
		"Review": "\r value for money, location and new facilities"
	},
	{
		"User": "Jerome",
		"Review": "\r location;shopping;food"
	},
	{
		"User": "ROBERT",
		"Review": "\r clean, price, secure"
	},
	{
		"User": "Kristine",
		"Review": "\r Location, value for money, simplicity"
	},
	{
		"User": "Patrick",
		"Review": "\r I like the comfortable bed and air-conditioning the best. Second is the bathroom, clean and functional. Third, I like the design and ambience."
	},
	{
		"User": "IAN",
		"Review": "\r CLEAN LOCATION PRICE"
	},
	{
		"User": "Aian",
		"Review": "\r bedroom amenities, security and location"
	},
	{
		"User": "Bella",
		"Review": "\r clean hotel"
	},
	{
		"User": "jose",
		"Review": "\r Modern, clean , comfortable"
	},
	{
		"User": "Crispin",
		"Review": "\r Accessibility, Comfort & Expectation"
	},
	{
		"User": "Richard",
		"Review": "\r Friendly staff and good location close to the new SM Mall"
	},
	{
		"User": "Richard",
		"Review": "\r Value for money, staff and cleanliness"
	},
	{
		"User": "Ignacio",
		"Review": "\r Cleanness, comfort, location "
	},
	{
		"User": "sarah",
		"Review": "\r comfort, convenience and cleanliness"
	},
	{
		"User": "romualdo",
		"Review": "\r cleanliness, staff, location"
	},
	{
		"User": "Corwin",
		"Review": "\r cleanliness, comfortable bed, hot water"
	},
	{
		"User": "Giancarlo",
		"Review": "\r 1. the hotel was very clean 2. the room was clean and new 3. good service"
	},
	{
		"User": "Gianvic",
		"Review": "\r The bed, bathroom & Pillow"
	},
	{
		"User": "Kristine",
		"Review": "\r Location, location, location"
	},
	{
		"User": "sarah",
		"Review": "\r location, staff and cleanliness"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Location, location, location"
	},
	{
		"User": "IAN",
		"Review": "\r Cleanliness, secured and comfortable"
	},
	{
		"User": "FRANCOIS",
		"Review": "\r Staff cleanless security"
	},
	{
		"User": "RUDOLF",
		"Review": "\r location friendly guards helpful "
	},
	{
		"User": "Anson",
		"Review": "\r 1. Price 2. Clean 3. Location"
	},
	{
		"User": "Emelita",
		"Review": "\r Price, location and new."
	},
	{
		"User": "Emelita",
		"Review": "\r Price, Location and cleanliness."
	},
	{
		"User": "Emelita",
		"Review": "\r Price, Location and Staff."
	},
	{
		"User": "Jee",
		"Review": "\r clean, cheap and new"
	},
	{
		"User": "Myla",
		"Review": "\r Comfort, staff and cleanliness."
	},
	{
		"User": "Marita",
		"Review": "\r nice"
	},
	{
		"User": "roderick",
		"Review": "\r location, price, srervice"
	},
	{
		"User": "Abdul",
		"Review": "\r Staff, location and cleanliness"
	},
	{
		"User": "Katrin",
		"Review": "\r The location is the best. It is very near with 2 shopping malls. Just 3-5mins ride. Take the jeep it is way cheaper. The rooms are clean and very comfy beds"
	},
	{
		"User": "Valeria",
		"Review": "\r Clean, great service and good value"
	},
	{
		"User": "Valeria",
		"Review": "\r Clean, friendly service, value"
	},
	{
		"User": "tan",
		"Review": "\r Clean"
	},
	{
		"User": "ramjie",
		"Review": "\r Nice hotel"
	},
	{
		"User": "ramjie",
		"Review": "\r Best cheap hotel"
	},
	{
		"User": "Willy",
		"Review": "\r Location, price, clean"
	},
	{
		"User": "Henry",
		"Review": "\r Value, polite staff & cleanliness "
	},
	{
		"User": "Chase",
		"Review": "\r price, location, clean"
	},
	{
		"User": "MERASOL",
		"Review": "\r clean &cozy"
	},
	{
		"User": "JOHN",
		"Review": "\r Accessible with the public transportation, clean and accommodating staff."
	},
	{
		"User": "Steven",
		"Review": "\r 1. Value for money if you book in advanced & online, 2. Reasonably new with great air conditioning, 3. Close to SM Lanang shopping centre, "
	},
	{
		"User": "Leonie",
		"Review": "\r Cleanliness, Wifi and Location "
	},
	{
		"User": "Paul",
		"Review": "\r comfort, location, price"
	},
	{
		"User": "Kenneth",
		"Review": "\r value staff cleanliness "
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) comfortable beds and pillows; 3) food and entertainment establishments are accessible"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Katrina",
		"Review": "\r Staff, price, location"
	},
	{
		"User": "Anthony",
		"Review": "\r Location, staff and cleanliness"
	},
	{
		"User": "Anthony",
		"Review": "\r Location, staff and cleanliness"
	},
	{
		"User": "Loveme",
		"Review": "\r new and clean"
	},
	{
		"User": "marcelina",
		"Review": "\r value for money, location and comfort"
	},
	{
		"User": "Daisy",
		"Review": "\r room, staffs, food"
	},
	{
		"User": "Annaliza",
		"Review": "\r The bed, pillow and blanket is comfortable.. I love the smell and the right softness/texture. Location is accessible. And price is low considering the comfrot we got."
	},
	{
		"User": "Abdul",
		"Review": "\r Cleanliness, Location and Attentive staff"
	},
	{
		"User": "charm",
		"Review": "\r The room was clean and comfortable. "
	},
	{
		"User": "Mark",
		"Review": "\r Near 2 malls and airport"
	},
	{
		"User": "Leizley",
		"Review": "\r affordable, clean, strategically located"
	},
	{
		"User": "LOURDES",
		"Review": "\r friendly staff, accomodating people, polite staff"
	},
	{
		"User": "Joana",
		"Review": "\r Best hotel for groups!"
	},
	{
		"User": "Lloyd",
		"Review": "\r cleanliness, good staff and security, cool aircon."
	},
	{
		"User": "Anthony",
		"Review": "\r Location, parking, new"
	},
	{
		"User": "Carel",
		"Review": "\r nice, clean, easy access"
	},
	{
		"User": "Rose",
		"Review": "\r clean, good service."
	},
	{
		"User": "Esther",
		"Review": "\r location, clean, accessible, safe"
	},
	{
		"User": "Erick",
		"Review": "\r The location is great. The staff is friendly. The rooms are very clean."
	},
	{
		"User": "Sarah",
		"Review": "\r location, cleanliness, value for money"
	},
	{
		"User": "fern",
		"Review": "\r good location, near sm lanang and ayala mall"
	},
	{
		"User": "Jelaine",
		"Review": "\r they have a very accomodating staff, clean rooms and very accessible to all malls"
	},
	{
		"User": "June",
		"Review": "\r Good location, fast check in, nice staff"
	},
	{
		"User": "Susanne",
		"Review": "\r Very comfortable bed! 5 star quality!"
	},
	{
		"User": "Bienvenido",
		"Review": "\r cleanl, polite staff "
	},
	{
		"User": "Mohanie",
		"Review": "\r I like the bed... The super cold aircon is so cool.. But our room now is kinda small ... I have requated cor a twin bed but the receptionist gave us the family room but though its big"
	},
	{
		"User": "Nikkoh",
		"Review": "\r Bed, shower, value for money.."
	},
	{
		"User": "carllyle",
		"Review": "\r room comfort. "
	},
	{
		"User": "JIM",
		"Review": "\r Location. Cleanliness. Comfort"
	},
	{
		"User": "Rose",
		"Review": "\r clean, friendly staff and good service"
	},
	{
		"User": "FRANCOIS",
		"Review": "\r security/cleanness/price"
	},
	{
		"User": "Cindy",
		"Review": "\r Location, staff, security "
	},
	{
		"User": "arcelyn",
		"Review": "\r good location"
	},
	{
		"User": "EDLIN",
		"Review": "\r location, value for money, very clean rooms"
	},
	{
		"User": "EDLIN",
		"Review": "\r Good location, very clean and pay what you need"
	},
	{
		"User": "charlie",
		"Review": "\r cleanliness,location,and courteous staff"
	},
	{
		"User": "John",
		"Review": "\r Great Staff,Beds and shower"
	},
	{
		"User": "John",
		"Review": "\r The bed,The shower, The location"
	},
	{
		"User": "John",
		"Review": "\r New,Comfy,Close to all malls"
	},
	{
		"User": "stephen",
		"Review": "\r Nice clean room. Good tv. Cold air con"
	},
	{
		"User": "Astrid",
		"Review": "\r Location. Staff. Cleanliness. "
	},
	{
		"User": "Kenneth",
		"Review": "\r Great value for money. comfortable and clean rooms staff very helpful"
	},
	{
		"User": "akira",
		"Review": "\r Clean and very cheap price."
	},
	{
		"User": "jonalyn",
		"Review": "\r good"
	},
	{
		"User": "Boyd",
		"Review": "\r Value for money, very clean room, accessible to malls"
	},
	{
		"User": "Krystoffer",
		"Review": "\r Friendly staff, good room facilities, accessibility"
	},
	{
		"User": "Darren",
		"Review": "\r location, comfort, price"
	},
	{
		"User": "liezle",
		"Review": "\r proximity to airport, value for money and cleanliness of the hotel"
	},
	{
		"User": "Kim",
		"Review": "\r good location for me, good price, and clean rooms"
	},
	{
		"User": "Marifel",
		"Review": "\r Great value for money,clean,comfortable"
	},
	{
		"User": "EDLIN",
		"Review": "\r LOCATION, VALUE FOR MONEY AND ACCESIBILITY"
	},
	{
		"User": "Joselito",
		"Review": "\r Clean, comfortable beds, good location"
	},
	{
		"User": "Christine",
		"Review": "\r Cleanliness, courteous staff, near the mall"
	},
	{
		"User": "Anacleta",
		"Review": "\r Clean , comfortable aside from being new built"
	},
	{
		"User": "Kristoffer",
		"Review": "\r Excellent location, best bang for buck, friendly staff"
	},
	{
		"User": "sheryn",
		"Review": "\r Clean, staff was attentive, close to destinations"
	},
	{
		"User": "Cherry",
		"Review": "\r Location, Cleanliness & Service"
	},
	{
		"User": "Cherry",
		"Review": "\r Location, Cleanliness & Service"
	},
	{
		"User": "Michelle",
		"Review": "\r location... relaxing.. friendly staff"
	},
	{
		"User": "JOSEPHINE",
		"Review": "\r Elevator. Guards a bit friendly. They call caba for us. Key card function."
	},
	{
		"User": "Ma.",
		"Review": "\r easy access to transportation"
	},
	{
		"User": "Therese",
		"Review": "\r very clean. comfy bed. "
	},
	{
		"User": "Clarita",
		"Review": "\r Clean. Good location. Modern"
	},
	{
		"User": "Kenneth",
		"Review": "\r price. convenience and comfort "
	},
	{
		"User": "CASIANO",
		"Review": "\r May be a bit off the places I wanted to visit, but it is clean & secure."
	},
	{
		"User": "REYNALDO",
		"Review": "\r Cleanliness, value for money, location"
	},
	{
		"User": "Abdul",
		"Review": "\r Cleanliness"
	},
	{
		"User": "Mohamad",
		"Review": "\r Staff were prompt, wifi is good and room is clean"
	},
	{
		"User": "Rio",
		"Review": "\r Location, proximity to major malls, very accessible"
	},
	{
		"User": "Abdul",
		"Review": "\r Location, Cleanliness and NIce room"
	},
	{
		"User": "Merhaya",
		"Review": "\r Good location, affordable hotel, clean"
	},
	{
		"User": "Elmer",
		"Review": "\r Location, Comfort"
	},
	{
		"User": "Genalyn",
		"Review": "\r close the malls area"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "ANDRO",
		"Review": "\r Room Design and Layout, Security and Location"
	},
	{
		"User": "Chessy",
		"Review": "\r Squeaky cleanliness, Location, Super comfy bed"
	},
	{
		"User": "John",
		"Review": "\r Professional staff,clean rooms, good location "
	},
	{
		"User": "geraldine",
		"Review": "\r location near sm. very clean and staff very helpful"
	},
	{
		"User": "Valerie",
		"Review": "\r Location is very convenient. It's very quiet and slept really well. "
	},
	{
		"User": "Anthony",
		"Review": "\r Clean, Fast and Value for money"
	},
	{
		"User": "Kurt",
		"Review": "\r location. value for money. near the airport"
	},
	{
		"User": "ANDREW",
		"Review": "\r Great value for money. Accessible. Excellent staff"
	},
	{
		"User": "jonas",
		"Review": "\r People location extramile"
	},
	{
		"User": "Capt",
		"Review": "\r Price, cleanliness, hotel policies "
	},
	{
		"User": "Melissa",
		"Review": "\r Clean & value for mOney"
	},
	{
		"User": "cyril",
		"Review": "\r Clean, friendly staff and location"
	},
	{
		"User": "Roy",
		"Review": "\r clean, strategic location, pleasant staff."
	},
	{
		"User": "alex",
		"Review": "\r friendly staff, fast wifi, safety features"
	},
	{
		"User": "alex",
		"Review": "\r fast wi fi, refill water station with minimal fee, clean toilet"
	},
	{
		"User": "Jure",
		"Review": "\r wifi works in the room"
	},
	{
		"User": "Christine",
		"Review": "\r Location, Staff, Price"
	},
	{
		"User": "louis",
		"Review": "\r Clean Rooms Good TV and good Wifi"
	},
	{
		"User": "Vilma",
		"Review": "\r Easy access to transportation, near the airiport and to SM Lanang"
	},
	{
		"User": "Marvin",
		"Review": "\r Cleanliness, Simplicity, Comfort"
	},
	{
		"User": "Florina",
		"Review": "\r Location value for money and clean"
	},
	{
		"User": "John",
		"Review": "\r Bed, Shower and Staff"
	},
	{
		"User": "Jayson",
		"Review": "\r Accessible location. Very clean. Hi tech system. "
	},
	{
		"User": "Antonette",
		"Review": "\r Cleanliness & accesibility to central location"
	},
	{
		"User": "Lady",
		"Review": "\r Clean rooms. Friendly Staff. Location"
	},
	{
		"User": "Axel",
		"Review": "\r Location, Staff, Value"
	},
	{
		"User": "Ma.",
		"Review": "\r The room is clean and comfortable but the location is far from downtown. Although its very near sm lanang and robinson mall. "
	},
	{
		"User": "Antoniette",
		"Review": "\r Staff, cleanliness, location"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Armando",
		"Review": "\r In the Main Street of Davao near airport very near SM Lanang and walking distance from Robinson Cybergate internet is free and fast . For basic sleeping need for business traveler like me It's fine"
	},
	{
		"User": "Matthew",
		"Review": "\r New rooms and close to SM small"
	},
	{
		"User": "thomas",
		"Review": "\r clean, comfortable, helpful staff"
	},
	{
		"User": "rey",
		"Review": "\r fast wifi, soft pillow & comforters, clean room"
	},
	{
		"User": "LORENA",
		"Review": "\r GOOD LOCATION, FRIENDLY AND RESPECTFUL STAFF AND CLEAN, NICE AND SAFE ROOM"
	},
	{
		"User": "Shermila",
		"Review": "\r location was convenient since near the malls, can get taxi right away, room is clean and comfortable"
	},
	{
		"User": "Shermila",
		"Review": "\r it is cheap but room is clean and location is convenient."
	},
	{
		"User": "Albert",
		"Review": "\r Clean"
	},
	{
		"User": "Karlo",
		"Review": "\r location, comfortable bed, clean bathrooms"
	},
	{
		"User": "iris",
		"Review": "\r location near malls, affordable, cleanliness"
	},
	{
		"User": "medardo",
		"Review": "\r price,location new."
	},
	{
		"User": "William",
		"Review": "\r brand new. great hotel"
	},
	{
		"User": "Rachelle",
		"Review": "\r Location, Location, Location"
	},
	{
		"User": "marife",
		"Review": "\r Cleanliness, location, affordability"
	},
	{
		"User": "Mike",
		"Review": "\r Cleanliness, safety and location are ok"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Location, rate, cleanliness"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Room rate, cleanliness, location"
	},
	{
		"User": "Lindsay",
		"Review": "\r really well located very close to SM Lanang Mall. Rooms and hotel very recently built. Very good value for money "
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Patrick",
		"Review": "\r The quality of the room and its appointments especially the bed, pillows and linen. The chic, fresh modern design of the room and the overall functionality and comfort of the room."
	},
	{
		"User": "Winfred",
		"Review": "\r Clean, wifi, not far from SM Lanang"
	},
	{
		"User": "Maria.",
		"Review": "\r Location"
	},
	{
		"User": "John",
		"Review": "\r 1) Location, 2) Price/Value, 3) Nice rooms"
	},
	{
		"User": "EMMANUEL",
		"Review": "\r ACEESSIBLE TO TRANSPORT, CLEAN AND AFFORDABLE"
	},
	{
		"User": "Elwina",
		"Review": "\r Clean white sheets, clean bathrooms, functional Internet "
	},
	{
		"User": "Mary",
		"Review": "\r convenience, security and promptness"
	},
	{
		"User": "Gerry",
		"Review": "\r price, cleanliness, staff friendliness"
	},
	{
		"User": "PAUL",
		"Review": "\r photo wall friendly staff easy online booking"
	},
	{
		"User": "RICHARD",
		"Review": "\r clean, friendly staff, value for money"
	},
	{
		"User": "Francisco",
		"Review": "\r value for the money"
	},
	{
		"User": "Ranjit",
		"Review": "\r value, cleanliness, near eating place."
	},
	{
		"User": "Missela",
		"Review": "\r Very affordable, good location, simple"
	},
	{
		"User": "Greg",
		"Review": "\r Clean, new and user friendly"
	},
	{
		"User": "Toni",
		"Review": "\r Clean, staff, elevator"
	},
	{
		"User": "STEPHEN",
		"Review": "\r cheap clean best value for money"
	},
	{
		"User": "John",
		"Review": "\r Location, Staff, Affordable"
	},
	{
		"User": "John",
		"Review": "\r Location, Staff, Affordable"
	},
	{
		"User": "Bonifacio",
		"Review": "\r location location location"
	},
	{
		"User": "Argelyn",
		"Review": "\r Location, rates and new"
	},
	{
		"User": "Maria",
		"Review": "\r 1. guests can choose to pay or not to pay for other services offered"
	},
	{
		"User": "Mark",
		"Review": "\r Clean, Cool, Affordable"
	},
	{
		"User": "Mark",
		"Review": "\r Clean, Cool, Affordable"
	},
	{
		"User": "Cerilo",
		"Review": "\r Location, comfy bed "
	},
	{
		"User": "Curtis",
		"Review": "\r clean, location, and onsight smoking area"
	},
	{
		"User": "Peter",
		"Review": "\r Cleanliness, location, price"
	},
	{
		"User": "Kenneth",
		"Review": "\r value, simplicity. And good staff"
	},
	{
		"User": "Mercedes",
		"Review": "\r Bueno Bonito Barato"
	},
	{
		"User": "Jason",
		"Review": "\r Price. Cleanliness. Location"
	},
	{
		"User": "Maria",
		"Review": "\r Toilet is clean at the lobby - room is clean - good location "
	},
	{
		"User": "Sarah",
		"Review": "\r Clean, safe, very good bed to sleep & shower room"
	},
	{
		"User": "Harvey",
		"Review": "\r Great value, clean surrounding and good staff"
	},
	{
		"User": "Ana",
		"Review": "\r The hotel room price is very affordable and its location is very accessible plus the room was very clean"
	},
	{
		"User": "Almira",
		"Review": "\r 1) room was clean, 2) staff were approachable and accomodating, 3) location is nice (along the highway, near the malls)"
	},
	{
		"User": "Kareen",
		"Review": "\r staff assistance "
	},
	{
		"User": "Robert",
		"Review": "\r Clean, modern and very quite aircon"
	},
	{
		"User": "Caryl",
		"Review": "\r Cleanliness, efficiency and good location"
	},
	{
		"User": "Steve",
		"Review": "\r Staff. Cleanliness location"
	},
	{
		"User": "Camille",
		"Review": "\r location, clean enough"
	},
	{
		"User": "Grethel",
		"Review": "\r Clean room, nice staff, near to hospital"
	},
	{
		"User": "Rufino",
		"Review": "\r In city proper, accomodating staff and clean."
	},
	{
		"User": "Glen",
		"Review": "\r Cheap, location, food"
	},
	{
		"User": "Cherina",
		"Review": "\r nice bed, fast Internet connection and good location"
	},
	{
		"User": "cliff",
		"Review": "\r staff, bed, cleanliness"
	},
	{
		"User": "pamela",
		"Review": "\r clean, location, comfy"
	},
	{
		"User": "Siegfred",
		"Review": "\r New Clean Reasonably priced"
	},
	{
		"User": "Mario",
		"Review": "\r very near and accessible"
	},
	{
		"User": "Emo",
		"Review": "\r 1) good value for my money; 2) near 2 malls; 3) eating establishments are aplenty nearby"
	},
	{
		"User": "Kenneth",
		"Review": "\r value for money, standard and cleanliness "
	},
	{
		"User": "rahilakanthan",
		"Review": "\r No big hassle,big value!"
	},
	{
		"User": "Gay",
		"Review": "\r The hotel is just few steps from Robinson's Cybergate and a few minutes ride to SM Premier Lanang. It is also a ride away from Abreeza Mall. The hotel is also near the airport so not much hassle."
	},
	{
		"User": "lee",
		"Review": "\r Clean,good air on , good for ur money "
	},
	{
		"User": "Francis",
		"Review": "\r Safety features"
	},
	{
		"User": "Charmaine",
		"Review": "\r Location, Friendly Staff, Quiet"
	},
	{
		"User": "MICHELE",
		"Review": "\r Clean, affordable"
	},
	{
		"User": "AMRITPAL",
		"Review": "\r Location, Price and maybe clean"
	},
	{
		"User": "WILLIAM",
		"Review": "\r Close to shopping Center, Air Con good and clean"
	},
	{
		"User": "RUDOLF",
		"Review": "\r excellent location, near malls, easy for taxis, well lighted"
	},
	{
		"User": "jose",
		"Review": "\r aircondion"
	},
	{
		"User": "Yui",
		"Review": "\r Great value! Friendly stuff, super clean modern rooms!"
	},
	{
		"User": "Melencio",
		"Review": "\r Location , near shoping mall"
	},
	{
		"User": "lee",
		"Review": "\r Clean,value for money,good wifi and good staff"
	},
	{
		"User": "Chantal",
		"Review": "\r bed, shower, location"
	},
	{
		"User": "orenthia",
		"Review": "\r location, price, bus boy was very friendly "
	},
	{
		"User": "Jonathan",
		"Review": "\r The people working so friendly / eassy to have a taxi / happy there is a smoking area ! "
	},
	{
		"User": "Emo",
		"Review": "\r quick access to shopping malls, move theaters, eating establishments & massage spas"
	},
	{
		"User": "Emo",
		"Review": "\r near shopping malls, near food establishments, accessible"
	},
	{
		"User": "Ray",
		"Review": "\r price/location/cleanliness"
	},
	{
		"User": "Greg",
		"Review": "\r Location is very good, the cleanliness is excellant, and the staff went beyond the call of duty. I was very impressed with the hotels and staff in the 'Tune Hotel' chain and now prefer to stay at Tune"
	},
	{
		"User": "Michael",
		"Review": "\r comforyable and clean bed , good bathroom, wi-fi"
	},
	{
		"User": "edsel",
		"Review": "\r clean safe accessible"
	},
	{
		"User": "Christian",
		"Review": "\r Affordability, comfort and staff friendliness"
	},
	{
		"User": "Magnolia",
		"Review": "\r great location, affordable price, comfy beddings"
	},
	{
		"User": "Fides",
		"Review": "\r great value for money since all the amenities inside the room is great. there is a small dinner in the ground floor. located near robinsons grocery"
	},
	{
		"User": "IDA",
		"Review": "\r Clean Comfortable and Accessible"
	},
	{
		"User": "Adonis",
		"Review": "\r Value for money, convenient location, courteous staff"
	},
	{
		"User": "Ma",
		"Review": "\r Staffs are accomodating, accessible, clran"
	},
	{
		"User": "Angel",
		"Review": "\r Service, location, cleanliness"
	},
	{
		"User": "Angel",
		"Review": "\r location, Service, Cleanlinessn"
	},
	{
		"User": "Julito",
		"Review": "\r nice"
	},
	{
		"User": "rosill",
		"Review": "\r Near to our office, near to the malls, near the airport "
	},
	{
		"User": "LENY",
		"Review": "\r white sheets, comfy bed, location"
	},
	{
		"User": "LENY",
		"Review": "\r near davao airport, clean, new"
	},
	{
		"User": "bernardo",
		"Review": "\r value for money, staff performance and cleanliness"
	},
	{
		"User": "Edwin",
		"Review": "\r Clean, affordable and great location."
	},
	{
		"User": "Edgardo",
		"Review": "\r value for money, cleanliness, location."
	},
	{
		"User": "Eng",
		"Review": "\r New. Free aircond-no additional charge and Free wifi.."
	},
	{
		"User": "Gil",
		"Review": "\r clean and good location"
	},
	{
		"User": "William",
		"Review": "\r Clean room, hair blower, nice soft bed"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Cleanliness, location, accessability"
	},
	{
		"User": "Regalado",
		"Review": "\r Strategic Location, Cleanliness, New"
	},
	{
		"User": "Jane",
		"Review": "\r value for money"
	},
	{
		"User": "Rachelle",
		"Review": "\r Location, Basic, Value for the money"
	},
	{
		"User": "Angel",
		"Review": "\r Location, Service, Cleanliness"
	},
	{
		"User": "jeffrey",
		"Review": "\r Spotlessly Clean, The staff was Excellent, Good cleen well run Hotel"
	},
	{
		"User": "May",
		"Review": "\r clean, new, smells good"
	},
	{
		"User": "Melody",
		"Review": "\r price, room, staff"
	},
	{
		"User": "Ma",
		"Review": "\r easy to transportation, very clean, fast wi-fi, and very comfortable"
	},
	{
		"User": "marconi",
		"Review": "\r value for money, good location, accessibility to punlic transport"
	},
	{
		"User": "Rio",
		"Review": "\r New, clean, accessible to public transport aytime"
	},
	{
		"User": "Jure",
		"Review": "\r wifi is fast"
	},
	{
		"User": "ARIEL",
		"Review": "\r Location, cleanliness, comfort"
	},
	{
		"User": "Thomas",
		"Review": "\r Price, comfortable room, clean"
	},
	{
		"User": "Jenalyn",
		"Review": "\r \"Clean, closer to the malls\""
	},
	{
		"User": "Conrad",
		"Review": "\r Clean, No Frills, Fast Internet connectivity"
	},
	{
		"User": "adel",
		"Review": "\r Wifi speed , comfortable bed , location near SM malls "
	},
	{
		"User": "LUIS",
		"Review": "\r Staff and accomodation . Thanks for the services of guards"
	},
	{
		"User": "RUDOLF",
		"Review": "\r location, cleanliness, comfort "
	},
	{
		"User": "VIVENCIO",
		"Review": "\r it is new, clean and easy to get ride."
	},
	{
		"User": "Sharon",
		"Review": "\r Location"
	},
	{
		"User": "Dwi",
		"Review": "\r Location, Cleanliness, Value for money"
	},
	{
		"User": "Irene",
		"Review": "\r new hotel, clean rooms, good location"
	},
	{
		"User": "Jose",
		"Review": "\r Location, price and cleanliness."
	},
	{
		"User": "KIM",
		"Review": "\r Clean, Clean & Clean"
	},
	{
		"User": "ABDULRAHMAN",
		"Review": "\r new...clean...well furniture"
	},
	{
		"User": "Norhamin",
		"Review": "\r Security, Shower and Bed"
	},
	{
		"User": "John",
		"Review": "\r Location, Staff, Affordable"
	},
	{
		"User": "ARVIN",
		"Review": "\r Best price. Very clean. Convenient. "
	},
	{
		"User": "EDMAR",
		"Review": "\r Clean, distance and class"
	},
	{
		"User": "Angel",
		"Review": "\r 5 star beds, accommodating staff, proximity to malls"
	},
	{
		"User": "Michelle",
		"Review": "\r Cleanliness comfort price"
	},
	{
		"User": "Mel",
		"Review": "\r Location is great, cheap pricing, friendly staff."
	},
	{
		"User": "Angel",
		"Review": "\r 5 Star Beds in a budget hotel"
	},
	{
		"User": "ronaldo",
		"Review": "\r location, value for money and hotel cleanliness"
	},
	{
		"User": "Angel",
		"Review": "\r Sheets, Bed, Spacious bathroom"
	},
	{
		"User": "Benita",
		"Review": "\r Accommodating staff; Cleanliness; Affordable rate"
	},
	{
		"User": "Geraldine",
		"Review": "\r clean, functional, no frills"
	},
	{
		"User": "Marigold",
		"Review": "\r Location, Value for Money, Cleanliness"
	},
	{
		"User": "Marrissa",
		"Review": "\r CLEAN, Accessible to several rides"
	},
	{
		"User": "Kristine",
		"Review": "\r Location, location, location"
	},
	{
		"User": "Kristine",
		"Review": "\r Location, location, location"
	},
	{
		"User": "Patrick",
		"Review": "\r Fresh, hip design, colours and overall ambience, Very clean and modern, functional room facilities and amenities, good value"
	},
	{
		"User": "Grethel",
		"Review": "\r accessibility to important places, value for money, good staff"
	},
	{
		"User": "Jerry",
		"Review": "\r Clean, & New hotel"
	},
	{
		"User": "George",
		"Review": "\r clean & modern design, relaxing.."
	},
	{
		"User": "Imie",
		"Review": "\r Clean, Value for money, New"
	},
	{
		"User": "EDWIN",
		"Review": "\r Rate is very competitive. Only guest with card can operate the elevator. Ceiling Fan can help room temperature when guest chooses not to use aircon."
	},
	{
		"User": "RUDOLF",
		"Review": "\r Room rate. Restaurant. Location."
	},
	{
		"User": "Rosemarie",
		"Review": "\r great location, very clean and affordable"
	},
	{
		"User": "Sean",
		"Review": "\r Staff ,clealiness and well manered"
	},
	{
		"User": "Bruce",
		"Review": "\r This Tune is same as we have come to expect in every way but one,,, "
	},
	{
		"User": "Marfy",
		"Review": "\r Price, Facilities, Staffs"
	},
	{
		"User": "ramon",
		"Review": "\r afordable, convenient, pleasant."
	},
	{
		"User": "Justine",
		"Review": "\r priceless service,pleasant room, affordable rates"
	},
	{
		"User": "Michael",
		"Review": "\r Clean, Location, Price"
	},
	{
		"User": "lee",
		"Review": "\r cheap,clean and fast free wifi"
	},
	{
		"User": "jeson",
		"Review": "\r good,clean and affordable"
	},
	{
		"User": "eddy",
		"Review": "\r cheap, clean and friendly staff"
	},
	{
		"User": "Katrina",
		"Review": "\r accommodating staffs, location and cleanliness of the rooms "
	},
	{
		"User": "Joel",
		"Review": "\r Clean, Affordable and Value for money"
	},
	{
		"User": "Sarah",
		"Review": "\r New, clean, Quick and easy"
	},
	{
		"User": "Sarah",
		"Review": "\r Bed and Bath and Refresh"
	},
	{
		"User": "Sarah",
		"Review": "\r Location, Staff Efficiency, Meet up and Go"
	},
	{
		"User": "Angelita",
		"Review": "\r Condition, location and value for momey"
	},
	{
		"User": "JAY",
		"Review": "\r location, staff and very clean rooms."
	},
	{
		"User": "lee",
		"Review": "\r Price,very comfortable,nice bed"
	},
	{
		"User": "Kristine",
		"Review": "\r very clean, helpful staff, accessible location"
	},
	{
		"User": "Jennifer",
		"Review": "\r Location"
	},
	{
		"User": "Jennifer",
		"Review": "\r Modern, location, and cleanliness"
	},
	{
		"User": "JIM",
		"Review": "\r New. "
	},
	{
		"User": "Janet",
		"Review": "\r Clean, Comfortable and Accessible"
	},
	{
		"User": "Rolan",
		"Review": "\r very comfort bed, hot and cold shower/water, located near malls"
	},
	{
		"User": "Dennis",
		"Review": "\r Value for money, proximity and cleanliness. "
	},
	{
		"User": "Generose",
		"Review": "\r convenient, easy to malls, friendly staffs"
	},
	{
		"User": "Edward",
		"Review": "\r CLean, Affordable, Amazing"
	},
	{
		"User": "Roderick",
		"Review": "\r Location, Clean room and Bathroom. Friendly staff"
	},
	{
		"User": "shum",
		"Review": "\r nice staff, clean ,good location"
	},
	{
		"User": "JOCELYN",
		"Review": "\r rates plus they said its a new hotel "
	},
	{
		"User": "derrick",
		"Review": "\r Clean. Great location. "
	},
	{
		"User": "DAN",
		"Review": "\r Good location, clean and new hotel"
	},
	{
		"User": "Diana",
		"Review": "\r near to shopping area, 15 minute ride to airport, cleanliness of the hotel"
	},
	{
		"User": "Paul",
		"Review": "\r Value, staff, design"
	},
	{
		"User": "Christina",
		"Review": "\r Within City center, very close to SM Lanang, Clean rooms, nice bathroom, reasonable rates. A good choice!"
	},
	{
		"User": "Christina",
		"Review": "\r Clean room, new facilities, comfortable beds"
	},
	{
		"User": "Roberto",
		"Review": "\r Value, cleanliness, modern"
	},
	{
		"User": "gayoung",
		"Review": "\r kind. clean. safe"
	},
	{
		"User": "Jeferson",
		"Review": "\r Wi-Fi and location"
	},
	{
		"User": "Cristine",
		"Review": "\r Great location, Clean Rooms, Great Service"
	},
	{
		"User": "Lee",
		"Review": "\r Price, cleanliness, age"
	},
	{
		"User": "Catherine",
		"Review": "\r comfort,location and value for money"
	},
	{
		"User": "JENIE",
		"Review": "\r price and clean room"
	},
	{
		"User": "Bobby",
		"Review": "The entire experience was horrible, unforgettable and horrifying. I checked out with so much disappointment. I will never check in to this hotel.. NEVER again.. "
	},
	{
		"User": "Jure",
		"Review": "\r the bed is great!"
	},
	{
		"User": "Marat",
		"Review": "\r Design, price"
	},
	{
		"User": "Thomas",
		"Review": "\r staff, location and comfort"
	},
	{
		"User": "Christian",
		"Review": "\r affordable comfortable nice"
	},
	{
		"User": "Philip",
		"Review": "\r Price, comfort and cleanliness"
	},
	{
		"User": "JOSIE",
		"Review": "\r Security, cleanliness, service"
	},
	{
		"User": "Erlinda",
		"Review": "\r Clean, Friendly staff and accessibility"
	},
	{
		"User": "Niel",
		"Review": "\r clean, good location and affordable"
	},
	{
		"User": "Cyril",
		"Review": "\r very clean friendly staff very near to the airport"
	},
	{
		"User": "Leda",
		"Review": "\r Clean/ Friendly Staff/Near in shopping center"
	},
	{
		"User": "Florence",
		"Review": "\r Near the airport, SM premier and walking distance to robinsons supermarket"
	},
	{
		"User": "OSCAR",
		"Review": "\r clean, nice staff, clean"
	},
	{
		"User": "Rhoanne",
		"Review": "\r Not so.friendly staff "
	},
	{
		"User": "Ma",
		"Review": "\r Comfortable bed, location, clean"
	},
	{
		"User": "Gerry",
		"Review": "\r Friendly, professional staff, housekeeping, security"
	},
	{
		"User": "Ma",
		"Review": "\r budget hotel,easy access to public transport"
	},
	{
		"User": "Maila",
		"Review": "\r comfy sheets, clean bathroom, nice smell"
	},
	{
		"User": "Sherry",
		"Review": "\r cheap, clean , location "
	},
	{
		"User": "joseph",
		"Review": "\r Clean room"
	},
	{
		"User": "Chris",
		"Review": "\r cleanliness, location and price"
	},
	{
		"User": "scott",
		"Review": "\r Decore "
	},
	{
		"User": "Napoleon",
		"Review": "\r centrally located, easy access to local transportation, near to restaurant & shopping"
	},
	{
		"User": "allan",
		"Review": "\r cheap, clean and friendly staff"
	},
	{
		"User": "jeany",
		"Review": "\r Easy access to shopping malls."
	},
	{
		"User": "Andrew",
		"Review": "\r Fantastic and friendly customer service, Modern facility, Cleanliness"
	},
	{
		"User": "Lea",
		"Review": "\r clean room, big bed, free wifi"
	},
	{
		"User": "Cristine",
		"Review": "\r Excellent location, great staff, very affordable "
	},
	{
		"User": "Julito",
		"Review": "\r nice"
	},
	{
		"User": "Joyce",
		"Review": "\r Clean rooms,centrally located.."
	},
	{
		"User": "TABITHA",
		"Review": "\r Clean, accessible, comfortable beds."
	},
	{
		"User": "Elizardo",
		"Review": "\r location, restaurant, attentive staff"
	},
	{
		"User": "Anthony",
		"Review": "\r Cleanliness, Accessibility and Facility"
	},
	{
		"User": "Edna",
		"Review": "\r Cleanliness, affordability and good location"
	},
	{
		"User": "cendyrela",
		"Review": "\r Clean Friendly staff Affordable "
	},
	{
		"User": "Raquel",
		"Review": "\r Clean, Comfort, Friendly Staff"
	},
	{
		"User": "Reinand",
		"Review": "\r Simple, comfortable, clean"
	},
	{
		"User": "Patrick",
		"Review": "\r Very Clean Accessible to Airport Accesible to SMX"
	},
	{
		"User": "DONDRICK",
		"Review": "\r Cleanliness, Elegance, and Security."
	},
	{
		"User": "Emiliano",
		"Review": "\r LOCATION CLEANLINESS Value for Money"
	},
	{
		"User": "CHIAJUNG",
		"Review": "\r safe, quite, and clean "
	},
	{
		"User": "Bassam",
		"Review": "\r clean; comfort, cheap"
	},
	{
		"User": "D-na",
		"Review": "\r Cleanliness, comfort, safety"
	},
	{
		"User": "Rhoanne",
		"Review": "\r Location vicinity around the hotel comfort and cleanliness"
	},
	{
		"User": "Ramon",
		"Review": "\r Price; location; clean room"
	},
	{
		"User": "Haniff",
		"Review": "\r Cheap, Clean and comfortable"
	},
	{
		"User": "JANGHYUN",
		"Review": "\r clean, cheap, wifi"
	},
	{
		"User": "Mark",
		"Review": "\r Clean, good location and fast wifi"
	},
	{
		"User": "Mark",
		"Review": "\r Budget,clean and quality"
	},
	{
		"User": "kim",
		"Review": "\r Cleanliness, attentive staffs, budget friendly"
	},
	{
		"User": "Catherine",
		"Review": "\r Wifi, value for money, great room."
	},
	{
		"User": "Fritzy",
		"Review": "\r Cheap"
	},
	{
		"User": "Edgar",
		"Review": "\r clean. comfortable. relaxing."
	},
	{
		"User": "MARYCYN",
		"Review": "\r clean affordable accessible"
	},
	{
		"User": "KE",
		"Review": "\r clean ,clean ,clean "
	},
	{
		"User": "Ruth",
		"Review": "\r location, easy access to transportation, staff efficiency"
	},
	{
		"User": "Ronald",
		"Review": "\r Great parking, very nice interiors and very clean"
	},
	{
		"User": "Frederick",
		"Review": "\r secure; affordable; centrally located within the city"
	},
	{
		"User": "shalili",
		"Review": "\r Low rates, nice location friendly staff"
	},
	{
		"User": "Eric",
		"Review": "\r Nothing"
	},
	{
		"User": "Maureen",
		"Review": "\r Clean but small rooms"
	},
	{
		"User": "Jose",
		"Review": "\r Best bang for the buck, CLEAN, and SUPER CLEAN"
	},
	{
		"User": "Mark",
		"Review": "\r Nice bed, shower and comforatable"
	},
	{
		"User": "Miguel",
		"Review": "\r The hotel is new, very clean and value,for,money. Although small, it has all the basic amenities that one needs. No complaints, especially for the price!"
	},
	{
		"User": "Rachelle",
		"Review": "\r Very courteous and attentive security personnel. They were very friendly and will really hail a cab for you. They care for the welfare of their clients. "
	},
	{
		"User": "jennifer",
		"Review": "\r location, price, comfort"
	},
	{
		"User": "June",
		"Review": "\r The room was just enough for me. Even though it is located in te heary of the city but it was really peaceful. Lastly, the cost is realy affordable to all."
	},
	{
		"User": "George",
		"Review": "\r Location, cleanliness"
	},
	{
		"User": "Korina",
		"Review": "\r centrally located, value for money, decently clean rooms"
	},
	{
		"User": "Hannah",
		"Review": "\r Near airport, comfortable but small and near shopping malls"
	},
	{
		"User": "Faith",
		"Review": "\r centrally located, very clean rooms, accommodating personnel"
	},
	{
		"User": "Jerwin",
		"Review": "\r PRICE, LOOKS, CLEAN"
	},
	{
		"User": "Primo",
		"Review": "\r price, location, rooms"
	},
	{
		"User": "gregory",
		"Review": "\r Cheap, clean and centrally located."
	},
	{
		"User": "Alec",
		"Review": "\r Cheap hotel new rooms and good internet available"
	},
	{
		"User": "Erwin",
		"Review": "\r Clean, quiet, budget-friendly"
	},
	{
		"User": "Portia",
		"Review": "\r Neat, tidy and basically new."
	},
	{
		"User": "jayson",
		"Review": "\r clean room, very comfy, location"
	},
	{
		"User": "shiela",
		"Review": "\r Location Cleanlines Quiet "
	},
	{
		"User": "Jukka",
		"Review": "\r Location only good thing."
	},
	{
		"User": "FRANCOIS",
		"Review": "\r Clean professional and good price"
	},
	{
		"User": "Winfred",
		"Review": "\r Internet, in-room safe, friendly staff"
	},
	{
		"User": "James",
		"Review": "\r Price clean nice shower with good hot water good bed"
	},
	{
		"User": "Mary",
		"Review": "\r New, clean and affordable"
	},
	{
		"User": "Teri",
		"Review": "\r clean, nice bathroom, all in package with wifi"
	},
	{
		"User": "JANE",
		"Review": "\r clean sheets, wifi in room, cable TV"
	},
	{
		"User": "Hannah",
		"Review": "\r Location, relatively brand new, the bed and linens, the well-planned outlets in the room. "
	},
	{
		"User": "Bruce",
		"Review": "\r the tune hotels are all very clean well run in good locations,, "
	},
	{
		"User": "Maureen",
		"Review": "\r Centrally located, budget-hotel, clean rooms."
	},
	{
		"User": "Jade",
		"Review": "\r 1.) Location is near the shopping malls, 2.)clean and friendly staff ,3.) offers affordable promo rate."
	},
	{
		"User": "Ronaldo",
		"Review": "\r Affordability, cleanliness and good service"
	},
	{
		"User": "Zayda",
		"Review": "\r The cleanliness, friendly staff and good service.."
	},
	{
		"User": "Romano",
		"Review": "\r modern design room and clean environment and friendly staff."
	},
	{
		"User": "sharon",
		"Review": "\r affordable, accomodating, clean"
	},
	{
		"User": "fernd",
		"Review": "\r Along the main road"
	},
	{
		"User": "chermaine",
		"Review": "\r clean, near to malls, good price, enjoyed the lobby camera! "
	},
	{
		"User": "Dominick",
		"Review": "\r Nice rooms, cheap rate and corteous staff"
	},
	{
		"User": "kevin",
		"Review": "\r good service,friendly"
	},
	{
		"User": "Francis",
		"Review": "\r Value Location Clean"
	},
	{
		"User": "Angelica",
		"Review": "\r Very clean, friendly staff, very modernized "
	},
	{
		"User": "Michelle",
		"Review": "\r comfort, affordable, cleanliness"
	},
	{
		"User": "Charlene",
		"Review": "\r Near airport and major malls"
	},
	{
		"User": "Napoleon",
		"Review": "\r The room Staff Location "
	},
	{
		"User": "Giovanni",
		"Review": "\r Good, Affordable and Easy Access"
	},
	{
		"User": "Greg",
		"Review": "\r The hotel was modern, very clean, and new."
	},
	{
		"User": "Frederick",
		"Review": "\r nothing"
	},
	{
		"User": "Juvy",
		"Review": "\r Location, Staff,Cost"
	},
	{
		"User": "Jose",
		"Review": "\r Clean, comfortable, & affordable"
	},
	{
		"User": "Ammi",
		"Review": "\r Location"
	},
	{
		"User": "RAYMOND",
		"Review": "\r Non Potable Water sign in bathroom sink, Reliable Wifi, Clean room, Cold Air Con, Location close to SM Lanag Mall, and nearby food, on main street"
	},
	{
		"User": "CANDILEEN",
		"Review": "\r Great location, reasonable price and friendly staffs"
	},
	{
		"User": "Darren",
		"Review": "\r Price, Security, Clean Rooms"
	},
	{
		"User": "Andrew",
		"Review": "\r inexpensive, clean, no frills"
	},
	{
		"User": "Oscar",
		"Review": "\r clean, new, sleek"
	},
	{
		"User": "MARILOU",
		"Review": "\r easy to access, very clean and relaxing"
	},
	{
		"User": "Peter",
		"Review": "\r close proximity to mall and convention centre, good access to public transportation, and cleanliness"
	},
	{
		"User": "Bethoven",
		"Review": "\r Proximity to the convention site Easy access to the airport Easy on the pocket for budget travellers"
	},
	{
		"User": "lalaine",
		"Review": "\r Value of money, location, cleanliness"
	},
	{
		"User": "douglas",
		"Review": "\r Firm Beds, Clean Bathroom, Good Value"
	},
	{
		"User": "Michael",
		"Review": "\r Staff, Internet, and restaurant"
	},
	{
		"User": "Marian",
		"Review": "\r accessible, has parking lot, clean"
	},
	{
		"User": "Charity",
		"Review": "\r 1) Very neat and clean 2) Accessible location 3) Friendly and attentive staff"
	},
	{
		"User": "Ferdinando",
		"Review": "\r Near to SM Lanang & abreeza mall. Near to airport. Easy access for public transportation."
	},
	{
		"User": "elvis",
		"Review": "\r clean,easy access to transport and good internet connections."
	},
	{
		"User": "Alma",
		"Review": "\r Helpful staff, clean rooms with fresh sheets and towels everyday, near malls and restaurants"
	},
	{
		"User": "Magnolia",
		"Review": "\r Good location, budget friendly, clean & comfortable"
	},
	{
		"User": "dindo",
		"Review": "\r nothing good to say about the place"
	},
	{
		"User": "James",
		"Review": "\r Location Location Location"
	},
	{
		"User": "Gerard",
		"Review": "\r it was very clean and centrally located"
	},
	{
		"User": "reg",
		"Review": "\r room, sleep, internet"
	},
	{
		"User": "Candida",
		"Review": "\r Affordable, cleanliness, location. All rooms are with windows. Clean bathroom. Transport accessibility I"
	},
	{
		"User": "liezle",
		"Review": "\r New hotel, clean, very close to public transport and value for money"
	},
	{
		"User": "Daniel",
		"Review": "\r cleanliness and location"
	},
	{
		"User": "Fe",
		"Review": "\r The biddings are clean and new including the towels. "
	},
	{
		"User": "Vicky",
		"Review": "\r Nothing exciting really. . . I guess, what you get is what you paid for. . . Water is not even supplied. . . Tap water is not potable!"
	},
	{
		"User": "Richard",
		"Review": "\r The security guard downstairs and his cab service help. Yhe only one that deserved a tip. I'll give this group all the 3 best.."
	},
	{
		"User": "Rampelthels",
		"Review": "\r Clean,location and price"
	},
	{
		"User": "Alfonso",
		"Review": "\r I would say the quality of the rooms, the efficiency of the staff, and the really cool and simple ammenities. "
	},
	{
		"User": "rey",
		"Review": "\r Clean, centrally located, budget hotel"
	},
	{
		"User": "Julito",
		"Review": "\r close to airport, close to shopping malls, new hotel"
	},
	{
		"User": "GENEVIVE",
		"Review": "\r easy to access, new and clean rooms, public transport easy access"
	},
	{
		"User": "Reifmon",
		"Review": "\r New & Value for Money"
	},
	{
		"User": "Luke",
		"Review": "\r Value, cleanliness, location"
	},
	{
		"User": "Abbie",
		"Review": "\r Bed & comforter, wifi and tv"
	},
	{
		"User": "Arvin",
		"Review": "\r Clean room, nice staff and quite location"
	},
	{
		"User": "Arvin",
		"Review": "\r Price, cleanliness and location"
	},
	{
		"User": "John",
		"Review": "\r Nice beds + shower, fast check in and out, happy staff"
	},
	{
		"User": "Elizardo",
		"Review": "\r worth the money, accessible to taxi, and nice breakfast "
	},
	{
		"User": "christopher",
		"Review": "\r location,new facilities,security"
	},
	{
		"User": "Mary",
		"Review": "\r small but clean comfortable rooms, high speed internet, good TV channels selection, proximity to major shopping malls"
	},
	{
		"User": "Edward",
		"Review": "\r Good value for money, hotel close to restaurants and shopping centres, good hotel"
	},
	{
		"User": "Ma",
		"Review": "\r Accessible, clean, affordable"
	},
	{
		"User": "JESREL",
		"Review": "\r The hotel is clean, linens and towels are still new and clean"
	},
	{
		"User": "allan",
		"Review": "\r lovation, location and location again"
	},
	{
		"User": "allan",
		"Review": "\r location, location and location"
	},
	{
		"User": "allan",
		"Review": "\r location, location, location"
	},
	{
		"User": "Edna",
		"Review": "\r Very clean, near to shopping malls and worth the money"
	},
	{
		"User": "Edna",
		"Review": "\r Near to the airport, very clean and vear near to shopping malls"
	},
	{
		"User": "Kristine",
		"Review": "\r new, accessible, very clean"
	},
	{
		"User": "Riza",
		"Review": "\r Location comfort and cleanliness"
	},
	{
		"User": "John",
		"Review": "\r fast check in, location, friendly staff"
	},
	{
		"User": "edison",
		"Review": "\r Price, location and design"
	},
	{
		"User": "Micky",
		"Review": "\r Good value for money, location in city close to malls, clean room and friendly staff"
	},
	{
		"User": "Micky",
		"Review": "\r Good value for money, location in city close to malls, clean room and friendly staff"
	},
	{
		"User": "Judith",
		"Review": "\r Very friendly and accommodating staff, not too pricey and newly built"
	},
	{
		"User": "Aquino",
		"Review": "\r Cheap enough and pretty good (but small) room. Near the new SM Lanang and Robinson's Supermarket, and many restaurants (Lyndon's, Swiss Deli, etc.). Only 10 mins. to the airport and 30 mins. to Samal."
	},
	{
		"User": "Kristine",
		"Review": "\r Location, bed and price"
	},
	{
		"User": "bernie",
		"Review": "\r location, value for money and friendly staff"
	},
	{
		"User": "Juan",
		"Review": "\r Clean, Privacy, Near city center."
	},
	{
		"User": "Arthur",
		"Review": "\r ac, nothing else"
	},
	{
		"User": "MAHAL",
		"Review": "\r Clean, accessible, friendly doorman "
	},
	{
		"User": "Michael",
		"Review": "\r First, the hotel provide great services. Fast check-in, fast check-out. Second, great things to those who want to commute - jeepneys are just in front of the hotels. 3rd, Friendly staffs! Lovely!"
	},
	{
		"User": "Thomas",
		"Review": "\r Good bed, good shower, good airco"
	},
	{
		"User": "Denis",
		"Review": "\r Bed was good....nothing else"
	},
	{
		"User": "ronaldo",
		"Review": "\r clean room, comfortable bed, nice staff"
	},
	{
		"User": "Norman",
		"Review": "\r Clean room, internet, fast check-in and out"
	},
	{
		"User": "Maria",
		"Review": "\r clean, new hotel, friendly staff"
	},
	{
		"User": "Elizabertus",
		"Review": "\r friendly staff, the room is not big but very clean, its a affordable price"
	},
	{
		"User": "Aldrene",
		"Review": "\r Close to airport and restaurants, nice tv, cheap."
	},
	{
		"User": "Justin",
		"Review": "\r Beds, Showers, Internet"
	},
	{
		"User": "zhen",
		"Review": "\r room is clean, wifi is good, safety is good too."
	},
	{
		"User": "Wayne",
		"Review": "\r Location, Staff, Beds"
	},
	{
		"User": "Norman",
		"Review": "\r Clean, internet, affordable"
	},
	{
		"User": "Norman",
		"Review": "\r Internet, clean, affordable"
	},
	{
		"User": "Kristine",
		"Review": "\r Value for money, clean rooms and comfortable bed"
	},
	{
		"User": "Larry",
		"Review": "\r cheap, clean, good staff. "
	},
	{
		"User": "Brian",
		"Review": "\r Location, distance from airport, the bed"
	},
	{
		"User": "Wayne",
		"Review": "\r Comfort, Cleanliness, Accessability"
	},
	{
		"User": "Larry",
		"Review": "\r Clean, Good Internet, Secure parking"
	},
	{
		"User": "Wayne",
		"Review": "\r Hot Showers, Nice Beds, Central Location"
	},
	{
		"User": "Wayne",
		"Review": "\r Good Location, Comfortable Rooms, Hot Showers"
	},
	{
		"User": "David",
		"Review": "\r Value for money, power shower, very comfortable"
	},
	{
		"User": "Cerilo",
		"Review": "\r location, bed and the safety of their customers"
	},
	{
		"User": "Marian",
		"Review": "\r Bed, location, room price"
	},
	{
		"User": "VICTOR",
		"Review": "\r Strategic location and very near the major shopping malls and tourist attractions in Davao City. Secured parking space also available although limited."
	},
	{
		"User": "JAKE",
		"Review": "\r new rooms, better bathroom, big tv screen."
	}
]
