[
	{
		"User": "ALMA",
		"Review": "Recommend more choices of food."
	},
	{
		"User": "Joyce",
		"Review": "Room was clean, comfortable, and spacious. Bathroom was clean as well. Breakfast spread was filling and delicious. Service was overall okay. Only mishap we had was that the people who came in after us were given a table in the main area while we were directed towards the “extension” which was just a function hall. I felt profiling and discrimination because both parties were made-up of 3 people in a group. So I don’t see why we were not offered to be seated at the main area when we arrived way before the other group. The other group was seated at the main area before we were asked if we were okay with being seated at the extension. "
	},
	{
		"User": "Rachel",
		"Review": "The Buffet breakfast was excellent! Staff were very friendly and helpful! "
	},
	{
		"User": "Ronald",
		"Review": "The standard is being maintained."
	},
	{
		"User": "Carlos",
		"Review": "The hotel is conveniently located beside Abreeza Mall. Front desk staff was really helpful. The rooms were spacious but needs a little bit of 'detailing'. Some paint has bubbled and is about to peel. "
	},
	{
		"User": "Reynaldo",
		"Review": "This was my second stay in SEDA Davao. The first one two years was good because I was alone. But the second stay wasn't that really pleasant. I booked 2 rooms on 6-7 May 2018 for 6 people for a night stay. I was of course expecting that they will provide us beds good for 3 persons each room. But unfortunately when we arrived there and checked in. There were only 2 single beds inside the rooms. I felt I was short changed of the money I payed for 6 people. About the facilities, inside the room there were white paint marks on the floor in our room. The swimming pool is smaller than I thought. The food was ok but I think expensive. Location wise, it's great place to stay because just only a few steps to Abreeza Mall. I dunno if I still have to book this hotel on my next travel."
	},
	{
		"User": "Maria",
		"Review": "This is my 2nd Seda hotel stay, the first being in Iloilo, and I’ve been hooked ever since! I love the huge bed and spacious room, and how comfortable the bed and pillows were. The breakfast was buffet was a treat! Various Filipino dishes were in the buffet spread, liked the tocino and danggit most especially. Dessert was also yummy! Ube and mocha cake, puto and palitaw. All in all it was a perfect stay, since the hotel had it’s own private path going to the mall. "
	},
	{
		"User": "Chad",
		"Review": "We stayed in all the major hotels in Davao on this trip and Seda Abreeza was head and shoulders above the rest. It felt like home in Davao and I have no complaints, which is rare. This is simply a great hotel run by exceptional staff for what must be a company of excellence that manages the hotel. The breakfast buffet was always top notch, with friendly servers and great food. The doormen went out of their way to provide the best service. The pool and recreation areas were clean and pleasant places to relax with the family. All the shopping, food and entertainment one could want at the Abeeza mall across the street. Its the best, safest, cleanest hotel in Davao by a far. "
	},
	{
		"User": "Cathrene",
		"Review": "-Room is nice and clean -Staffs are friendly and helpful -Great location and easy access to mall and church -lovely buffet breakfast -downside is the wifi its just slow -great money value"
	},
	{
		"User": "PAOLO",
		"Review": "everything is awesome except for wifi connection "
	},
	{
		"User": "Bernabe",
		"Review": "Clean and hotel still feels new. Good location."
	},
	{
		"User": "juvie",
		"Review": "The best place to stay while you are in Davao."
	},
	{
		"User": "Maria",
		"Review": "nice location and value for money"
	},
	{
		"User": "ALICIA",
		"Review": "Nice location. Clean room. Breakfast is good. Karl, Singapore"
	},
	{
		"User": "Yvette",
		"Review": "Seda is aware that it has many guests last 17-20 may 2018. It is disappointing that the restaurant staff did not anticipate this thus making many guests wait for almost an hour before they can take their breakfast. Knowing the limited space of the dining hall and the 11th floor lounge, contingency plans should had been undertaken to ensure that all the guests were accommodated. Other than this, seda met our expectations. "
	},
	{
		"User": "Liza",
		"Review": "Very near Abreeza Mall, very nice hotel with very friendly staffs and efficient reception staffs or frontliner. Breakfast is good"
	},
	{
		"User": "Rowena",
		"Review": "Good value for money and good location but the view from our room are the dilapidated houses. "
	},
	{
		"User": "Ismail",
		"Review": "Staff are so good and the hotel is great Resturant is small and need to be bigger as lots of gust need to wait long time to be seated . "
	},
	{
		"User": "Charizza",
		"Review": "The staff are very friendly and helpful. Breakfast buffet is superb. Had a wonderful stay."
	},
	{
		"User": "Marivic",
		"Review": "Had breakfast at the restaurant but got there trays was empty so sad for a buffet. So much workers doing nothing. Staff so slow. "
	},
	{
		"User": "Marivic",
		"Review": "Bed linen wasn’t change had long hair on top the bed when I open. Shower area had mold between tiles. Trash can was so dirty. I was once a housekeeper for 10 years and didn’t see like it before. "
	},
	{
		"User": "Chad",
		"Review": "The whole stay was great. My family didn't want to leave. Very friendly staff. The pool and hotel room were very clean. The breakfast buffet was amazing, best I ever had at a hotel (premier room executive suite). The location was great for shopping as its nearly connected to the Abeeza Alya Mall that has everything including great choices for food and entertainment. If you want a good clean safe hotel in Davao then this is for sure a top pick."
	},
	{
		"User": "Mierycris",
		"Review": "The location was fine and accessible. The staff/s ate friendly and accommodating.. It was only the cleanliness i am very particular with. The breakfast meals has so little for selection. The staff was not able to provide cutleries and set our table before giving it to us. We have to chase for them for utensils. Some guest no longer have breakfast optipns and no top up were made.."
	},
	{
		"User": "Clarito",
		"Review": "Very nice hotel to stay in Davao with family. Looking forward to stay again during next visit to this city."
	},
	{
		"User": "Arvin",
		"Review": "Hotel is just across abreeza making all things very accessible. stayed on the 7th floor. rooms feel a bit old and the carpet on the hallways smells like smoke. I hope they do something to save the hotel considering that its relatively new."
	},
	{
		"User": "Jukhairy",
		"Review": "Centrally located beside Abreeza Mall. Room is very clean and smells good. Staff are polite and customer oriented. Lobby and breakfast area needs improvement. You have to wait longer to be accomodated. "
	},
	{
		"User": "Kristine",
		"Review": "Hassle free check in and check out...well maintained rooms, clean barhroom, sheets and towels...staff were all courteous and professional. Near abreeza mall and other malls in davao...parking and transportation readily available...buffet breakfast is ok..."
	},
	{
		"User": "Rebecca",
		"Review": "for me i love everything about this hotel"
	},
	{
		"User": "RAMON",
		"Review": "The hotel is just right beside Ayala Abreeza Mall, very convenient when it comes to restaurant, banks, and shopping. Quite close to the airport as well. The hotel is just okay. The breakfast? Ahm its cold! Try turning on the food heaters! I ate the same food in my 3 nights stay."
	},
	{
		"User": "DANNA",
		"Review": "The carpet in the room is very dirty and dusty. It should be cleaned. "
	},
	{
		"User": "rashdi",
		"Review": "Excellent hotel, very good location, efficient, courteous & very friendly staff. Had a great stay for 3 days with my family. "
	},
	{
		"User": "Daniel",
		"Review": "The staff of the hotel. From the front desk to the food outlet at the lobby were very friendly. Going out of their way to talk to the guests. But, terrible entertainment during dinner. It would be nice to have more than just one food outlet. "
	},
	{
		"User": "MARY",
		"Review": "Rooms are not sound proof. You can hear the sounds and noise from the party hall."
	},
	{
		"User": "SOOJIN",
		"Review": "Price was ok and location. Its across abreeza mall. But the hall way was so dirty and how they painted the wall was really shocking for me. I thought its a nice hotel. But it was like those inn not hotel. Specially toilet walls and shower area was really bad. But good thing bed was clean. If i go back to Davao i try to stay in other hotels but m not sure there are better ones available already. their food was good at the lobby area but price is little high."
	},
	{
		"User": "yvonne",
		"Review": "nice location clean but pricey"
	},
	{
		"User": "yvonne",
		"Review": "clean ,nice location but pricey"
	},
	{
		"User": "Armila",
		"Review": "our stay was good ,but only thing i would suggest if they can put bidet in their comfort rooms.."
	},
	{
		"User": "Ernie",
		"Review": "Will definitely come back"
	},
	{
		"User": "Harold",
		"Review": "A local home grown brand that provides world class service and convenience across the Philippines. Seda is now a default hotel of choice across the country for any company trips"
	},
	{
		"User": "Gemma",
		"Review": "Excellent from security, assistance, maintenance to restaurant staff. They work extra mile to make your stay comfortable. "
	},
	{
		"User": "Toshihiko",
		"Review": "Breakfast is excellent it has variety of food to choose from. My kids loves the pool and most of all the location is perfect "
	},
	{
		"User": "Charles",
		"Review": "Everything was perfect. very nice hotel. I would like to go back again."
	},
	{
		"User": "Reynaldo",
		"Review": "staff and place was clean and close to abreeza mall"
	},
	{
		"User": "Francis",
		"Review": "Positive - pool - Ayala Center is a stone throw away - you can buy or eat whatever you want - the president sneaks in to have coffee in the night - breakfast is strong Negative - I can’t think of any - this is a good place to stay in."
	},
	{
		"User": "Katrina",
		"Review": "We would appreciate if staff will have the initiative to ask their guest upon check in re Ayala Rewards Circle membership card, so it would be automatic everytime we dine in we get the discounts on food. 😊 Thank you!"
	},
	{
		"User": "chariza",
		"Review": "Place is good untill we left our phone on charge and not off and they didnt bother to call us right away!!! And why th hell our phone is off? If u say its off cauae u submitted it to the stuff thats fine but then When we called the front desk, they said they have to call us back cause they have to call the house keeping its been 12 hours since w check out. The place is good but neve left you belongings"
	},
	{
		"User": "Pio",
		"Review": "Hotel and rooms are really nice, although it is quite secluded. There is a pool and there is a strip mall that has a few restaurants nearby. Good place to spend a few nights in. "
	},
	{
		"User": "Jocelyn",
		"Review": "The place is just across the mall where you can find restaurants. The hotel is not a 5 star, but its clean and accesible to transportation. Although Davao is a very traffic place to visit. Breakfast is good, and that one thing i love. Will come back again when i visit the traffic place of davao."
	},
	{
		"User": "chariza",
		"Review": "my phone was left at too 409 and they did not even bothered to call me to inform that my phone was there. I know i did not used that phone and was charging the whole day and using my other phone. Realized that i haven't got my other phone that i been charging on the room. How come your housekeeping didn't report right away that the phone was left. And when i call the phone it was off!! the fact that it was on when i left it there. The place is excellent location, food is good, but housekeeping is horrible. why?"
	},
	{
		"User": "Sheena",
		"Review": "Please improve the selections of the breakfast buffet especially the dessert section. Overall it was a nice stay. Will definitely choose this hotel again when we return!"
	},
	{
		"User": "Benjamin",
		"Review": "Getting a Club floor rooms provide me the use of the Club business lounge at the 11th flr with free afternoon snack and early evening pica pica while I’m doing my emails. Also you can do meetings. Free breakfast have pleanty of choices Staff are all smile and accommodating. Hotel is 2 minutes walk to Ayala Abreeza mall. I will go back to this hotel again. "
	},
	{
		"User": "Melvie",
		"Review": "A little too busy these days, but still one of two best hotels to stay at when in Davao"
	},
	{
		"User": "Michael",
		"Review": "Grat location, only 1 minute walk from the hotel. The hotel is very clean and well maintained. The swimming pool is small but cozy. Breakfast, I would say is about average. All in all I would definitely stay there again."
	},
	{
		"User": "Stephene",
		"Review": "Easy access to an upscale mall (food, shopping, entertainment). Staffed by friendly professionals. Rooms and facilities are well maintained and clean."
	},
	{
		"User": "Estrella",
		"Review": "Cleanliness and attentive staff"
	},
	{
		"User": "Douglas",
		"Review": "Great facilities, wonderful staff, excellent breakfast, etc."
	},
	{
		"User": "deana",
		"Review": "Nice choice enjoy with shopping just beside the hotel. H&m markspancer levis Robinson shopping and many more nice Korean food that I have tried Staff of the hotel is warm and polite... Medicine have to keep some due to I get cold but could not get medicine they don't sell any panadol there... Overall consider got choice They dont have hair dryer in the room You won't regret to stay here"
	},
	{
		"User": "Anne",
		"Review": "Good location close to mall (just across the street) , new hotel with nice, clean rooms. Comfortable beds, and most importantly very nice staff. "
	},
	{
		"User": "Andrea",
		"Review": "I love this hotel! My husband and i stay here every year when we're in the city. The staff are overall amazing, clean hotel, good food and drinks. I highly recommend this hotel! We will back this april. "
	},
	{
		"User": "Mervin",
		"Review": "I stayed overnight on my birthday last 14 Feb. together with my parents. The check in and check out process was smooth. I was satisfied with the service they had provided as well as the room amenities. Will come back for sure! Thank you Seda Hotel Davao as well as the birthday cake you had given me."
	},
	{
		"User": "IMELDA",
		"Review": "the menus .. other than that its a perfect hotel to stay!!"
	},
	{
		"User": "Victoria",
		"Review": "Definitely would come back as always!. Very near Abreeza Mall. Stall are all very accommodating. Special mention to the good looking and very cordial Banquet Manager/ Assistant who extended a Valentine date table as we didn't have previous reservation. All in all it was a wonderful stay at SEDA Hotel"
	},
	{
		"User": "Sheila",
		"Review": "Great location, nice rooms but a bit expensive. Rooms not ready yet even if we booked online days earlier so we have to wait for 15 minutes for it to be ready for checking in. Front desk staff was however pleasant as he apologized and let us wait in the lounge. Overall it was a peasant stay for us."
	},
	{
		"User": "Neneth",
		"Review": "The staff were helpful and polite especially Jules, Kristine, Karl, Mergent and Ornan. These staff members always welcome us with great smiles and provided us with great service. Our only constructive feedback is to improve the breakfast menu (too repeatetive) same every morning. Also the Misto restaurant is too small can’t cater for a large booking. "
	},
	{
		"User": "Kevin",
		"Review": "Had an amazing stay! Good hotel, nice and spacious rooms. Hotel staff very helpful! Breakfast buffet is really good! Will stay again when returning to Davao "
	},
	{
		"User": "Norgianna",
		"Review": "The seda hotel in Davao city is very good, it is just a hop to abreeza mall and at the Center of the city. I stayed at seda with my husband and son but while in the hotel, my husband did his yoga session on the carpet. Surprisingly, he got redness on his skin and felt itchiness. "
	},
	{
		"User": "Chris",
		"Review": "Friendly and helpful staff but the experience as a whole is let down by the state the hotel is in. No serious issues a quick renovation can’t fix. "
	},
	{
		"User": "Douglas",
		"Review": "This is the third time we have used this hotel. It is in a good location, very safe area, the mall is across the street, it is a nice mall with plenty of shopping and food available. The mall also has a movie theater so if your in the mood for a movie. I plan on going to Seda Abreeza every time I visit Davao "
	},
	{
		"User": "anthony",
		"Review": "Very nice modern hotel. Fantastic buffet breakfeast alot of food to choose from. Good location next door to Abreeza Mall."
	},
	{
		"User": "Louella",
		"Review": "I had a week-long business in Davao and my stay at Seda made it pleasant and manageable. The staff were friendly, attentive and courteous. The lobby gets crowded in the morning but I liked coming in from my business meetings after dinner when it was quiet. The hotel was right across a small mall for emergency personal items. "
	},
	{
		"User": "Lorina",
		"Review": "Seda Hotel is my favorite hotel.I can walk to the ayala mall anytime and the staff of this hotel are friendly and helpful to the guest."
	},
	{
		"User": "Rodjean",
		"Review": "Weve been here a couple of times we kept on coming back because of the good location and good food. But our last stay was so disappointing we left our external drive in the television and they didnt return it to us :( all our files gone! Dishonest staffs!"
	},
	{
		"User": "Celso",
		"Review": "The value for money doesn’t matched the expected facilities and location"
	},
	{
		"User": "Ahmad",
		"Review": "Good place for city view with connection mall nearby within walking distance...but as a muslims i require a kiblat direction point signage on the room ceiling...please put it...as easy for others muslims to find kiblat direction for solah praying purposes... Overall...all of the staff a nice...especially the housekeeping guys...they are heroes!!! Good job guys...keep on the good work...very very friendly..."
	},
	{
		"User": "Curtis",
		"Review": "For the most part the staff are excellent, however the staff in the Executive lounge don’t smile and are not the friendliest which was surprising and. not welcoming nor any smiles or warmth., that was disappointing ."
	},
	{
		"User": "Kim",
		"Review": "Comfortable Clean and convenient "
	},
	{
		"User": "DALE",
		"Review": "I was expecting a room that can be compared to the same price and hotel rating in Manila. Unfortunately, it was below than I've expected."
	},
	{
		"User": "Ying",
		"Review": "Lovely staff. Room is spacious and clean but many issues. Shower head wasn’t working and so were some power points. Bloomberg channel on tv also had some problems and when the technician came he couldn’t solve the issue and suggested I watch BBC instead. Breakfast option was quite limited. I paid a lot more to upgrade to the club room but I didn’t feel the premium is worth . The room is exactly the same and only diff is the executive lounge which wasn’t much to shout about."
	},
	{
		"User": "Rowena",
		"Review": "Stay was ok. Staff unreliable and slow-moving to our requests. Also before booking, we called and ask the reception desk if they have bed railings for I’m bring 2 children both below 5 years old with me. They assured me that they have it. But upon checking in, they told us that they don’t have any bed railings. "
	},
	{
		"User": "Jenette",
		"Review": "Most often we will get this hotel for holidays but we noticed it’s getting even more expensive . "
	},
	{
		"User": "Andros",
		"Review": "It’s very new and near to the departmental store and walking distance to purchase your drinks and water. Traffic is good and not congested "
	},
	{
		"User": "Josinee",
		"Review": "Great and wonderful place with fantastic employee"
	},
	{
		"User": "Curtis",
		"Review": "The hotel is modern, and has a nice atmosphere. The only real problem with this hotel the matenance and care for the pool area . The music I had to request to be put on, also had to ask for cushions, had to go inside to the bar to get drinks and was not properly attended to, the hotel need to spiffy up the pool area"
	},
	{
		"User": "Norman",
		"Review": "The title says it all"
	},
	{
		"User": "Drew",
		"Review": "This hotel is on the same property as Abreeza Mall which makes it very convenient. The club lounge is nice for free snacks and drinks. The pool is adequate. The fixtures are a little dusty and tired for a hotel in this price range. The front desk staff are helpful, but the other staff not so much. Breakfast is somewhat underwhelming. The restaurant is overrated. There is better food at Abreeza. Don't bring outside food or drinks to the pool area or you will be chased away like we were."
	},
	{
		"User": "Stephen",
		"Review": "Very helpful with the group of 4. I’ve been to Seda Abreeza back in 2016 and enjoyed it immensely. "
	},
	{
		"User": "maria",
		"Review": "more choices of foods. i hope someday it would b much bigger pool. the location is in the center o the davao . right infront of abreeza mall .frontdesk adrian is very attentive and friendly ."
	},
	{
		"User": "Eric-Jim",
		"Review": "Just waited for room service for a while, fix the issue.. more people needed!! "
	},
	{
		"User": "devorra",
		"Review": "Somewhat Good points: -Breakfast and service at the mistó was good but still waited few mins for our turn. -Internet was not that bad around the lobby area and was able to use the Mac for my work for few mins. Bad points: - Walls are not sound proof you can hear people talking at the hallway and can hear the other room's noise next to my room. Lot of noise -No door stopper at the main door it clash directly to the closet cabinet. -hand shower at the toilet is located on the left side which is not convenient to grab -Carpet at the hallway needs some drycleaning it didn't smell really bad but it somehow � stinks -Guy receptionist wasnt friendly & accommodating to locals only to foreigner guests -Mini bar stinks not even a working cooler -False ad was expecting hot tub but theres none thats the only reason I book it pls update your advertisement Sorry for being meticulous but overall not worth the price. I am not an important person to rate but think of it as an opportunity to improve your overall service. I am from Davao and would like you to improve."
	},
	{
		"User": "Denis",
		"Review": "We booked the club room and it was worth it. All day free refr3shments (juice, bottled water and soda). All you can eat Snacks from 2-4pm and cocktails at 5-7pm at the club lounge. For me its enough to fill in for lunch and dinner but for those who loves rice this may not be enough. For the breakfast queue at the Misto is quite long. Possible due to the holidays. At around 8am we are already at 8th in the queu. And the spread is enough but Marco Polo is still better.. The pool is small while the room is not sound proof. You can hear people outside ur room walking/talking. Overall club room was worth it. Especially that we had availed the discounted rate at Agoda."
	},
	{
		"User": "Jenette",
		"Review": "My compliments goes more to the hardworking and efficient staff this hotel have. Great teamwork."
	},
	{
		"User": "Fia",
		"Review": "whenever me and my mom visit Davao, we always check in here. this is our 3rd time checking in sa Seda. i think na cozy na sila mama sa place and plus, the staff are very nice, specially ung bell boy. they helped my mom keep the durian sa freezer ata nila so it wont get rotten plus they helped mama pack the boxes for the fruits. "
	},
	{
		"User": "michael",
		"Review": "The wife and came here for 3 nights and were very happy with the Hotel. The room was comforting and a great location to restaurants and right across the street from the mall. "
	},
	{
		"User": "Marjoe",
		"Review": "Good location, the hotel and amenities was okay. Small gym."
	},
	{
		"User": "Christina",
		"Review": "Cozy interiors (I checked in deluxe) efficient staff, very courteous and considerate. Very clean. Carpeting could help solve acoustic/hallway noise issue. Massage service awesome. 👍👌"
	},
	{
		"User": "David",
		"Review": "Nice Staff, clean, one of the best options if safety is your concern.. The internet is not quite fast enough to depend on if you are working online for a living and or its very important to you. "
	},
	{
		"User": "Ronaldo",
		"Review": "The room is clean and comfortable. Staff are courteous and very good breakfast."
	},
	{
		"User": "kristin",
		"Review": "everything's perfect! near everywhere. great bfast buffet"
	},
	{
		"User": "Jenette",
		"Review": "Most preferred hotel in Davao City due to the convenience it Offers , I.e; close proximity to Abreeza mall and other establishments. Great staff and I would like to specially commend Staff Jayson for being so efficient , gracious and accommodating. Special thanks as well to all the front desk personnels and the guards . Thank you for making our stay a very pleasant one. "
	},
	{
		"User": "Pak",
		"Review": "Pro: location -next to a mall. Friendly and helpful staff , good breakfast. Con: location, traffic jam in the morning and evening. Breakfast, long queue. Overall: still one of the better hotels in Davao but a bit pricey. "
	},
	{
		"User": "Lorina",
		"Review": "Seda is a very nice hotel very friendly staff and walking distance to the malls. "
	},
	{
		"User": "Lorraine",
		"Review": "Everything was great! To improve more, Seda should update their carpets. Also, when a customer checks in, take them to their room. "
	},
	{
		"User": "albert",
		"Review": "We were very impressed with everything seda has. Specially their executive lounge. "
	},
	{
		"User": "Grace",
		"Review": "The area of the hotel has heavy traffic, making transportation difficult. "
	},
	{
		"User": "reya",
		"Review": "breakfast could be better (waited a long time for my butter)"
	},
	{
		"User": "Charmelyn",
		"Review": "The hotel staff is so accommodating, great location. "
	},
	{
		"User": "Ma.",
		"Review": "3rd time staying at Seda hotel. Clean rooms, friendly staff and convenient location. "
	},
	{
		"User": "Reeuxies",
		"Review": "Having been a regular guest at this hotel this year with my one year old daughter, I was very disappointed with my recent stay. Even though I had clearly stated in my reservation that I would be arriving between 5-6pm, when I arrived at the hotel from the airport around 6:45pm, I was told that there were no available rooms as the rooms had not been cleaned yet. I was told to wait in the lobby with a hungry baby. We were finally escorted to our room after about a 30 mins wait but the room was a disappointment. Having stayed in the same room in my last stay, the room cleaning was a total rush job where the cleaner failed to leave small hand towels or a bath mat. No kettle even though there was one last time and the safe was locked shut. Breakfast upstairs in the lounge was a disappointment was well. A request for a high chair for my daughter was quickly dismissed as they were all supposedly in use, yet when I walked around to get my food, there was an empty high chair in the corner of the room. Clearly the staff were more busy with something else but it was not cleaning or making the breakfast experience a pleasing one. The tables were dirty and had not been wiped and there were no cutlery. Many guests including myself had to request for them several times before a spoon and fork finally appeared. Davao City now has several good hotels to choose from so I will think carefully where I will stay later this month when I travel back there again. "
	},
	{
		"User": "EFLEDA",
		"Review": "Thin walls... Can hear next room chatter "
	},
	{
		"User": "IAN",
		"Review": "No comment"
	},
	{
		"User": "Brendalyn",
		"Review": "Wasn’t happy with my stay at the hotel. I expected more of what I’ve paid for. I didn’t get the value of what I paid for. Wouldn’t recommend it for foreign friends. "
	},
	{
		"User": "Karla",
		"Review": "We made a booking to Seda Davao because of what we have experienced in Seda BGC and Seda Iloilo. But wrong hotel choice, it seems that Seda Davao has not been informed of their service standards. First we were greeted by a snob hotel driver, we moved on after the Front Office apologized. But they rub salt into the wound when the Front Office staff took note of our credit card details even if our payment pushed thru."
	},
	{
		"User": "Dominic",
		"Review": "When we arrived nobody assist us when in fact 3guards are available at that time, nobody helps us when we disembark our baggages, (For your information: we have 2 kids with us at that time); BUT they helped the next customer, we are so disappointed, we are a constant client of SEDA your records shows, Now we are having second thoughts if we will go back 😞😞😞"
	},
	{
		"User": "Sean",
		"Review": "Love the location"
	},
	{
		"User": "Thomas",
		"Review": "Wonderful place. I'll remember it. Good example of Philippine hospitality. Be sure to select 'breakfast option' or you'll pay 600 pesos ($11) for it. If you eat a big breakfast, it's a good deal."
	},
	{
		"User": "LORENA",
		"Review": "Nice pool the choice of international foods was great but menu changes daily sometimes for local foods bad luck if you don't like local foods like rice and fish close to all things the rooms very if you got a small room it's a bit simple you pay more you get something impressive to open your eyes all up I like it."
	},
	{
		"User": "Myrna",
		"Review": "I booked two bedroom accomodation in 10th floor my panrens and my sister stayed there. They love the service and the place. The most who enjoyed my dad 90yrs old celebrated his surprised bday in the hotel. Thanks very much Seda i will highly recommend the Hotel."
	},
	{
		"User": "Alan",
		"Review": "No foul smells and everything works fine due to it being recently built. The location next to a Mall is nice and the location is in the heart of the city."
	},
	{
		"User": "Tang",
		"Review": "-Very courteous & responsive staff -Comfortable rooms -Convenient location "
	},
	{
		"User": "Allan",
		"Review": "Rooms are new and well maintained. Staff are courteous and breakfast is good. Plus great location!! Thumbs up!"
	},
	{
		"User": "Pak",
		"Review": "Location is good, next to a mall. Breakfast is alright but not refilled fast enough. Will stay here again."
	},
	{
		"User": "Veronica",
		"Review": "The hotel is near to everything you might need, shops, restaurant, cafe, massage/spa, local tourist destination & church. Transportation is not a problem as many jeepneys pass Abreeza and Grab-taxi is easy to book. We will definitely recommend it and will surely stay there when in Davao."
	},
	{
		"User": "Nova",
		"Review": "What stood out for me is the location. The amenities is wonderful for busy business travelers like me ex. the gym is quite spacious. I also like the fact that the slippers are thick and comfortable. Reusable. My one big turn off is the staff, esp at the front desk, needs more training in courtesy. Needs to smile more often with a positive disposition. "
	},
	{
		"User": "Ivy",
		"Review": "Our group was happy to have spent our team building here."
	},
	{
		"User": "Abegail",
		"Review": "Torn bedsheet, fluid stains on the bed runner, dirty chair (by the desk), no hairdryer, no hand towel on the first day"
	},
	{
		"User": "Ma.",
		"Review": "Very convenient location, clean and comfortable rooms, friendly and accommodating staffs. I would highly recommend Seda Hotel to everyone. Would surely come back soon!"
	},
	{
		"User": "Kristine",
		"Review": "the hotel is more pricey than the others. but accessible to the abreeza mall. what i dont like is , a lot of traffic on the way to the hotel! but hotel it self is okey"
	},
	{
		"User": "Stefan",
		"Review": "If you have the room at 9-10-11 floors with a balcony you have an access to the lounge, perfectly to your breakfast and afternoon tea. This hotel was so much better than Marco Polo Hotel. So I am very pleased. Sincerely yours Stefan s"
	},
	{
		"User": "RUDOLF",
		"Review": "Staff good, best breakfast buffet in Davao City"
	},
	{
		"User": "Eric",
		"Review": "I am satisfy to stay here because the location is very good,very closed to mall and the room is clean as well"
	},
	{
		"User": "Ivy",
		"Review": "Easy access to downtown area. The staff are all friendly and efficient. I commend the front desk staff, the check in / out process is fast and easy. I felt Davao's hospitality at its best with sincerity. I had a great stay! "
	},
	{
		"User": "Maureen",
		"Review": "My family loves the room and its ease of access to Abreeza Mall. Though the pool was quite small - could barely fit 20 adults.The breakfast was delicious, my mother loved the unsalted danggit. :) I loved the bacon - not too salty."
	},
	{
		"User": "mirasol",
		"Review": "Nice building coz it's new accommodating staff.. I celebrate my 40th bday I booked for our dinner. I was disappointed coz the foods are served in cold. I choose already the foods in order so that they can prepare well but sadness they served foods maybe 10 minutes after they cooked.. buffet breakfast is good and many have choices.. "
	},
	{
		"User": "Paul",
		"Review": "Superb stay here. I made a quick trip to the Philippines from the states and came straight to Davao for the 2017 Kadayawan. I stayed a total of 5 nights but I spent 2 nights here at SEDA and 3 nights downtown to be close to the activities and parades. I booked a room with executive lounge access that was on the 10th floor, while the executive lounge was one floor above. I had checked out of my downtown hotel after the kadayawan festivities mid-morning and they allowed me to check in upon arrival at around 10am. Staff bent over backwards and I didn't even have to ask. Didn't have to ask for a room with a great view of the city, but I sure got one, an end room with an absolutely awesome wide view. It was great falling asleep at night above the light of the city. I had a major fall during a mountain trail run the day before, and one of my wounds that I didn't get stitched that needed it, reopened and bled a fair amount. I called the front desk and asked if they had bandages and staff came up to my room with a large first aid kit and took care of it. Thanks so much Seda, I will be back around Araw ng Dabaw 2018! "
	},
	{
		"User": "Daniel",
		"Review": "I think Seda is the best hotel in Davao. Great rooms, awesome food, well trained staff and the perfect location. At this price point you cannot do better."
	},
	{
		"User": "khay",
		"Review": "- location is very accessible - friendly staff everywhere especially at club lounge - clean & comfortable room"
	},
	{
		"User": "ARIEL",
		"Review": "great location, good foods! we'll come back definitely..."
	},
	{
		"User": "ronald",
		"Review": "HAD TO WAIT SEVERAL HOURS AFTER TWO CHECK--IN TIME TO CHECK IN. LOST MONEY FOR WHAT I PAID FOR AND I ALL GOT WAS A SORRY FULLY BOOKED YOU HAVE TO WAIT FOR ROOM. WHAT I PAID FOR A CERTAIN CHECK IN TIME AND LEFT TAGUM UST TO GET THERE AND WAIT IN LOBBY??? VERY DISAPPOINTED"
	},
	{
		"User": "Lourdes",
		"Review": "Great variety of breakfast meals and its just a walking distnce to the shopping mall. "
	},
	{
		"User": "Kristine",
		"Review": "Pros: 1. It is in the heart of the city, near to everything 2. Clean room 3. Friendly staff Cons: 1. Thin wall, if you have children specially young kids and if it throws tantrum. Neighbors can really hear it from their room"
	},
	{
		"User": "gregory",
		"Review": "The location is good as it is owned by the mall next door. I like that you have a supermarket so close.. The gym facilities are just adequate given the size of the room, a let-down to anyone who stays there longer and wants a more substantial workout. The pool as well adequate with some direct sunlight during the day. The breakfasts were quite good with a competent wait staff. The beds are comfortable but the room itself is showing some wear. "
	},
	{
		"User": "CHIN",
		"Review": "toilet has smell."
	},
	{
		"User": "Gemma",
		"Review": "Professional and friendly staff makes this hotel maintain its good reputation aside from its good-sized rooms and amenities. Special thanks to Ruben, Rey, Kristine and all the staff who made our stay, home away from home."
	},
	{
		"User": "Kevin",
		"Review": "When we chk in we weren't briefed that there was a dress code at the restaurant. But those booking pls be aware that the pool good to fit only 20 heads not more.small size for dwarf would be good but if european type would better be elsewhere.i wouldnt want recommend this place even its \"new\"."
	},
	{
		"User": "Mer-ain",
		"Review": "We stayed for a day only but i enjoyed it. Location was great since it is a walking distance from abreeza mall. The room was spacious and clean. The staff were nice and polite. I highly recommend it😊"
	},
	{
		"User": "Edwin",
		"Review": "The hotel is next to Ayala Mall, had better shopping and food offering that than the SM mall 15 minutes away. the hotel room is clean, did not check out the gym (if any). the pool looks small. the restaurant does offer much food choices, but you can find plenty across the mall. Check out Boiling Crab and Shrimp (by taxi 5 minutes away) "
	},
	{
		"User": "Orlando",
		"Review": "Service from staff"
	},
	{
		"User": "Diana",
		"Review": "Rooms are in soothing earth colors, massage closes at 1am which gives guest enough time for relaxation, 24 dining is a plus! The only thing I was concerned about is the wifi, P200/hr."
	},
	{
		"User": "Christian",
		"Review": "beside an ayala mall. Just 20-30 mins away from Airport. Good selection of food for breakfast"
	},
	{
		"User": "Charisse",
		"Review": "breakfast is ❤"
	},
	{
		"User": "Ellen",
		"Review": "This hotel has a good location because the abreeza mall is beside Seda hotel. The hotel is new , clean but i don't like here is that i heard some noises beside our room and the voices of the guest who are walking in the aisle interrupt us. One thing is that we arrive in davao airport around 5:30 am and the hotel has no shuttle bus . Our other friends are booked in Marco polo davao and they have a shuttle bus to bring them in the hotel ...the desk staff and driver of the Marco polo bus offered to bring us to Seda hotel for free..: i was so amaze with the marco polo service..."
	},
	{
		"User": "Abdel",
		"Review": "So dissapointed because it is a Seda hotel I thought they have a superb room and mattress. You can see from the walls and corners it slowly giving up! Didn't have a hairdryer. It should be worth half its published rate. On the positive note, buffet breakfast was great!"
	},
	{
		"User": "Flordeliza",
		"Review": "Hospitable staff , cleanliness and the buffet breakfast was enjoyable. I was very happy during my two days stay at this hotel that I ended up booking another room for my family. I will definitely book again to stay on my next holiday. "
	},
	{
		"User": "gregorio",
		"Review": "good breakfast buffet and nice room"
	},
	{
		"User": "Reinalissa",
		"Review": "We appreciate the free early check-in. We were able to rest after a very early flight from Manila. The staff were very efficient and accomodating. Breakfast selection is good and tasty. There are enough seats for hotel guests at the dining area. There is a pool but we did not try it. Security is top notch. There is a mall across the hotel and taxi is easy to find around the area."
	},
	{
		"User": "Anne",
		"Review": "Arrived in one of their units and it was very clean"
	},
	{
		"User": "Marianne",
		"Review": "Very clean"
	},
	{
		"User": "Joseph",
		"Review": "My stay this time was definitely better than the first one. I got the club room which unlocks the privilege of using the Executive Lounge at the 11th floor. Food and Beverage selections during breakfast and happy hour cocktails were good. Service is always good in here. The room design is similar to the one at the lower floors with the exception of the study lamp. Overall a really good stay. "
	},
	{
		"User": "Joseph",
		"Review": "Hotel Stay was overall very good. Breakfast selections were okay, but could have been better for the price of the room. Hotel room was very neat and nicely designed. It's hard to swim at the pool since location of the pool is quite awkward and very visible from the lobby."
	},
	{
		"User": "CECILIA",
		"Review": "Nice hotel"
	},
	{
		"User": "vincent",
		"Review": "mall is right across. taxi is easy. spacious room. pool is not that huge."
	},
	{
		"User": "Marrissa",
		"Review": "The location is good. Staff are very friendly and accomodating"
	},
	{
		"User": "Marrissa",
		"Review": "Location is good . Near mall, staff are very friendly"
	},
	{
		"User": "DARLYN",
		"Review": "This is the second time I stayed at SEDA Abreeza. Overall, our stay was still good. We were upgraded to a premium room which was very nice. My only comment is for the housekeeping to improve their services. On our second day,they forgot to give us hand towels. On our third day, they forgot to replace our towels."
	},
	{
		"User": "Karen",
		"Review": "Went here for staycation a couple of times. Love their bed and pillows :)"
	},
	{
		"User": "Azalea",
		"Review": "I stay at Seda everytime I visit Davao so I'm used to the service and the facilities. But this time, the housekeeping fell short of my expectations. They usually have my room made up by 9 or 10am at the latest (I usually request housekeeping at 7), but this time, housekeeping came by at 1pm -- and only after I called the front desk to follow up. The breakfast buffet is also a bit disappointing (specifically the hashbrowns, the bacon, and the sausages). These are what I always get, so I have basis for comparison and I'm a bit disappointed this time. The taste and the texture is not up to the usual standard. Other than these, everything else was as expected. And I will still go to/recommend Seda for Davao visits."
	},
	{
		"User": "Douglas",
		"Review": "The hotel is conveniently located next to a mall thus easy access to a good variety of food. Staff were friendly and helpful."
	},
	{
		"User": "renalyn",
		"Review": "Staff needs to be more friendly. Thier so uptight. "
	},
	{
		"User": "Rosemarie",
		"Review": "I like the feel of the room. Very clean, very homey. Great advantage is, its just beside Abreeza Mall. The food is delicious too. Seda will always be my first choice. Keep it up!"
	},
	{
		"User": "Mary",
		"Review": "This is very ideal place to stay into. Id appreciate if their rest rooms have bidet or at least pail and dipper. You can have these things requested though. It would have been better if theyd have the initiative to put them inside the room. The buffet breakfast is one of the best thing of checking in. There are varieties of food to choose from. This is also right across Abreeza Mall which makes it more convenient to tourists. "
	},
	{
		"User": "Aimee",
		"Review": "Our stay was very comfortable and I appreciated the extra effort the staff extended our little boy who felt very at home. Shout out to ballhop Lito who instantly became a friend to us for looking after our boy's needs. One thing to be improved can be the coordination at the front desk because right after I called to ask for assitance with our bags, we got a call asking if we will extend our stay. But no biggie! Overall stay and service was great!👍🏼"
	},
	{
		"User": "Angelica",
		"Review": "I booked this for my parents. We loved how it's directly in front of Abreeza Mall, very convenient for shopping and dining. We also loved the privacy of the Executive Lounge on the top floor. They serve free coffee and tea at 2-4pm and free cocktails at 5-7pm. Those amenities alone make the executive rooms already worth it. I just hope they do something about the walls in the rooms. It's not soundproof. We could hear the noise from the hallway and the adjacent rooms. "
	},
	{
		"User": "Li",
		"Review": "Very noisy room. No sound insulation at all. Will be waken up by noisy door closing sound by neighbouring rooms. Can hear clearly what TV channel our neighbour is watching! Amount paid is too excessive for this room type. Room quality is lower than 3 star!"
	},
	{
		"User": "Corrine",
		"Review": "Our request for a connecting room or even adjacent room was not meet. Our rooms were 901 and 912. This set up is difficult in case of emergency like earthquake which happened during our stay."
	},
	{
		"User": "Angela",
		"Review": "Small room but good location. Near abreeza mall. "
	},
	{
		"User": "Ryan",
		"Review": "The staff were very friendly and accomodating. The restaurant food and breakfast are good. The location is extremely convenient since Abreeza Mall is just across the hotel."
	},
	{
		"User": "Ethel",
		"Review": "The room was clean and spacious. It was a relaxing and comfortable stay. "
	},
	{
		"User": "Anna",
		"Review": "I am very satisfied with their service, their staff is very accommodating. The room was clean and spacious. The location is great easy access to malls and restaurants. And btw i miss their durian coffee!"
	},
	{
		"User": "lukas",
		"Review": "The best hotel in Davao city , modern kitchen , very nice and personnel that is taking care of you, big modern shopping mall on the city of it, very central in davao"
	},
	{
		"User": "John",
		"Review": "you can never go wrong with Seda Hotels"
	},
	{
		"User": "Rob",
		"Review": "Choice of food and breakfast were disappointing "
	},
	{
		"User": "Adorado",
		"Review": "Everything you need is within the vicinity with shopping mall beside the hotel."
	},
	{
		"User": "Kritthee",
		"Review": "The hotel is near mall so we can find restaurants easily. We stayed at club floor."
	},
	{
		"User": "Christian",
		"Review": "Great location. Good selection of food. Friendly staffs. Comfortable room"
	},
	{
		"User": "Anthony",
		"Review": "Always enjoy my stay there, great room and friendly staff, nice breakfast and great location as across the road from Abrezza Mall. Will stay again next time for sure"
	},
	{
		"User": "Dynah",
		"Review": "Had good time staying in this hotel all in all i'll give them a 5."
	},
	{
		"User": "Sherylyn",
		"Review": "We were placed in a corner room with a view of Abreeza mall and Mt Apo. We had cocktails in the club lounge. The upgrade was worth it!"
	},
	{
		"User": "Brock",
		"Review": "Can't really fault Seda. Having the mall next door is very convenient. The staff at Seda are excellent."
	},
	{
		"User": "Greg",
		"Review": "This hotel is truly on the level of any good hotel in the US or anywhere else in the west. Great location too, just a few steps away from one of the best malls in town. "
	},
	{
		"User": "Anna",
		"Review": "We had a wonderful weekend stay at Seda Abreeza. The staff were helpful, efficient and always polite. We requested for an early check in prior to our arrival in Davao and was given a confirmation the night before. Usually, hotels will give you a \"no assurance\" reply but i received a confirmation from Seda immediately. Their people have been trained well to handle queries and requests without the usual \"will check with management\"...Location of hotel is excellent, its connected to an Ayala mall. Breakfast is good. Will definitely stay here again in the future."
	},
	{
		"User": "carla",
		"Review": "its not what we expected. the bed are comfy but the room is quite small for the price."
	},
	{
		"User": "CARLOS",
		"Review": "It was great returning to Seda. The hotel is consistently clean, safe and the staff are friendly. The location is fantastic with the mall nearby and the church was just a walking distance( great since we were there on a Sunday). We would definitely return. Oh yeah, the breakfast was awesome! I'm a vegetarian and I had many to eat! Thanks Seda!"
	},
	{
		"User": "Vanessa",
		"Review": "The location is very close to Abreeza Mall. Staff were friendly and helpful."
	},
	{
		"User": "renalyn",
		"Review": "Rooms are big especially thier club room. IF ur a traveling family with kids doing business this would be good because the mall is just nxt door. So u can just send the kids to the mall while doing ur business. "
	},
	{
		"User": "keiichi",
		"Review": "I told them three times. Kindly turn off the aircon before check-in. But they did not..."
	},
	{
		"User": "Ellora",
		"Review": "upon check in of guest make sure the room is well prepared with complimentaries and toiletries refilled.thank you"
	},
	{
		"User": "Jean",
		"Review": "Location is ideal and across the road from Abreeza Shopping Mall and walking distance to Victoria Mall. Staff very friendly and helpful. Room was clean and serviced daily.Breakfast good, may be more variety required but what was on offer was prepared well."
	},
	{
		"User": "Andrew",
		"Review": "Location is great, hotel is new, nice and clean and the staff are fantastic. My favorite hotel in Davao. An issue that they need to fix: Buffet breakfast cannot accommodate for all of the guests so 4 out of my 5 days we had to wait between 10 and 20 min in the foyer for a seat in the buffet area. This is really poor of the hotel when there is plenty of room to add more tables"
	},
	{
		"User": "Andrew",
		"Review": "Location is great, hotel is new, nice and clean and the staff are fantastic. My favorite hotel in Davao. An issue that they need to fix: Buffet breakfast cannot accommodate for all of the guests so 4 out of my 5 days we had to wait between 10 and 20 min in the foyer for a seat in the buffet area. This is really poor of the hotel when there is plenty of room to add more tables"
	},
	{
		"User": "Robin",
		"Review": "Friendly staff "
	},
	{
		"User": "Keith",
		"Review": "With very accommodating crew at the same time near to Abreeza Mall. "
	},
	{
		"User": "richard",
		"Review": "Not for us other then the mall across the street we couldnt go anywhere without a cab and not much to do there and price was high"
	},
	{
		"User": "Eliza",
		"Review": "It was a pleasure to stay here because everyone was just friendly and helpful. When I got caught in the rain while I was at the mall across the street, the guard radioed the hotel to lend me an umbrella and someone came to get me immediately!"
	},
	{
		"User": "magdalena",
		"Review": "Would definitely recommend this hotel. Very good breakfast spread courteous staff good location. We were there on valentines day and although we were nit part of their valentines dinner they were gracious enough to allow us to use their photo booth. One of the staff even had to look for the photographer who was on break at that time. Very well trained staff. "
	},
	{
		"User": "Myra",
		"Review": "Pros -location, buffet breakfast, knowledgeable and friendly staff Cons - no hair dryer in each room. It has to be requested from the front desk. "
	},
	{
		"User": "Wanna",
		"Review": "Nice and clean hotel, staff is helpful and friendly "
	},
	{
		"User": "Paulie",
		"Review": "Great value for a more modern hotel. Right across from the mall. Friendly staff and the breakfast is good"
	},
	{
		"User": "Alex",
		"Review": "It's a nice place but a little uptight with dress code for breakfast and security. Breakfast is excellent, pool sux"
	},
	{
		"User": "Kimberly",
		"Review": "My friends and I had a staycation at Seda Davao during the holiday season. Primarily chose this hotel for its spacious rooms and convenient location. Check-in was a breeze. Only problem upon arrival at room was that we noticed a couple of essentials missing from the bathroom (floor towel and hand towels). Must have been overlooked because of the busy season. Nonetheless, staff were very prompt and responsive to our requests. "
	},
	{
		"User": "Grin",
		"Review": "Very kind to give early check in and late check out."
	},
	{
		"User": "Kristianne",
		"Review": "Location - pretty much okay. Very close to Abreeza Mall which makes it so accessible. Check-in - We were able to check-in early even before the check-in time which is a good thing. However, I emailed the hotel and requested for a connecting room if possible or even rooms that are close to each other ahead of time. I expected that it was arranged already yet during check-in they were still looking for rooms that we can have. Breakfast was okay. Staff who served during breakfast were really nice. Pool staff was also nice. Room - okay but could have a chair or a small sofa even for a deluxe room. We have to ask for a lot of things as it was not complete when we checked in~ towels, slippers and tissues. Overall the stay was nice. "
	},
	{
		"User": "Raine",
		"Review": "Nothing New. Basic Hotel. Location Ok. "
	},
	{
		"User": "Anton",
		"Review": "Very convenient location as it is across Ayala's Abreeza mall so shopping and dining are accessible. Room's are clean and well appointed. The breakfast buffet offered a lot of choices."
	},
	{
		"User": "Mary",
		"Review": "We spent our last night in Davao here and we weren't disappointed in having a good night sleep/rest after 4 days of touring. Room was spacious and even comes with kitchenette, which may be useful if you plan to stay longer. Right accross the Ayala Mall so it was convenient also in getting 'pasalubongs' to bring back home. WiFi is quite slow, though and faster WiFi would mean additional cost. Staff are nice and attentive. So yes, we'd recommend staying in this hotel whenever you're in Davao."
	},
	{
		"User": "ONG",
		"Review": "Excellent location, the mall is just a stone throw away… a good variety of food"
	},
	{
		"User": "Michael",
		"Review": "Very clean facility and rooms; staff very helpful and pleasant; excellent selection of breakfast items; centrally located and close to shopping."
	},
	{
		"User": "Raoul",
		"Review": "still OK for Davao standards but getting old"
	},
	{
		"User": "Marian",
		"Review": "Stones throw from Ayala mall"
	},
	{
		"User": "jean",
		"Review": "Hotel is great with great staff and great breakfast buffet.. parking sucks though.. but would still recommend this to my friend"
	},
	{
		"User": "Wayne",
		"Review": "Close to shopping and entertainment "
	},
	{
		"User": "sandra",
		"Review": "The location, the staff, the facilities... all were as expected. Would be great to change breakfast menu once in a while though :) "
	},
	{
		"User": "pilar",
		"Review": "Spacious room and bed"
	},
	{
		"User": "Gisella",
		"Review": "The staff are very helpful, the location can't be beat and the rooms are well-appointed."
	},
	{
		"User": "John",
		"Review": "friendly staff"
	},
	{
		"User": "Koichi",
		"Review": "Overall I would rate my stay as good. It's just that the price must have been solely based on the brand and location. I think that the value for money is not that impressive."
	},
	{
		"User": "Ronaldo",
		"Review": "Always my favorite hotel"
	},
	{
		"User": "Divinofiel",
		"Review": "Hotel is very close to Abreeza Mall. Friendly staff. Would stay here again if I will be in Davao."
	},
	{
		"User": "CATHERINE",
		"Review": "Great location and close to the Mall. Very good breakfast buffet."
	},
	{
		"User": "Jecsan",
		"Review": "Convenient location"
	},
	{
		"User": "sandra",
		"Review": "The location was great, it was across Abreeza mall. The staff was helpful enough. Had an issue with parking though. Had to park across the street because some walk in guests occupied the parking below. I think they should prioritize hotel guests for parking ... what I noticed is they are starting to lose the same flare they had when they opened... but I would still stay there ... "
	},
	{
		"User": "Iam",
		"Review": "my wife left her dress at our hotel room,we noticed it when we got home,their staff should have informed us at check out.."
	},
	{
		"User": "KAREN",
		"Review": "Very accessible Hotel. Helpful staff. Nice rooms."
	},
	{
		"User": "Martha",
		"Review": "None"
	},
	{
		"User": "Gemma",
		"Review": "The staff is very helpful making my stay more comfortable and safe."
	},
	{
		"User": "Derk",
		"Review": "The hotel's location is great, next to Abreeza Mall. The hotel itself is good however it is starting to see signs of being a few years old. There are many areas where a new paint job is overdue rather than just a touch up, which is done with sometimes a different tone paint. If you come with your own car be aware of the fact that when the hotel has any functions or parties, locals from Davao are allowed to park in the underground parking garage and no space is set aside for actual guests who are paying to stay at the hotel. When in the hotel I saw several cars parked in the parking with the drivers waiting in the car. They could be waiting anywhere outside also."
	},
	{
		"User": "Gemma",
		"Review": "nice and cozy hotel with access to malls"
	},
	{
		"User": "cesar",
		"Review": "excellent hotel"
	},
	{
		"User": "Ennalyn",
		"Review": "New hotel. Pool so small"
	},
	{
		"User": "Ben",
		"Review": "This hotel is far better than Marco Polo, however still needs attention. When I stayed there they had a fire drill practice at 730AM till 830AM. I never experienced this in any hotel I ever stayed in for the past 30 years. I think they could of easily accomplished their goals if they started the drill at 11AM and not compromised the guests so early. Breakfast buffet is minimal. Gym only has about 5 machines. The big advantage to this hotel is that it is fairly new so it is pretty clean. Also the location is directly across from the Ayala Mall. Typically I will stay at the Marco Polo which was booked so I tried this hotel. As much as the Marco Polo needs renovations I would probably stay there due to a more complete gym and a nicer bar. "
	},
	{
		"User": "Vicente",
		"Review": "Ok"
	},
	{
		"User": "MARIA",
		"Review": "I love it!!😊"
	},
	{
		"User": "Derk",
		"Review": "We are \"regulars\" at the hotel due to its location. We stay at the club or premier rooms which gives us some extra perks such as a lounge with free drinks and breakfast in the lounge area instead of downstairs. The latest, breakfast in the lounge is disappointing as the selection is very limited and it is recommended to have breakfast downstairs where the selection is better. A shame that no ham or other cold cuts are available for those who want them (Foreigners, like myself). Every time I'm being promised that they are out just that day we're there and when they have something the hotel staff cuts it up in tiny little pieces. Also, no croissants at breakfast."
	},
	{
		"User": "Bashiruddin",
		"Review": "The hotel is one of the best hotels i've been. The staff were all couteous and make you feel at home. Keep it up guys!"
	},
	{
		"User": "Anna",
		"Review": "Seda Abreeza has a great location. The breakfast buffets were always good and there was daily variety. Plus, the staff was excellent - friendly, helpful, and genuinely willing to help. We would highly recommend this place!"
	},
	{
		"User": "MEDARDO",
		"Review": "Years of staying in hotels and I have never experienced such a bunch of indifferent hotel staff. it was just one service disappointment after another. From the time I arrived to check in, I was horrified my bags were left in the middle of the lobby behind me, someone could have just walked away with it. You guessed it, I had to roll my bags up myself. No one was there to assist. Two days in a row I came back to the room the same way I left it in the morning. I complained about the air-condition vents and nobody came so I had to work on it myself. Twice I ran into a tie wearing staff and believe it or not, he did not even look up to greet me, where normally they would just be too smiley and helpful, eager to strike a connection. I had to push my floor button. AND TO THINK I WAS BOOKED IN A CLUB ROOM!!!"
	},
	{
		"User": "Francis",
		"Review": "Experience was very nice. Need to improve internet service"
	},
	{
		"User": "Dexter",
		"Review": "Hotel is located very near a mall, so plus points for convenience and accessibility. Staff are attentive and helpful. "
	},
	{
		"User": "YAU",
		"Review": "Clean and good"
	},
	{
		"User": "DARLYN",
		"Review": "The family enjoyed our stay at SEDA Abreeza. Most remarkable for me was the friendly staff especially housekeeping for the Club room. There is a variety of food menu for breakfast. The proximity to the Abreeza mall is the plus point as we had no worries about where and what to eat"
	},
	{
		"User": "clyde",
		"Review": "Great Room looking right down on abrezza mall, only a few minutes walk to walk, Great staff always friendly and helpful at all times, Great buffet breakfast with lots of choices, Well done Seda we will be back next year"
	},
	{
		"User": "Joselito",
		"Review": "We enjoyed our stayed and definitely w ewill come back again here."
	},
	{
		"User": "leah",
		"Review": "one of the best hotels in Davao.. friendly staff and very clean and spacious room. definitely will stay again :)"
	},
	{
		"User": "Coleen",
		"Review": "Superb location! Just cross the street to get to Abreeza Mall. We love the club room and the club lounge! You can have your breakfast at Misto or at the Club Lounge, but there's a great selection at Misto =) Seda Abreeza is your home away from home =)"
	},
	{
		"User": "HONGZHI",
		"Review": "hotel just located outside of abreeza mall,.which is so convenient that even if you dont have supplement breakfast you can just grab jollibee from outside of abreeza mall"
	},
	{
		"User": "FUAD",
		"Review": "i enjoy staying in Seda hotel Davao the hotel is excellent "
	},
	{
		"User": "April",
		"Review": "Seda is one of the best hotels in Davao now. Its proximity to Abreeza mall and center of town makes it ideal if you have business or enjoy shopping or cant survive far from city lights and sounds. The room was very comfortable, new and clean, water pressure fantastic. Staff was great as well. Breakfast buffet alright but gets boring after a few days. "
	},
	{
		"User": "Benson",
		"Review": "I had great experience staying at this hotel. Being a father, bringing two little children was easy, especially buying my grocery needs at Abreeza Mall, which happens to be just across the mall. Thank you for wonderful vacation experience with your hotel. Great staff as well."
	},
	{
		"User": "Con",
		"Review": "Beautiful hotel, clean friendly staff , Spacious rooms. Every facility you could imagine. "
	},
	{
		"User": "Alan",
		"Review": "A new hotel right next to a Mall. The rooms were very nice with great amenities. The breakfast was great with a good selection of foods. One of the better places to stay in Davao proper."
	},
	{
		"User": "Sarip",
		"Review": "Good location, near mall"
	},
	{
		"User": "william",
		"Review": "Good location "
	},
	{
		"User": "Marvin",
		"Review": "Your money's worth."
	},
	{
		"User": "Lerma",
		"Review": "Me and my brother had a great experience in seda abreeza. We arrived early at 6am in Davao and i rang the hotel and they accomodated us that early for free of charge. Buffet breakfast was great and one more good thing is too close to the shopping mall and restaurant. Well done abreeza, i will certainly come back again... From England"
	},
	{
		"User": "Edward",
		"Review": "Nice place next to abreeza mall. Clean. Friendly. Big tv in room. Fast wifi. Definitely will stay again. "
	},
	{
		"User": "Charnell",
		"Review": "Nice room, probably the best hotel in the city, staffs are friendly"
	},
	{
		"User": "Samuel",
		"Review": "The hotel is in strategic location, across Abreeza Mall and 30mins away from the airport. We booked in a Club Room which is perfect for vacationing couple like us as it provide access to the Club lounge where you can have breakfast, afternoon tea and cocktails without paying extra. The area around the hotel and mall is great for a breeze walk and jogging, then capped it with few stretches in the gym and a quick deep in the adjacent pool. There are function rooms too in the mezzanine which you can book for that mini-conference or business meetings. The staff are courteous and always cheerfully help you on your requests."
	},
	{
		"User": "Abigail",
		"Review": "We have stayed at Seda in Davao twice now, and both times we have really enjoyed it. The staff is outstanding--friendly, helpful, remembered us from our previous stay, and really just made for a terrific stay overall. (in particular, Jun went above and beyond to help us feel comfortable both times we've stayed!) My only comments, and they are small ones, relate to details that could be improved in order to compete with Davao's other top notch hotels. The bathrooms are very clean, but need some touch up paint. The towels also look like they could stand to be replaced in order to give the feeling of luxury that matches the rest of the hotel. Also, the shower door didn't close properly which caused our bathroom to be wet for the majority of our stay. The pool is the only other area that I would comment on--the chair situation is difficult is there is more than one group using the pool. There need to be more lounge chairs there for people to relax and enjoy the pool. I know this may sound like very small things, which they are. Seda is a beautiful hotel with great staff and a great location. Thanks for making our stay wonderful! "
	},
	{
		"User": "Jacob",
		"Review": "All is fine, nothing special and nothing wrong with"
	},
	{
		"User": "Alma",
		"Review": "Abreeza Mall 👍🏼"
	},
	{
		"User": "Henrietta",
		"Review": "Staff are quite friendly but the only problem is that they always speak their local dialect and some of them can hardly speak English ! For our breakfast, we have to wait a long time before we can be seated. Rooms are clean. Oh by the way, their towels are almost colored brown and I have to ask housekeeping to change clean towels. "
	},
	{
		"User": "Carl",
		"Review": "I love their food.mfantastic stay"
	},
	{
		"User": "darlene",
		"Review": "The location is very good because its near a mall. And even if its near a mall, its still quiet. "
	},
	{
		"User": "Maria",
		"Review": "We always stay here whenever we are in Davao.It is located just across Seda Abreeza so it's very convenient if you need anything or you want to eat.Breakfast was delicious and staff was very pleasant with their guests."
	},
	{
		"User": "lyle",
		"Review": "Great room with a super comfy bed. Located between a mall and 24 hour spa. Staff were friendly and efficient. Internet was constantly available. Best hotel I've stayed in when travelling to the Philippines "
	},
	{
		"User": "Ronaldo",
		"Review": "Conveniently located beside the Ayala Abreeza mall and approximately 30 minutes from the airport. Friendly and helpful staff. Clean room, comfy bed, hot shower, and fast check-in / check-out. You can buy the award winning Malagos chocolates and cheeses in this hotel. I had a great stay and will comeback. Thanks Seda. I recommend this hotel to all travelers to Davao."
	},
	{
		"User": "Bashiruddin",
		"Review": "The hotel staff are courteous and ready to assist at all times. I will come again and stay in this hotel. "
	},
	{
		"User": "John",
		"Review": "nice place and nice price"
	},
	{
		"User": "dean",
		"Review": "Biggest hotel in the city"
	},
	{
		"User": "dean",
		"Review": "Clean and cheap"
	},
	{
		"User": "dean",
		"Review": "Very clean ans suitable for business "
	},
	{
		"User": "Ralda",
		"Review": "Enjoyed our stay the & extended "
	},
	{
		"User": "MANUEL",
		"Review": "Love the cleanliness and the location of the hotel."
	},
	{
		"User": "Mark",
		"Review": "The hotel is located at a very good location. The facility and fixtures are modern. The breakfast is very good and has a great selection. "
	},
	{
		"User": "Vicky",
		"Review": "Very convenient in everything. "
	},
	{
		"User": "Therese",
		"Review": "I always stay here with my family whenever I'm in davao. I love that it is located in front of abreeza mall & the room is big enough to accommodate me & my kids. The staff also are very accommodating. "
	},
	{
		"User": "RUDOLF",
		"Review": "Best place to stay for any event in abreeza mall"
	},
	{
		"User": "CHRISTOPHER",
		"Review": "this is definitely the hotel that is strategically located in the best place in davao. just beside abreeza mall. facilities are new and clean. acccomodating staff. great stay for me."
	},
	{
		"User": "Christopher",
		"Review": "Nice and in good location across from mall ...but not the cheapest..."
	},
	{
		"User": "Chee",
		"Review": "No comment"
	},
	{
		"User": "Alva",
		"Review": "Friendly service, clean room, good breakfast buffet and close to mall. We always stay at seda. "
	},
	{
		"User": "Richie",
		"Review": "Love the breakfast, and the proximity to everything. On top of a shopping mall. clean rooms"
	},
	{
		"User": "George",
		"Review": "Near malls & car services.."
	},
	{
		"User": "Christopher",
		"Review": "Very nice all round hotel will come back "
	},
	{
		"User": "Adam",
		"Review": "Good value and experience for the money!"
	},
	{
		"User": "Abdul",
		"Review": "Hotel charge over price..is not a five star standard."
	},
	{
		"User": "Derk",
		"Review": "We have stayed here several times so this hotel is one of our choice, however it is overrated and a bit overpriced for what clients get. We just now found out that the breakfast downstairs is much better than the one offered on the 11th floor for club and premium rooms, even though those rooms are higher in price and the breakfast on the 11th floor is supposed the be one of the extras you get for the extra money. Our premium room had a balcony but there's no furniture on the balcony so it's useless. Specially for older people it will be difficult to get in and out of the bathtub / shower as it is too high. Rooms come with only 2 large towels and one small. Even though the premium room has a small kitchenette there's no plates or utensils. Staff is friendly"
	},
	{
		"User": "Yuchi",
		"Review": "you can find good service in club floor and dinning. best access to the ceda breeze shopping mall. "
	},
	{
		"User": "Jesus",
		"Review": "Security and cleanliness of the hotel."
	},
	{
		"User": "Joffer",
		"Review": "Service is good but room rates are high. "
	},
	{
		"User": "leonilita",
		"Review": "Ok"
	},
	{
		"User": "stephanie",
		"Review": "convenient located in front of a mall, easy transpo"
	},
	{
		"User": "Robert",
		"Review": "Just opposite Abreeza mall of the Ayalas"
	},
	{
		"User": "James",
		"Review": "room was missing a food menu and took several calls and about 30 minutes to get one to the room..pretty frustrating when you're starving. No \"second\" chair or stool or chair for in-room food service for the both of us to sit down and eat. "
	},
	{
		"User": "aileen",
		"Review": "good facilities, walking distance to abreeza mall. good breakfast buffet"
	},
	{
		"User": "Abigail",
		"Review": "This was our first time staying here and we loved the location being so close to Abreeza Mall. The only downside for us was the lack of seating by the pool. There are only 4 lounge chairs and a few tables with chairs. Otherwise, everything else about the stay was great! "
	},
	{
		"User": "Rob",
		"Review": "excellent place to stay"
	},
	{
		"User": "Meneleo",
		"Review": "I enjoy our stay, complimentary cocktails is great. Hotel room is clean."
	},
	{
		"User": "Janette",
		"Review": "The moment I stepped in inside the Hotel, there was an awful smell and the time spent for waiting to check in is 45 mins. no one offered drinks or something. Worst part, I want stuck inside the room toilet due to loosen door know, I called the reception to assist me and the time 3 guys appeared in my room did not even bother to ask if they should be fixing it to ensure it will not be repeated. Lousy service. I wanted to highlight and escalate this to the management, your reception officer were not professional enough to handle such peak times."
	},
	{
		"User": "RENATO",
		"Review": "We asked to replace the foot towel, but the staff told us they ran out of towels so we used the hand towel. I don't think it is proper to do that."
	},
	{
		"User": "Maria",
		"Review": "Our stay was very pleasant. Location was very convenient and the staff promptly replaced the desk lamp that wasn't working in our room. My only complaint is they didn't clean our room until very late in the afternoon and only after we personally reminded the housekeeping staff."
	},
	{
		"User": "Giovanni",
		"Review": "i love this hotel. it's very convenient since it is connected to abreeza"
	},
	{
		"User": "Patrick",
		"Review": "Really good location right across from the mall. Easy access and nice pool / simple gym. Room service did a good job cleaning. Would recommend."
	},
	{
		"User": "Stephen",
		"Review": "Great location opposite Davao's best mall. The hotel was modern, clean with good facilities, and excellent staff. There was a small swimming pool and adjacent gym, which sufficed for \"Joe Average\". My only criticism, and apparently that of most other guests, was the paper thin walls of the rooms. Consequently, you were able to hear every cough, sneeze, sexual activity, and conversation of your neighbours. Others have remarked about this problem and I was told that management had been informed. However, until this problem is addressed, this hotel will never get a 9 or 10 rating from me."
	},
	{
		"User": "Liesl",
		"Review": "Great stay and location right across from the mall!!"
	},
	{
		"User": "Derk",
		"Review": "The hotel is located next to Abreeza mall. The premier room was large enough but bathroom lacks light and fresh looking towels. Towels supplied look old and not white at all. The towel supplied for the floor of the bathroom looks like a dirty rag, just like during a previous visit."
	},
	{
		"User": "Ronald",
		"Review": "Great hotel, perfect location opposite Abrezza mall. Easy, convenient and nice rooms."
	},
	{
		"User": "Ryan",
		"Review": "The hotel is located in a very accessible location. It is adjacent to the Abreeza Mall, a high-end shopping mall in Davao City. It is very convenient for families with senior citizen and small children. The carpet under the bed though needs thorough cleaning as dust has accumulated under the bed. "
	},
	{
		"User": "rosanne",
		"Review": "My family of 4,my husband & I, a tweenie & a 4-yr old - both girls, had a fantastic time during our extended stay here. This hotel is easily accessible to downtown, airport, right in the Abreeza mall, hospitals, offices & city attractions. It is very well kept and organized, there's a nice sparkling pool and a restaurant and bar with excellent food choices. There's also music some nights at the bar. The staff are all courteous,helpful, neat and honest. It is very worth it to stay back here @ Seda!"
	},
	{
		"User": "Knut",
		"Review": "Sorry Seda Abrezza. This was not so good. When we come to the hotel I feel and see nobody of the staff smiling. They say good evening and no smile. Rest of days we stay there the same. The same in the reseption. The staff Who was manage the breakfeast was smile and kindly. The breakfeast litle bit expensive. Cleanless was good. This place not worth the money we pay. Sorry here we don't go back. Shiela and Knut Olav "
	},
	{
		"User": "Derk",
		"Review": "Hotel's best feature is it's location next to Abreeza mall."
	},
	{
		"User": "Maureen",
		"Review": "Nice and cozy for meetings as well as for pleasure."
	},
	{
		"User": "Kathryn",
		"Review": "I like staying at Seda hotel."
	},
	{
		"User": "Sheila",
		"Review": "Excellent service "
	},
	{
		"User": "Rosemarie",
		"Review": "Just beside Abreeza Mall. Very pefect location. The food was great. Very secured parking area. Will definitely stay here again."
	},
	{
		"User": "Reynaldo",
		"Review": "Overall, it was a pleasant stay in Seda. The food, amenities, location (because the mall was just stone throw away)and courteous staff. Maybe the letdown was the view of my room. I just didn't like seeing those shanties. I would love to recommend this hotel to all my friends. And I'll make sure that when I'm in Davao Seda will be my home away from home."
	},
	{
		"User": "ROGER",
		"Review": "bad deal"
	},
	{
		"User": "leonilo",
		"Review": "Everything was nice. "
	},
	{
		"User": "Ric",
		"Review": "Room is impressive. Location is great since it's beside Abreeza mall."
	},
	{
		"User": "Mary",
		"Review": "The hotel is just beside the mall, rooms are nice and cozy. They didn't have vallet and food at the executive lounge is very limited."
	},
	{
		"User": "Susana",
		"Review": "Friendly staff especially to kids. A stone's throw from abreeza mall. "
	},
	{
		"User": "Michael",
		"Review": "All good"
	},
	{
		"User": "Lance",
		"Review": "Ok"
	},
	{
		"User": "April",
		"Review": "We stayed at club rooms, really great service! Food was great as well. Accessibility to mall and town proper a bonus. "
	},
	{
		"User": "Gaudioso",
		"Review": "Nice one. Quiet expensive for Davao City"
	},
	{
		"User": "Leia",
		"Review": "The staff was very accommodating and friendly. The room is spacious and the bed is very comfortable."
	},
	{
		"User": "Lorelie",
		"Review": "Always comfortable staying here"
	},
	{
		"User": "SHAYNE",
		"Review": "Continue on your excellent service - Will surely stay again there when we're at Davao."
	},
	{
		"User": "James",
		"Review": "Having a child who needs fast internet for when he play his online games... this is hotel is better compared to the one at SM Lanang. The room is clean.. the staff average but courteous and i had my airline tickets printed out for me with no problem at all. Will keep coming back. Their restaurants are very very expensive but just cross the street and you have Starbucks and other great food choices at Abreeza Mall... ne reason to avail of their buffets unless your not the one paying the bill :-) "
	},
	{
		"User": "Rocelyn",
		"Review": "Everything is good, staff are always smiling❤️"
	},
	{
		"User": "Snyder",
		"Review": "I stayed here primarily for the convenience. The hotel is very new thus their club rooms and facilities are very updated. I will stay here every time I visit Davao."
	},
	{
		"User": "NORMA",
		"Review": "Clean "
	},
	{
		"User": "maria",
		"Review": "just across Abreeza Mall. "
	},
	{
		"User": "Kris",
		"Review": "Seda hotel is consistent any where in the philippines- service, room amenities, location. "
	},
	{
		"User": "ronaldo",
		"Review": "Ok"
	},
	{
		"User": "JOHN",
		"Review": "Lack of parking space"
	},
	{
		"User": "Darren",
		"Review": "good standard hotel, good food, rooms etc"
	},
	{
		"User": "Desiderata",
		"Review": "ok"
	},
	{
		"User": "Amy",
		"Review": "Best choice for its price and location. Internet is really good and the breakfast was nice."
	},
	{
		"User": "Yoranda",
		"Review": "Very good service, location and hospitality"
	},
	{
		"User": "MARILOU",
		"Review": "Great"
	},
	{
		"User": "Arturo",
		"Review": "One day stay was very clean and staff was very polite "
	},
	{
		"User": "Philip",
		"Review": "This hotel was the best. No hassles. Very professional, helpful and fast service"
	},
	{
		"User": "Jim",
		"Review": "Good location. Nice place, but kinda expensive compared to other hotel of the same kind."
	},
	{
		"User": "CERES",
		"Review": "Our stay should have been perfect if not for the clogged sink at the bathroom and beddings that smelled like some kids urinated on the foam. I love their design, their location and buffet breakfast is good but nothing extra ordinary. I would still want to come back with a better experience "
	},
	{
		"User": "Chau",
		"Review": "good location and breakfast"
	},
	{
		"User": "Jacqueline",
		"Review": "Location is very good. Value for Money okay. The place though it appears to be clean, if you look at the finer details, you will see that it's not cleaned properly. There were a lot of smudges on glasses, the bathroom had hair stuck on walls, the computer screen was also full of smudges and the keyboard black. The hotel smells good though. Not all the staff are trained professionally as you would except from a hotel which is aesthetically good."
	},
	{
		"User": "shibi",
		"Review": "She behave very badly and never experience anywhere or any class of hotel like such attitude. Talking very badly and manners "
	},
	{
		"User": "Nelvin",
		"Review": "Didn't quite able to enjoy the little facilities the hotel offered (pool, gym, etc). The one thing I needed was excluded though. Breakfast. Php600 for breakfast is a bit much. Might stay again in my next, next, next visit to Davao after trying other hotels. "
	},
	{
		"User": "mary",
		"Review": "Good location and good food"
	},
	{
		"User": "Therese",
		"Review": "I always stay at Seda when i'm in Davao. I love that the hotel is located in front of Abreeza mall. The hotel staffs are very accomodating & the hotel is very clean. I'm just upset that the towels are stained with black spots."
	},
	{
		"User": "Delfin",
		"Review": "Excellent location, Good value for money"
	},
	{
		"User": "Rosemarie",
		"Review": "Would definitely recommend! "
	},
	{
		"User": "Chariya",
		"Review": "\r Great location , good room and good service"
	},
	{
		"User": "Jenette",
		"Review": "\r Efficient, helpful staffs. The location is very close to Abreeza mall."
	},
	{
		"User": "Valeria",
		"Review": "\r Location, cleanliness, great food"
	},
	{
		"User": "Francis",
		"Review": "Love everything about Seda. I'll come back for sure"
	},
	{
		"User": "cary",
		"Review": "Satisfy with everything"
	},
	{
		"User": "marcos",
		"Review": "Of course, there are other hotels in Davao but this hotel has it all. International standard quality room, better than average breakfast and above all, LOCATION is second to none. Staying at other hotels, you have to take a taxi to get around to go to malls or just eat out. This hotel is adjacent to arguably the best mall in Davao. No need for taxi. Marco Polo used to be the best but father time has caught up and it no longer makes the grade, in my opinion"
	},
	{
		"User": "christopher",
		"Review": "\r New hotel, great staff, good location "
	},
	{
		"User": "christopher",
		"Review": "\r This hotel is very new. Abreeza mall is right across the street. "
	},
	{
		"User": "CHUNG",
		"Review": "Next to shopping mall , good location "
	},
	{
		"User": "Faye",
		"Review": "Place was not completely cleaned. Pool water is hazy and there was a worm in it."
	},
	{
		"User": "Bryan",
		"Review": "The Club Floor is a great place to stay, schedule business meetings, and relax"
	},
	{
		"User": "raffy",
		"Review": "\r location, scent upon entrance (CK) and interior"
	},
	{
		"User": "porvener",
		"Review": "\r value, location and staff"
	},
	{
		"User": "LI",
		"Review": "\r only location is nice"
	},
	{
		"User": "MARIE",
		"Review": "As always, they gave amazing service. Clean rooms, comfy beds, friendly staff, and convenient location, I couldn't ask for more!!!"
	},
	{
		"User": "John",
		"Review": "My stay had been excellent. Get the rooms with the club lounge access, they're worth it. Food is delicious. Staffs are friendly. Hotel is perfect for staycations. "
	},
	{
		"User": "Therese",
		"Review": "Everytime i'm in davao with my family i always stay in this hotel. The room is big enough to accomodate all of us. The hotel is located just across abreeza mall. Perfect place to stay for all occasions."
	},
	{
		"User": "Miai",
		"Review": "Good location and clean"
	},
	{
		"User": "uendie",
		"Review": "good points -the location is very good next to the mall and breakfast was okay bad points -was given a 2nd floor room when i requested for a high floor on my booking -the bedsheets/linens were dirty and bath mat also looks dirty -noisy can hear noise from the outside the hallways as well as outside the window and upon complaining was told that they will check but I was never informed on what's going on - stayed two nights, even with complaints on the noise and etc nothing was done... it was hard to sleep with the noise"
	},
	{
		"User": "Cynthia",
		"Review": "location is great just beside a big shopping mall The Abreeza Mall. Room is big and clean"
	},
	{
		"User": "Rene",
		"Review": "The first room 704 assigned to us was smelly but we were immediately attended and transferred to Room 614 with a better view of the adjacent Mall. Location was great. It's 2 minutes walking distance to the mall and 15 minutes taxi drive to the airport without traffic. I will definitely recommend the hotel not only of location, nice rooms but because all the entire staff are very courteous, friendly and cordially receptive!"
	},
	{
		"User": "Priscilla",
		"Review": "\r Great location. Spacious room. Accommodating staff"
	},
	{
		"User": "Jessie",
		"Review": "\r Comfort and close to the mall."
	},
	{
		"User": "Gregg",
		"Review": "\r good location, great staff and very comfortable"
	},
	{
		"User": "Grace",
		"Review": "\r location cleanliness"
	},
	{
		"User": "Edward",
		"Review": "To objectives of my recent trips are the following: a) visit my parents, b) have time to relax and c) meet friends. All these were accomplished in a the short visit we did in Davao as the hotel is centrally located. Places that i need to visit are just a taxi drive away. In addition, Davao is a good place where you can have good food at reasonable prices. My wife and i were even able to get a very good massage at nearby spa. I will definitely be back later this year for another quick visit"
	},
	{
		"User": "Jose",
		"Review": "Davao City has a number of hotels that provide the traveler a range of options. Seda is the practical choice perfect for a businessman or a tourist who doesn't need to pay for too much floor space; it offers comfortable accommodations in a convenient location - next to a mall! Anyway getting around Davao isn't a problem, so Seda being a little distant from the city center isn't much of an issue..."
	},
	{
		"User": "Arlene",
		"Review": "\r The hotel design is modern and classy with big and comfy rooms. Service is good . Very good value for money. Will definitely come back."
	},
	{
		"User": "Patrick",
		"Review": "We are sure to book again at Seda Davao in our next trip to Davao."
	},
	{
		"User": "Alva",
		"Review": "\r Location, staff, bed"
	},
	{
		"User": "Arlene",
		"Review": "\r Excellent food, convenient location, great value for money"
	},
	{
		"User": "Ignasi",
		"Review": "\r Modern, Comfortable"
	},
	{
		"User": "Dino",
		"Review": "\r Staff, breakfast and room"
	},
	{
		"User": "Suzanne",
		"Review": "\r Our family enjoyed the breakfast immensely! The staff has been wonderful still."
	},
	{
		"User": "Noel",
		"Review": "\r location, location, location"
	},
	{
		"User": "Hanalynn",
		"Review": "\r location,interior,pool"
	},
	{
		"User": "Edna",
		"Review": "\r comfort, custmer service, accessability"
	},
	{
		"User": "Christine",
		"Review": "\r free breakfast, free wifi"
	},
	{
		"User": "Andrew",
		"Review": "\r Location, Staff and Room"
	},
	{
		"User": "Richard",
		"Review": "\r Location, comfort, service"
	},
	{
		"User": "leslie",
		"Review": "\r room accomodation, food servive"
	},
	{
		"User": "Maria",
		"Review": "\r Comfortable bed,cozy feel,very near the mall & church"
	},
	{
		"User": "Bea",
		"Review": "\r Comfortable, Clean, Location easily accessible"
	},
	{
		"User": "EFREN",
		"Review": "\r Cleanliness, efficient staff and location."
	},
	{
		"User": "theresa",
		"Review": "\r Location, friendly staff and good food"
	},
	{
		"User": "Brock",
		"Review": "\r Cleanliness, rooms, staff"
	},
	{
		"User": "Emma",
		"Review": "\r Location, comfort, modern"
	},
	{
		"User": "MARIE",
		"Review": "\r Cleanliness, Location, and Great Value for Your Money"
	},
	{
		"User": "Marita",
		"Review": "\r Friendly staff, great location and superb service"
	},
	{
		"User": "Marrissa",
		"Review": "\r Excellent food, Near Abreeza (Ayala Mall), Near Church"
	},
	{
		"User": "HAROLD",
		"Review": "\r The best thing about the hotel is its location because it is located at the heart of the city and it's beside the Abreeza mall. Another thing I like in the hotel is its king-size bed."
	},
	{
		"User": "Manuel",
		"Review": "\r Price, location, shopping "
	},
	{
		"User": "Ronald",
		"Review": "\r location, staff, comfort"
	},
	{
		"User": "Castor",
		"Review": "\r clean"
	},
	{
		"User": "David",
		"Review": "\r Location, room size, cleanliness"
	},
	{
		"User": "Jeanett",
		"Review": "\r Location , cleanliness , accross Abreeza mall , in front of Redemptorist church , near Sm Lanang too just 3kms away "
	},
	{
		"User": "ERIC",
		"Review": "\r Cleanliness, accessibility and comfort. "
	},
	{
		"User": "JOHN",
		"Review": "\r 1) main lobby - I love the smell 2) nice people - they all smile when they meet people. greet guest with cheerful aura and welcoming attitude 3) clean and comfortable rooms, love earth colors too."
	},
	{
		"User": "Alfredo",
		"Review": "\r Pool has clean water,good ambience,courteous staff"
	},
	{
		"User": "Von",
		"Review": "\r Clean room , friendly staff, near mall"
	},
	{
		"User": "Lerma",
		"Review": "\r Perfect location, clean, accomodating staffs"
	},
	{
		"User": "Paul",
		"Review": "\r With standards"
	},
	{
		"User": "Kathryn",
		"Review": "\r Staffs are friendly, food was great, and clean pool."
	},
	{
		"User": "Jeannie",
		"Review": "\r location, ambiance, breakfast"
	},
	{
		"User": "John",
		"Review": "\r Location, Room, Internet"
	},
	{
		"User": "Jo",
		"Review": "\r Location, Staff, Rooms"
	},
	{
		"User": "Maria",
		"Review": "\r Good location ,very clean "
	},
	{
		"User": "Darryl",
		"Review": "\r The bed, the bathroom and the staff"
	},
	{
		"User": "Ralph",
		"Review": "\r Clean, Value for Money, Great location"
	},
	{
		"User": "Ronald",
		"Review": "\r Service, Friendliness, Helpfulness"
	},
	{
		"User": "Chariya",
		"Review": "\r Good location , good service and comfortable room"
	},
	{
		"User": "Alain",
		"Review": "\r 1. Location 2. Cleanliness 3. Good staff"
	},
	{
		"User": "allan",
		"Review": "\r Location staff and food"
	},
	{
		"User": "john",
		"Review": "\r Good location,polite and helpful staff, "
	},
	{
		"User": "Maria",
		"Review": "\r Service, value of money and amenities"
	},
	{
		"User": "Dawn",
		"Review": "\r Location - very accesible, lots of restos to choose from, Abreeza Mall is just a minute walk. Rooms are great with modern fixtures - very cold aircondition is a plus! Clean and nice hotel - very cozy!"
	},
	{
		"User": "Chua",
		"Review": "\r Good place "
	},
	{
		"User": "Cherry",
		"Review": "\r Convinient, Clean and Good Service"
	},
	{
		"User": "Peter",
		"Review": "\r Location, service and comfort"
	},
	{
		"User": "Edwin",
		"Review": "\r Friendly staff, New, Clean"
	},
	{
		"User": "Zarah",
		"Review": "\r Food, cleanliness, location"
	},
	{
		"User": "Antonio",
		"Review": "\r Location beside Ayala Mall was great. Facilities super w/ fitness center & pool and club lounge access. Daily food selection was great."
	},
	{
		"User": "Ester",
		"Review": "\r cleanliness, good location and nice staff"
	},
	{
		"User": "josephine",
		"Review": "\r they have a smiling and accomodating staff, clean room, good foods too"
	},
	{
		"User": "Wilsie",
		"Review": "\r location, cleanliness, value for money"
	},
	{
		"User": "Mark",
		"Review": "\r Room was very comfortable, breakfast was excellent, staff were well trained"
	},
	{
		"User": "Martin",
		"Review": "\r Location, its still new, big rooms"
	},
	{
		"User": "Ralph",
		"Review": "\r location, price, cleanliness"
	},
	{
		"User": "Sarah",
		"Review": "\r Clean rooms, soft bed and pillows, cold enough"
	},
	{
		"User": "Mary",
		"Review": "\r Location, affordable, convenience "
	},
	{
		"User": "MARIA",
		"Review": "\r Staff, clean and location"
	},
	{
		"User": "Kim",
		"Review": "\r Good location, good food, good rest."
	},
	{
		"User": "Emmanouelle",
		"Review": "\r Location, comfort, shops"
	},
	{
		"User": "Stephanie",
		"Review": "\r The room has a lot of sockets, cleanliness and services"
	},
	{
		"User": "Michael",
		"Review": "\r Staff performance, facilities, and dining"
	},
	{
		"User": "Rex",
		"Review": "\r Location, Pool, Room"
	},
	{
		"User": "ethel",
		"Review": "\r location"
	},
	{
		"User": "David",
		"Review": "\r Location - Clean - Pool and Gym"
	},
	{
		"User": "ethel",
		"Review": "\r location"
	},
	{
		"User": "Randall",
		"Review": "\r nice room for the price, location is good and convenient to the mall"
	},
	{
		"User": "Alexander",
		"Review": "\r Clean spacious room, friendly staff, nextcto Mall"
	},
	{
		"User": "Ronald",
		"Review": "\r The rooms, the location, the gym."
	},
	{
		"User": "Henry",
		"Review": "\r location"
	},
	{
		"User": "Hui",
		"Review": "\r Nothing much really"
	},
	{
		"User": "Donna",
		"Review": "\r Staff are accommodating, ideal location "
	},
	{
		"User": "EC",
		"Review": "\r Hotel was clean, location is good."
	},
	{
		"User": "Mark",
		"Review": "\r Nice room, Nice Gym"
	},
	{
		"User": "Maria",
		"Review": "\r cleamliness, staff is well trained and helpful"
	},
	{
		"User": "James",
		"Review": "\r Clean, excellent location, a little bit small"
	},
	{
		"User": "Nancy",
		"Review": "\r The room was comfortable, convenient location, excellent facilities. "
	},
	{
		"User": "mona",
		"Review": "\r location, room comfort, breakfast"
	},
	{
		"User": "Lourdes",
		"Review": "\r location, comfort, friendly staff"
	},
	{
		"User": "Colin",
		"Review": "\r Right next to mall, new hotel, efficient staff "
	},
	{
		"User": "Wison",
		"Review": "\r Location near abreeza mall"
	},
	{
		"User": "Carl",
		"Review": "\r Clean, relatively complete but lots of improvement for resto"
	},
	{
		"User": "Mohammad",
		"Review": "\r Location, near a breeze mall, clean"
	},
	{
		"User": "Rob",
		"Review": "\r Location is very good, staff is very helpfull and friendly"
	},
	{
		"User": "Vicente",
		"Review": "\r Location, price, amenities"
	},
	{
		"User": "Cherry",
		"Review": "\r Clean,Accomodating,Good Location "
	},
	{
		"User": "Cherry",
		"Review": "\r Relaxing,Clean,Comfortable"
	},
	{
		"User": "Jannicken",
		"Review": "\r very spacious and clean room, good view and complete facilities. Location is also near in the airport and a few minutes away from downtow"
	},
	{
		"User": "Jason",
		"Review": "\r location, nice, new"
	},
	{
		"User": "Alceo",
		"Review": "\r very accessible, clean and the staff are very friendlt"
	},
	{
		"User": "Ramsey",
		"Review": "\r Location, location, location"
	},
	{
		"User": "Malou",
		"Review": "\r The hotel is clean, our room is clean and smells good, excellent service from the staff."
	},
	{
		"User": "hagen",
		"Review": "\r location, lux rooms, price"
	},
	{
		"User": "Franciscus",
		"Review": "\r location, staff friendliness, cappuccino's"
	},
	{
		"User": "Alely",
		"Review": "\r Courteous staff but housekeeping was slow. "
	},
	{
		"User": "Kristen",
		"Review": "\r this hotel is new, clean and offers good variety of gud and delicious foods!"
	},
	{
		"User": "Niel",
		"Review": "\r good location, just across the mall. affordable price with good services"
	},
	{
		"User": "Tomas",
		"Review": "\r Location, staff service, quality"
	},
	{
		"User": "ARLENE",
		"Review": "\r Near shopping mall "
	},
	{
		"User": "Catherine",
		"Review": "\r The location, the staff and the cleanliness of the hotel"
	},
	{
		"User": "Joffil",
		"Review": "\r Location, Facility, Staff"
	},
	{
		"User": "Jacob",
		"Review": "\r Clean, not old, next to Abreeza mall"
	},
	{
		"User": "Tan",
		"Review": "\r Good location. Near to airport n opposite a big shopping mall. Room clean. Staff friendly and helpful. "
	},
	{
		"User": "ERLENE",
		"Review": "\r BREAKFAST, ROOM AMENITIES AND COMFORT"
	},
	{
		"User": "Philip",
		"Review": "\r Location, Gym and pool, Helpful staff"
	},
	{
		"User": "Kathleen",
		"Review": "\r The best things about Seda Davao are its location, clean and comfortable rooms and very friendly staff"
	},
	{
		"User": "Jeaneth",
		"Review": "\r Location, cleanliness, friendly staff"
	},
	{
		"User": "Garry",
		"Review": "\r Location, comfortable bed"
	},
	{
		"User": "Shermaine",
		"Review": "\r Accessibility, Class, Affordable"
	},
	{
		"User": "Feona",
		"Review": "\r Location, good food, friendly and helpful staff"
	},
	{
		"User": "ANNALIZA",
		"Review": "\r Location, room and staff are all good."
	},
	{
		"User": "Jan",
		"Review": "\r Food location and staff"
	},
	{
		"User": "Dr",
		"Review": "\r very near the mall, comfortable place, friendly staff"
	},
	{
		"User": "Dominic",
		"Review": "\r Location location location"
	},
	{
		"User": "Teri",
		"Review": "\r very near abreeza, good food and nice hotel"
	},
	{
		"User": "Ngee",
		"Review": "\r Good hotel facilities, cleanliness and good staff"
	},
	{
		"User": "HONGZHI",
		"Review": "\r convenience clean comfortable "
	},
	{
		"User": "Stanley",
		"Review": "\r Location, food, kind staff"
	},
	{
		"User": "Michael",
		"Review": "\r Staff attitude and performance; room condition and decor; and, dining choices"
	},
	{
		"User": "Eliza",
		"Review": "\r Clean room, comfortable bed, just across the mall"
	},
	{
		"User": "Ma.",
		"Review": "\r accomodating and efficient guest service staff, comfortable and spacious rooms and good location"
	},
	{
		"User": "RICHARD",
		"Review": "\r staff, bed "
	},
	{
		"User": "Armela",
		"Review": "\r location, pool, room size"
	},
	{
		"User": "Armela",
		"Review": "\r location, pool, room size"
	},
	{
		"User": "Sheila",
		"Review": "\r Breakfast Buffet, Location, Very Nice Rooms"
	},
	{
		"User": "Ann",
		"Review": "\r Location, Amenities, Value for Money"
	},
	{
		"User": "Kathrina",
		"Review": "\r Location, Food, Rooms"
	},
	{
		"User": "Kathleen",
		"Review": "\r Food. Customer Service. Room."
	},
	{
		"User": "Dominic",
		"Review": "\r Location, accomodation, hospitality"
	},
	{
		"User": "Stephen",
		"Review": "\r Location, Cleanliness, Proximity to Abreeza Mall"
	},
	{
		"User": "SABADO",
		"Review": "\r cleanliness, food, comfort"
	},
	{
		"User": "MARIE",
		"Review": "\r Great location -- right in front of a mall; Clean and comfortable rooms; Friendly hotel staff"
	},
	{
		"User": "marlon",
		"Review": "\r good amenities, beautiful rooms, hospitable staff"
	},
	{
		"User": "Florian",
		"Review": "\r Location, location , location"
	},
	{
		"User": "Anthony",
		"Review": "\r Comfort,Convenience,Safety"
	},
	{
		"User": "Alan",
		"Review": "\r Overall quality of the hotel, location next to Abreeza Mall, super comfy bed."
	},
	{
		"User": "ANNA",
		"Review": "\r The hotel is directly across Abreeza mall so shopping and dining was so convenient. Also took a cab to Aldevinco Shopping Center which was so near too. You can get pearls and souvenirs there."
	},
	{
		"User": "Cora",
		"Review": "\r Location. Comfort. Service."
	},
	{
		"User": "MARITES",
		"Review": "\r location, food and service"
	},
	{
		"User": "Robert",
		"Review": "\r Pool,Bed,Food"
	},
	{
		"User": "Carl",
		"Review": "\r location, facilities, comfort"
	},
	{
		"User": "Terry",
		"Review": "\r Near mall, accessible to airport, room is clean"
	},
	{
		"User": "Anna",
		"Review": "\r Cleanliness, location, value for money"
	},
	{
		"User": "Christine",
		"Review": "\r First, i feel so comfortable staying in the hotel. Its very accessible to the mall and to the airport. Second, we found it clean and spotless. Third, the staff are cheerful and bery helpful! "
	},
	{
		"User": "Frederick",
		"Review": "\r location is good, design is good, aircon is good"
	},
	{
		"User": "Ma",
		"Review": "\r The staff are accommodating and helpful"
	},
	{
		"User": "Dennis",
		"Review": "\r clean, food, near city"
	},
	{
		"User": "Ronald",
		"Review": "\r near the mall, friendly staff, good acoustic singers"
	},
	{
		"User": "Avon",
		"Review": "\r tiny cold pool, so-so amenities, 3-star only, i've seen better"
	},
	{
		"User": "ARNEIL",
		"Review": "\r Service. Location. Structure."
	},
	{
		"User": "Ma",
		"Review": "\r very good service, excellent food"
	},
	{
		"User": "Johanna",
		"Review": "\r service, location, cleanliness"
	},
	{
		"User": "Abigail",
		"Review": "\r location, quality of rooms, quality of service"
	},
	{
		"User": "Abigail",
		"Review": "\r great location, wonderful staff, very classy service for a 4 star hotel"
	},
	{
		"User": "Agnes",
		"Review": "\r Hotel personal are very well trained & helpful. The daily buffet breakfast is excellent and has a wide variety of choices. anything you need they satisfy you with a smile. "
	},
	{
		"User": "Cecilia",
		"Review": "\r Service, food n location"
	},
	{
		"User": "Oscar",
		"Review": "\r Location,clean , good service"
	},
	{
		"User": "Martin",
		"Review": "\r Location, Service and Room"
	},
	{
		"User": "Lucille",
		"Review": "\r comfortable room, clean, nice facilities"
	},
	{
		"User": "Anacleta",
		"Review": "\r A very good buffet breakfast, clean and comfortable bed."
	},
	{
		"User": "ERNESTO",
		"Review": "\r Proximity to a Mall, Marina Wharf and A Very Nice Hotel"
	},
	{
		"User": "Sajonia",
		"Review": "\r Location,cleanliness,security"
	},
	{
		"User": "Gilda",
		"Review": "\r Location"
	},
	{
		"User": "Yen",
		"Review": "\r near mall, clean, free wifi"
	},
	{
		"User": "Giovan",
		"Review": "\r Nice and clean, Convenient location, Big rooms"
	},
	{
		"User": "Giovan",
		"Review": "\r Nice and clean, Convenient Location, Big rooms"
	},
	{
		"User": "Haydn",
		"Review": "\r staff,location, cleanliness"
	},
	{
		"User": "NECITAS",
		"Review": "\r near the mall, near my place of meeting and near the city center"
	},
	{
		"User": "Therese",
		"Review": "\r hotel location, staff performance & value for money"
	},
	{
		"User": "Edgar",
		"Review": "\r Comfortable and clean room; near and accessible to ayala shopping mall; strong free wifi signal"
	},
	{
		"User": "Mohamad",
		"Review": "\r staff were friendly. Easy access to shopping mall just across the street. will come again when am in Davao."
	},
	{
		"User": "Ulybert",
		"Review": "\r Location, Value for Money, Staff performance"
	},
	{
		"User": "Michele",
		"Review": "\r clean comfy convenient"
	},
	{
		"User": "Seockkang",
		"Review": "\r clean transport price"
	},
	{
		"User": "MARIE",
		"Review": "\r Great Location, Friendly Staff, and Good Value for Your Money"
	},
	{
		"User": "VERNIE",
		"Review": "\r Location,price,convenience"
	},
	{
		"User": "Karen",
		"Review": "\r location, food and room"
	},
	{
		"User": "MARIE",
		"Review": "\r Location, comfort, and convenience"
	},
	{
		"User": "RANDY",
		"Review": "\r Location, comfort, value-wise"
	},
	{
		"User": "Jugger",
		"Review": "\r Location, Location, Location"
	},
	{
		"User": "Maria",
		"Review": "\r 3 best things about this hotel: accessible, attentive staff and facilities"
	},
	{
		"User": "Sophian",
		"Review": "\r Room, location n value for money"
	},
	{
		"User": "Jane",
		"Review": "\r accessible to the mall. comfortable and nice staffs"
	},
	{
		"User": "William",
		"Review": "\r location, services and rates"
	},
	{
		"User": "gregory",
		"Review": "\r The breakfast, the beds, the shower"
	},
	{
		"User": "Tim",
		"Review": "\r Location, club floor"
	},
	{
		"User": "liezle",
		"Review": "\r What I like most about the hotel is its accessibility to Abreeza Mall and very central to the business district, the comfort and convenience the hotel affords to its guests and an escape from the city"
	},
	{
		"User": "HERMINE",
		"Review": "\r Comfortable beds, great location and good service"
	},
	{
		"User": "Jay",
		"Review": "\r comfy beds, buffet breakfast, staff"
	},
	{
		"User": "Yoranda",
		"Review": "\r Location Staff and meal"
	},
	{
		"User": "Philippe",
		"Review": "\r proximity to shopping, easy access to transportation, great helpful staff"
	},
	{
		"User": "JAMES",
		"Review": "\r good location,new rooms and fast wifi"
	},
	{
		"User": "marilou",
		"Review": "\r Location"
	},
	{
		"User": "Randall",
		"Review": "\r The best things about the hotel were the location in that it was very convenient to the mall and also has good aircon and water pressure from the shower."
	},
	{
		"User": "Charito",
		"Review": "\r good food, courteous staff and good service"
	},
	{
		"User": "Josephine",
		"Review": "\r Its in the heart of the city,big beds, friendly staff"
	},
	{
		"User": "Peter",
		"Review": "\r Locacation acrosss from Ayala Mall"
	},
	{
		"User": "serena",
		"Review": "\r close to abreeza, quiet room near the top, free wifi"
	},
	{
		"User": "marife",
		"Review": "\r Location, buffet breakfast, cleanliness"
	},
	{
		"User": "Raymond",
		"Review": "\r great staff, great location"
	},
	{
		"User": "Farukh",
		"Review": "\r Room was very clean and bed very comfortable and nice staff"
	},
	{
		"User": "Ammi",
		"Review": "\r Location,rooms,front desk..l"
	},
	{
		"User": "bandar",
		"Review": "\r Clean,near to the mall and its new"
	},
	{
		"User": "Maria",
		"Review": "\r Modern style, spacious rooms, good location"
	},
	{
		"User": "Annabelle",
		"Review": "\r Location, cleanliness, coziness"
	},
	{
		"User": "Sabery",
		"Review": "\r Room size, great locaion, clean"
	},
	{
		"User": "Armida",
		"Review": "\r The Staff being so Polite and Attentive. The Location. Great Value for money."
	},
	{
		"User": "Generose",
		"Review": "\r location, comfortable, clean"
	},
	{
		"User": "Chantal",
		"Review": "\r Location, Accesibility, Good Bed"
	},
	{
		"User": "Dulce",
		"Review": "\r Location is perfect . Food was great and room was comfortable. "
	},
	{
		"User": "PHILIP",
		"Review": "\r efficient, near shops, convenient"
	},
	{
		"User": "Stephan",
		"Review": "\r The hotel is located very central in downtown Davao next to Abrezza Mall. the room was superb. the staff is very friendly and helpfu. "
	},
	{
		"User": "rosanne",
		"Review": "\r Clean, modern, near city"
	},
	{
		"User": "Maida",
		"Review": "\r Room, location, amenities"
	},
	{
		"User": "rosanne",
		"Review": "\r Clean, modern, accessible"
	},
	{
		"User": "shaun",
		"Review": "\r location, rooms, food"
	},
	{
		"User": "Genie",
		"Review": "\r Accomodating staffs, good food & lacation, cleanliness excellent"
	},
	{
		"User": "Karlo",
		"Review": "\r 1. Location"
	},
	{
		"User": "Lanelyn",
		"Review": "\r Good location, clean hotel and staff are friendly and accommodating"
	},
	{
		"User": "ELISEO",
		"Review": "\r Friendly staff, excellent location & great room conditions/cleanliness"
	},
	{
		"User": "Lydia",
		"Review": "\r good location, across a Catholic church, delicious food, new facilities"
	},
	{
		"User": "Jennifer",
		"Review": "\r New, accessible and reasonable rate"
	},
	{
		"User": "Louie",
		"Review": "\r Location, good staff and cleanliness"
	},
	{
		"User": "Stephan",
		"Review": "\r Very clean rooms, Staffel is very friendly and the hotel and rooms are modern."
	},
	{
		"User": "Martin",
		"Review": "\r location, service, ambiance "
	},
	{
		"User": "Jan",
		"Review": "\r Gym, pool and service"
	},
	{
		"User": "Raimund",
		"Review": "\r nice rooms - good breakfast.... friendly service"
	},
	{
		"User": "Gary",
		"Review": "\r Clean, modern, efficient"
	},
	{
		"User": "ROWENA",
		"Review": "\r Walking distance to Ayala Mall and Redemptorist Church"
	},
	{
		"User": "DENNIS",
		"Review": "\r Attentive staff, comfortable hotel and good value for money"
	},
	{
		"User": "DENNIS",
		"Review": "\r Accessible, convenient rooms and friendly staff"
	},
	{
		"User": "ROGELIO",
		"Review": "\r Location / Value for Money / Shopping"
	},
	{
		"User": "eriberto",
		"Review": "\r Food, location and very clean"
	},
	{
		"User": "Ernest",
		"Review": "\r Location, comfort, gym"
	},
	{
		"User": "Stephen",
		"Review": "\r quality,price,location"
	},
	{
		"User": "Richard",
		"Review": "\r Location, price and fast wifi"
	},
	{
		"User": "Michael",
		"Review": "\r (1) Staff performance, friendliness and helpfulness. (2) Hotel location. (3) Room condition and comfort."
	},
	{
		"User": "Noel",
		"Review": "\r Room, staff, location... and Breakfast "
	},
	{
		"User": "stewart",
		"Review": "\r proximity to the mall"
	},
	{
		"User": "Tristan",
		"Review": "\r it is very accessible, very safe and has very nice and comfortable rooms"
	},
	{
		"User": "Aldbrian",
		"Review": "\r Room, club lounge, location"
	},
	{
		"User": "Catherine",
		"Review": "\r clean, service, location"
	},
	{
		"User": "robert",
		"Review": "\r good location, professional staff, hotel is in good condition"
	},
	{
		"User": "robert",
		"Review": "\r location was good, staff was professional, hotel is new"
	},
	{
		"User": "CHARISSA",
		"Review": "\r Across the mall, accessible to public transport, new hotel"
	},
	{
		"User": "shiella",
		"Review": "\r location niceroom clean"
	},
	{
		"User": "trina",
		"Review": "\r Room is spacious, security, good meal"
	},
	{
		"User": "Yolanda",
		"Review": "\r accommodating staff, beautiful place and clean environment"
	},
	{
		"User": "YOLANDA",
		"Review": "\r Big rooms comfortable beds great service"
	},
	{
		"User": "ANGELICA",
		"Review": "\r location, clean and new"
	},
	{
		"User": "Jenette",
		"Review": "\r Service quality, very polite staffs"
	},
	{
		"User": "TAGANAHAN",
		"Review": "\r Location, attentive stsff, breakfast"
	},
	{
		"User": "Charles",
		"Review": "\r The hotel is over-all clean, has a modern look and friendly staff. "
	},
	{
		"User": "Alva",
		"Review": "\r location bed"
	},
	{
		"User": "Alva",
		"Review": "\r location bed "
	},
	{
		"User": "Ghia",
		"Review": "\r Elegance, Accessibility, Friendliness"
	},
	{
		"User": "Ong",
		"Review": "\r Location, room comfort, fast Internet"
	},
	{
		"User": "Karl",
		"Review": "\r nice"
	},
	{
		"User": "Elaine",
		"Review": "\r Clean and convenient location "
	},
	{
		"User": "tio",
		"Review": "\r beside mall, clean and fast check in"
	},
	{
		"User": "Alva",
		"Review": "\r bed, location "
	},
	{
		"User": "sandra",
		"Review": "\r location, breakfast buffet, pool"
	},
	{
		"User": "Darren",
		"Review": "\r price,comfort,location"
	},
	{
		"User": "Ronald",
		"Review": "\r 1. Really a four & half star property. 2. Very effective Wifi. 3 Location great with big mall adjacent."
	},
	{
		"User": "Robert",
		"Review": "\r Location, breakfast, inernet"
	},
	{
		"User": "Ronaldo",
		"Review": "\r perfectly located, best breakfast, nice, clean and comfortable room"
	},
	{
		"User": "Christobert",
		"Review": "\r Excellent location, good service and clean. "
	},
	{
		"User": "noli",
		"Review": "\r staff are accomadating,polite,courteous"
	},
	{
		"User": "Ronald",
		"Review": "\r Its their location, the hotel itself and the food."
	},
	{
		"User": "ROLANDO",
		"Review": "\r location, clean and quite"
	},
	{
		"User": "Joanna",
		"Review": "\r Value for money, cleanliness, service"
	},
	{
		"User": "gerlyn",
		"Review": "\r location, service and comfort"
	},
	{
		"User": "Zhi",
		"Review": "\r Value for money, great location, clean"
	},
	{
		"User": "kevin",
		"Review": "\r location ,nice rooms, "
	},
	{
		"User": "Ross",
		"Review": "\r Location, food, Friendly staff"
	},
	{
		"User": "marcos",
		"Review": "\r location, location, location"
	},
	{
		"User": "Johanna",
		"Review": "\r Location, decent room, clean"
	},
	{
		"User": "Kenneth",
		"Review": "\r Location, cleanliness , staff"
	},
	{
		"User": "Thomas",
		"Review": "\r Location, room, facilities"
	},
	{
		"User": "Leah",
		"Review": "\r Cleanliness, ambiance, excellent customer service"
	},
	{
		"User": "May",
		"Review": "\r accommodation and accessibility"
	},
	{
		"User": "Reynald",
		"Review": "\r location right next to mall. Clean modern rooms. Good service. "
	},
	{
		"User": "Herbert",
		"Review": "\r Efficient staff"
	},
	{
		"User": "HAROLD",
		"Review": "\r Great Location walking distance in Abreeza. Very good staff service and good food. "
	},
	{
		"User": "Barbara",
		"Review": "\r accessibility, accommodation, surrounding areas"
	},
	{
		"User": "Rodel",
		"Review": "\r Location, Price and Good staff"
	},
	{
		"User": "CHRISTIAN",
		"Review": "\r big bed, many pillows, cool airconditioner."
	},
	{
		"User": "Kristine",
		"Review": "\r Location location and location"
	},
	{
		"User": "Kristine",
		"Review": "\r Location, location, location"
	},
	{
		"User": "Abdul",
		"Review": "\r The friendly staff, cleanliness, location "
	},
	{
		"User": "Mary",
		"Review": "\r breakfast was good"
	},
	{
		"User": "Raul",
		"Review": "\r Location, food, location..."
	},
	{
		"User": "Nurhaziqah",
		"Review": "\r Place and cozy"
	},
	{
		"User": "Marie",
		"Review": "\r near abreeza mall, heart of the city access to all, new clean hotel"
	},
	{
		"User": "ALAN",
		"Review": "\r GOOD LOCATION , NEW ROOMS , GOOD POOL"
	},
	{
		"User": "Annabelle",
		"Review": "\r cleanliness, ambiance, location"
	},
	{
		"User": "June",
		"Review": "\r Staff were excellent, good location a"
	},
	{
		"User": "Ambrocio",
		"Review": "\r Location. Food. Service"
	},
	{
		"User": "Ambrocio",
		"Review": "\r Location. Spacious rooms. Breakfast choices"
	},
	{
		"User": "Ambrocio",
		"Review": "\r Location it is just across an Ayala Mall . Affordability . Breakfast buffet is satisfying"
	},
	{
		"User": "ALFREDO",
		"Review": "\r staff, food and location"
	},
	{
		"User": "George",
		"Review": "\r modern design, clean & comfortable"
	},
	{
		"User": "KWOK",
		"Review": "\r Location"
	},
	{
		"User": "Mark",
		"Review": "\r the location, the staff, the experience..."
	},
	{
		"User": "Geminiano",
		"Review": "\r Very good location, just right room size for tourist, very helpful staff"
	},
	{
		"User": "Edwin",
		"Review": "\r New, Location and Staff"
	},
	{
		"User": "ailyne",
		"Review": "\r comfortable and fun"
	},
	{
		"User": "Sol",
		"Review": "\r Great Staff..very good and safe location."
	},
	{
		"User": "Anna",
		"Review": "\r great rooms, breakfast buffet, staff"
	},
	{
		"User": "Daniel",
		"Review": "\r Comfort, location, staff, security"
	},
	{
		"User": "Vicente",
		"Review": "\r Good location..reasonable price..great staff..😀"
	},
	{
		"User": "APRIL",
		"Review": "\r Location, price and cleanliness."
	},
	{
		"User": "Ian",
		"Review": "\r the position close to abreeza shopping center, the butler King on floor 11 .a great guy hotel facilities generally were excellent"
	},
	{
		"User": "Cesar",
		"Review": "\r Location decor amenities"
	},
	{
		"User": "Erwin",
		"Review": "\r nice"
	},
	{
		"User": "Erwin",
		"Review": "\r location"
	},
	{
		"User": "Ronald",
		"Review": "\r Location, dining staff"
	},
	{
		"User": "Angel",
		"Review": "\r Smiling and accommodating staff, Proximity to Abreeza Mall, Cleanliness of the rooms"
	},
	{
		"User": "Claire",
		"Review": "\r Location. New Hotel. Clean"
	},
	{
		"User": "Dana",
		"Review": "\r Staff, modern facility, great location"
	},
	{
		"User": "Florence",
		"Review": "\r accessible, nice and tidy, and friendly staff"
	},
	{
		"User": "Marc",
		"Review": "\r Close to Abreeza Mall,Club Access, fast check inn/out "
	},
	{
		"User": "Michael",
		"Review": "\r Cleanliness, Comfort, Location"
	},
	{
		"User": "RUDOLF",
		"Review": "\r Its new, located beside mall, easy accessable"
	},
	{
		"User": "MAELENA",
		"Review": "\r Location."
	},
	{
		"User": "MARIA",
		"Review": "\r Good food,good location, clean room"
	},
	{
		"User": "Dominic",
		"Review": "\r location staff convenience"
	},
	{
		"User": "Hector",
		"Review": "\r location"
	},
	{
		"User": "ray",
		"Review": "\r New, clean, location"
	},
	{
		"User": "Juvy",
		"Review": "\r staff are exceptional!! i love the room..its clean and smelling fresh..overall!!its highly recommended."
	},
	{
		"User": "Mindy",
		"Review": "\r Hospitable staff, lush beds, modern interiors, business hotel adjacent to Abreeza Mall. "
	},
	{
		"User": "Grace",
		"Review": "\r good location, breakfast was great, and staff were really friendly and good service"
	},
	{
		"User": "Frederick",
		"Review": "\r Friendly Staff, Clean and Nice Location"
	},
	{
		"User": "Joseph",
		"Review": "\r Location, staff, and cleanliness"
	},
	{
		"User": "Emmanouelle",
		"Review": "\r 1. The location - right across abreeza mall 2. The hotel facade and cozy rooms. 3. The friendly and helpful staff"
	},
	{
		"User": "Alan",
		"Review": "\r Rooms, Staff "
	},
	{
		"User": "Reese",
		"Review": "\r Comfort, ambiance, staff"
	},
	{
		"User": "Mervin",
		"Review": "\r location, breakfast, bed"
	},
	{
		"User": "reviemelyn",
		"Review": "\r Location near Ayala abreeza, nice lobby , friendly staff"
	},
	{
		"User": "julio",
		"Review": "\r hospitality , kind, "
	},
	{
		"User": "Mario",
		"Review": "\r comfortable clean convenient"
	},
	{
		"User": "Romwell",
		"Review": "\r Location, value for money and friendly staff"
	},
	{
		"User": "Therese",
		"Review": "\r location, value for money & cleanliness"
	},
	{
		"User": "Joan",
		"Review": "\r The best 3 things about this hotel were as follows: 1) the staff were very accommodating and helpful specially with little kids around, 2) the rooms and bathrooms were clean and safe for toddlers, 3) "
	},
	{
		"User": "PETER",
		"Review": "\r good wine service at dining room, pool is clean, F & B manager very courteous."
	},
	{
		"User": "Sam",
		"Review": "\r Internet speed, breakfast, amenities"
	},
	{
		"User": "Vincent",
		"Review": "\r Clean hotel. Just across Abreeza Shopping Center and located at the metropolis"
	},
	{
		"User": "Josefina",
		"Review": "\r Location and cleanliness"
	},
	{
		"User": "Jeanette",
		"Review": "\r Great location, nice pool, friendly staff"
	},
	{
		"User": "TOSHIYUKI",
		"Review": "\r Location, Room, Price are good."
	},
	{
		"User": "joseph",
		"Review": "\r clean room."
	},
	{
		"User": "Aldbrian",
		"Review": "\r Club Rooms, Luxurious, Large Bed"
	},
	{
		"User": "craig",
		"Review": "\r comfortable rooms, nice staff, close to food and shopping"
	},
	{
		"User": "lee",
		"Review": "\r clean,fast wifi,spacious "
	},
	{
		"User": "Nathan",
		"Review": "\r Modern decor, comfortable rooms, great restaurant"
	},
	{
		"User": "Pamela",
		"Review": "\r The room, food and location :)"
	},
	{
		"User": "Marielle",
		"Review": "\r clean, nice staff, convenience"
	},
	{
		"User": "Edwin",
		"Review": "\r New Clean and location is good"
	},
	{
		"User": "Lorelie",
		"Review": "\r Comfortable stay really loved the bed), very close to the mall(few steps away), safety(Security)"
	},
	{
		"User": "Nurhaziqah",
		"Review": "\r Food location and new hotel"
	},
	{
		"User": "Erville",
		"Review": "\r Internet, Facility, location"
	},
	{
		"User": "Mary",
		"Review": "\r Location, clean roomsm friendly staff"
	},
	{
		"User": "JENIE",
		"Review": "\r Clean room, great staff and location"
	},
	{
		"User": "James",
		"Review": "\r Service is great, warm staffs, great location"
	},
	{
		"User": "Tracy",
		"Review": "\r Nice, clean, new, friendly staff"
	},
	{
		"User": "Marissa",
		"Review": "\r Location, internet, facilities"
	},
	{
		"User": "Carmelo",
		"Review": "\r Great location. Nice hotel. Very friendly, attentive and accomodating staff."
	},
	{
		"User": "Charito",
		"Review": "\r beachfront, pool and food & dining"
	},
	{
		"User": "ALLAN",
		"Review": "\r The hotel has a very convenient location and is accessible to all the good spots in Davao City. The hotel is new and clean, and the staff are very helpful and courteous. "
	},
	{
		"User": "Tomas",
		"Review": "\r location, location, location"
	},
	{
		"User": "Cherryl",
		"Review": "\r Accomodating staff"
	},
	{
		"User": "kevin",
		"Review": "\r location,great rooms, great staff"
	},
	{
		"User": "JOZALD",
		"Review": "\r Centrally located Modern Clean"
	},
	{
		"User": "Benedict",
		"Review": "\r Location, Security, Cleanliness"
	},
	{
		"User": "Roberto",
		"Review": "\r Very nice bed, modern interiors, NICE bathroom"
	},
	{
		"User": "Pamela",
		"Review": "\r Clean surroundings, friendly staff, quite location"
	},
	{
		"User": "Marion",
		"Review": "\r Very close to a nice shopping mall."
	},
	{
		"User": "SHIELA",
		"Review": "\r cleanliness,easy access ,centrally located"
	},
	{
		"User": "JOHN",
		"Review": "\r Cleanliness, staff treatment, situated in a best location"
	},
	{
		"User": "rafael",
		"Review": "\r Good location, good meal and cleanness"
	},
	{
		"User": "Barry",
		"Review": "\r location, decor, comfort"
	},
	{
		"User": "Luningning",
		"Review": "\r Friendly staff, great food , and very accessible to the malls and to the airport . "
	},
	{
		"User": "Kristoffer",
		"Review": "\r Very comfortable, good deal on agora, good service and amenities"
	},
	{
		"User": "Gloria",
		"Review": "\r New, with Friendly Staff with good spoken English, Convenient."
	},
	{
		"User": "Bassam",
		"Review": "\r location; price, services "
	},
	{
		"User": "Marion",
		"Review": "\r Location good"
	},
	{
		"User": "Ma",
		"Review": "\r next to a very nice mall"
	},
	{
		"User": "KWOK",
		"Review": "\r value for money, clean and comfortable."
	},
	{
		"User": "Anthony",
		"Review": "\r Friendly and competent, Good amenities, Very good location"
	},
	{
		"User": "Michael",
		"Review": "\r comfortable rooms, good amenities, Abreeza mall a stone throw away"
	},
	{
		"User": "Edith",
		"Review": "\r I like that the bathroom has no bathtub with shower on it, free wifi access and good breakfast "
	},
	{
		"User": "Laurence",
		"Review": "\r location"
	},
	{
		"User": "Paul",
		"Review": "\r Cleanliness, location & value for money"
	},
	{
		"User": "gregory",
		"Review": "\r New, bright, excellent location."
	},
	{
		"User": "primaluz",
		"Review": "\r Convenient location, spacious and comfortable room, great food"
	},
	{
		"User": "Julian",
		"Review": "\r Food, bed, and location"
	},
	{
		"User": "frederick",
		"Review": "\r centrally located. new, nice hote"
	},
	{
		"User": "Mai",
		"Review": "\r staffs are friendly and approachable location is very good fast internet connection"
	},
	{
		"User": "Cindie",
		"Review": "\r Nice interiors, Value for money & close to a shopping mall"
	},
	{
		"User": "George",
		"Review": "\r Only a few steps away from the mall. Delicious breakfast. Hi speed internet."
	},
	{
		"User": "Vishal",
		"Review": "\r location, rate and service"
	},
	{
		"User": "Bea",
		"Review": "\r New, Clean rooms, Near Abreaaza shopping mall, "
	},
	{
		"User": "elena",
		"Review": "\r Clean, modern and new."
	},
	{
		"User": "Therese",
		"Review": "\r location,value for money & staff"
	},
	{
		"User": "Frederick",
		"Review": "\r RIGHT BESIDE SHOPPING MALL"
	},
	{
		"User": "Bernardo",
		"Review": "\r Staff, service and clean."
	},
	{
		"User": "Charlemagne",
		"Review": "\r Clean, new and nice"
	},
	{
		"User": "Ailing",
		"Review": "\r rate, service and location"
	},
	{
		"User": "George",
		"Review": "\r Courteous staff, comfortable beds, easy access to transports and mall."
	},
	{
		"User": "Wenefredo",
		"Review": "\r location, price and staff"
	},
	{
		"User": "ERIC",
		"Review": "\r location, new, facilities"
	},
	{
		"User": "Leonardo",
		"Review": "\r Hotel is characterised by cleanliness, helpful and professional staff"
	},
	{
		"User": "Marc",
		"Review": "\r Near shopping mall, Reasonably clean, Decent TV"
	},
	{
		"User": "Ronaldo",
		"Review": "\r Across Abreeza Mall. New Hotel. "
	},
	{
		"User": "Andrew",
		"Review": "\r good food, helpful staffs and great location."
	},
	{
		"User": "Edwin",
		"Review": "\r value for money, clean rooms, nice location"
	},
	{
		"User": "MARIA",
		"Review": "\r Location, location, location"
	},
	{
		"User": "Sandee",
		"Review": "\r New hotel with good location. Cleanliness is commendable."
	},
	{
		"User": "Edmund",
		"Review": "\r Centrally located, clean, new"
	},
	{
		"User": "Allen",
		"Review": "\r very good room."
	},
	{
		"User": "Arthleen",
		"Review": "\r Location, price, staff"
	},
	{
		"User": "EDILBERTO",
		"Review": "\r Clean, near the shopping area, and have fast internet connection"
	},
	{
		"User": "Therese",
		"Review": "\r location,friendly staff & clean room"
	},
	{
		"User": "Odessa",
		"Review": "\r Easy access to public transport, close to shopping malls, clean and comfortable"
	},
	{
		"User": "Julian",
		"Review": "\r The service was impeccable. The breakfast buffet was delicious."
	},
	{
		"User": "Aris",
		"Review": "\r location, room comfort, proximity to mall"
	},
	{
		"User": "Alan",
		"Review": "\r fast check in / check out, clean"
	},
	{
		"User": "Luke",
		"Review": "\r Location, Value, Service"
	},
	{
		"User": "Melissa",
		"Review": "\r Friendly people, friendly waiter, Very close to the mall"
	},
	{
		"User": "Alexander",
		"Review": "\r you get more as you expected"
	},
	{
		"User": "Jan",
		"Review": "\r Affordable luxury, Central Location, Value for money"
	},
	{
		"User": "Rose",
		"Review": "\r big rooms, big bed, clean"
	},
	{
		"User": "Francisco",
		"Review": "\r Location, internet, nice breakfast"
	},
	{
		"User": "ROEL",
		"Review": "\r The 3 best things about the hotel are (1) location - it is right next to Davao's newest mall Abreeza, (2) beautiful room, (3) warm staffs"
	},
	{
		"User": "gilbert",
		"Review": "\r location, room size, big and very comfortable bed"
	},
	{
		"User": "Lorraine",
		"Review": "\r Clean, very cozy and affordabble"
	},
	{
		"User": "Mary",
		"Review": "\r good location, just across Abreeza mall, friendly staffs."
	},
	{
		"User": "Yoranda",
		"Review": "\r Good location to shopping center. All the staff is so friendly. Resourceful response"
	},
	{
		"User": "Robert",
		"Review": "\r 1. Efficient staff. 2. Clean & comfortable. 3. Good taxi service. "
	},
	{
		"User": "Lourdes",
		"Review": "\r Friendly staff,clean,near the Mall for shopping."
	},
	{
		"User": "JENIE",
		"Review": "\r Accomodation, Staff and Room"
	},
	{
		"User": "CHARISSA",
		"Review": "\r Rooms were comfortable and clean. Bathroom water pressure was excellent. Breakfast choices was good"
	},
	{
		"User": "Mary",
		"Review": "\r location clean rooms"
	},
	{
		"User": "rey",
		"Review": "\r Very good location, near shopping mall and excellent service"
	},
	{
		"User": "Rita",
		"Review": "\r cleanliness, friendly staff, proximity to shopping complex"
	},
	{
		"User": "Marlene",
		"Review": "\r Location, shopping, stylish"
	},
	{
		"User": "serena",
		"Review": "\r walk to large SM, restaurant in teh hotel. Big rooms"
	},
	{
		"User": "Dennis",
		"Review": "\r New, location to mall, service"
	},
	{
		"User": "Catherine",
		"Review": "\r location, room, accessibility"
	},
	{
		"User": "rey",
		"Review": "\r Nice facilities, centrally located and friendly staff"
	},
	{
		"User": "Marcus",
		"Review": "\r Great employees, Great food and clean and comfortable rooms "
	},
	{
		"User": "David",
		"Review": "\r Room Comfort, Breakfast, Price Point"
	},
	{
		"User": "John",
		"Review": "\r big rooms, nice breakfast, nice pool"
	},
	{
		"User": "Ma",
		"Review": "\r location, shopping, easy access to public transpo"
	},
	{
		"User": "ANGELICA",
		"Review": "\r near, new and clean "
	},
	{
		"User": "Arnab",
		"Review": "\r Close proximity to shopping mall, city center, good room size"
	},
	{
		"User": "LILYVELLE",
		"Review": "\r king size bed, comfy room & convenient location"
	},
	{
		"User": "Nathan",
		"Review": "\r Access to club lounge on club floor, good Internet and sufficient power outlets in club floor rooms"
	},
	{
		"User": "elvie",
		"Review": "\r nice location, friendly staff, my daughter enjoyed with the pool, good in service"
	},
	{
		"User": "anna",
		"Review": "\r The room is so clean and the bed made us feel so well rested..the executive lounge cater our needs..and made our stay very satisfying and we got the value for our money..we will return and stay there "
	},
	{
		"User": "Edward",
		"Review": "\r near a mall, bed was coomfortable, security access to rooms were good "
	},
	{
		"User": "Man",
		"Review": "\r new rooms, friendly staff, convenient location"
	},
	{
		"User": "evelyn",
		"Review": "\r location, value for money"
	},
	{
		"User": "Sanjay",
		"Review": "\r Location, cleanlines, freindly staff"
	},
	{
		"User": "Christopher",
		"Review": "\r near the mall, clean, attentive staff"
	},
	{
		"User": "Stephen",
		"Review": "\r Clean and spacious room. Good and helpful staff. The hotel is very new and close to a nice mall with some good restaurants."
	},
	{
		"User": "Maria",
		"Review": "\r Minimalist modern design, friendly staff, comfortable bedroom"
	},
	{
		"User": "Christopher",
		"Review": "\r Hotel, Location, Staff"
	},
	{
		"User": "John",
		"Review": "\r location, service, parking"
	},
	{
		"User": "Huang",
		"Review": "\r classy, nice and friendly staff"
	},
	{
		"User": "Huang",
		"Review": "\r nice, clean, good room service"
	},
	{
		"User": "Stephan",
		"Review": "\r Location is central, shopping mall next to the hotel and modern hotel"
	},
	{
		"User": "Eliezer",
		"Review": "\r clean, large room and pristine swimming pool"
	},
	{
		"User": "Jonathan",
		"Review": "\r Location. Cleanliness. Staff."
	},
	{
		"User": "Edgar",
		"Review": "\r good location, nice breakfast, nice room"
	},
	{
		"User": "Wayne",
		"Review": "\r Great Location, Friendly Staff, Nice Rooms"
	},
	{
		"User": "Noel",
		"Review": "\r Staff, room, breakfast"
	},
	{
		"User": "Wei",
		"Review": "\r new, clean, location"
	},
	{
		"User": "Wei",
		"Review": "\r new, clean, centrally located"
	},
	{
		"User": "John",
		"Review": "\r Convenient,Very Clean,Handyfor airport"
	},
	{
		"User": "JANETH",
		"Review": "\r Location,breakfast and the bed size"
	},
	{
		"User": "Joyce",
		"Review": "\r Modern room design, right beside a mall, right in the middle of the city."
	},
	{
		"User": "WUI",
		"Review": "\r Clean, quiet and very comfortable bed!"
	},
	{
		"User": "Ivy",
		"Review": "\r Great food; great staff; clean and stylish design of hotel and hotel room"
	},
	{
		"User": "Michael",
		"Review": "\r Clean, Friendly, Safe"
	},
	{
		"User": "John",
		"Review": "\r Right next door to a major shopping centre that is only new, reasonable gym and pool "
	},
	{
		"User": "Anna",
		"Review": "\r Fast internet, centrally located, easy access to malls"
	},
	{
		"User": "Ronald",
		"Review": "\r Next to Ayala mall, large bed and friendly staff"
	},
	{
		"User": "Jayson",
		"Review": "\r Centrally located, excellent customer service, value for money"
	},
	{
		"User": "Banseal",
		"Review": "\r location "
	},
	{
		"User": "jeffrey",
		"Review": "\r Location, staff and accessibility."
	},
	{
		"User": "Simon",
		"Review": "\r swimming pool, location, and bathroom"
	},
	{
		"User": "Cheryl",
		"Review": "\r Very clean, just across the new Ayala shopping mall, comfortable rooms"
	},
	{
		"User": "Penafrancia",
		"Review": "\r Big and Clean Rooms and CR, Breakfast, Accessible"
	},
	{
		"User": "Curtis",
		"Review": "\r location, cleanliness, close to shopping"
	},
	{
		"User": "Chee",
		"Review": "\r Easy access, centrally located"
	},
	{
		"User": "NASSER",
		"Review": "\r Staff was very helpfully their we're ready to extra mile to help second the location near to big mall in davao,third the staff was helpfully."
	},
	{
		"User": "Edward",
		"Review": "\r As a newly opened hotel, the rooms have modern design, spacious and good airconditioning unit. I took a room with large bed. it was very comfortable to sleep on and had several soft pillows. "
	},
	{
		"User": "CHRISTINE",
		"Review": "\r Excellent Service, Superb Dining, Centrally Located"
	},
	{
		"User": "Grant",
		"Review": "\r Centrally located beside the mall"
	},
	{
		"User": "Timothy",
		"Review": "\r New, stylish and comfortable."
	},
	{
		"User": "ma",
		"Review": "\r location, cleanliness & friendly staff"
	},
	{
		"User": "Jean",
		"Review": "\r very large room and bathrooum, very comfortable and close to abreeza mall"
	},
	{
		"User": "NICDAO",
		"Review": "\r near to mall "
	},
	{
		"User": "VAN",
		"Review": "\r Close to malls for shopping and dining"
	},
	{
		"User": "Craig",
		"Review": "\r new, shopping center, food"
	},
	{
		"User": "Daniel",
		"Review": "\r Great Bed, Next to Abreeza shopping mall, Large Flat screen"
	},
	{
		"User": "Chee",
		"Review": "\r central located, near shopping and easy to get food"
	},
	{
		"User": "Jacinto",
		"Review": "\r Clean room, king size bed, and near the mall"
	},
	{
		"User": "Erika",
		"Review": "\r near abreeza mall, nice clean and comfy bed"
	},
	{
		"User": "jean",
		"Review": "\r location, nice rooms and good breakfast"
	},
	{
		"User": "Ronaldo",
		"Review": "\r clean and spacious room, very good buffet breakfast and affordable price"
	},
	{
		"User": "irena",
		"Review": "\r great location, friendly staff, comfy bed"
	},
	{
		"User": "Maria",
		"Review": "\r fairly newly built, modern architecture, very clean,large rooms, nice pool"
	},
	{
		"User": "clyde",
		"Review": "\r Room, staff. Location"
	},
	{
		"User": "Jeffrey",
		"Review": "\r Centrally located, New and Modern rooms, and beside a shopping mall."
	},
	{
		"User": "Yoego",
		"Review": "\r Location, Helpful Staff, Price"
	},
	{
		"User": "Yoego",
		"Review": "\r Location, Price, Friendly Staff"
	},
	{
		"User": "CERES",
		"Review": "\r Clean and Fresh, Secured, Right Next to a Shopping Mall"
	},
	{
		"User": "Arthur",
		"Review": "\r Close to city center, close to shopping mall, well-maintained"
	},
	{
		"User": "Jeffrey",
		"Review": "\r 1.Good-sized, clean rooms 2. Attentive and friendly staff 3. Accessibility to Abreeza Mall and transportation"
	},
	{
		"User": "Chaivit",
		"Review": "\r new, good location, efficient staff"
	},
	{
		"User": "Romulo",
		"Review": "\r new comfortable rooms, good breakfast spread, functional toilet & bath"
	},
	{
		"User": "Luc",
		"Review": "\r Location clean comfortable "
	},
	{
		"User": "Ronaldo",
		"Review": "\r Clean, large room and great breakfast"
	},
	{
		"User": "Joleen",
		"Review": "\r location, efficient staff, wifi "
	},
	{
		"User": "Mohammad",
		"Review": "\r New hotel, clean, location"
	},
	{
		"User": "Audrey",
		"Review": "\r New, Easy access & Beside the mall"
	},
	{
		"User": "Chee",
		"Review": "\r Centrally located, close to shopping and restaurant"
	},
	{
		"User": "ERIC",
		"Review": "\r location, brand new, best buffet breakfast"
	},
	{
		"User": "Romina",
		"Review": "\r location, room size, free wifi"
	},
	{
		"User": "JENIE",
		"Review": "\r Friendly staff, clean room, close to a mall (Abreeza Mall)"
	},
	{
		"User": "Pamela",
		"Review": "\r convenient, acessible, new"
	},
	{
		"User": "Pamela",
		"Review": "\r near shopping mall, clean, comfortable bed, convenient,acessible"
	},
	{
		"User": "mark",
		"Review": "\r Room, fast internet, next to Abreeza Mall"
	},
	{
		"User": "Elizabeth",
		"Review": "\r Helpful staff, accessible to shops, good facilities"
	},
	{
		"User": "florence",
		"Review": "\r Nice Pool,good access to abreeza ,frienly staff"
	},
	{
		"User": "Lo",
		"Review": "\r Nice and confortable"
	},
	{
		"User": "Zandrix",
		"Review": "\r Front desk, service crew, pool and gym personnel were very attentive to our needs."
	},
	{
		"User": "Elizabeth",
		"Review": "\r Good location, close to shops, helpful and friendly staff"
	},
	{
		"User": "Judy",
		"Review": "\r Great customer service, clean , good location"
	},
	{
		"User": "Karen",
		"Review": "\r close to the mall, clean, simple modern"
	},
	{
		"User": "MELISSA",
		"Review": "\r comfy bed, large tv, nice lobby"
	},
	{
		"User": "Judy",
		"Review": "\r location, room size, friendly staff"
	},
	{
		"User": "Lourdes",
		"Review": "\r breakfast,friendly staff,near a mall"
	},
	{
		"User": "myrna",
		"Review": "\r Clean, location, food"
	},
	{
		"User": "Floro",
		"Review": "\r cleanliness, wifi & friendly staff"
	},
	{
		"User": "rissa",
		"Review": "\r Newly built,clean and near to shopping mall"
	},
	{
		"User": "erlinda",
		"Review": "\r Fantastic location . Best in service clean room"
	},
	{
		"User": "Lourdes",
		"Review": "\r Nice place,near a mall,clean,staff very respectful and friendly."
	},
	{
		"User": "Gelyn",
		"Review": "\r bed, bathroom, wifi"
	},
	{
		"User": "Kimberly",
		"Review": "\r Location, Friendly Staff, Brand New"
	},
	{
		"User": "Gerhard",
		"Review": "\r Location, Staff and Great breakfast"
	},
	{
		"User": "CHUA",
		"Review": "\r location is right across the upscale ayala abreeza mall, very accessible to pubic transport and centrally located in downtown davao, a wonderful staff at the front desk and dining area"
	},
	{
		"User": "Eldon",
		"Review": "\r Location, design, service"
	},
	{
		"User": "marife",
		"Review": "\r free computers for guests at the lobby, relaxed atmosphere,shopping mall just outside the hotel,wide variety of buffet breakfast and oustanding staff service"
	},
	{
		"User": "Marissa",
		"Review": "\r friendly staff,elegant design of the hotel,beautiful and big rooms"
	},
	{
		"User": "rowena",
		"Review": "\r secured elevator access, adequate room space, amenities"
	},
	{
		"User": "Jacinto",
		"Review": "\r king size bed, near mall, and clean"
	},
	{
		"User": "Derk",
		"Review": "\r Staff and parking"
	},
	{
		"User": "Rene",
		"Review": "\r New, Clean rooms with clean bathroom and a real firm bed, good for people with back problem"
	},
	{
		"User": "CARLO",
		"Review": "\r Staff, Breakfast, Fast Internet"
	},
	{
		"User": "Gerhard",
		"Review": "\r Location, comfort, staff"
	},
	{
		"User": "Cheah",
		"Review": "\r good location, Excellent Cust Service and delicious food"
	},
	{
		"User": "Teresa",
		"Review": "\r near Abreeza Mall, cetrally located, newly open hotel"
	},
	{
		"User": "Paul",
		"Review": "\r Location, comfort, service"
	},
	{
		"User": "Sherwin",
		"Review": "\r good location, good parking space, good ambiance"
	},
	{
		"User": "alan",
		"Review": "\r friendly staff,clean rooms, prompt service"
	},
	{
		"User": "Gary",
		"Review": "\r clean rooms, good design"
	},
	{
		"User": "eliezer",
		"Review": "\r new, modern great location"
	},
	{
		"User": "eliezer",
		"Review": "\r clean comfortable and modern"
	},
	{
		"User": "Sherwin",
		"Review": "\r new, includes breakfast, free use of imacs in the lobby, free wifi."
	},
	{
		"User": "Yousuf",
		"Review": "\r close to shopping mall"
	},
	{
		"User": "Jacqueline",
		"Review": "\r clean room, centally located hotel. good breakfast"
	},
	{
		"User": "Joel",
		"Review": "\r Location, price, clean rooms"
	},
	{
		"User": "Nympha",
		"Review": "\r location, breakfast, bed"
	},
	{
		"User": "Ana",
		"Review": "\r The bed was very soft, room was very clean and superb design"
	},
	{
		"User": "Eileen",
		"Review": "\r Staff friendliness n very helpful"
	},
	{
		"User": "Michelle",
		"Review": "\r Free wifi with pcs in lobby. Location. Staff are very fluent in English."
	},
	{
		"User": "Joseph",
		"Review": "\r 5-star accommodations, affordable pricing, Ayala brand"
	},
	{
		"User": "Richard",
		"Review": "\r the location, room, clean"
	},
	{
		"User": "Giovanni",
		"Review": "\r New Clean and at the heart fo the city"
	},
	{
		"User": "James",
		"Review": "\r beside Abreeza Mall, free WiFi, nice staff"
	},
	{
		"User": "ERIC",
		"Review": "\r Central location, modern design and very competitive rate "
	},
	{
		"User": "Paul",
		"Review": "\r Location, service, quality room"
	},
	{
		"User": "Alvin",
		"Review": "\r Breakfast buffet, proximity to airport, near shopping mall"
	},
	{
		"User": "Alan",
		"Review": "\r Great Location"
	},
	{
		"User": "Cheah",
		"Review": "\r 1) Nice and clean 2) Staff is friendly 3) New the Shopping Centre and a lot of Restaurant"
	},
	{
		"User": "Wong",
		"Review": "\r Good decoration, good inner decoration, new & clean"
	},
	{
		"User": "Ma",
		"Review": "\r New, nice and comfortable"
	},
	{
		"User": "Ma",
		"Review": "\r New, good location and clean"
	},
	{
		"User": "Abbey",
		"Review": "\r The hotel is new, clean, and very nicely decorated. The breakfast is the best we've had in hotels around the Philippines."
	},
	{
		"User": "Ma",
		"Review": "\r New. Good location. Great for shopping."
	},
	{
		"User": "Dennis",
		"Review": "\r Centrally located, new, next to Abreez"
	},
	{
		"User": "Raoul",
		"Review": "\r location, nice bed"
	},
	{
		"User": "Jean",
		"Review": "\r Safe, clean, luxurious and very nice"
	},
	{
		"User": "Hillary",
		"Review": "\r staff, bed, security"
	},
	{
		"User": "Janet",
		"Review": "\r elegant, pleasing & very appealing"
	},
	{
		"User": "Gerardo",
		"Review": "\r new hotel with elegant design, good location (next to abreeza mall), efficient staff"
	},
	{
		"User": "Frederick",
		"Review": "\r nice design, very modern, and friendly staff"
	},
	{
		"User": "JOEL",
		"Review": "\r New hotel, nice and clean rooms and fast internet"
	},
	{
		"User": "FRANCIS",
		"Review": "\r Brand-new Hotel, Clean, Comfortable and across Abreeza Mall for shopping and dining"
	},
	{
		"User": "Raoul",
		"Review": "\r Location, comfort, clean"
	}
]
