[
	{
		"User": "Neal",
		"Review": "Excellent place to stay as it is centrally located. Easy to walk about to the Mall if you choose to, and very easy to catch a Taxi when you want. Breakfast is excellent and the workers are very attentive. Already planning my next stay there."
	},
	{
		"User": "Therese",
		"Review": "The hotel is nice and clean. Staffs are approachable, accommodating, beautiful and smiling face. Love it!"
	},
	{
		"User": "Chad",
		"Review": "I liked the hard wood floors in the rooms for cleanliness. Rooms should all have in room safes... that would be great. Location is great being off the main street, but yet a short 5-minute walk to the G-mall and all its shops and food courts. Be sure to check out the roof top food court called the Peak across the street at the G-mall. Great value if traveling on a budget. "
	},
	{
		"User": "Marivic",
		"Review": "Front Desk ageant had to make a copy of my driver license and I don’t like it. I am not comfortable having that copied. Here in US we don’t do that due to personal information is all in the driver license. I work in a Hotel Industry and Work at the Front Desk also and we don’t do that here. Front desk agents wasn’t friendly at all. No greetings no hi and hello or welcome to all guests. "
	},
	{
		"User": "Glaiza",
		"Review": "Pros Big room Comfy bed Bidet Staff are nice Friendly Food is really good Location is good too House keeping is fast Con: Need to upgrade facilities (pool) Deep clean of rooms is a must No safety deposit box But this hotel surprised me..will stay here again.. "
	},
	{
		"User": "Rene",
		"Review": "Enjoyed the stay"
	},
	{
		"User": "Maria",
		"Review": "noticed that hotel has 2-3 hair blower only? I think you also need to invest on this, as when you lady client is checking out, chance of requesting for a hair blower is high"
	},
	{
		"User": "Bethany",
		"Review": "Breakfast was so good..."
	},
	{
		"User": "Ramsey",
		"Review": "At the heart of city center, mall across the street, sumptous breakfast, clean rooms and convenient location."
	},
	{
		"User": "Gregory",
		"Review": "It’s been two years since we last stayed here which use to be often. It’s still a nice place but it’s getting rough around the edges and they don’t clean as well as they use to. The pool and “hot” tub have always been cold. The WiFi is not very good unless you are in or near the lobby. For the money, I think I’ll stay someplace else next time. "
	},
	{
		"User": "Gareth",
		"Review": "We had a couple issues with the Pinnacle. The first was the room service, it was terrible. It took 1.5 hours to arrive and 2 out of the 3 dishes were soggy and at room temperature, clearly they had been finished and say out for 45+ minutes. The fruit salad had cheese on it! We also experienced something I haven't before, though this is definitely partly my fault. We weren't sure how many people were coming, so just put in 1 adult in the twin rooms. However when we arrived we found out they charge you more for the same room depending on how many people you say are staying, something I haven't experienced before. The charge online is around 15% more per person, but if you do it upon arrival it's an extra 55%! I'm used to just being charged a flat fee per room. "
	},
	{
		"User": "Jukhairy",
		"Review": "We booked twin superior room and the double beds are big and you can sleep comfortably most especially if the hotel will provide comfortable pillows. Breakfast buffet has many choices. Very good location."
	},
	{
		"User": "Clarizza",
		"Review": "The rooms were ok but they're somewhat old. The breakfast was great, I love the hot choco and the varieties. The pool was small and located in front of some rooms, so I wasn't comfortable as there were occupants on those room that were just staying by the pool. The location was great, just a few meters are restaurants, coffee shops, and spa. The staff though were not that accommodating. I got to the reception area and they were just chatting, I overheard their conversation and it's not even business related. They attended to my needs only after they finished chatting. You need to ask them to help you with your luggage even though you're obviously in need of help and they only helped me get to the elevator. I also asked if I could have my 1000 bill exchanged to smaller bills as my driver doesn't have a change for my PhP 300+ vehicle fare, they said that they don't have available bills but I later saw one of the receptionist holding 100s and 50s bills."
	},
	{
		"User": "Ben",
		"Review": "No safe inside the room to secure valuables "
	},
	{
		"User": "Maye",
		"Review": "Every thing’s perfect. Thanks!"
	},
	{
		"User": "Connie",
		"Review": "Location is great taxi called to entrance within minutes staff ensured guest safety recording taxi number, staff are efficient and polite, great breakfast with varieties, house keeping staff are attentive with fast response, will recommend friends and will stay again when visit Davao again! "
	},
	{
		"User": "Rochelle",
		"Review": "The sheet have stains. The shower knob was difficult to manoeuvre. You can hear the rooster in the morning. The walls are thin. The staff were good, they were accomodating. "
	},
	{
		"User": "Feliciano",
		"Review": "Very accessible location. Your needs within the reach. Nice buffet breakfast. "
	},
	{
		"User": "Mohamad",
		"Review": "Easy to get to mall, taxis and very convenient to get anywhere u wished"
	},
	{
		"User": "Mohamed",
		"Review": "To provide some halal food.. Breakfast ....waiter/waiteress must keep calling to clear the table. the chef don't understand what is half boil egg? Hotel staff....frontline staff very helpful and approachable Hotel Facility - toilet water (W.C area) stagnant water "
	},
	{
		"User": "Genjimichico",
		"Review": "Near to everything"
	},
	{
		"User": "cristina",
		"Review": "Staff are very accommodating and polite, breakfast was good with lots of local food choices, we love the home made achara :) "
	},
	{
		"User": "Roy",
		"Review": "The staff is very courteous and helpful, the location is on the center of the city, near shopping malls and food hub. The breakfast is different every morning and its good. Our room is big, bcoz I need a space for my bike, but it needs additional cleaning, the floor is sticky. overall the hotel is perfect. "
	},
	{
		"User": "RICHARD",
		"Review": "Nice place"
	},
	{
		"User": "Lara",
		"Review": "You definitely get more than what you pay for. "
	},
	{
		"User": "Aquiles",
		"Review": "Friendly hotel staff interesting breakfast buffet with Filipio taho and many other sweet delicacies. Near Gmall, San Pedro Hospital and Sta. Ana church and to many other important establishment in the nearby. Safe parking spaces. See you again soon."
	},
	{
		"User": "william",
		"Review": "just fantastic stay at hotel will go back again so freindly and helpfull thanks to genisis resturant manager he very helpfull one morning no bacon on menu cus change some days but he went and got me plate full nice and crispy just as us uk men do so thanks ///////////////// "
	},
	{
		"User": "LENY",
		"Review": "my cousins loved their pool. the location is great since it is just adjacent to a mall"
	},
	{
		"User": "alma",
		"Review": "Great place nice food... "
	},
	{
		"User": "BAOYIN",
		"Review": "It looks like so old. "
	},
	{
		"User": "Dion",
		"Review": "Everything was great! I will definitely stay here again on my next visit. Clean, nice people who alway greet with a smile every single time I return to the room. Very affordable and nice size room for the buck. Greatly recommend..."
	},
	{
		"User": "Francis",
		"Review": "My entire stay was pleasant with amenities I needed being provided. I was expecting a nice modern room based on the photos but what I got was the opposite of what's in the photo. Value for money, Yes I guess? because (1) it's cheap and with complete amenities (2) location is in the busy area of downtown and close to the malls It's just that I thought it was a catch because it's prices is no more than PHP2500 when I booked it after taxes but when I stayed, I basically got what I paid for."
	},
	{
		"User": "Trisha",
		"Review": "premier room not worth it. "
	},
	{
		"User": "Robert",
		"Review": "Had 3 nights stay on this hotel and everything went smooth and fine. Location is very good, food was awesome, staff is ok. Value for money using Agoda is GREAT!!!"
	},
	{
		"User": "Tadashi",
		"Review": "Terrible. A receptionist asked me to wait for a while when i asked for check-out. It seems that they needed to check my room. I was waiting in their lobby but she never came to me. I went to the front desk and i could not find her. And then i check with a guy whether i could leave out and explained about my situation. But he never said apologize to me. He just told me that i was allowed to go out."
	},
	{
		"User": "Sarah",
		"Review": "PROS: The room is spacious and clean. Location is near to G Mall and just 5-10 minute-ride to Roxas Market and other establishments. Staffs are very accommodating and are very welcoming. Breakfast meals are also good but not that excellent. CONS: The jacuzzi water is too cold and the woman at the entrance of buffet area does not smile. "
	},
	{
		"User": "Neil",
		"Review": "I keep on coming back to this hotel. Everything is good!"
	},
	{
		"User": "edward",
		"Review": "improve connection of internet"
	},
	{
		"User": "Vladas",
		"Review": "The pros: great Davao location close to everything. Lots of shopping and eating places within a walking distance. AVIS renta a car on premises. Very courteous, helpful, friendly staff. A very rich complimentary breakfast buffet with a lot of great tasting nutritious food. The (minor) cons: Room key cards keep demagnetizing for no apparent reason. The gym is tiny and virtually with no working equipment. The pool is very small. Jacuzzi has only cold water. "
	},
	{
		"User": "Jestoni",
		"Review": "Internet connection is too bad. As a business traveler, this is one important thing that I'm considering in choosing a hotel. Since it's my first time with this hotel, I didn't expect that they have poor wifi connection. Hopefully they can improve this one."
	},
	{
		"User": "Stephen",
		"Review": "I expect a reasonable level of internet access from a hotel of this standard . I was very disappointed with the WiFi Internet service, it was so bad that even the most simple sites were difficult to access even using their ‘business computer’ in the lobby. Any visitor who requires internet on their travels should really consider other options rather than rely on this hotel. "
	},
	{
		"User": "Kimberly",
		"Review": "The room was spacious and clean. buffet breakfast was great. what i am concerned of is the pool it looks so dirty and jacuzzi was not working. "
	},
	{
		"User": "Stanley",
		"Review": "Wonderful Hotel, but food has lost a couple of points."
	},
	{
		"User": "Diane",
		"Review": "Most of the foods served were not tasty. The water in jacuzzi was very dirty. The comfort room in my room needs renovation. It looks a bit old. Spacious room. Clean. Comfortable pillows and bed. Fast response and service from house keeping. Perfect location and convenient for travellers"
	},
	{
		"User": "Rizalino",
		"Review": "Excellent location and a good value for money. The array of breakfast selection was a real treat. "
	},
	{
		"User": "Curtis",
		"Review": "The rooms need safety deposit boxes "
	},
	{
		"User": "Francine",
		"Review": "Highly recommended for a stay in davao city!besides gaisano mall and centrally located..very good buffet breakfast w/ eye catching donut wall and wheel of cupcakes for kids!rooms are big and clean.."
	},
	{
		"User": "Damsel",
		"Review": "All was okay except for the clogged toilet bowl. Plus the receptionist should smile more often. Location is also good near Gaisano Mall especially for me who loves mall strolling and shopping "
	},
	{
		"User": "Lora",
		"Review": "The room was clean when we entered. But the toilet was smelly. Need to be clean and sanitize properly. As the smell of urine was there. For this kind of hotel it would be nice if they have a safety box,a mini bar (fridge was bigger than the average hotel) and a hair dryer. "
	},
	{
		"User": "rajandran",
		"Review": "Very good hospitality specially by the F&B manager Mr Allan who really takes care of us while breakfast. House keeping staff and front office staffs with prompt attention ."
	},
	{
		"User": "Cha",
		"Review": "My family enjoyed our 3-night stay, the hotel is well maintained. Rooms are clean, and the twin bed is big enough to sleep an adult and a child comfortably. The pool is small, guest have to take turns or it gets crowded. Luckily, the children got in first so they still enjoyed playing there. Breakfast buffet is good, they rotate/change viands daily. The staff are helpful and accommodating - guards, frontdesk, café and pool area. We liked the location, we drove around and there are many stores, ATM, places to eat, even a mall nearby."
	},
	{
		"User": "ROSAN",
		"Review": "For a family stay,this is nice. They have a pleasant restaurant , good food and a place for family bonding and get together. Location is also good."
	},
	{
		"User": "Carl",
		"Review": "Breakfast could be better"
	},
	{
		"User": "Jephonie",
		"Review": "As the title says, there is nothing special about this place. It is a small hotel with mediocre service and food. The room is clean but the staff could be better. The best thing about this place is its location. Other than that, I suggest you try other hotels in the city."
	},
	{
		"User": "Lorena",
		"Review": "the room was big, great breakfast, kids enjoyed swimming in pool and jacuzzi. We'll be back"
	},
	{
		"User": "Erna",
		"Review": "I hope the staff will address our request eat immediately. Because we requested for additional slippers since we only have one pair in our room and we didn't bring our own. We requested twice at the front desk before it was delivered to us THE NEXT DAY. However, overall it was a very pleasant and good stay at the hotel."
	},
	{
		"User": "jim",
		"Review": "when I arrived had nice greeting out front was very cool. everyone who I passed that work there said hello. Thats a great staff...didnt eat your breakfast cuz i like mcdo so walked down there..I would recommend this hotel to everyone in the Whole World..."
	},
	{
		"User": "Imaichi",
		"Review": "The kids would like to take a dip in their wading pool but wasn't able to as there was a party going on in the pool area. Would've been nice if they didn't make it exclusive so that other guests can enjoy the place. I know another hotel in the city who don't allow exclusive use of their pool area. But overall, good stay. "
	},
	{
		"User": "jeamar",
		"Review": "good value for money location is somewhat ideal depending on the where you are going rooms are big and clean "
	},
	{
		"User": "Christina",
		"Review": "Not recommended if you want to just relax...but if you're a beer drinker, go ahead the lobby cafe frances allows beer drinking to your hearts delight and LOUD singing I was told there was a \"private\"party but it was like you're in a beer garden...I expected a more relaxing or at least a cozy place. The premier suite where I stayed was good but had mosquito even when I showered I stil got bit. the window can easily open without screen. "
	},
	{
		"User": "Gipeom",
		"Review": "1) 1000peso deposit need 2) 4beer only allow to bring per day if you bring more you have penalty 3) many penalty rule made i can't feel comfortable in this hotel i was stay there 5times from last year no more... maybe owners changed or manager changed "
	},
	{
		"User": "Aileen",
		"Review": "Hotel is clean, great locations, great staff, friendly staff, and closer to restaurants"
	},
	{
		"User": "edward",
		"Review": "improve internet connection."
	},
	{
		"User": "Marillo",
		"Review": "Good location"
	},
	{
		"User": "Steven",
		"Review": "Toilet and shower head was leaking, shower and bathroom is a little outdated and was not as clean as should be.. Bathrooms overall could use some improvements. However, it was acceptable for the money spent."
	},
	{
		"User": "tokunori",
		"Review": "Good WiFi is to slow and sometimes no connection."
	},
	{
		"User": "Hannadia",
		"Review": "This hotel has always been my favorite hotel in Davao. Situated in the heart of the city and walking distance to malls. I love to relax in their jacuzzi and I love their free breakfast. "
	},
	{
		"User": "Suzette",
		"Review": "The room is a good size with a good view. The restaurant is awesome with a reasonable price. The location of the hotel is convenient close to the city and to the mall. I stayed at Marco Polo and Waterfront Insular Hotel. I like the Pinnacle Hotel the most. The hotel is nice and the staff, too."
	},
	{
		"User": "Raquelyn",
		"Review": "very near at the mall and attractions"
	},
	{
		"User": "John",
		"Review": "the breakfast buffet was pretty good. Get a high floor on an outside wall for views over the city. I was in room 919, not bad. a bit higher and viewing the seaside may be better, but it was a nice view anyhow. "
	},
	{
		"User": "Neil",
		"Review": "it was very old. the rooms were had a good size its just that the cabinet and the bathroom fixtures shows its old. the best part about it is the location. it was a very short walk to the G Mall. the breakfast was good. they served local dishes. especially the seafood. we had dinner here, the fish was really good. "
	},
	{
		"User": "Jay",
		"Review": "I suffered a major kidney stone attack while I was there at the Pinnacle. The staff was so wonderful, took me straight to the hospital and made sure I was taken care of before they left. Also they went back to my hotel room to get my meds to let the doctors know. I am so grateful to those two wonderful young men who assisted me. Praise them and praise God for them."
	},
	{
		"User": "bryan",
		"Review": "we stayed here for 1 nights during our vacation in davao, the experience was amazing. With me are 2kids and my wife, we very much enjoy the buffet breakfast it was superb also the jacuzzi was so relaxing.. we checked in late so we did not experience the pool at nigh because its closed"
	},
	{
		"User": "Princess",
		"Review": "my parents had a great time together with grand children in your hotel. Checking in went smoothly"
	},
	{
		"User": "David",
		"Review": "The best thing about this hotel is the yummy food and very affordable and beer is the cheapest of any motel in davao city , well done management."
	},
	{
		"User": "Henricus",
		"Review": "The pool was closed when I stayed here, so bad. But I discovered it has an inside pool area too! Very nice. Staff is friendly, place is clean, restaurant is OK to good."
	},
	{
		"User": "allison",
		"Review": "Clean room and outstanding workers "
	},
	{
		"User": "Elaine",
		"Review": "it's my second time in Pinnacle Hotel. When I arrived in the hotel, the staff did not bother helping me with my luggages, maybe because they thought I was not checking in. and I was part of the participants in the training upstairs (my uniform had the same color with them). Although that should not be excuse. The staff should be courteous to everyone in and out of the hotel. Anyway, the room given to us was very spacious. Room was clean and comfortable. CONS: As mentioned by other reviews, WIFI CONNECTION NEEDS IMPROVEMENT. Very Very slow internet connection. And the Jacuzzi needs more heat. Pool needs improvement too. Overall, it was a good place to stay. We will surely comeback. Hopefully this time, the staff is more friendly and considerate."
	},
	{
		"User": "Fe",
		"Review": "Hotel is quite old but still well maintained. Cleanliness is OK but lobby is always full. Maybe because of their occupancy. But breakfast is very good considering the price you pay for the room. Good stay. "
	},
	{
		"User": "cetin",
		"Review": "Run-down and needs renovation."
	},
	{
		"User": "Jehan",
		"Review": "Hotel is centrally located in the heart of the city. Pool is small and unattended. Rooms need improvement as they are old, but beds are bigger than most hotels have."
	},
	{
		"User": "Emmanuel",
		"Review": "Our stay here was pretty good. The staff were very welcoming, although some of them weren't that switched on. I find the day staff to be much more engaging than the night ones. The breakfast was OK, however, it wasn't that hot. I suppose you'd need to be there at 6am to ensure the food is still relatively hot. As for the location, the hotel in situated on a very accessible road, and is close to one of Davao's main malls, Gaisano Mall (G Mall). You can walk, get a cab, or if you're willing to pay, get dropped off by the Hotel's transport services. There are also plenty of food places around the area. We didn't utilise their room service, as you can get food delivered from numerous eateries (macca's, Jollibee, Burger King, etc...). Overall, we had a pleasant stay and would come back here again, but stay in a more expensive room for the experience. We stayed in a Superior Twin Room. Twas spacious and had a nice ambience. :) "
	},
	{
		"User": "Avon",
		"Review": "could have been better if they did not lock us out on the 2nd day. we had to go down the reception again to have our keys updated. we were paid for 2 days in advance"
	},
	{
		"User": "Jean",
		"Review": "The facilities, buffet breakfast, our room and the staff are all A+. It's the best hotel when it comes to location in downtown/Davao City. Walking distance to a couple of malls and as well as their Night Market. Our 3 night stay were awesome."
	},
	{
		"User": "Maureen",
		"Review": "We had the family room - I could say the room was quite big, it could even fit up to 3-4 families. What I just didn't like was the smell of room - they should've also put some air freshener. The food was okay but I suggest to add more varieties in main dish. Also, there was a liquid dripping from split-type air-condition onto my face which I thought was disgusting. I had to put a tissue into it to stop from leaking."
	},
	{
		"User": "Paul",
		"Review": "Great deal and the location was great, near at the mall, hospital and public transportation. Thumbs up!"
	},
	{
		"User": "Nonette",
		"Review": "We stayed in a family room at 12th floor, when we walk in, the room smell terrible. There's toilet paper in the bathroom but looks like a left over roll from previous guest. No back up, i have to request for more. Coffee and cup provided is only good for a couple. We reserve the room for 4 people, obviously its for family not just for a couple. The security were very attentive, they assist my mom to get in the car since she was on the wheel chair. That was very nice and I thank them for their hospitality. "
	},
	{
		"User": "Aileen",
		"Review": "Hotel still in good conditions near McDonald's and some restaurants "
	},
	{
		"User": "Sara",
		"Review": "Clean, friendly staff"
	},
	{
		"User": "Jasmin",
		"Review": "cons: having to pay security/incidental deposit of P1000 and has to present stub at check out. "
	},
	{
		"User": "Anna",
		"Review": "friendly staff and good location. I will surely come back"
	},
	{
		"User": "Leizl",
		"Review": "Location was great, staff were very hospitable. Rooms are big and comfy however they need to do some bathroom renovation. Also they need to improve the food choices on their breakfast buffet. "
	},
	{
		"User": "maria",
		"Review": "Experienced 6.7 earthquake when i stayed there. Good thing, the building's structure ilremained intact"
	},
	{
		"User": "Bernadita",
		"Review": "Hotel is a bit older but clean and it doesnt smells old ..bed..foods..room size is good..poor wifi connection.poor shower room."
	},
	{
		"User": "Crisitna",
		"Review": "There some adjustments needed and the staff were not as helpful or sympathetic. I didn't feel that they tried so hard...maybe because they see that its an online booking....a bit different if paid directly to them"
	},
	{
		"User": "Joyce",
		"Review": "The hotel is accessible to the nearby mall, lots of nearby restaurants and food options to choose from. Customer service was top notch. Every hotel staff I interacted with are polite and very courteous. They will attend to your needs/concerns without any hesitation. Food in their restaurant is great and very affordable."
	},
	{
		"User": "Peter",
		"Review": "Nice place and location. Staff are accommodating and helpful Breakfast is nice. Only downside is wi-fi is slow.. very slow."
	},
	{
		"User": "edward",
		"Review": "must improve wifi"
	},
	{
		"User": "Estelita",
		"Review": "Good value for money, good breakfast, friendly and courteous staffs!"
	},
	{
		"User": "TIMHAR",
		"Review": "Decent and nice hotel"
	},
	{
		"User": "TIMHAR",
		"Review": "Suited for a 3-star rating hotel only"
	},
	{
		"User": "Ma",
		"Review": "Pros: the price, location, the chef made some effort to make unique looking donuts that kids would surely love. Although it doesnt taste so good, the chef's creativity is highly appreciated. Cons: hotter water in shower please."
	},
	{
		"User": "Jessie",
		"Review": "value of money and nice location."
	},
	{
		"User": "Jessie",
		"Review": "value of money and nice location which is near to the shopping center such as malls."
	},
	{
		"User": "Melanie",
		"Review": "Good Value for money, nice room , staff and Very Good breakfast buffet"
	},
	{
		"User": "Anna",
		"Review": "Suggest that you must upgrade the design of your rooms. We we're lucky enough to see President Duterte here! you must try their native tinolang manok!"
	},
	{
		"User": "Jeehan",
		"Review": "If you are looking for a \"Value for Money\" Hotel, this is it. Sufficient facilities and excellent buffet breakfast are among the best services of this hotel. I really enjoyed my 3-days stay here. Will definitely stay here again when I go back to Davao. "
	},
	{
		"User": "Alexander",
		"Review": "clean pretty room good food staff needs training "
	},
	{
		"User": "Christopher",
		"Review": "Nice place to stay ..across from G mall..a few eateries next door "
	},
	{
		"User": "Corazon",
		"Review": "Toilet rather small, room 902 very bad smell"
	},
	{
		"User": "Nenita",
		"Review": "The service was excellent, especially their front desk staff Jeff Uy. He made our Davao experience awesome because of his tour references. Other hotels don't have staff like him who is very friendly and accommodating. The cafe also has great staff and food. The pool near the gym was relaxing Will definitely return there next time."
	},
	{
		"User": "Florencio",
		"Review": "Very good "
	},
	{
		"User": "krizelle",
		"Review": "We had high expectation for this hotel, however, facility-wise the room we were given looked old and cheap. I had to ask housekeeping to give us new pillows because the pillowcases did not look anything close to fresh. The cabinet smelled terribly bad. "
	},
	{
		"User": "Welhilmina",
		"Review": "I would like to comment during my stay last march 23 . Two female staff were not attentive at all . Upon check out , waited for gate pass to clear . She didn't call or let me know. I noticed the other customer later got her fate pass done. . When I asked for mine , just that time she gave it to me . I just hope the staff will treat fairly to Filipinos -- also. Noticed they are so accommodating to foreigners , but for Filipinos less accommodations . Hopefully this will be given attention . Please take a moment to check and find out . Thanks "
	},
	{
		"User": "SULTAN",
		"Review": "Security Staff all were very respectful Room is clean comfortable Hotel is nice One would feel at home there."
	},
	{
		"User": "Krestel",
		"Review": "centrally located just beside the Gmall, many restaurant around the hotel, clean and big rooms, standard room can accomodate 2-4 guest, with small swimming pool at the 5th floor - my kids really enjoyed it because it has a small jacuzzi which is very relaxing, the staff are friendly and, the free buffet breakfast was the best ~ many food to choose from, and they also allow early check in around 11am, for our 2nights stay we will difinetly come back and will recommend it to others, it was the best place to rest and to relax in the city.. "
	},
	{
		"User": "Ryan",
		"Review": "If you want to go in Davao with lots of options, this is the best place. Its near to Gaisano Mall."
	},
	{
		"User": "Glazy",
		"Review": "Everything was great. Delicious breakfast!"
	},
	{
		"User": "chariecor",
		"Review": "Pros: Super Spacious room, helpful staff, clean room --- Cons: Old Bathroom's shower not working, check-in process took too long"
	},
	{
		"User": "roy",
		"Review": "when i arrive at the hotel the people in the front door were not helping me with my luggage. And when i try to check in the girl in the front desk(trixee) told me that i need to wait for 15-20 minutes because the reservation officer is eating up his breakfast. after 10 minutes i approach the same girl again and told me again to wait because still on break then after 15 minutes i talk to other people in the front desk then i told them what if that person break is 1 hour do i need to wait ..is there anyone who can check me in...my god paano kung absent yung tao na yun di ko makaka check in...then they just let me check in...i been several times in davao(marco polo) and people are very helpful and friendly."
	},
	{
		"User": "Aura",
		"Review": "Please change the pillows especially if the room is already a suite. Also, add more variety on your breakfast buffet. "
	},
	{
		"User": "James",
		"Review": "clean, good service "
	},
	{
		"User": "Heidelynn",
		"Review": "The Breakfast is good. Staff are very friendly and helpful. The room is clean and spacious. The bathroom looks old though so it has that dirty look. But I would give it a 3 star."
	},
	{
		"User": "Vicky",
		"Review": "The staff were always willing to help and were really friendly and lovely to talk to. The room was spacious and comfortable and air con was a great touch. The piano lounge in the evening was always enjoyable and both the pool and jacuzzi were great. Overall lovely stay."
	},
	{
		"User": "Shel",
		"Review": "I had a superb stay here. Comfortably slept! The staffs are great as well! Will definitely come back."
	},
	{
		"User": "Homer",
		"Review": "Perfect location to see all that Davao has to offer. Start day with good breakfast and your not far from G-Mall or Peoples Park.. Perfect hotel for price and location"
	},
	{
		"User": "Asther",
		"Review": "Good location, food and spacious rooms with an amazing view of beautiful Davao City. May need more maintenance checking on the toilet and some furnitures, may be ok for us but not for some who have been to other mid to high-end hotels."
	},
	{
		"User": "reviemelyn",
		"Review": "Attentive staff, good breakfast then the hotel is clean, near gmall and accesible love this hotel , old hotel but well maintained "
	},
	{
		"User": "Melanie",
		"Review": "Would try a different hotel next time"
	},
	{
		"User": "Nestor",
		"Review": "Good Value of Money for this kind of hotel. Staff are kind and friendly. I don't know but there's something smelly when you first entered the room. Maybe, management / housekeeping staff should look into this."
	},
	{
		"User": "Grin",
		"Review": "This hotel has great potentials. They just have to work more on cleanliness."
	},
	{
		"User": "Andrew",
		"Review": "Having stayed at the Pinnacle Hotel previously as a traveller, I was surprised to find that the standard of service seemed to be trying to improve, which is counter to my experience elsewhere. The staff are all determined to greet you with their signature greeting; \"Madayaw Sir, Madayaw Maám\".... Check in was not smooth. I'd requested a matrimonial bed, which was printed on my voucher but they'd reserved a twin bed room for me, then the last moment change put me in a room with no view at all... On trying to get to our room, we were confronted by one out of the three elevators out of service and it stayed that way for our entire stay. Now we find that they have no service elevator so when the hotel is full, as it was for this stay, the staff occupy a huge amount of elevator time in moving bedding and service trolleys up and down.... Bad design, coupled with poor elevator management meant that we were inconvenienced over and over in trying to get up to the 9th floor or down to the lobby..... The room was well appointed, except that there was no safe in the room, I had to use the old fashioned system of safety deposit behind reception. The shower's spray head was blocked, I had to remove it to take a proper shower! Water pressure was great and it was hot water so thumbs up for that. There was a good tv with a few channels for those in need of tv. The restaurant was really good and well managed, my only criticism was that they insist on providing only unsalted butter.... If this is for our health, why do their egg chefs insist on adding large amounts of salt to everything they cook???? The restaurant had a floor manager who never seemed to stop organising things, he was excellent and when I told him I would like regular salted butter, he provided it by the next morning... Impressed but I think there should always be a choice on display for those who don't like margarine, or butter that tastes like margarine. No fresh milk for the cereals, only room temperature UHT mi"
	},
	{
		"User": "Maripola",
		"Review": "I will be glad to stay again at this hotel"
	},
	{
		"User": "Herbert",
		"Review": "nice place, cozy but elegant. a little dim in the bathroom though. beds are great as well as the ambiance. Great buffet spread! must try grilled tuna. "
	},
	{
		"User": "chris",
		"Review": "good location..."
	},
	{
		"User": "Raul",
		"Review": "Satisfied with our stay."
	},
	{
		"User": "Elizalde",
		"Review": "The staff are very accomodating, they let us stay for an early check in. The buffet breakfast is also Good. "
	},
	{
		"User": "Dolores",
		"Review": "Buffet breakfast is very good "
	},
	{
		"User": "Claudine",
		"Review": "the location is an advatage for newbies like us :)"
	},
	{
		"User": "Paul",
		"Review": "Great value for money.....very clean hotel and a great location being only 5 minutes walk to Gaisano Mall."
	},
	{
		"User": "Paul",
		"Review": "Nice hotel only 5 minutes walk to Gaisano Mall....very clean and great value for money."
	},
	{
		"User": "Han",
		"Review": "I came back one night to find 3 roaches in the room and one of it was on my bed. Grossed me out. They transferred me to another room though but I wouldn't stay here again. The staff was great though. "
	},
	{
		"User": "Satchi",
		"Review": "Stayed with family last august, i requested for an early checkin as our flight is due to arrive in davao around 8am. We got to the hotel around 9 and when we got there we were told that the room is not available yet as the checkin time is 2pm, i took into consideration that we were a bit early and didnt wanna make a big fuss since i was having a really nice time with family. So all of us waited at the resto, we were told to come back to the reception around 12 as this is their checkout time and so thats what we did, when i went back there isnt any rooms still and i was already feeling a bit annoyed as we were travelling with children and it was a long day for us. Finally we were able to check in around 3pm, when we got to the room(family room) IT WAS HORRIBLE, DIRTY, AND STINKY. The bathrooms disgusting and everything else was just a nightmare. Never going back to this hotel ever again. Staffs are rude, facilities are outdated, and rooms are like those we see in horror films, its dark and some bulbs are not functioning, its dirty and its very smelly. You can get a more decent hotel in davao for the same price so its best to steer clear away from this hotel. "
	},
	{
		"User": "Liwayway",
		"Review": "With a hotel feel for the price. Safe. Clean."
	},
	{
		"User": "Angelito",
		"Review": "Pillows are not comfortable Towels are very old Wifi not string enough from time to time . Breakfast- Brewed Coffee not a typical coffee taste it was so light for the last ten days i was there. Fruits are not up to quality to ensure their quality in taste and flavor Staff are very helpful but may not be aware of the purpose of the business of ensuring customer satisfaction in food and comfort of staying in the hotel"
	},
	{
		"User": "John",
		"Review": "Large rooms, close to the mall. Seems to be older then most hotels in Davao but still a nice stay."
	},
	{
		"User": "Brianne",
		"Review": "I keep coming back because of staffs and efficient service."
	},
	{
		"User": "marco",
		"Review": "It was a nice place, but needs more attention when one checks in. Other then that the staff was great. And The halls on the upper floors are hot and muggy just to get to room. Yuk, "
	},
	{
		"User": "Mark",
		"Review": "Rooms are clean but smelled \"old\". Staff are helpful"
	},
	{
		"User": "saeed",
		"Review": "So nice service spechaly front disc and supervisor at the restaurant he is nice person and hard working looking what the giust need,,clean room every thinges perfect,,and I recommend any frind to stay in this hotel ,,also the security working hard all the day and night,,I wil come again and again,thank u for all,,"
	},
	{
		"User": "Sheittie",
		"Review": "I really love this hotel. "
	},
	{
		"User": "Rodolfo",
		"Review": "The room is good enough in size, beds are big, but the only thing i find lacking in a big hotel is the \"shower hose water spray\". "
	},
	{
		"User": "Desiree",
		"Review": "Good"
	},
	{
		"User": "Marc",
		"Review": "Comfortable bed. Breakfast buffet is quite good. Impressed with the staff. Restaurant food is good and reasonably priced. 7-11 close by. Water in pool and jacuzzi colder than expected but that's only slight negative we can think of. Recommended."
	},
	{
		"User": "ronesa",
		"Review": "Nice hotel to stay in, its near the City & Gmall, safe place,had a good accomodation & the morning Buffet breakfast is yummy! Yes i recommend this Hotel 100% "
	},
	{
		"User": "Claudine",
		"Review": "This place was so digusting. I left to eat then the moment I cam back I saw 4 baby cockroaches feeding on my toothpaste and toothbrush. The frontdesk staff was really damn annoying. He never emphatized and left us hanging there while calling his manager. Damn useless! Please book somewhere else. "
	},
	{
		"User": "Sultan",
		"Review": "The location is great and breakfast is super.. I don't about lunch and dinner.. I was eating outside "
	},
	{
		"User": "warren",
		"Review": "Across the road from Gaisano Mall, rooms are great...traffic is very challenging in central Davao...and highway coming in and out"
	},
	{
		"User": "Donald",
		"Review": "The Pinnacle Hotel is a very nice hotel in Davao city & is in a central location near the shopping center. Easy access to the attractions of the city & has large comfortable rooms. I would highly recommend this hotel to my family & friends."
	},
	{
		"User": "Julieta",
		"Review": "Price was very reasonable. Relatively cheap compared to other hotels. The hotel itself looks really nice. The lobby looks elegant and the ambience was welcoming. The staff was very accommodating. They easily respond to the needs of the guests. Checking in and out were a breeze. Food was surprisingly good. Had lunch there upon check in. The servings were big and the food tastes good too. We likewise enjoyed the breakfast buffet. Breakfast food selection was varied and also tasted really good to our liking. We stayed in a superior room. Rooms was ok. The beds are big. Airconditing was cold. Room was clean. The interior looks nice. The bathroom was ok too, it was clean, no funky smell, but looks a bit rusty already. However, one big disappointment is the lack of sufficient lighting. The room was dark since there were only 3 small yellow pinlights. The bathroom was also very dark since there was only one small frosted light. Light did not even reach the shower room. Overall, our stay was very pleasant and comfortable. Apart from the poor lighting and some aesthetics that could be improved, every aspect of our stay was above satisfactory. In fact, we really enjoyed our stay here. I would definitely recommend this hotel to those who are on budget yet still wants an enjoyable and comfortable stay in a nice hotel. "
	},
	{
		"User": "annalyn",
		"Review": "Clean and new but there is no tub in the bathroom to soak in"
	},
	{
		"User": "Yek",
		"Review": "Fairly good location, reasonably good buffet breakfast included. I will come back to this hotel if I visit Davao again"
	},
	{
		"User": "Manilyn",
		"Review": "Tahimik. Friendly staff. Good ambience. Clean. "
	},
	{
		"User": "JANGHYUN",
		"Review": "Location good Breakfast ok Room size good Receptionist just so so Finally 8 point out 10 , reasonable price "
	},
	{
		"User": "rey",
		"Review": "This hotel is just across Gaisano"
	},
	{
		"User": "Larisa",
		"Review": "Room is ok. Spacious. However, rooms are not sufficiently lighted. Its Dim and cant do work."
	},
	{
		"User": "Larisa",
		"Review": "Good location. Spacious room. However, room is not well lighted. A bit dim. WIFI is weak."
	},
	{
		"User": "vecher",
		"Review": "the room was really dirty. there was an old bottled water left inside the cabinet. bathroom floor was dirty, they did not provide a floor mat unless asked. there was an eyelid tape left at the table. and room is really dusty. the hotel staff were really nice though. and would really go out of their way to help you. "
	},
	{
		"User": "May",
		"Review": "Nice entrance guards and helpful"
	},
	{
		"User": "Rachel",
		"Review": "Value for money, good location"
	},
	{
		"User": "Jacqueline",
		"Review": "The hotel was good for it's rate and was in a very accessible road."
	},
	{
		"User": "Kate",
		"Review": "I've never been disappointed with hotels before than this one. I understand that Saturday visitors may come full packed that's why we were very understanding when we have waited almost an hour just to check in. By the time we finally reached the room, I was starting to feel disappointed- it was not the room I have booked and paid for, the Jacuzzi was not working and there's not a single employee overseeing the pool area. There were some kids playing (I don't know where their parents are). I just thought it would be safer if someone would actually be there to avoid accidents especially with kids. Anyway, food is great. Some crew are lazy but there are also helpful especially those in the front desk. Thank you."
	},
	{
		"User": "Teofilo",
		"Review": "Food does not taste well. Request for room service never came. Front line counter staff are not helpful"
	},
	{
		"User": "reya",
		"Review": "breakfast was nice (drinks were not so good). staff were very accomodating."
	},
	{
		"User": "Charlie",
		"Review": "Cost cutting on lightings is damaging to the ambience"
	},
	{
		"User": "Anne",
		"Review": "Our 4 days stay in Pinnacle is good. The location of the hotel is right in the heart of downtown Davao. We mainly used taxi cabs as our main transportation and did not have a hard time getting one. Their breakfast is usual but good 👍🏻 their rooms is spacious for 2 but kind of rusty already. Their bathroom is not up to date as they don't have bidet (this defines a newly renovated bathroom for me). There were small roaches coming out of the bathroom drainage. But overall, if you are looking for a not so expensive hotel which is in a good location choose Pinnacle."
	},
	{
		"User": "Francis",
		"Review": "A clean and nice place to stay for business travellers"
	},
	{
		"User": "Julie",
		"Review": "Among all the reviews for the supposed 4-5 star hotels in Davao, Pinnacle had the most mentions of cleanliness. They did not disappoint. We stayed in a Family room good for 4 pax and it was BIG. Bathroom was so-so but clean. No bidet, but water pressure was good. They provide slippers and toiletries, but the towels were OLD. Breakfast buffet was free, but if your brekky is not included, fret not. We ordered ala carte Continental Breakfast and was surprised by the quantity. It can feed 2 hungry people with 3 hash browns, fruit platter, bread basket, 4 slices of bacon, omelette-scrambled egg, coffee or tea, and fresh fruit juice for Php350. They have this weird policy though: We bought 2 big boxes of Kuilan's siopao (50 pcs) and the guard became hesitant to le us in because of guests are allowed knly a certain number of outside food in the room. Do I look like I was going to eat 50 pcs in 1 sitting??? It's to bring back home, duh! Oh, the elevator was a plus but it was hot inside, no a/c"
	},
	{
		"User": "ngee",
		"Review": "nothing much to do in around. but feel very safe."
	},
	{
		"User": "ngee",
		"Review": "value for money"
	},
	{
		"User": "Robert",
		"Review": "good value, very nice rooms, good location, breakfast OK"
	},
	{
		"User": "Charlene",
		"Review": "The location is favorable if you prefer to access the city. The hotel room rate is a bit pricey."
	},
	{
		"User": "Julito",
		"Review": "Love the place!"
	},
	{
		"User": "Veronica",
		"Review": "Na"
	},
	{
		"User": "Sherielyn",
		"Review": "Very accommodating staff, good location and clean room"
	},
	{
		"User": "Liwayway",
		"Review": "The jacuzzi was at first not in operation and the pool during our first day of stay. The next day we used it and it was cold even the jacuzzi. Pool was small. Breakfast buffet was ok and not bad. Had a few pinoy dishes, mami, cereals and some bread, omelette buffet. The cable had only a few channels and was different from the menu/list placed in the room. The standard room was big enough and spacious. The staff were friendly and accommodating. We had a small cat in a carrier and the staff allowed it to be placed outside the hotel since pets are not allowed. All in all, this hotel may be recommended. It's walking distance to a Gaisano mall and Penong's chicken. There's a piano bar at night in the hotel lobby."
	},
	{
		"User": "Curtis",
		"Review": "I like the Pinnacle Hotel. The location is not quite as convenient as some other hotels, but the staff is helpful and the facilities are fine. Good breakfast."
	},
	{
		"User": "DARWIN",
		"Review": "The Room Was Spacious For A Family And The Hotel Location Is Strategically Located Within The City Proper. Highly Recommended For Travellers."
	},
	{
		"User": "Patrick",
		"Review": "along Orchard but towards the end. 10min walk from the main area of orchard."
	},
	{
		"User": "Kristine",
		"Review": "Stayed here because of the location and the big beds. Room is big and beds are comfortable. Pool is nice. Buffet breakfast is delicious. My only complaint is the bathroom which is not so clean. Grout is dark with mildew. Corners are gross and looks so unclean. "
	},
	{
		"User": "Mary",
		"Review": "Thanks so much pinnacle! Early check in kmi ,galing s flght frm manila. Pag dating sa hotel inasikaso agad kmi ng mga staff.Pagdating sa room namin wow ang ganda at ang linis. Next vcation n namin s davao babalikan namin to. "
	},
	{
		"User": "Joana",
		"Review": "The only problem were the ants on the lamp desk. They're all over the table. But the sheets are clean (and they smell so good too)."
	},
	{
		"User": "jesus",
		"Review": "It's Budget friendly for a night or two."
	},
	{
		"User": "Michael",
		"Review": "The hotel is located near Gaisano Mall, Penong's Restaurant and close to a Church. Buffet breakfast is good with different choices. Room is spacious even for a family with 3 kids. There is also Avis transport services in the vicinity of the hotel where you can book, hire and drive a vehicle going around the city."
	},
	{
		"User": "Nelpa",
		"Review": "I've been to many hotels in Davao for business and vacation and I am very happy to finally find a hotel that I really love. It is within my budget range, the food is very good, staff very friendly and near Aldevinco. "
	},
	{
		"User": "John",
		"Review": "Staff were not helpful at all at the counter upon check in. It took 48 years for the water we asked, we ate dinner in the room without water."
	},
	{
		"User": "Christian",
		"Review": "Hotel was good and clean, accomodating staff "
	},
	{
		"User": "Alwin",
		"Review": "Big rooms. Good for 4 persons. Central location, near gaisano mall and walking distance from aldevinco shopping center"
	},
	{
		"User": "Sulaiman",
		"Review": "Wifi is good. A little old looking building but the best with an average price."
	},
	{
		"User": "Julito",
		"Review": "When in Davao City, we always use this hotel whenever we have activities in the city center. The location is nice!"
	},
	{
		"User": "ace",
		"Review": "good location for my meetings. please add staff at the frontdesk when it is peak hours takes longer than the usual for check in and check out"
	},
	{
		"User": "ace",
		"Review": "good location. nice staff, just lacking in numbers... it takes longer than the usual to check in and check out...add more staff in the front desk. "
	},
	{
		"User": "MYRNA",
		"Review": "Clean and very accommodating staff. Location is good "
	},
	{
		"User": "Ma.",
		"Review": "As expected"
	},
	{
		"User": "Abdul",
		"Review": "the hotel is in shopping area and accessible to all i made reservation on it if i am in davao"
	},
	{
		"User": "Rowell",
		"Review": "Definitely a great place to stay both for business and vacation. Near to malls, restaurants, and other tourist spots in Davao city. Buffet is good but could be better by offering more selections and I am hoping that they will serve Davao's delicacies. As for the rooms, it was clean and bed is comfy. Very easy to check in and check out. One area to improve is their wifi. I will definitely come back and stay when I go to Davao! "
	},
	{
		"User": "Sing",
		"Review": "Didn't like the roaches in the bathroom but they did change the room for me instantly "
	},
	{
		"User": "Maritess",
		"Review": "Our stay was fabulous. We like the free breakfast. Clean hotel, friendly staffs the hotel have. Thank you. "
	},
	{
		"User": "jesus",
		"Review": "Its an okay hotel."
	},
	{
		"User": "Gerlie",
		"Review": "Very clean, big rooms affordable for family. "
	},
	{
		"User": "JAYCONRAD",
		"Review": "thanks"
	},
	{
		"User": "ROsalina",
		"Review": "Ok"
	},
	{
		"User": "Donn",
		"Review": "Prons: with in the city. Clean. Cons: None"
	},
	{
		"User": "youngmin",
		"Review": "nope"
	},
	{
		"User": "wesley",
		"Review": "It's my first time in Davao and i was looking for a place to stay which is near the city and a lot of attractions. Luckily my friend told me about Pinnacle Hotel. My whole stay in the Hotel was good and comfortable. I would definitely go back and recommend this place to my friends. Thank you! "
	},
	{
		"User": "Bernadette",
		"Review": "Okay except for clogged sink on the bathroom we're assigned to, however entire stay is ok"
	},
	{
		"User": "eliezer",
		"Review": "Convinient since it is near the city. Near g-mall."
	},
	{
		"User": "eliezer",
		"Review": "Hotel is in good condition, room is big, breakfast is good also. Location is near city center. Over all good hotel."
	},
	{
		"User": "VAN",
		"Review": "Strategically located to nearest malls, spas and local tourist spots"
	},
	{
		"User": "Carmencita",
		"Review": "The Pinnacle Hotel is more of a shopping mall than a hotel because they make you pay again for services/facilities which you should have already paid. You have to pay/deposit for an additional key because they will only give you one key for two guests. They will make you pay for dirty towels so please be careful when you take a bath and see to it that the towels will have no colors on them or else you have to pay P800.00 for a soiled towel. You also have to ask housekeeping for complimentary toothbrush, toilet paper, etc.since they do not provide them completely when you check in. So why stay at Pinnacle Hotel better stay in a mall and pay brand new items rather than used items!!!! "
	},
	{
		"User": "Zahed",
		"Review": "Usual hotel for my wife and I very nice"
	},
	{
		"User": "Uzzielyn",
		"Review": "just surprised why breakfast is not included. but the place is nice and cozy. one awful experience though with their receptionists. hope they will train them what a good customer service means"
	},
	{
		"User": "Harendran",
		"Review": "Nice Hotel with friendly staff"
	},
	{
		"User": "ruskin",
		"Review": "Get this: if you want a second room key (which is a card), you need to put down a 200 peso deposit, in case you don't return the second card. But they issue a white paper receipt, which you ALSO need to return to claim your 200 peso deposit. Give me a break!!!! So, if you return the key, which is what the deposit is for, but lose the receipt, which is worthless, you lose your deposit. This is wrong on so many levels. First of all, the keys are essentially disposable and no American hotel would ever charge you a deposit for a second key, they'd just give you as many keys as you need, and if you lose one, so what? Plus, to have a system so the receipt is required to claim your stupid deposit on a valueless key, is obviously set up to double their chances of keeping the deposit. In other words, it's an unethical money grab. I suggest everybody who stays there refuse to pay the deposit and demand to speak to the manager to voice their complaints. "
	},
	{
		"User": "Marcus",
		"Review": "Old and rundown, needs a make over, comfortable bed, good bathroom, clean towels, but overpriced for what you get. No breakfast included, food average.staff ok, pool was a big letdown. And gym was a pile of old rusty machines that don't work...a joke"
	},
	{
		"User": "archie",
		"Review": "See you next year pinnacle"
	},
	{
		"User": "CHEE",
		"Review": "Next to the hotel there is a restaurant selling chicken bbq was very delicious "
	},
	{
		"User": "Arvin",
		"Review": "Everything was fine about this hotel but you need to dress like an honorable person to be noticed by their staff. We were in line waiting to be called to check in but they called the guy who came after us because that guy is wearing a barong dress unlike us who only wears jeans and shirts."
	},
	{
		"User": "Ariane",
		"Review": "Close to shopping malls. Very good buffet breakfast."
	},
	{
		"User": "Inocencia",
		"Review": "Continue your excellent service"
	},
	{
		"User": "edsel",
		"Review": "Improve lighting for business paper works. Provide bidet at the cr. Recheck hot and cold shower condition "
	},
	{
		"User": "ruskin",
		"Review": "There's bugs. Ugh. A cockroach in the hall, and bug in the bathroom. I'd not have said this again, my second time, but Agoda keeps asking me to review the hotel. It's not gonna get better Agoda, better let put this repeated review requests to bed. "
	},
	{
		"User": "Vanessa",
		"Review": "Hotel rooms and facilities was disappointing. Our room smells ancient, dirty and stained bed sheets and covers. No hotel slippers, the mini fridge was ancient looking, baby cockroaches were visible, foul bathroom smell. Hotel attendant was not that accommodating except the hotel security. even though this hotel was ideal, an easy access to most places. We/I wont be back to this pinnacle anymore. "
	},
	{
		"User": "ruskin",
		"Review": "I saw two bugs like snakes in the corner of the shower stall. And there was a hair on the top sheets of the bed, not mine. A big cockroach was in the hall, which I stepped on and felt it crunch under my shoe. Ugh. Last time I'll be staying there. My fiancé reminded me there was lots of hair in the comfort room, they didn't clean it well. I can go on and on. My fiancé says the housekeeping should be improved. I've been there many times before, but not any more. "
	},
	{
		"User": "Imelda",
		"Review": "We're satisfied everytime we stayed in this hotel until last June 18 , 2016, we arrived in the hotel past 10PM & left for Samal 5AM of June 19. One hour before we left we booked again for another night through Agoda. According to the staff in the front desk he will endorse but when we come back past 6PM June 19 they gave us another room because somebody already occupying our room & we're informed that our used dresses left in a bag were with the housekeeping staff. We're not happy about it. Hope it will not happen again & proper endorsement will be done among the staff especially those in the front desk. Otherwise, the hotel is very good. Thank you, more power & God bless."
	},
	{
		"User": "Ian",
		"Review": "I was booked in a superior room... When I enter the room, i smell something not good. The CR was not that amazing which is the most important part of the room for me. The front office is not that attentive to their guest. One thing that i was disappoint is that you can't bring alcoholic drink in the hotel that was brought outside. On the other hand, the location is very accessible. The pool is relaxing and the housekeeping staff is friendly and approachable. "
	},
	{
		"User": "Roberto",
		"Review": "Only the location and food are good. The rest are satisfactory."
	},
	{
		"User": "Rosemarie",
		"Review": "It exceeded my expectations! We had a big room with a king sized bed. It is well maintained, although the sofa in the room needs reupholstering . Food was great. You'll be getting more than the price you pay. Will surely come back."
	},
	{
		"User": "Stephanie",
		"Review": "Excellent Service and Convenient Location. "
	},
	{
		"User": "Stephanie",
		"Review": "Excellent Service and Convenient Location. "
	},
	{
		"User": "Ann",
		"Review": "Stayed at the superior room type and the wifi was weak! Walking distance to the shopping mall. "
	},
	{
		"User": "Reneil",
		"Review": "Staff are not courteous. I remember i was standing at the front desk & no one even bother to ask me if what I am there for even I was already calling them still ignoring me. One staff I remember standing at the entrance holding his cellphone texting during work which did not even open the doors for us. You need to be attentive on customer needs since you are in the business of service & hospitality."
	},
	{
		"User": "Neil",
		"Review": "nice"
	},
	{
		"User": "Wilhelm",
		"Review": "It's a hotel that needs renovation. It's located nicely at the heart of the city. The lift and corridor, the room smells misty. It's a value for money hotel"
	},
	{
		"User": "Mauro",
		"Review": "Dirty Small"
	},
	{
		"User": "jinxuan",
		"Review": "Good breakfast! "
	},
	{
		"User": "Gigs",
		"Review": "We were a family of big people and I was originally worried that the room would be tight but was pleasantly surprised it wasn't. Breakfast was good as well. "
	},
	{
		"User": "Kathryn",
		"Review": "They need improvement in cleaning their bathroom specially in the shower area. black spots in the floor to wall sides and glass door and wall is very visible. "
	},
	{
		"User": "Roalia",
		"Review": ":C"
	},
	{
		"User": "DANIEL",
		"Review": "No negatives so far."
	},
	{
		"User": "Kim",
		"Review": "value for money "
	},
	{
		"User": "gerhard",
		"Review": "the Hotel Looks from the Outside very \"international\" and good. the Rooms have the Charme of 1970's. all in dark Brown and old. ok, the Rooms Are big and Not Bad. some Small Animals always Walking over the bed...there Is no Safe in the Room and the aircon has no Remote ... But it's just ok. Restaurant downstairs. Personal helpful "
	},
	{
		"User": "Christopher",
		"Review": "I stayed once in deluxe room very nice..the second time in excitve suit very nice one of the best I've seen..look forward to go back"
	},
	{
		"User": "Gipeom",
		"Review": "Nice and cheap"
	},
	{
		"User": "Jenz",
		"Review": "clean big ang spacious room"
	},
	{
		"User": "SAURAV",
		"Review": "Totally disappointed and never again going to book ever, lots and lots of sneaky charges . Staffs are not so friendly , overall it's 3/10"
	},
	{
		"User": "Rojard",
		"Review": "Very happy guest"
	},
	{
		"User": "Lilibeth",
		"Review": "Customer service is very good. "
	},
	{
		"User": "Jaclyn",
		"Review": "Accessible to all \"Must-sees\""
	},
	{
		"User": "JAYCONRAD",
		"Review": "large rooms and cold airconditioning. very accommodating staff "
	},
	{
		"User": "dennis",
		"Review": "one of the better hotels I have stayed at in the Philippines..the staff are very friendly and can't do enough to help..I rate this hotel very highly "
	},
	{
		"User": "kevin",
		"Review": "Hotel was nice , nothing special "
	},
	{
		"User": "Keem",
		"Review": "Slow response and less polite on catering customers."
	},
	{
		"User": "Maria",
		"Review": "Our stay in Davao was very nice. The staff also was very, very nice. Congratulations!!!"
	},
	{
		"User": "reviemelyn",
		"Review": "Pinnacle is an old hotel with an old hotel policy im having difficulties on checking in arrived tired and exhausted 8pm alrealdy when i check in they ask me for a hotel voucher from agoda they need a printed copy of it i have to look for an internet cafe since they wont accept emails what kind of hotel soo inconveniet for me its already late at night and i dont know the place i ask them i will just email only i showed to them my confirmation letter from agoda by my email still insisted that i need to print it dont like to book in this hotel again soo much hassle"
	},
	{
		"User": "Marc",
		"Review": "Value for money. Nice hotel near to malls and restaurants. Excellent overall."
	},
	{
		"User": "mark",
		"Review": "good value for money, nice breakfast"
	},
	{
		"User": "Elmar",
		"Review": "Staff war very friendly, rooms clean and nice"
	},
	{
		"User": "Matthias",
		"Review": "PROS: Good Location, good Room & Bed, With Pool, Breakfast So-So, Free Wifi even at rooms (slow, but will do, Good staff. CONS: Bathroom needs more lightning and better drain down the water from shower"
	},
	{
		"User": "Angelique",
		"Review": "The room is very spacious and the room is clean. The location is also good. However the staff/s assigned in the reception area namely Jessa and the other staff has poor customer service. They are not friendly, polite nor cheerful. They don't know how to acknowledge your presence, I would be the one who will greet them first instead of them greeting me first and they wouldn't even smile. And when you talk to them they don't know how to politely answer your question or request. The housekeepers are more polite compared to the receptionist. Housekeepers would greet you with a smile and will make you feel at home. It seems like their receptionist are not properly trained. All in all my experience was great except for the service at the reception(check-in/check-out). I do hope that they will be trained as a business woman I always keep this in mind \"Courteous treatment and excellent customer service will make a customer a walking advertisement\"."
	},
	{
		"User": "Vicente",
		"Review": "big rooms, comfortable stay "
	},
	{
		"User": "Marian",
		"Review": "PROS: Good Location, Big Room & Beds, With Pool, Breakfast So-So, Ample Parking Space, Free Wifi even at rooms (slow, but will do, atleast no need to stay in the lobby just to use wifi), Good staff. CONS: No bidet, Bathroom needs more lightning, Bed is not that soft or hotel quality. Overall, satisfied with my stay and will highly recommend Pinnacle to anyone going to Davao for business or leisure."
	},
	{
		"User": "Jazzie",
		"Review": "\r location, price, spacious room"
	},
	{
		"User": "Rodrina",
		"Review": "We were there 11am and the room was only available at 5PM. The following day, the buffet breakfast ran out at 7am and took a long time to refill. They were understaffed in the restaurant. Our company sponsored an event there and when the organizer asked for the snacks to be distributed to thw various sponsor tables. The waiter did not follow the instructions even he was told several times by the organizer of the event. The waiter dumped all the snacks in our table and the organizer staff was the one who distributed the food to the other sponsor tables. The waiter was really rude also and has this arrogance."
	},
	{
		"User": "Jeff",
		"Review": "\r Location Value Food"
	},
	{
		"User": "Jeff",
		"Review": "\r location value food"
	},
	{
		"User": "Francis",
		"Review": "\r location, staff, food"
	},
	{
		"User": "MA.",
		"Review": "\r Average room size & good location"
	},
	{
		"User": "Kamil",
		"Review": "easy access, comfortable stay within city centre."
	},
	{
		"User": "DAVID",
		"Review": "nice place"
	},
	{
		"User": "Susan",
		"Review": "Will stay at this hotel again on my next visit"
	},
	{
		"User": "Josephine",
		"Review": "\r Location is perfect accessible to all; clean & cozy; "
	},
	{
		"User": "Shirlene",
		"Review": "\r Location,price and staff"
	},
	{
		"User": "Felipe",
		"Review": "We had a comfortable overnight stay in Pinnacle. The room was spacious and had the things that we needed. The staff were competent and courteous. I have no complaints."
	},
	{
		"User": "leona",
		"Review": "Stayed for 11 nights. Rooms were cleaned, however the last 4 days.. Stay over room was not cleaned properly. Pillow cases were replaced with blood stains, floor not swept or mop property. Soap scums on bathroom tiles and glass doors. Blood stains on newly changed pillow cases. Additional light would be nice in the bathroom... (It's not bright enough) . During some nights, it was loud and noisy outside the hallways.. Maybe, occasional security walks on guest floors during the night. Upon check out, we requested for assistance with luggage. Waited for more than 30 minutes for bell staff to come up. We decided to bring our luggage down instead. Our room was prepaid. But, we were asked to wait for them to check the room before we can leave the hotel. Then, I guess someone went up to the room and checked it..then came down after 15 minutes and said.. \"Your ### room?, yah, your good!\" This is the first time that we ever encounter having "
	},
	{
		"User": "Kenneth",
		"Review": "The staff are very kind, helpful & friendly. Kudos!! :) The place is quiet and accessible. It was a pleasant stay and I'll definitely come back."
	},
	{
		"User": "Eliza",
		"Review": "\r Location, cleanliness"
	},
	{
		"User": "Generose",
		"Review": "Room we got was very dark, there was not enough light coming from the only windowwe have (room situated near fire escape and window facing stairs). I think, yeah we`re just staying for the night and mostly we were out so we just requested additional lamp just to make our room brighter. The \"FRINEDLY\" staffs promised to give us one but come check-out time there was none provided. We really even tried to request to transfer room after 5 minutes of checking in but the receptionist didnt do anything. Even when we requested for extra shampoo and toothpaste the houee cleaning staffs didnt provide."
	},
	{
		"User": "james",
		"Review": "Great Hotel"
	},
	{
		"User": "Raul",
		"Review": "\r location"
	},
	{
		"User": "Charisse",
		"Review": "\r great location, spacious room, price is reasonable"
	},
	{
		"User": "LI",
		"Review": "It's pity I slept in pass the breakfast time, the hotel had good location (just in Chinatown) also near the Gmall! General speaking the hotel over the price "
	},
	{
		"User": "Art",
		"Review": "\r Staff, Food, Location"
	},
	{
		"User": "Antonio",
		"Review": "\r Great staff, nice location, clean room"
	},
	{
		"User": "Christopher",
		"Review": "\r location, staff, room size"
	},
	{
		"User": "Christopher",
		"Review": "\r location, staff, room size"
	},
	{
		"User": "Miai",
		"Review": "Clean and good location"
	},
	{
		"User": "Nerius",
		"Review": "\r location, dining"
	},
	{
		"User": "Sunshine",
		"Review": "\r Ok"
	},
	{
		"User": "Sunshine",
		"Review": "\r Food proximity to places staffs"
	},
	{
		"User": "Rodrigo",
		"Review": "Breakfast can still be improved. "
	},
	{
		"User": "Aimee",
		"Review": "\r comfort, affordable, approachable staff"
	},
	{
		"User": "Eric",
		"Review": "You get what you pay for"
	},
	{
		"User": "MYRNA",
		"Review": "\r Clean good staff and big room"
	},
	{
		"User": "Ralph",
		"Review": "\r Location, staff, room"
	},
	{
		"User": "Reinel",
		"Review": "\r First the Location, second is the view from our 10th floor room, third is the pool and jacuzzi which we swim and relax all by ourselves."
	},
	{
		"User": "Richard",
		"Review": "\r location, pool area, net"
	},
	{
		"User": "Brian",
		"Review": "\r 1. Location 2. Room Size 3. Polite staff"
	},
	{
		"User": "Noel",
		"Review": "\r location, location, location"
	},
	{
		"User": "Hanalynn",
		"Review": "\r price,location and interior"
	},
	{
		"User": "Cyrene",
		"Review": "\r Location Room Comfort"
	},
	{
		"User": "april",
		"Review": "\r Their food is okay, their location is great and the price is okay."
	},
	{
		"User": "David",
		"Review": "\r Location , price and safety "
	},
	{
		"User": "Christopher",
		"Review": "\r location, staff, room size"
	},
	{
		"User": "John",
		"Review": "\r Excellent location. Taxi is easy. Very accessible to Gmall."
	},
	{
		"User": "Justine",
		"Review": "\r Proximity. Service. Staff"
	},
	{
		"User": "Lester",
		"Review": "\r location, staff, food"
	},
	{
		"User": "Epher",
		"Review": "\r 3 best things about this hotel: 1. Excellent location 2. Relaxing Jacuzzi 3. Beautiful Lounge area"
	},
	{
		"User": "Jeorge",
		"Review": "\r accomodation, location and comfort."
	},
	{
		"User": "Arvin",
		"Review": "\r Not much"
	},
	{
		"User": "Wendy",
		"Review": "\r It's in the Central and there are many landmarks that are quite near the hotel; it is also accessible to jeepneys going to other landmarks. "
	},
	{
		"User": "lhiz",
		"Review": "\r cheap,near malls,"
	},
	{
		"User": "dahlia",
		"Review": "\r very comfortable, nice staff, great place"
	},
	{
		"User": "Julieta",
		"Review": "\r Location, location, location"
	},
	{
		"User": "Eddie",
		"Review": "\r The hotel is well located, pretty close to all the actions. The staffs are friendly and do their job well."
	},
	{
		"User": "Sara",
		"Review": "\r Clean, and staff was friendly"
	},
	{
		"User": "Eisa",
		"Review": "\r location , mall in front and restaurants"
	},
	{
		"User": "PAT",
		"Review": "\r Room Space, Pool, Jacuzzi & Value for money. It was a memorable stay at the hotel. Our kids really enjoyed the pool. We are Definitely coming back."
	},
	{
		"User": "Sunshine",
		"Review": "\r Food , breakfast, staffs"
	},
	{
		"User": "June",
		"Review": "\r Location, security, dining"
	},
	{
		"User": "Ian",
		"Review": "\r food, staff and location"
	},
	{
		"User": "Gregory",
		"Review": "\r Location, rooms, staff"
	},
	{
		"User": "MYRNA",
		"Review": "\r Clean, nice staff and close to shopping malls"
	},
	{
		"User": "MYRNA",
		"Review": "\r Clean, big and breakfast is good"
	},
	{
		"User": "Azalea",
		"Review": "\r First are foods. Very sumptuous and really satisfies my appetite. Second is the room itself. I love the cleanliness of their toilet and bath and the large bed as well. And lastly their location."
	},
	{
		"User": "imarzen",
		"Review": "\r cleanliness. food. staff."
	},
	{
		"User": "Clyde",
		"Review": "\r Location, security and near the mall "
	},
	{
		"User": "Detlef",
		"Review": "\r service, great staff, breakfast, waiters all okay!"
	},
	{
		"User": "Kathryn",
		"Review": "\r Clean room "
	},
	{
		"User": "Marjorie",
		"Review": "\r Location, wifi, big beds"
	},
	{
		"User": "Tom",
		"Review": "Poor breakfast service and reception counter need improvement. Staff not focused in their work. "
	},
	{
		"User": "Mayette",
		"Review": "\r Location, room and room rates/price"
	},
	{
		"User": "ALDRIDGE",
		"Review": "\r Location is in the center of downtown , Bfast is included , a lot of nearby Restaurants"
	},
	{
		"User": "Ofelia",
		"Review": "\r great breakfast, large rooms "
	},
	{
		"User": "Marjorie",
		"Review": "\r Good location, huge beds, friendly staff"
	},
	{
		"User": "Vicente",
		"Review": "\r location, value for money, comfortable beds"
	},
	{
		"User": "Grace",
		"Review": "\r Location, spacious rooms"
	},
	{
		"User": "Chrisvian",
		"Review": "\r Location."
	},
	{
		"User": "Kurt",
		"Review": "\r Room was clean"
	},
	{
		"User": "seyed",
		"Review": "\r Freindly staff,good location,quick services"
	},
	{
		"User": "MYRNA",
		"Review": "\r Clean, nice room and staff."
	},
	{
		"User": "Luriel",
		"Review": "\r Good loc, aircon not so cold"
	},
	{
		"User": "Chris",
		"Review": "\r Safety, convenience, comfort"
	},
	{
		"User": "Timothy",
		"Review": "\r Standard , price , amenities."
	},
	{
		"User": "Flordeliza",
		"Review": "\r Accommodating staff, spacious rooms, value for money"
	},
	{
		"User": "Flordeliza",
		"Review": "\r Accommodating staff, value for money, spacious rooms"
	},
	{
		"User": "Lanelyn",
		"Review": "\r good location, clean, friedly staff"
	},
	{
		"User": "nerissa",
		"Review": "\r 1. location 2. price 3. nice room"
	},
	{
		"User": "Benedict",
		"Review": "\r Staff, location, room"
	},
	{
		"User": "Hans",
		"Review": "\r Located in downtown Davao, spacious parking area and cheap price."
	},
	{
		"User": "ALDRINA",
		"Review": "\r Room was big and spacious; cleaning staff, bellhops and security guards were helpful and accommodating; good location"
	},
	{
		"User": "Terry",
		"Review": "\r Breakfast, staff was nice, blackout curtains."
	},
	{
		"User": "Vicente",
		"Review": "\r location, value for money, spacious room"
	},
	{
		"User": "jean",
		"Review": "\r Size of rooms cleanliness a nd location"
	},
	{
		"User": "Kristine",
		"Review": "\r Location, price, big room"
	},
	{
		"User": "Melissa",
		"Review": "\r Superb location, helpful staff, and comfortable rooms :) Value for money!"
	},
	{
		"User": "Mohammad",
		"Review": "\r The location, location location"
	},
	{
		"User": "Timothy",
		"Review": "\r Price , standard and location."
	},
	{
		"User": "Von",
		"Review": "\r Clean, staff are friendly and near malls"
	},
	{
		"User": "Willie",
		"Review": "\r Location, food and service "
	},
	{
		"User": "Ken",
		"Review": "\r good location"
	},
	{
		"User": "John",
		"Review": "\r I like the way the rooms are kept clean. The staff, particularly the guards are very accommodating."
	},
	{
		"User": "Lolita",
		"Review": "\r I like the room, food and they have good staff!!"
	},
	{
		"User": "Arel",
		"Review": "\r Good Location, Friendly Staffs, easy to get taxi"
	},
	{
		"User": "Jessica",
		"Review": "\r Room staff and the location"
	},
	{
		"User": "Mohammad",
		"Review": "\r Location "
	},
	{
		"User": "Claudine",
		"Review": "\r Location"
	},
	{
		"User": "Danielle",
		"Review": "\r location, big beds, clean room"
	},
	{
		"User": "Rencel",
		"Review": "\r Room, Location, Food"
	},
	{
		"User": "Von",
		"Review": "\r Clean, Comfort and Nice view "
	},
	{
		"User": "Kathleen",
		"Review": "\r Clean, friendly staff, affordable"
	},
	{
		"User": "Kristine",
		"Review": "\r Location, big bed, spacious room"
	},
	{
		"User": "Richard",
		"Review": "\r Staff, Location clean"
	},
	{
		"User": "john",
		"Review": "\r Position,location,location."
	},
	{
		"User": "DIOMEDES",
		"Review": "\r Hospitality, Clean room, location"
	},
	{
		"User": "Fang",
		"Review": "\r location"
	},
	{
		"User": "Marco",
		"Review": "\r indoor mini pool, location, and the food was great"
	},
	{
		"User": "Armando",
		"Review": "\r clean, location is good and spacious rooms"
	},
	{
		"User": "Rencel",
		"Review": "\r Room, Location, Budget"
	},
	{
		"User": "Rencel",
		"Review": "\r Room, Budget, Loation"
	},
	{
		"User": "Marie",
		"Review": "\r Location, location, location ☺"
	},
	{
		"User": "Victor",
		"Review": "\r Nice space and relaxing"
	},
	{
		"User": "Maria",
		"Review": "\r Good location and nice and accomodating staff"
	},
	{
		"User": "Gordon",
		"Review": "\r The Staff, The Location and the presentation"
	},
	{
		"User": "Graciano",
		"Review": "\r Comfortable, accessible, pleasing staff"
	},
	{
		"User": "mervyn",
		"Review": "\r location - cleanliness - helpfull staff"
	},
	{
		"User": "Jack",
		"Review": "\r The room is above average, very clean & complete"
	},
	{
		"User": "EVELYN",
		"Review": "\r Location, acceptable Room comfort"
	},
	{
		"User": "Marjorie",
		"Review": "\r Convenient location to my destinaltion, clean but smells old, reception area smells better"
	},
	{
		"User": "Jerome",
		"Review": "\r location;shopping;food"
	},
	{
		"User": "simon",
		"Review": "\r We ate in the hotel alot which,good food, good staff room service, very relaxing"
	},
	{
		"User": "Maria",
		"Review": "\r Cozy bed, good location and good food"
	},
	{
		"User": "Melani",
		"Review": "\r Room, security "
	},
	{
		"User": "Francis",
		"Review": "\r Staff are friendly, rooms ok, good location."
	},
	{
		"User": "Norhamin",
		"Review": "\r Food, Big Room & Friendly Staff"
	},
	{
		"User": "Zahed",
		"Review": "\r staff, food, lobby"
	},
	{
		"User": "Zahed",
		"Review": "\r staff, food, lobby"
	},
	{
		"User": "Virginia",
		"Review": "\r Food is good, room is comfortable and clean "
	},
	{
		"User": "Daniel",
		"Review": "\r staff,location and room comfort"
	},
	{
		"User": "JOHN",
		"Review": "\r Clean, nice location, good staff"
	},
	{
		"User": "Cyrene",
		"Review": "\r location"
	},
	{
		"User": "Philip",
		"Review": "\r Location, price and comfort"
	},
	{
		"User": "Irene",
		"Review": "\r location, value for money, convenient"
	},
	{
		"User": "ALpha",
		"Review": "\r food, value for money, friendly staff"
	},
	{
		"User": "Rencel",
		"Review": "\r Rooms,Location,Budget"
	},
	{
		"User": "Rencel",
		"Review": "\r Rooms, Location, Food"
	},
	{
		"User": "Rencel",
		"Review": "\r Rooms, Location, Budget"
	},
	{
		"User": "Jeni",
		"Review": "\r Very friendly staff, comfortable rooms and well-maintained"
	},
	{
		"User": "Ma.",
		"Review": "\r Location, staff and hospitality"
	},
	{
		"User": "Aurora",
		"Review": "\r Location price food"
	},
	{
		"User": "Ben",
		"Review": "\r Location"
	},
	{
		"User": "STEVEN",
		"Review": "\r customer service,cleanliness,location"
	},
	{
		"User": "Maria",
		"Review": "\r location, staff, room size"
	},
	{
		"User": "Rachel",
		"Review": "\r facilities, location and value for money.."
	},
	{
		"User": "Eliezer",
		"Review": "\r clean, comfortable and good location"
	},
	{
		"User": "ALAIN",
		"Review": "\r Comfort, cleanliness, stafff courteouness "
	},
	{
		"User": "ALAIN",
		"Review": "\r swiming pool ...good food"
	},
	{
		"User": "ALAIN",
		"Review": "\r good staff..clean room"
	},
	{
		"User": "ALAIN",
		"Review": "\r good food....nice swimming pool ....close to mall"
	},
	{
		"User": "ALAIN",
		"Review": "\r big room,,,,cleanliness...."
	},
	{
		"User": "Girlen",
		"Review": "\r Location, staff and food"
	},
	{
		"User": "Alaine",
		"Review": "\r location and staff"
	},
	{
		"User": "Erica",
		"Review": "\r budget friendly"
	},
	{
		"User": "alex",
		"Review": "\r Cleanliness, Staffs professionalism, Room space."
	},
	{
		"User": "Katrina",
		"Review": "\r just the location"
	},
	{
		"User": "Alan",
		"Review": "\r Staff attentive, close to Gaisano Mall, clean."
	},
	{
		"User": "ZENAIDA",
		"Review": "\r 1) Hotel staff are polite, helpful and accommodating. (2) Good location"
	},
	{
		"User": "Russell",
		"Review": "\r location, food and polite staff"
	},
	{
		"User": "Yvonna",
		"Review": "\r Space, room and beds, staffs"
	},
	{
		"User": "Merrynol",
		"Review": "\r staff is so accommodation, value for money, location"
	},
	{
		"User": "Nerlyn",
		"Review": "\r customer service, food and location"
	},
	{
		"User": "Stella",
		"Review": "\r staff"
	},
	{
		"User": "Nerlyn",
		"Review": "\r Location, customer service and food"
	},
	{
		"User": "Larisa",
		"Review": "\r Location. Comfortable rooms. "
	},
	{
		"User": "Larisa",
		"Review": "\r Location. Value for money. Comfort"
	},
	{
		"User": "Larisa",
		"Review": "\r Location. Value for money. Comfortable. "
	},
	{
		"User": "Gloria",
		"Review": "\r Quite, cozy and location! The hotel is convenient if you are on business trip. Our room is comfortable for 2 people and its quite guarantees a good night sleep."
	},
	{
		"User": "Rhea",
		"Review": "\r location, clean, ok service"
	},
	{
		"User": "Anthony",
		"Review": "\r Room size, breakfast selection, staff"
	},
	{
		"User": "Darren",
		"Review": "\r cost, location"
	},
	{
		"User": "Jimmy",
		"Review": "miserable"
	},
	{
		"User": "Jimmy",
		"Review": "\r Food , Cleanliness & Accessublility"
	},
	{
		"User": "Larisa",
		"Review": "\r Comfortable room, food, city center"
	},
	{
		"User": "Anthony",
		"Review": "\r Friendly staff,cleanliness, and good food."
	},
	{
		"User": "Brent",
		"Review": "\r The value, service and cleanliness were the best features of the hotel. I'd stay here again."
	},
	{
		"User": "Arthuro",
		"Review": "\r Location"
	},
	{
		"User": "Franze",
		"Review": "\r Easy check in"
	},
	{
		"User": "ace",
		"Review": "\r location, rooms, accessibility"
	},
	{
		"User": "Ma.",
		"Review": "\r Good location, efficient and courteous staff, clean and comfortable room"
	},
	{
		"User": "Choon",
		"Review": "\r Convenient, Big Room, Biz Support"
	},
	{
		"User": "rey",
		"Review": "\r Reasonably priced meals, good location, courteous staff"
	},
	{
		"User": "rey",
		"Review": "\r Meals reasonably priced, good location, courteous staff"
	},
	{
		"User": "Erlyn",
		"Review": "\r 1) Customer Service 2) Food & Location 3) Value of Money"
	},
	{
		"User": "Ismael",
		"Review": "\r lobby ambiance is pretty cool & the staff are all very courteous at all times. "
	},
	{
		"User": "Evelyn",
		"Review": "\r Value for money, Location, Comfortable rooms"
	},
	{
		"User": "DANIEL",
		"Review": "\r Location, good food and value for money"
	},
	{
		"User": "Vida",
		"Review": "\r The location , it's close to everything in the city. Malls, airport, business district , hospital. It's very affordable . Friendly environment and staffs are professional. "
	},
	{
		"User": "Lisa",
		"Review": "\r Nice Room Comfort, Very Pleasant Front Desk Service"
	},
	{
		"User": "KARNIK",
		"Review": "\r Hotel located right on the center of the Downtown Davao and easy to moving around anywhere you like to go."
	},
	{
		"User": "Welhilmina",
		"Review": "\r Excellent customer service - great location - cleanliness ! "
	},
	{
		"User": "sung",
		"Review": "\r Price, location, staff kindness"
	},
	{
		"User": "John",
		"Review": "\r Cleanliness, Location, Friendly Staff"
	},
	{
		"User": "Sheila",
		"Review": "\r accessibility, cleanliness and affordability"
	},
	{
		"User": "Kent",
		"Review": "\r The rooms we stayed at are clean and decent. Basic bathroom needs were provided. Bigger and fluffier pillows though would be great! Buffet breakfast was okay. Location is close to everything."
	},
	{
		"User": "Rey",
		"Review": "\r location, location, location"
	},
	{
		"User": "Thomas",
		"Review": "\r staff, food, location"
	},
	{
		"User": "Eliezer",
		"Review": "\r good one and value for money."
	},
	{
		"User": "Fletcher",
		"Review": "\r Value for money, great location, staff"
	},
	{
		"User": "ANGELICA",
		"Review": "\r location, price, food"
	},
	{
		"User": "William",
		"Review": "\r good location. lots of foos"
	},
	{
		"User": "ghassan",
		"Review": "\r Location, staff, value"
	},
	{
		"User": "Jill",
		"Review": "\r nice accomodating staff, good location, clean room"
	},
	{
		"User": "Stanley",
		"Review": "\r service ,politeness, value for money "
	},
	{
		"User": "Justin",
		"Review": "\r location, bed is comfy. staff friendly."
	},
	{
		"User": "Paul",
		"Review": "\r Location, price and Reception area"
	},
	{
		"User": "Maria",
		"Review": "\r Buffet breakfast"
	},
	{
		"User": "jarra",
		"Review": "\r Big Room & Bed, Very Affordable and Good Location!"
	},
	{
		"User": "jarra",
		"Review": "\r Big Room, Good Location and Very Affordable..."
	},
	{
		"User": "shirley",
		"Review": "\r clean and nice and sffordable"
	},
	{
		"User": "Terence",
		"Review": "\r Close to shops freindly staff good service"
	},
	{
		"User": "AMANO",
		"Review": "\r Location new building good breakfast"
	},
	{
		"User": "Allan",
		"Review": "\r This hotel was clean and tidy, close to the areas I needed to go to and had a nice atmosphere over all I enjoyed my stay and will use again"
	},
	{
		"User": "Janina",
		"Review": "\r Staff. Location. Facilities."
	},
	{
		"User": "Jeanette",
		"Review": "\r value for money, clean but small room"
	},
	{
		"User": "Gary",
		"Review": "\r the good thing of this hotel is that it is located near malls and hospitals... breakfast are very common!"
	},
	{
		"User": "Lea",
		"Review": "\r Location in downtown"
	},
	{
		"User": "Dennis",
		"Review": "\r staff, location, price"
	},
	{
		"User": "Noljohn",
		"Review": "\r good location, comfortable and clean rooms and staff are kind"
	},
	{
		"User": "Clifford",
		"Review": "\r Location, clean and comfortable bed"
	},
	{
		"User": "Cindy",
		"Review": "\r value for money, helpful and very friendly staffs and great location"
	},
	{
		"User": "mark",
		"Review": "\r location, nice rooms, friendly staff"
	},
	{
		"User": "Rhenan",
		"Review": "\r location, value, rooms"
	},
	{
		"User": "Joseph",
		"Review": "\r convenience, clean, big beds"
	},
	{
		"User": "Chris",
		"Review": "\r Buffet Breakfast, Location, and roomsize."
	},
	{
		"User": "allison",
		"Review": "\r Location "
	},
	{
		"User": "Sharihana",
		"Review": "\r the bed is big & comfortable to stay"
	},
	{
		"User": "Raimund",
		"Review": "\r food - internet - "
	},
	{
		"User": "Davide",
		"Review": "\r frankly in front desk, staff available for any request, looks"
	},
	{
		"User": "Brett",
		"Review": "\r the location, kind security guards"
	},
	{
		"User": "Chantal",
		"Review": "\r Staff, Location, Accessibility"
	},
	{
		"User": "Chantal",
		"Review": "\r Location, affordability, Deals"
	},
	{
		"User": "Thomas",
		"Review": "\r Location,price,staff"
	},
	{
		"User": "Karen",
		"Review": "\r Spacious room, courteous staff with excellent service"
	},
	{
		"User": "Eliezer",
		"Review": "\r Good and highly interactive staff"
	},
	{
		"User": "Eliezer",
		"Review": "\r good food, good rest and comfort"
	},
	{
		"User": "Eliezer",
		"Review": "\r comfort, location and cleanliness"
	},
	{
		"User": "VAN",
		"Review": "\r price, food and good staff"
	},
	{
		"User": "Corne",
		"Review": "\r Friendly staff"
	},
	{
		"User": "MARIA",
		"Review": "\r Nice location, my kids enjoyed swimming, very good breakfast preparation."
	},
	{
		"User": "israelito",
		"Review": "\r pool, clean rooms."
	},
	{
		"User": "Aileen",
		"Review": "\r Location, clean and friendly staff"
	},
	{
		"User": "Charmaine",
		"Review": "\r hotel decors"
	},
	{
		"User": "irene",
		"Review": "\r Good ambiance, staff are accommodating, with good facilities, Me and my hubby willing to stay again on this hotel on our next visit to davao.. "
	},
	{
		"User": "Rowena",
		"Review": "\r Nice, clean and spacious room. Attentive staff. Good location."
	},
	{
		"User": "jeremiah",
		"Review": "\r location location pool"
	},
	{
		"User": "Lee",
		"Review": "\r Atmosphere, organization, cost"
	},
	{
		"User": "Abdon",
		"Review": "\r Location, wifi"
	},
	{
		"User": "marjorie",
		"Review": "\r very conveniet near shopping center,, pennong, ice giants, amazing staff,, very affordable priece"
	},
	{
		"User": "Gregory",
		"Review": "\r Comfortable, clean, right next to G mall, friendly staff. "
	},
	{
		"User": "MARITES",
		"Review": "\r Great location, great value and good food"
	},
	{
		"User": "Reynald",
		"Review": "\r A pretty nice hotel. Busy lobby. Room is big although there is that \"old\" smell but not pronounced. Breakfast is horrible. "
	},
	{
		"User": "Marilyn",
		"Review": "\r the staff,the room and the food"
	},
	{
		"User": "Robert",
		"Review": "\r Close to all shopping, restuarants, malls"
	},
	{
		"User": "Vima",
		"Review": "\r newly built hotel. goos location. value for money"
	},
	{
		"User": "Jean",
		"Review": "\r Clean, convenient & affordable"
	},
	{
		"User": "Alex",
		"Review": "\r Location.... WIFI.... Nice room"
	},
	{
		"User": "Michelle",
		"Review": "\r Location, cleanliness, quality"
	},
	{
		"User": "Maria",
		"Review": "\r Spacious room, Friendly Staff, Great breakfast"
	},
	{
		"User": "maynard",
		"Review": "\r close to everything, good value and very clean."
	},
	{
		"User": "Kristine",
		"Review": "\r Location, location, location"
	},
	{
		"User": "Josephine",
		"Review": "\r Very helpful and accommodating staff- named ALexis...location is perfect.....beds are big thus, very comfortable"
	},
	{
		"User": "Krisna",
		"Review": "\r Food, room, staff are all good"
	},
	{
		"User": "Jeanne",
		"Review": "\r affordable, nice location nice place"
	},
	{
		"User": "Kristine",
		"Review": "\r Location only"
	},
	{
		"User": "Naum",
		"Review": "\r Location, security, friendly staff "
	},
	{
		"User": "Rosemarie",
		"Review": "\r Best three things about this hotel -- cleanliness, hotel service, delicious breakfast!"
	},
	{
		"User": "david",
		"Review": "\r Room clean good food"
	},
	{
		"User": "Ronah",
		"Review": "\r Food, Friendly Staff, Cleanliness"
	},
	{
		"User": "armin",
		"Review": "\r clean rooms ,central location,price"
	},
	{
		"User": "Anthony",
		"Review": "\r Staff performance, Quality of the room and amenities, Location"
	},
	{
		"User": "Venus",
		"Review": "\r Central location, very near a mall, lots of eateries around"
	},
	{
		"User": "Mindy",
		"Review": "\r Big beds, centrally located, hospitable staff"
	},
	{
		"User": "Seve",
		"Review": "\r Location, value for money, friendly staffs"
	},
	{
		"User": "Trevor",
		"Review": "\r Staff, clean and comfort"
	},
	{
		"User": "faye",
		"Review": "\r ambience, staff, cleanliness"
	},
	{
		"User": "David",
		"Review": "\r Breakfast location and room"
	},
	{
		"User": "Irene",
		"Review": "\r Location"
	},
	{
		"User": "Rowena",
		"Review": "\r Staff were very friendly especially Mr. Diego, customer service is very good. Buffet breakfast is excellent. Good location and security is okay."
	},
	{
		"User": "Cornelis",
		"Review": "\r room layout, cafe convenience, early check in"
	},
	{
		"User": "Nina",
		"Review": "\r In the city proper"
	},
	{
		"User": "Nina",
		"Review": "\r Value for money, big beds"
	},
	{
		"User": "Wolfgang",
		"Review": "\r location, affordable"
	},
	{
		"User": "Abdulrahman",
		"Review": "\r Food, staff performance and clean"
	},
	{
		"User": "Christina",
		"Review": "\r Breakfast has a good selection of fresh fruits and pastry, hot and continental breakfast; courteous and accommodating staff; quiet but has easy access to public transporation."
	},
	{
		"User": "Tomas",
		"Review": "\r location, staff performance and room size"
	},
	{
		"User": "Noel",
		"Review": "\r safe, clean, value for money"
	},
	{
		"User": "NORMA",
		"Review": "\r The good location,friendly staff and high speed internet"
	},
	{
		"User": "Frances",
		"Review": "\r friendly and accommodating staff, centrally located, well maintained hotel"
	},
	{
		"User": "Roderick",
		"Review": "\r location bed pool"
	},
	{
		"User": "James",
		"Review": "\r Close to G mall Nice staff Accomodating of needs"
	},
	{
		"User": "Jo",
		"Review": "\r clean, spacious room, friendly staff"
	},
	{
		"User": "Honey",
		"Review": "\r accessibility, spacious rooms, quiet surroundings"
	},
	{
		"User": "EUNICE",
		"Review": "\r value for money, big room, good location"
	},
	{
		"User": "Rosvel",
		"Review": "\r Perfect place to stay for always on the go travelers Centrally located in the city Clean rooms/surroundings"
	},
	{
		"User": "Maria",
		"Review": "\r Easy to book, staff were friendly and accomodating and the room is comfortable and cheap. 3 fast elevators."
	},
	{
		"User": "Charlene",
		"Review": "\r location, big rooms, jacuzzi"
	},
	{
		"User": "abel",
		"Review": "\r buffet breakfast /room service easy to talk to the staff & all staff are neat looking persons"
	},
	{
		"User": "Ronald",
		"Review": "\r 1. Low room rates 2. Excellent location 3. Friendly staff"
	},
	{
		"User": "rene",
		"Review": "\r location location location"
	},
	{
		"User": "Alex",
		"Review": "\r Location Presentation Quiet"
	},
	{
		"User": "NORMAN",
		"Review": "\r value,location and service"
	},
	{
		"User": "Cherry",
		"Review": "\r great value for money"
	},
	{
		"User": "Julito",
		"Review": "\r nice"
	},
	{
		"User": "jayson",
		"Review": "\r comfort, breakfast, location, good staff."
	},
	{
		"User": "JACQUES",
		"Review": "\r profesionaliism of the staff , quietness and low rate "
	},
	{
		"User": "Allen",
		"Review": "\r Clean rooms, convenient location and budget friendly"
	},
	{
		"User": "Gil",
		"Review": "\r good location, safety, value for money"
	},
	{
		"User": "k",
		"Review": "\r Location & affordability"
	},
	{
		"User": "Janice",
		"Review": "\r Service, Food, Location"
	},
	{
		"User": "Marilou",
		"Review": "\r Close to the airport, "
	},
	{
		"User": "Robert",
		"Review": "\r Staff always willing to assist, good stepping off point for sightseeing, close to restaurants shopping malls"
	},
	{
		"User": "Kelvin",
		"Review": "\r Hotel Exterior looks grand, Friendly staff, fast room service"
	},
	{
		"User": "valerie",
		"Review": "\r friendly staff, location, comfortable room"
	},
	{
		"User": "Eliezer",
		"Review": "\r centrally located, large room"
	},
	{
		"User": "Tina",
		"Review": "\r serves one of the best grilled tuna!! "
	},
	{
		"User": "Paul",
		"Review": "\r Nice sized rooms.....good location and reasonable price"
	},
	{
		"User": "PETER",
		"Review": "\r LOCATION, STAFF, BREAKFAST"
	},
	{
		"User": "Julito",
		"Review": "\r nice"
	},
	{
		"User": "PATROCINIO",
		"Review": "\r nice"
	},
	{
		"User": "Jeannie",
		"Review": "\r location. convenient"
	},
	{
		"User": "Kenneth",
		"Review": "\r good location, nice breakfast, cable TV"
	},
	{
		"User": "Zahed",
		"Review": "\r room, staff, food"
	},
	{
		"User": "jarette",
		"Review": "\r Location, lobby, exterior facade"
	},
	{
		"User": "Catherine",
		"Review": "\r within city area, near shopping malls & clean room"
	},
	{
		"User": "Irene",
		"Review": "\r Friendly and attentive staff, comfortable and within the city"
	},
	{
		"User": "Duc",
		"Review": "\r good htel but smoking area is too far"
	},
	{
		"User": "James",
		"Review": "\r Great location, good breakfast, big rooms."
	},
	{
		"User": "James",
		"Review": "\r Big clean room, good buffet breakfast, Great location."
	},
	{
		"User": "jean",
		"Review": "\r location, room size and friendly staff"
	},
	{
		"User": "Caerel",
		"Review": "\r jacuzzi, staff, location"
	},
	{
		"User": "milo",
		"Review": "\r comfortable ... affordable ... helpful staff"
	},
	{
		"User": "Gwyn",
		"Review": "\r Close to mall and restaurants."
	},
	{
		"User": "Josephine",
		"Review": "\r big beds, accessible to shopping malls, with extra amenities you can enjoy plus free buffet breakfast"
	},
	{
		"User": "Carmelo",
		"Review": "\r Centrally Located, large beds and spacious rooms, four star hotel"
	},
	{
		"User": "James",
		"Review": "\r Food, Room"
	},
	{
		"User": "Carmelo",
		"Review": "\r large and spacious rooms, centrally located to business and accomodating staff"
	},
	{
		"User": "Neil",
		"Review": "\r friendly staff, comfortable room great breakfast"
	},
	{
		"User": "Andre",
		"Review": "\r bed, pillow and the 2nd bed with pillow "
	},
	{
		"User": "garry",
		"Review": "\r clean rooms, large room, fairly priced"
	},
	{
		"User": "Noel",
		"Review": "\r Location, cost, comfy pillow"
	},
	{
		"User": "Theresa",
		"Review": "\r facade, comfortable beds, friendly staff"
	},
	{
		"User": "Anna",
		"Review": "\r free wifi, easy access to malls, friendly staff"
	},
	{
		"User": "CLAIRE",
		"Review": "\r Clean, comfortable, good location"
	},
	{
		"User": "Rami",
		"Review": "\r Nära centrum.."
	},
	{
		"User": "Mario",
		"Review": "\r The hotel has good security, friendly staff and the place was clean."
	},
	{
		"User": "Renilo",
		"Review": "\r Attentive staff, great ambience, comfortable"
	},
	{
		"User": "George",
		"Review": "\r location, clean, great breakfast"
	},
	{
		"User": "Darren",
		"Review": "\r Comfortable room, nice location near mall, good security"
	},
	{
		"User": "Carmelo",
		"Review": "\r Their location is the first it is within the metro, accommodating staff and relatively spacious rooms."
	},
	{
		"User": "Grace",
		"Review": "\r good breakfast"
	},
	{
		"User": "Louise",
		"Review": "\r Spacious Room, Friendly Staff and Accessibility"
	},
	{
		"User": "Edgyn",
		"Review": "\r Location, Friendly staffs, Ambiance"
	},
	{
		"User": "Henry",
		"Review": "\r bed, breakfast and service"
	},
	{
		"User": "JAQUILINE",
		"Review": "\r Modern nice hotel"
	},
	{
		"User": "maria",
		"Review": "\r good location, friendly staffs , huge rooms"
	},
	{
		"User": "jean",
		"Review": "\r Size of rooms with 2 double beds, good staff and near the center of city"
	},
	{
		"User": "Evangeline",
		"Review": "\r Big beds, large room, spacious lobby"
	},
	{
		"User": "aileen",
		"Review": "\r breakfast, location and service"
	},
	{
		"User": "Gerhard",
		"Review": "\r Location,location, location"
	},
	{
		"User": "Jennyfer",
		"Review": "\r its location, comfortable bed"
	},
	{
		"User": "leonardo",
		"Review": "\r I liked the lounge area the best-big and comfortable sofa; staff are helpful and nice"
	},
	{
		"User": "Joseph",
		"Review": "\r Size of room and shower"
	},
	{
		"User": "Rowena",
		"Review": "\r Easy access to transpo, nice staff, comfortable rooms and lots of pillows"
	},
	{
		"User": "jose",
		"Review": "\r service is very good"
	},
	{
		"User": "ROSLAN",
		"Review": "\r Nice hotel on top the hill with attentive staffs smiling all the time."
	},
	{
		"User": "Mary",
		"Review": "\r good and friendly staff...nice lobby with impressive array of paintings..comfortable bed and good room"
	},
	{
		"User": "Maria",
		"Review": "\r Pinnacle hotel's best qualities are service, appearance and did i mention service?"
	},
	{
		"User": "RICHELLE",
		"Review": "\r location, quiet, no more"
	},
	{
		"User": "christine",
		"Review": "\r Location, staff, breakfast"
	},
	{
		"User": "MYRNA",
		"Review": "\r nice breakfast, the staff are friendly and the hotel has a very large lobby "
	},
	{
		"User": "Jerome",
		"Review": "\r location, location, location"
	},
	{
		"User": "fritzie",
		"Review": "\r new hotel"
	},
	{
		"User": "WARREN",
		"Review": "\r The hotel was very accommodating."
	},
	{
		"User": "Levent",
		"Review": "\r I dont see good futur for this hotel"
	},
	{
		"User": "Joseph",
		"Review": "\r Fast service"
	},
	{
		"User": "amadeo",
		"Review": "\r good location"
	},
	{
		"User": "martin",
		"Review": "\r I"
	},
	{
		"User": "GEOFFREY",
		"Review": "\r rooms are good, good showers, air condtioning worked well"
	},
	{
		"User": "venus",
		"Review": "\r evrything"
	},
	{
		"User": "ALBERT",
		"Review": "\r spacious room and very clean"
	},
	{
		"User": "Blomqvist",
		"Review": "\r Location and friendliness if staff"
	},
	{
		"User": "Ma",
		"Review": "\r Rooms are clean."
	},
	{
		"User": "Marivic",
		"Review": "\r the spacious room.."
	},
	{
		"User": "Edmond",
		"Review": "\r value for the money"
	},
	{
		"User": "Fidelyn",
		"Review": "\r Near the malls and restaurants..."
	},
	{
		"User": "Hiromitsu",
		"Review": "\r Walk distance to Marco Polo"
	},
	{
		"User": "Chauncey",
		"Review": "\r The Lobby was the best feature, and the location from the mall."
	},
	{
		"User": "Muhammad",
		"Review": "\r Breakfast spread, grand lobby, nice pool."
	},
	{
		"User": "Juliebelle",
		"Review": "\r Location"
	},
	{
		"User": "John",
		"Review": "\r Nice new hotel, well-kept premises, friendly staff. Room for improvement."
	},
	{
		"User": "Brian",
		"Review": "\r good location if want to be downtown across from gloriata Mall"
	},
	{
		"User": "Randall",
		"Review": "\r The room was clean and comfortable enough"
	},
	{
		"User": "Angel",
		"Review": "\r We loved how we were treated like royalty"
	},
	{
		"User": "roger",
		"Review": "\r right next to large mall"
	},
	{
		"User": "George",
		"Review": "\r Breakfast offered free, indoor swiming pool and decor of lobby and rooms"
	},
	{
		"User": "Stefan",
		"Review": "\r great for professionals, and romantic stays"
	},
	{
		"User": "Joseph",
		"Review": "\r staff is courteous, helpful and respectful, clean hotel, easy accessibility"
	},
	{
		"User": "alvin",
		"Review": "\r Close to mall and night life"
	},
	{
		"User": "Jolene",
		"Review": "\r Clean"
	},
	{
		"User": "Jolene",
		"Review": "\r clean"
	},
	{
		"User": "christopher",
		"Review": "\r location, staff"
	},
	{
		"User": "Eduardo",
		"Review": "\r Central location , clean and easy to find."
	},
	{
		"User": "christopher",
		"Review": "\r location, price"
	},
	{
		"User": "Stefan",
		"Review": "\r downtown, accessible, quiet and great staff"
	},
	{
		"User": "Mary",
		"Review": "\r Good "
	},
	{
		"User": "Sheryl",
		"Review": "\r nice ambiance, clean rooms"
	},
	{
		"User": "KAMAL",
		"Review": "\r in the center of entertainment"
	},
	{
		"User": "Allan",
		"Review": "\r location"
	},
	{
		"User": "Lani",
		"Review": "\r Rooms, elevator, foot, everything!"
	},
	{
		"User": "JONGMIN",
		"Review": "\r Clean, reasonable price, good service!"
	}
]
