[
	{
		"User": "Rey",
		"Review": "Spacious rooms & clean bathrooms. The staff are kind & hospitable. I suggest to offer more variety of food to choose for breakfast and a little bit more of quantity. "
	},
	{
		"User": "Cathee",
		"Review": "Been there 3 times. Well-maintained. Comfty. Accessible. Will definitely go back there again!"
	},
	{
		"User": "rossana",
		"Review": "Just improve the breakfast meal. ☺"
	},
	{
		"User": "Cherrymar",
		"Review": "The room is clean. But I booked for a room that says Two Twin Beds, they gave me a room with Two Single Beds. I didnt mind as it was only me, but I was thinking what if it was four of us, then we could have had a hard time sleeping using two single beds. The breakfast is only a bun with egg on it. They didnt even ask me what I want to drink. They gave me a sachet of coffee. I had book a room of a similar price with this one in cebu and they gave me a proper breakfast."
	},
	{
		"User": "Chan",
		"Review": "We enjoyed our stay, receptionist Kahrla and staff Joemelyn were always cheerful, the property is new and clean, close to everything, only problem is there's no car park, no lift, no bedside table and breakfast was just bun with egg or tuna with coffee, overall it was acceptable, recommended. "
	},
	{
		"User": "Hannah",
		"Review": "Clean rooms, affordable, friendly and accommodating staff especially the receptionist, Kahrla. Near Abreeza and Victoria Plaza and a number of resto and hangout places such as BoxedUp. Although it's a struggle that there's no elevator especially if your room is on the 4th flr, still giving them 5 stars. My family and I had a good stay. More power.👌👍"
	},
	{
		"User": "MA",
		"Review": "Pros - cheap but very clean; good staff; spacious room; good location; . Cons-no lift"
	},
	{
		"User": "Eloise",
		"Review": "pros- it was near good restaurants cafes - it was clean, spacious room - aircon was cold and new - hot cold shower cons - no elevator and we were at the 4th floor - no parking space, there was a space for 2 but one guest occupied all the space - not handicapped friendly, no lift - when we entered the room it smelled like dried fish was left inside for a few hours - paid for 100 for breakfast (1 satchet of coffee, burger bun, sunny side up egg inside) that was worth P30. -no telephone to call, you had to walk down the stairs if you needed something from the reception. -no security guard"
	},
	{
		"User": "athabor",
		"Review": "Staff are very friendly even when I reach at 3 am to wake them . Room is clean and good lack facilities like intercom ,coffee maker and the toilet bowl small like for kids . Overall nice place to stay and nearby mall and food "
	},
	{
		"User": "Nelson",
		"Review": "Overall stay was superb, the hotel was clean, the location was okay, it was located in executive subdivision of Doña Vicenta so it was ultra safe and so many restaurants nearby and there is Victoria Plaza few meters away. The room was spacious, however there are small yet important thing needs to consider - no table near the bed, put at least 3 hangers in the cabinet coz there is only 1, sabitan ng damit sa wall, and breakfast at least rice meal, coz we had burger and egg only. Anyways, receptionist was very polite and having a very nice costumer service though, 5 stars for Ate. Indeed Davao - Life Is Here."
	},
	{
		"User": "Kris",
		"Review": "All good here"
	},
	{
		"User": "christee",
		"Review": "Good room size, very fast wifi and clean surroundings."
	},
	{
		"User": "Richelle",
		"Review": "The hotel is new so everything is new is the hotel..staff are very freindly and accommodating...we'll surely return in this hotel. "
	},
	{
		"User": "Joanna",
		"Review": "Room and bathroom were very clean and spacious. Fast wifi. Nice pillows and bedsheets for very good sleep. Walking distance to Victoria Plaza and Abreeza mall. Warm staff who accommodated me for late check in. Simple breakfast of instant coffee and egg sandwich. Only thing is there’s no escalator and I was on the 4th floor - no problem as long as you don’t have a heavy bag. Highly recommend. Thanks!"
	},
	{
		"User": "Jacqueline",
		"Review": "Nice staff, clean rooms, strong wifi, great location, reasonable rates. I love this hotel and will definitely stay here again and again."
	},
	{
		"User": "Thomas",
		"Review": "Since it was quite new, place was really clean. Had good pillows but beds were bit hard. Staff were all polite, friendly and attentive. Walking distance to malls(10 mins) and boxed up( food court) is really nearby and some restaurants as well. Breakfast need some upgrade though. But it was pleasant stay. "
	},
	{
		"User": "Jacquelyn",
		"Review": "Almost everything was great for us, staff was friendly and helpful, the kuya helped us with our luggage going up the second floor because there’s no elevator, the room was spacious and clean, cool ac, clean bathroom, towels provided with shampoo sachets and small soap. The location I guess is okay. We had no time to explore the surrounding/ nearby areas but it was quiet and peaceful at night when we checked in. We were just slightly disappointed with breakfast. Wish they had options. Ours was a burger bun with sunny side up egg (we were not asked but my bf prefers scrambled egg) and 1 packet of coffee. I am allergic to egg so I had to order/buy a small cup of noodles just to have something to eat. The coffee sachet and the burger bun was actually ok for me if only it came with a piece of regular size hotdog or a slice of luncheon meat or any canned/processed food. We were in a hurry because of an early appointment and had no extra time to go out to walk to look for a nearby carinderia or food stall."
	},
	{
		"User": "Maria",
		"Review": "Nice staff...the only not so good about this establishment is that they do not have elevator. The bldg is until 4th flr. We are located at the 4th flr 😣. Wifi is fast"
	},
	{
		"User": "Thrina",
		"Review": "The facilities were okay, however we had water shut down from the time we arrived at the hotel untill the next day 10am. Our room was located at the 4th floor and there were no elevators provided. "
	},
	{
		"User": "Angelo",
		"Review": "Place is relatively new. Location is within a subdivision and near victoria plaza"
	},
	{
		"User": "Ronald",
		"Review": "Pro’s- The rooms are big, clean, comfortable beds, friendly staff, and the entire building is new. Cons- breakfast is only bread and egg, there is no electric socket near the bed. You need to charge phones beside the TV. There is no bidet, and better if they provide slippers."
	},
	{
		"User": "Kimberly",
		"Review": "The floors and the beds were absolutely clean. I am a traveller who values room cleanliness. Would come back here again if given the chance. Loved the place!"
	},
	{
		"User": "Xerben",
		"Review": "the place was very clean, although maybe coz its still new. staff were very accomodating ang proactive in helping. i would definitely stay here again if ever im back in davao. lacks a bit in the area of food services though. also no laundry service. but both can be availed nearby. i love the homey feel. "
	},
	{
		"User": "Eunice",
		"Review": "We will definitely go back! "
	},
	{
		"User": "Jesame",
		"Review": "Room is clean, staff are accommodating. But not accessible to public tansports. Overall very good."
	},
	{
		"User": "Momtadz",
		"Review": "Very Clean , Affordable :) Five 🌟 star"
	},
	{
		"User": "Reyan",
		"Review": "-near Bajada (walking distance from Victoria Plaza) and Boxed Up (food hub) -also has free wifi -the facilities are clean"
	}
]
