[
	{
		"User": "Ramvic",
		"Review": "The hotel and its facility is good. I think they needed to train their staff, especially the reception, to be more courteous and welcoming. They are the front desk, people would ALWAYS come to them so they should be approachable. During my check-in, it was as if I didn't exist when I was the only one at the counter that time. They were busying themselves with \"I dont know\". Same thing when I checked out! But then at least I didnt really have to deal with them longer. "
	},
	{
		"User": "Shalen",
		"Review": "So I booked it that day thru agoda right away, and when we got there the staff made us wait for atleast half hour because the receptionist said and did not showed on their list yet. They told us to sit first And wait for their call. The woman answered phone calls and accepting guests and seems like she forgot about us. So I noticed she had a co worker with her and I approach her to check If my name already showed on their booking list. She said Oh yes Ma’am. So,, if I did not let them check it again we will wait for an hour? Yeah right.- but all in all the rooms are good. Guards are accomodating and polite. We love the swimming pool."
	},
	{
		"User": "Pinky",
		"Review": "I love the place.. but what I love most was the breakfast buffet.. love it!.. I will book it again.. Thank you!"
	},
	{
		"User": "Eunice",
		"Review": "Though the room is quiet clean, but needs renovation / upgrade "
	},
	{
		"User": "Matt",
		"Review": "Great place. ATM inside the building My only gripe was the Wifi in the room was very weak"
	},
	{
		"User": "Raquel",
		"Review": "I booked a family room here for four of us and check in was 2 p.m. We checked in at 3p.m. but were made to wait till the room not ready at 3:45pm. The front desk staff entertained walk ins and phone calls but did not bother to check on us. The front desk staff told us that family rooms take long to clean so we had to wait. For people who are tired and hungry and just wants to rest, waiting shouldn't be an option. Go somewhere else, Davao City has so many nice hotels . So disappointed. "
	},
	{
		"User": "Rob",
		"Review": "There are many good things about Apo View but there are also problems which are with the Management. I exchanged words with the Manager Ms Leah Jane S Adolfo, initially with her ignoring my 2 emails and 3 phone calls from Hong Kong and accepted her apology. As a retired GM I had picked up on a few minir problems which were ( in my opinion ) down to o poor or lack of Management and training. She agreed to sit diwn with me ove a coffee and hear my constructive views, but despite my leaving messages for her at the front desk for the next FIVE days she never responded. Needless to say i left her a three page letter expressing my disappointment at her lack of Professionalism and basic good manners. Many of the staff I spoke to were just waiting for a better job as they had little or no confidence in Ms Adolfoand her senior managers. No staff food ! ( and yet they would dispose of under used Buffet food than look after their workforce ( who were excellent) Also was zero tourist info"
	},
	{
		"User": "c",
		"Review": "Over all, we had a pleasant stay... Only there's limited food choices on the buffet breakfast and not so pwd friendly tub.."
	},
	{
		"User": "Gilbert",
		"Review": "price is very good, rooms need improvement, break fast not bad, other room are little bit warm other with new split type, personnel thumbs up, i will still come back and recommend this hotel "
	},
	{
		"User": "JEFFREY",
		"Review": "Staff are very accommodating. Room look bit old but clean."
	},
	{
		"User": "Ryan",
		"Review": "They put us in this 362 old room, facing to a very dirty scenery, next to the room is the housekeeping quarter where staff are doing horse play, voices are so loud. I asked twice the reception to transfer us but no luck telling its full house. It’s unacceptable but no choice and sleepwith the ordeal. "
	},
	{
		"User": "Lester",
		"Review": "Pros I enjoyed the stron Wifi connection. I was able to finish some of my work reports."
	},
	{
		"User": "Tan",
		"Review": "Hotel need to upgrade, bathroom shower head broken and old."
	},
	{
		"User": "paul",
		"Review": "Breakfast buffet is always cold food not hot ,Elevator is old but safe ,Air con its old but works . Room was clean shower was good and hot. Reception staff are not that welcoming very poor Enjoy your stay here Good luck "
	},
	{
		"User": "Alexis",
		"Review": "This has been my hotel every time I am in Davao. Seems they have improved their service since the last time I was here when it was taken over by a different management"
	},
	{
		"User": "Liang",
		"Review": "Sound proof is not good. You can hear next door walking and coughing. Plus, there is a phone on the hallway, don’t know it’s for whom, It rings forever and no one will answer it. And there is no hot water. No hot water in such a big hotel? Kidding! "
	},
	{
		"User": "Marlene",
		"Review": "Upon entering the room, floor is wet! Elevator smells bad. "
	},
	{
		"User": "Merdil",
		"Review": "overall was good."
	},
	{
		"User": "Jane",
		"Review": "Service was good. "
	},
	{
		"User": "Edwin",
		"Review": "Clean and nice place with courteous and friendly staff. The buffet has a variety of palatable dishes and what impressed me most was the service."
	},
	{
		"User": "Julie",
		"Review": "Very spacious rooms and complete facilities. The staff are accomodating. The elevator lobby is a little hard to locate the first time, but its okay. The best part is the buffet breakfast :) I stayed here for business, but this should be perfect for families and group of friends as well."
	},
	{
		"User": "Myraflor",
		"Review": "the staff were very accommodating especially at the front desk & melo of entrèè restaurant. rooms were big & beds comfy. food in the entrèè were very tasty. only downside was we were given rooms with a view of the rusty roof tops of the neighboring houses. i was kinda expecting a view of the apo to live up the hotel's name."
	},
	{
		"User": "nelson",
		"Review": "Hotel is very nice but breakfast buffet had very poor selection "
	},
	{
		"User": "Richard",
		"Review": "Location Pool Value Clean Great staff Breakfast"
	},
	{
		"User": "Angelica",
		"Review": "we booked two rooms and it were all very nice and clean, the buffet have great selections- free breakfast, and the pool was very clean"
	},
	{
		"User": "RHEA",
		"Review": "Honest hotel staff"
	},
	{
		"User": "Roxann",
		"Review": "It's in the center of the city malls, restaurants are just nearby."
	},
	{
		"User": "Alexander",
		"Review": "Great "
	},
	{
		"User": "Angelique",
		"Review": "Old hotel. Needs to be improved when it comes to facilities."
	},
	{
		"User": "DONNA",
		"Review": "We arrived around 630pm, left our things in the room and went out for dinner. When we came back, I laid my son to bed to drink his milk and was shocked to find out that the pillow cases got a lot of hair strands all over it including the linens and blanket! I immediately called housekeeping to replace it! Was very disappointed as I have very high expectation of The Apo View Hotel! Is it because they knew I booked it for a steal price here in Agoda compared to their published rates that's why they never bothered to replace them?! To the manager of the property, I hope you do random checks as this will destroy your hotel's reputation."
	},
	{
		"User": "Marysor",
		"Review": "I bookes for 4 days and it was amazing stay on this hotel...my nephew and niece were so happy swimming on the pool just in front of our room....Staff were very friendly and accomodating....I definitely will coming back..."
	},
	{
		"User": "JEANNE",
		"Review": "Apo hotel has been around for a long time now. The elevator is small and only 1 is functional. I think the price is high considering the facilities are old. Improvements or renovations can be made. On the other hand, the restaurant and food choices are good. "
	},
	{
		"User": "Grethel",
		"Review": "The rooms at 350 and 377 had defective airconditioning system. The first maintenance personnel just reported that our aircon was normally not cold while the second maintenance personnel thoroughly checked the aircon and found ice crystals forming on the said equipment. We transferred twice just to get a comfortable room. We are thankful that the staff were able to attend to our needs. However they don't have much initiative 'coz when I asked for an electric fan that's just what they gave.. Without offering for room transfer until we requested. Breakfast buffet is good and the restaurant staff are very accommodating. "
	},
	{
		"User": "PETER",
		"Review": "Nothing at all"
	},
	{
		"User": "Alexander",
		"Review": "We enjoyed our stay. Good location for everything. A bit old though.."
	},
	{
		"User": "Lorena",
		"Review": "The place is old but room was still nice. The bathroom needs serious fixing - blower does not work, sink is clogged, no bidet, no hot shower. The frontdesk people are quick and nice. Food was great! Very affordable!"
	},
	{
		"User": "Rechie",
		"Review": "When we arrived at the reception nobody greeted us. One person is prete ding to be very busy talking in the phone while others are inside the staff rooms and came out only after a few minutes.. Room smells like never been use for months.. No scented sprays or something that you can use.. AC only for fan mode. "
	},
	{
		"User": "Marysor",
		"Review": "Hotel ia in Downtown Area and near People's Park...thats really good...the only thing they should start renovating the rooms...furniture are old and cleaner bathroom is a must....but overall i still recommend it to my friends..."
	},
	{
		"User": "Moon",
		"Review": "0no more hot water, many warms"
	},
	{
		"User": "Isaac",
		"Review": "When I'm in Davao i always try to stay in this hotel. It is close to everything, very clean and very friendly staff. "
	},
	{
		"User": "Hemantha",
		"Review": "I feel booking trough Agoda not a real value, always get lower treatment. before i book this hotel i requested high floor but i received 3rd floor when arrived and when ask? they change me to 5th floor which the higher floors reserved for the other sites booking. I stayed for 4 days it’s the same breakfast which is really boring with taste. Really need some renovation for this hotel. I not recommend this hotel for the money paid. "
	},
	{
		"User": "Ma",
		"Review": "Booked 3 bedrooms x 6pax. Contacted the hotel 10am on the same day of our arrival to comfirm our booking. Staff have confirmed that we are booked for 3bedrooms that day and have asked if what sort of beds do we prefer: 2singles or matrimonial bed? I told her we prefer matrimonial beds. She said its ok. Check in time was supposed to be 2pm but we didn't managed to arrived at the hotel till 7pm. Went to the reception and ask for our rooms. We were told that the rooms are not yet ready as they are still cleaning the room???? And we are having 2single beds each room!!! The lady in the reception said two rooms are ready but the 3rd room is still being cleaned. We were travelling with 2 seniors who are already tired. So we agreed to get the 2rooms while waiting for the 3rdroom so the oldies can have a rest. It was a poor service and we are really not happy "
	},
	{
		"User": "John",
		"Review": "accesible"
	},
	{
		"User": "John",
		"Review": "very clean room"
	},
	{
		"User": "Angelli",
		"Review": "walang modo ang front office supervisor - as far as i could remember \"jessie/jc\" yung name nya. super rude, mean, walang modo, not a good example of a good hotelier! i will never go back to that hotel ever again and will never recommend that hotel. yung ceiling ng room may tubig tumutulo! ang baho ng rooms 😠😤😡"
	},
	{
		"User": "alan",
		"Review": "I loved the king bed, the spacious room, the awesome buffet and great staff. They made us feel at home. Jesti, Bernie and Jun really took great care of us. :)"
	},
	{
		"User": "Ronald",
		"Review": "We requested for a higher floor but we only got 2nd floor, they didnt even bother checking other options for us and minutes later, another guest checked in and was given the 9th floor. Wifi in this hotel was also close to non-existend so this property is nor recommended for business travels who relies on wifi connectivity. We moved to a room closest to the main router on the floor but it didnt make a difference. Service? They definitely have a lot of room to grow. I have worked in several 5 star hotels overseas and the F&B service here was pathetic. The staff won’t even smile and make you feel welcome.. it feels like they just come to work and leave. When we asked for coffee at bfast, the server just looked at us and ignored us.. then the 2nd time we asked, the server poured it and left without even a word... horrible.. location is pretty central but I would rather stay in boutique hotels where i feel welcome. "
	},
	{
		"User": "Tara",
		"Review": "staff was nice, room was large, clean and simple. breakfast was nice. The rooms required you to have your key card in this little power switch in order for your room to have power... an eco friendly touch which has its pros and cons. Pros: energy saving, keeps your key so you always know where it is. Cons: your room is pretty hot when you arrive. when you leave for the day and your power is off, it turns the fridge power off too. if you don’t return the key card you get charged P500... as an american use to not having to turn key cards in this was an inconvenience since the family we were traveling incurred this fee for leaving without turning their key in."
	},
	{
		"User": "Sharon",
		"Review": "Needs to be upgraded. I was disappointed that even a hair dryer cant be provided"
	},
	{
		"User": "Anthony",
		"Review": "Needs decorating and new staff"
	},
	{
		"User": "Jeffrey",
		"Review": "goodhappy!!"
	},
	{
		"User": "Relpha",
		"Review": "Toilet facilities needs uodating"
	},
	{
		"User": "Wilaine",
		"Review": "I didn't enjoy the breakfast and there was a small cockroach in the toilet room. "
	},
	{
		"User": "Maryanila",
		"Review": "The location is good. Very near to a mall and salon district. The staff are not as friendly as the other hotel we stayed. They don’t greet and no smile. The building needs more lighting. It’s dark and gloomy. The elevator needs renovation. The room is surprisingly wide and spacious and the bed is big too. Nice view of the swimming pool and the mall. You have to call the front desk to give you a hair dryer. The swimming pool is big and there is a deep part so you have to watch your children. The breakfast buffet is disappointing. You have to first go to the Front Desk to get your ticket. When we got to the restaurant , the tables are not clean and no table setting. They ran out of food and drinks. There seems to be a gap in communication because we were asked many times about our breakfast ticket many times by different staffs. WiFi worked in our room. If you don’t mind about those things and just need a place to sleep, this is a good place."
	},
	{
		"User": "Albert",
		"Review": "My wife just loved the place and its location, just a walking distance to people's park, malls and eating house. Very accommodating staff that they even set up a baby crib upon request. And good food which we enjoyed during our breakfast."
	},
	{
		"User": "Denise",
		"Review": "I stayed with my dad and sister in Apo View for 8 days. The breakfast buffet was good, with a nice selection of food to start the day. They also had bacon! Haha. The best about Apo View were the staff. They were very friendly and took care of what we needed. The only downside is the cleanliness of the pool, and lack of gym amenities, but overall, it was worth our money!"
	},
	{
		"User": "Relpha",
		"Review": "Requested for an early check in but were charged of P1500 on top of our payment, sink was blocked and was reported but never repaired, toulet needs refurbishment , toilet was dirty, no towels when we arrived, and kettle was placed in the toilet? Ewwww... it was very poor, cleanliness wise its soo yukcy"
	},
	{
		"User": "Prime",
		"Review": "We were for 2 nights and the experience was exceptional. Staff are very friendly and accommodating. Our room is so clean except that the air conditioner got busted on our last night due to too much ice. There are no mini bar, the ref is empty. Breakfast is too ordinary. But the experience os really good. Will stay again in this hotel."
	},
	{
		"User": "Cecilia",
		"Review": "The buffet ran out of food and replacement was slow. The menu had very few choices . the room given to us was 3 hrs late than originally promised."
	},
	{
		"User": "Keisha",
		"Review": "Old, no lights. Water flow in shower is very slow."
	},
	{
		"User": "Jayar",
		"Review": "the rooms are super clean!!!! but the elevators are OLD and scary! and finding a parking spot is hard"
	},
	{
		"User": "Maria",
		"Review": "got two connecting rooms for a family of 4.When i went inside the room 834 the floor was wet. I needed to call the housekeeper... the other room was 833. We got inside at around 130pm. So hot outside, we have to switch on the aircon to its maximum. We stayed for almost one hour but twas still hot. We called up engineering dept. the personnel checked just said theres nothing wrong, we just wait for a while. Until 4pm but the blow was just like of a heater. I dialed the reception frint desk housekeeping , called up the front desk but nobody picked up fone.This time to make my sons comfortable, i just opened the connecting door so that room can share with the coldness of the other room. After an hour i dialed again thise numbers and whew the receptionist answered telling me that we will just transfer yo another room but not connected anymore.what? I cant allow my sons to be away ftom us.so we stayed. As my husband wanted to take a shower OMG he had hard time turning the faucet."
	},
	{
		"User": "Michelle",
		"Review": "everything is perfect..staff and the food.. the bed is very comfortable"
	},
	{
		"User": "Ma",
		"Review": "Clean and Cozy is what I look for, and this hotel was good for me."
	},
	{
		"User": "David",
		"Review": "I had changed my date through my travel agency and had an email confirming that the date was changed and when I arrived at the hotel, the staff would not honor what the travel agency said and told me that I had to pay for another night. Later I called the travel agency and they refunded my money. I would never stay here if my life depended on it."
	},
	{
		"User": "Francisco",
		"Review": "rooms are dated, there was a cockroach in the bathroom, the buffet spread is 1 star at best.... was really disappointed. thought it would be a good hotel. but is 2 star at best,."
	},
	{
		"User": "coco",
		"Review": "had a pleasant stay with my husband right after our wedding, free breakfast were good and acceptable, polite and approachable staff, too. The room AC was producing a little noise audible when TV and other stuff were turned off, though as a whole everything was good."
	},
	{
		"User": "VIRADOR",
		"Review": "Hotel is near to everywhere. Very good food and location"
	},
	{
		"User": "reynaldo",
		"Review": "We enjoyed our stay as we were conveniently accommodated by the friendly staff."
	},
	{
		"User": "Yamada",
		"Review": "Icant say anything,ilove all also the staff they are hospitality,and kind,the rooms are goods,service is nice,foods in the morning is very delicious,(buffet)iwanted to stay again at the apo view!!!"
	},
	{
		"User": "Romanoff",
		"Review": "Very close to restaurants, peoples park, very much cities where almost everything is there.. Nice!"
	},
	{
		"User": "Alan",
		"Review": "This place is old and needs upgrading. Our room had a nice bathtub but the water to the tub didn't work., 2 maintenance men couldn't get it to work. It took forever to get hot water in the shower, had to waste time waiting for it to get hot. No blow dryer in the room, we were told that they would send one, it never came. Called again to ask for a dryer and was told there wasn't one available because the hotel was full. No spares???? Got a dryer from a maintenance man who told us housekeeping had one, Terrible service! "
	},
	{
		"User": "Albert",
		"Review": "1st time to be in Apo View hotel...main lobby to hallway til our room not impressive as facilities and looks are outdated...even the ac, fixtures, etc...staff though esp at Entree are warm and caring...location is strategic...you can still see it's grandeur a couple of decades ago...pool is boring...no gym...garden could be great if this will be refurbished...wifi is dependable...old elevator...got scared when power went off and I was still inside....free buffet breakfast is good but you may still want more choices....hot chocolate and local delicacies will be a good mark for them...."
	},
	{
		"User": "Rosalina",
		"Review": "Pros: location, breakfast buffet Cons: fully booked hotel during our stay so complaints weren't answered instantly, but eventually."
	},
	{
		"User": "Paolo",
		"Review": "pool area needs renovation. customer service is impressive. "
	},
	{
		"User": "Donald",
		"Review": "Very nice place for the money, quiet and clean. Short walking distance to Gaisano Mall. "
	},
	{
		"User": "Nestor",
		"Review": "Check in process takes long since there is only one officer assigned in the front desk.....it is a waiting game"
	},
	{
		"User": "Julius",
		"Review": "My family loved it here especially my little ones. They so loved it here. The staff, the place and the food are all lovely. Our stay was all woryh it. Wil definitely come back here. Thank you for the great service. "
	},
	{
		"User": "Rodante",
		"Review": "They have a shuttle service going to Airport but you need to pay for it 150pesos per head. "
	},
	{
		"User": "GLENDA",
		"Review": "poolside is slippery. something must be done about it. very dangerous for kids."
	},
	{
		"User": "Darren",
		"Review": "Clean friendly, spacious, what more can I ask for :) Thanks"
	},
	{
		"User": "Ian",
		"Review": "Can't really complain about the hotel everything was good as can be expected in Davao - even the ongoing painting work was done with minimum inconvenience. Davao has a strict smoking policy, even outside, which I cannot disagree with too much despite being a smoker myself. My issue is the absurdness of the policy and wondering what it is trying to achieve. So if you are new to Davao and smoke please be aware."
	},
	{
		"User": "Eva",
		"Review": "Nice, clean and comfortable hotel with swimming pool that kids (and adults) can enjoy. Although, we encounter a little problem with the aircon on the second night but the staff immediately gave us another room. "
	},
	{
		"User": "Randy",
		"Review": "We cancelled our trip to Davao so technically we didn't use the room we reserved on Agoda. However to our surprised, we got a friend who stayed there and asked us if we push thru with our trip to Davao cause someone has used our name and stayed on our room. We didn't know how the management of that hotel let somebody stay on someone's room at the expense of the later! We paid for those rooms and the management upon knowing that we won't probably come, let someone just used the rooms we reserved and paid! Worst hotel we've ever known"
	},
	{
		"User": "Rhea",
		"Review": "My children enjoyed the pool. Location is near Davao Doctors hospital and Mall."
	},
	{
		"User": "Venice",
		"Review": "the front office team are very friendly. they do entertain my baby whenever he is throwing his tantrums. unfortunately, i forgot the name of the pretty lady for me to commend. the buffet selection are all enticing. the bad experience i had begins with the tv channels are not working properly. we called several times for them to fix. wifi is also poor although we called the attention of the it already. the cot looks dirty, old and have bite marks on the metal from previous babies who used it. no hand shower. "
	},
	{
		"User": "Ana",
		"Review": "The Apo View Hotel has achieved icon status among hotels in Davao simply because it is the oldest. It continues to live up to its standard though, with nice rooms and relatively well-kept facilities. I got my room for cheaper than its normal rate, which made my stay even better."
	},
	{
		"User": "Denise",
		"Review": "It was difficult to access the internet amd when accessed it was so slow. I was asked to go down to the lobby to send an email. Good thing I was not there on business. Although the bathroom amenities were not complete (still had to call for them to complete it) the hotel was clean, the room was big and there was a pool where the little one enjoyed. "
	},
	{
		"User": "stephen",
		"Review": "the hotel is one of those hotels that would have been world beater in its day. now needs new carpet and a face lift. looking a bit tiredd. still offers goid breakfsst andx was comfortable. staff were friendly and obviously had some training. will stay here again"
	},
	{
		"User": "Laurent",
		"Review": "We booked two rooms for one night by error on agoda, we wanted to book one room for two nights. We tried to modificate it on agoda but no way. One hour after the booking we gone to the hotel to explain the problem and to ask the management to change it. My wife talked to the receptionist as soon as we got to the hotel, that I accidentally booked the two rooms, and the receptionist looked for the rooms which available for us but she was not listened what my wife told her at first, as she process the rooms to checked in. I was confused because she give us the two key card and I told her again that we wanted to change the date of the other room instead, but then the receptionist told us that we must told her first before she did check in our room nor doing it via Agoda which I used for booking to cancel the ther room. We stayed on this hotel last week for four nights. And in every room we encountered has a problem but we just ignore them, what hesitate us the most is they don't help us us their guests. And even to talk to the manager I haven't because the receptionist just talked to him/her They don't treat their best guests with respect. This hotel was one of the best in Davao many years ago now it's going down and down year after year. We stayed in several rooms during these past days. In each one has an problem with WiFi which is very slow in the rooms and only working on half time. The hot water is coming only after long and long minutes if you are lucky. If not only cold water available. The faucet is loose and the sink was stuck the water. In two rooms the water evacuation in the bathroom was not working"
	},
	{
		"User": "Jon",
		"Review": "Hot water for baths or the lack of is always an issue when I stay at the mt. Apo. But I like it for various reasons including location and a wonderful dinning area with good food. "
	},
	{
		"User": "harah",
		"Review": "elevator is old, bathroom at hallway smells awful, no hot water.. the room is ok but the card key sometimes does not work we have to wait for the staff to get the master card key.. food is nice but i'm sure will not stay there again..."
	},
	{
		"User": "Peter",
		"Review": "Very nice hotel.. staff are very friendly and accommodating. Will recommend this hotel in Davao city."
	},
	{
		"User": "Peter",
		"Review": "Nice hotel"
	},
	{
		"User": "Peter",
		"Review": "Nice hotel, location is good , staff are friendly and accommodating."
	},
	{
		"User": "Peter",
		"Review": "Very nice hotel.. still worth the value for money."
	},
	{
		"User": "ENRICO",
		"Review": "Old and run down. This hotel needs major renovation. Smells bad. The pool was closed and we were not informed by Agoda that the pool was closed. It mentioned that the hotel have a swimming pool but it did not mention that the pool was under maintenance for the whole duration of our stay. I feel ripped-off for not being informed that their swimming pool was closed and under maintenance. Agoda should mention in their site that the pool is closed for maintenance. The elevator smells so bad. I will not recommend this place if no major renovation is done."
	},
	{
		"User": "VEN",
		"Review": "Air condition has an awkward smell, obviously the air passage is not clean at all !!! It make the whole room smell so bad. No hot shower !! Called reception to compalin twice but they never call back to me to inform what happen. No technician were sent to check. The next morning saw ppl were calling to the reception to complain about no hot shower. The water tab was so loose as well...hit and cold label only with a piece of white cellophone tape. Got a video of it. No worth for money i paid rm300 for it...i want a refund !! The worst experience ever"
	},
	{
		"User": "Chrisel",
		"Review": "A few tiny cockroaches running around my room. "
	},
	{
		"User": "NORJIAMINAH",
		"Review": "went to davao on a business trip and checked in at the apo view hotel.. booked the supreme room and got the value of my money.. the room is clean and staff are immensely courteous..we enjoyed their buffet breakfast, so many delicious food to choose from"
	},
	{
		"User": "eusebio",
		"Review": "No hot water in bathroom No kettle for coffee. Pool needs rehab Breakfast not so good. Pathway from Restaurant to Lift area stinks. STAFF EXCELLENT very helpful and accomodating. 5 star Service."
	},
	{
		"User": "Rhea",
		"Review": "satisfied with our stay.."
	},
	{
		"User": "Allison",
		"Review": "Good location. Great breakfast spread. Overall hotel ambiance is okay. "
	},
	{
		"User": "peter",
		"Review": "There was no hot water....and no attempt to explain or fix this"
	},
	{
		"User": "Raine",
		"Review": "Good Deal for a low Price"
	},
	{
		"User": "Lincoln",
		"Review": "Execellent value for money. The room was clean and tidy. Short drive to the town centre. Would stay again. Highly recommended "
	},
	{
		"User": "SULTAN",
		"Review": "Housekeeping must be revamp. Very lousy. This facet drowns the good features of the hotel such as the terrific waiters and the respectful security from whom the concierge staff could learn a lot. The management must continue the kind of service under Sonny Pamintuan . Apo view is not just a hotel. It is one of the city's landmarks. "
	},
	{
		"User": "Carmencita",
		"Review": "Been here for the nth time. I am very comfortable in this hotel"
	},
	{
		"User": "Carmencita",
		"Review": "Apo View Hotel is my home away from home. I need not say more."
	},
	{
		"User": "Julito",
		"Review": "While this is a reliable hotel for us as a family who needs ample parking space, the hotel in general looks old and tired. Needs some major refurbishing. "
	},
	{
		"User": "MARK",
		"Review": "Love the buffet breakfast"
	},
	{
		"User": "chona",
		"Review": "Location is great. Dirty, old and noisy hotel! Looks can be deceiving! Worst...worst...worst...hotel"
	},
	{
		"User": "hok",
		"Review": "Location ok. Pretty central to most places. Took a shower on arrival and bathroom flooded within a few minutes. Had to wait 5 hours with 4 follow up calls before anything was done. No instructions on how in room safe worked and took several hours and several calls before anyone came. Had to constantly request bath, hand and face towels from housekeeping on a daily basis. Breakfast buffet always luke warm, never hot."
	},
	{
		"User": "brett",
		"Review": "Room is good ,breakfast is good but a bit expinsive if you want to eat there buffet dinner,.nice staff and helpful..."
	},
	{
		"User": "Edwin",
		"Review": "Location and Cleanliness is well maintained."
	},
	{
		"User": "Edwin",
		"Review": "Location and cleanliness is very good"
	},
	{
		"User": "Joseph",
		"Review": "I may have been unlucky that night but there was no hot water, dirty towels, no lock box, no view, and no wifi. Only thing I enjoyed was the free breakfest. "
	},
	{
		"User": "consolacion",
		"Review": "Pros: location, breakfast buffet, big rooms Cons: bathroom fixtures need repairs, hot water shower cold, front receptionists not accomodating doesnt even smile unlike in other davao hotels, "
	},
	{
		"User": "Percival",
		"Review": "."
	},
	{
		"User": "EDLIN",
		"Review": "I was here like 12-13 years ago and was back last week but the experience was like centuries apart (sorry for the exaggeration) and i was very disappointed.... given only a single keycard so if you accidentally leaves your card behind you have to ask fo assistance from front desk... free wifi is very poor... worst is the shower..... oh my god....if you turned the knob to the right you get cold water but if you turn the other side youll get freezing water... no choice either way... and drainage system is so poor that if you take a 15minutes shower youll end up having a foot deep water in your tub.... its hilariously disappointing...."
	},
	{
		"User": "Ghemar",
		"Review": "This is a \"has been\" hotel that retained its expensive price only due to its popularity during the old days. Furnitures are old, toilet and bath needs refurnishing, internet is low. The way to the elevator in the GF is way too far from the reception with a not so pleasing environment. dark and dirty and feels like a sidewalk alley."
	},
	{
		"User": "Celabel",
		"Review": "Good for family, large bed and large room. We had asked for room service to clean the room again (upon arrival) because my son has allergic rhinitis, and the staff was really kind about it. They cleaned and wiped the room just to accommodate our request."
	},
	{
		"User": "ryan",
		"Review": "Overall enjoyed our stay "
	},
	{
		"User": "Ryan",
		"Review": "K"
	},
	{
		"User": "villanueva",
		"Review": "It's clean but old . Good location "
	},
	{
		"User": "Sherdon",
		"Review": "rooms are ok, but can improve. needs renovation. aircon a little bit noisy. rooms are dark."
	},
	{
		"User": "SOPHIAN",
		"Review": "Went to stay there on the 13 Jan to the 14 Jan 2017. Overall their amenities such as the hot water never properly work so I had to cold shower the whole time. Breakfast was ok but needs more choices if possible. The mini fridge bar was empty inside which was a first time experience for me. Outside windows and room was very clean which is the good point about the hotel. Place looks a bit old but comfy. Aircon was not that cold compare to what I'm used to. Staff were courteous and had a great smile. "
	},
	{
		"User": "Neneth",
		"Review": "The location of this hotel was perfect, close to everything. The restaurant and the staff were great. However, it ends there. The rooms are old and needs to be updated. "
	},
	{
		"User": "Neneth",
		"Review": "Firstly, the rooms, facilities and hallway carpets are too old, it needs replacement. Secondly, the security guards at the hotel door was inconvenient esp when they open your suitcases full of unwashed clothes & your bras & underwear starts falling. They need to buy an xray machine same from the airport xray machines. The only good thing about this hotel is the location so close to everything and the restaurant. The staff are attentive, polite and friendly. "
	},
	{
		"User": "Jon",
		"Review": "You ask too much. "
	},
	{
		"User": "Mohammad",
		"Review": "In the heart of davao city . Near to the down town "
	},
	{
		"User": "Elsbeth",
		"Review": "the hotel is at center so very convenient for exploring Davao. The staff were nice. The hotel is renovating but it is not an excuse for a broken water heater. First time to use pail and dipper in a hotel for hot water. Also, smells like paint. "
	},
	{
		"User": "REJEAN",
		"Review": "Advantage for location, need to upgrade room facilities "
	},
	{
		"User": "Pia",
		"Review": "Location stood out for us. Toilet seat was dirty upon check in. Fascilities should be better considering the price we paid for a deluxe room. "
	},
	{
		"User": "Paolo",
		"Review": "Cockroaches, no heater, old appliances."
	},
	{
		"User": "ROBERTO",
		"Review": "Food is salty and hard to call front desk. Staff does not attend to your needs despite - several follow ups "
	},
	{
		"User": "Eliza",
		"Review": "Location is near Aldivinco, Gaisano Mall. Dencia's, Penong's and other good restaurants. It would be good if the hotel has gym so the guests can exercise. Breakfast buffet is good. All the staff, from the guards, receptionists and concierge are courteous and very helpful. It is better if they will remove the carpets in the rooms, not good for guests with allergies. I didn't had the chance to view Mt. Apo because the breakfast is located at the ground floor. "
	},
	{
		"User": "Dave",
		"Review": "Friendly staff front desk and dining people. Long walk in the lobby to access higher floors. Quiet room stay. Old furniture needs painting. No flat iron on room. Friendly housekeeping. 7/10 rating...."
	},
	{
		"User": "Antoniette",
		"Review": "Standard hotel, clean, good facilities"
	},
	{
		"User": "Eula",
		"Review": "The hotel is not good. Maalikabok, at mainit ang aircon. Di ako nkatulog for 2 days. Will not"
	},
	{
		"User": "ARIEL",
		"Review": "The color of the room is very blunt and the shower is defective however the breakfast is very nice..."
	},
	{
		"User": "Hatem",
		"Review": "Location is good Very noisy at day time Wifi very weak Old hotel "
	},
	{
		"User": "Marie",
		"Review": "Staff were sensitive to our needs especially those at the restaurant. Those at the front desk we're welcoming and efficient. "
	},
	{
		"User": "Sharina",
		"Review": "The Deluxe room is very spacious, and clean when I checked in. It could have been better if the toilet was cleaner and the toilet bowl didnt have any stains. I do love their pool but floor tiles were slippery, not very safe. Front desk staff could have been consistent in giving out room rate info. Overall, it was okay."
	},
	{
		"User": "Fred",
		"Review": "Except for location, this hotel offers nothing worthwhile. Everything is antiquated and barely working and the food offerings are abysmal"
	},
	{
		"User": "Jonathan",
		"Review": "We'll not go back again."
	},
	{
		"User": "Julito",
		"Review": "While this is an old hotel, Apo View Hotel still shows its glory with its friendly and accommodating staff. The hotel looks tired inside but definitely will come back due to the nice location and friendly staff."
	},
	{
		"User": "jessa",
		"Review": "Accommodating staffs. Good location. Old Hotel. Nice swimming pool. My kids enjoying their stay."
	},
	{
		"User": "Eliezer",
		"Review": "Nice place to relax and centrally located. Near shopping centre and very convenient. Friendly Staff."
	},
	{
		"User": "Kumar",
		"Review": "The breakfast buffet could use perking up"
	},
	{
		"User": "Edwin",
		"Review": "Staff are very courteous, the location is very good, the facilities are clean..."
	},
	{
		"User": "Lina",
		"Review": "nothing else"
	},
	{
		"User": "ANGEL",
		"Review": "overall rating-satisfactory"
	},
	{
		"User": "Marivel",
		"Review": "Friendly staff.Clean room."
	},
	{
		"User": "Lina",
		"Review": "the facilities are already old and so arethe rooms, but theyarebeing kept clean and well equipped with amenities. i like the receptionists being very helpful and accomodating. "
	},
	{
		"User": "NORMA",
		"Review": "value for money with accommodating staff "
	},
	{
		"User": "Jeremy",
		"Review": "Overall we were very impressed. And the breakfast was delicious and had a huge selection."
	},
	{
		"User": "marife",
		"Review": "Staff are accomodating , the lobby needs an upgrade but the cleanliness iis ok"
	},
	{
		"User": "DONALD",
		"Review": "APO VIEW HOTEL IS AN OLD HOTEL, BUT IT STILL AN ICON IN DAVAO AND A LANDMARK WITH THE TRADITIONAL DAVAO SPIRIT. THE ROOMS AND FACILITY ARE CLEAN, WITHIN INTERNATIONAL STANDARD. THE STAFF ARE FRIENDLY AND CAN COMMUNICATE WELL IN FOREIGN LANGUAGE. "
	},
	{
		"User": "Jose",
		"Review": "Nice "
	},
	{
		"User": "gerald",
		"Review": "Free breakfast buffet but only for two person. And they charged us 500php for excess person. Breakfast Food doesnt taste good. "
	},
	{
		"User": "Janalle",
		"Review": "location is ok"
	},
	{
		"User": "jojo",
		"Review": "I booked thru agoda jun 29 to jul 2 for a total rate of P11400. After a few days, I booked my office mate with the same date and accomodation for a total of P9218.61 only. During check in we was inform that existing hotel rate at P2500 per day. Giving me headache how to justify our different rates."
	},
	{
		"User": "javier",
		"Review": "By far one of the best experience I have so far, I had stay in other Hotel like Marco Polo, but this hotel is the best in price supper clean, the staff were very friendly and helpful in all.. the the breakfast blow my mind the variety of to choose from it. I rate this hotel a most to stay to experience all Davao have to show without blowing up the wallet..."
	},
	{
		"User": "Emilie",
		"Review": "I was very disappointed...i booked 3 rooms in one night.as soon as they opened the rooms smells comes out. Moldy smell. Yack...."
	},
	{
		"User": "Marie",
		"Review": "A bit expensive "
	},
	{
		"User": "Joan",
		"Review": "Good"
	},
	{
		"User": "Joan",
		"Review": "Good"
	},
	{
		"User": "Estrellita",
		"Review": "Thanks"
	},
	{
		"User": "Christopher",
		"Review": "I went there to treat my girl friend to hot bubble bath for her birthday.they had no hot water and didn't really care...with my free breakfast they send me outside to a private conference for breakfast...when I walked in they all laughed at me so embarrassing...they should of seen I'm not with the conference...I went back to pinnacle hotel much better and nicer ..and better breakfast I would never go back to apo view I've had better for 1000 paso"
	},
	{
		"User": "Merelyn",
		"Review": "Service in poolside very slow .Hallways no aircondition.The glass windows overlooking the city very dirty.I don't think I will be going back there."
	},
	{
		"User": "Neneth",
		"Review": "No hot water and Internet connection wasn't working in our room and breakfast buffet was limited in terms of choices. The place is run down need upgrading. Although, Staff were good, attentive with our requests. The buffet dinner on Saturday night was enjoyable and location to the CBD was great. I think based on what we paid , it's quite an expensive hotel. "
	},
	{
		"User": "Ellen",
		"Review": "I used agoda for booking so my accommodation's receipt is with agoda's. The receptionist told me that when I asked for an official receipt . So ok. But I was only issued with PROVISIONAL receipt for my 1800 excess bill for the food and all. My bad I didn't dare to check what's inside the the envelope because I was with my toddler who kept on running, so I hurriedly took the envelope (thinking that the official receipt was inside since I asked.the the O.R). Then I drove off after all my stuff were all in the truck. I just checked the envelop upon arriving home. Upsetting, of all the hotels which I stayed in my entire life, this is the only hotel that gave me provisional receipt when I asked for an OR! A piece of advice, double check the receipt before leaving especially if u need it. "
	},
	{
		"User": "Michael",
		"Review": "Friendly staff, good value. Views from pool side side rooms much nicer(other side you see tightly packed shacks). "
	},
	{
		"User": "Rodolfo",
		"Review": "The Hotel in general is superb (food, service, security and cleanliness). The only negative in this hotel is their wifi (slow and unstable)"
	},
	{
		"User": "Escolastico",
		"Review": "Affordable 😎"
	},
	{
		"User": "Galileo",
		"Review": "The room is not good. Theres a bad smell. And the lights are not functioning all."
	},
	{
		"User": "Rencel",
		"Review": "room, Location, food"
	},
	{
		"User": "nenita",
		"Review": "Eating places around are nice and cheap with good food. Nice hotel with casino to entertain you"
	},
	{
		"User": "Marc",
		"Review": "We arrived and we expect a well courteous welcome from the front desk considering it is a 4 star hotel and a famous one in the area. but we received a cold treatment upon check in and check out. But some staff are well accomodating. "
	},
	{
		"User": "IVAN",
		"Review": "Sad to see how this one time excellent property is going down. Rooms/furniture are quite old, poor quality of mattress, and I have to call the attention of the housekeeping almost every night to fix some issues. "
	},
	{
		"User": "Janet",
		"Review": "No one assist our baggage, no free coffee inside the room...food ok lang"
	},
	{
		"User": "Rencel",
		"Review": "Nce food, room and view"
	},
	{
		"User": "Lyle",
		"Review": "They gave me a room that looked like it was under construction. Shorted me towels that have a high price tag if you are charged for them. I complained and finally the manager gave me the better room I paid for. I had to open my suitcase outside for security to search. First time I ever had a hotel do that to me. Bad bfast and service. I would not recommend this hotel nor stay at it again."
	},
	{
		"User": "John",
		"Review": "Over priced for the condition of the facility. Poor workmanship on repairs. Too hot in hallways. Location very good for local eateries. Would not recommend to a friend."
	},
	{
		"User": "peter",
		"Review": "All the staff are friendly.The service is excellent."
	},
	{
		"User": "husain",
		"Review": "\r nice staff .... no ac in corridors.... good breakfadt"
	},
	{
		"User": "hsinchang",
		"Review": "convinent to go mall"
	},
	{
		"User": "Yvette",
		"Review": "\r it is the location "
	},
	{
		"User": "IRA",
		"Review": "\r Location, Food, Comfort"
	},
	{
		"User": "Siva",
		"Review": "It will ideal if a welcome drink can be offered to staying guest."
	},
	{
		"User": "Abiden",
		"Review": "I know that Apo View Hotel is one of the oldest hotel in Davao, i can accept that some of the structures are warned out and walls that needs to be re painted. But the worst part during my stay was cockroaches everywhere particularly the washroom. Sorry is not the answer to the problem, they should do something to stop the problem. Hire a professionals to eliminate those creepy little things that wakes me up during my stay. "
	},
	{
		"User": "Lenel",
		"Review": "\r Comfort, location, good service"
	},
	{
		"User": "noel",
		"Review": "\r Location, Service and room"
	},
	{
		"User": "Teodoro",
		"Review": "\r Location and service."
	},
	{
		"User": "rebecca",
		"Review": "\r near our davao branch .... good food"
	},
	{
		"User": "raymond",
		"Review": "\r food, location to shops, access to Dr surgery"
	},
	{
		"User": "Darryl",
		"Review": "\r Good location, couteous staff, adequate parking space"
	},
	{
		"User": "James",
		"Review": "\r Buffet Ok"
	},
	{
		"User": "Christopher",
		"Review": "\r Location "
	},
	{
		"User": "CASSIS",
		"Review": "I'm not satisfied. The value for money isn't what i was hoping for. My room smell like bleach, i purchase nearby grocery for an air freshener. I could hear our neighbors from my room. Other hotels are cheaper and is way quite nicer than this. Elevators not working properly, when i arrived there out of 3 available only 1 is allowed for guest and the other is a service elevator, the other one is out of order."
	},
	{
		"User": "Perdeoan",
		"Review": "Not good, swimming poolis under repair. No hot shower. They provided us a filthy room and when we complained, that's when the hotel transferred us to a better room."
	},
	{
		"User": "Jasmi",
		"Review": "\r Cozy, friendly and accessable"
	},
	{
		"User": "raymond",
		"Review": "\r staffs are friendly, foods are great and location is just at the center of the city"
	},
	{
		"User": "Noel",
		"Review": "\r Met expectations for room cleanliness, food quality and staff service. "
	},
	{
		"User": "Roderick",
		"Review": "\r Near dining places"
	},
	{
		"User": "Roderick",
		"Review": "\r Near dining places."
	},
	{
		"User": "Mitchell",
		"Review": "\r Still has its old ambience from the 80's"
	},
	{
		"User": "arnold",
		"Review": "\r near the city"
	},
	{
		"User": "Randall",
		"Review": "\r buffet was good"
	},
	{
		"User": "moonsuk",
		"Review": "\r good location, clean, kind"
	},
	{
		"User": "Jemila",
		"Review": "\r Good location, very nice staff"
	},
	{
		"User": "Joseph",
		"Review": "\r the staff,cleanliness,food"
	},
	{
		"User": "Donald",
		"Review": "\r The room was nice, swimming pool was very big, Buffet was ok very good Ham and Cheese Omelet."
	},
	{
		"User": "Armando",
		"Review": "\r The breakfast buffet was great, the bar with live band was great and the pool was really nice."
	},
	{
		"User": "Elvira",
		"Review": "\r The food, the restaurant and the dining. "
	},
	{
		"User": "CHING",
		"Review": "\r landmark of the city, friendly staff, need renovation "
	},
	{
		"User": "greg",
		"Review": "\r room was clean and bed comfortable"
	},
	{
		"User": "Robert",
		"Review": "\r Restobar"
	},
	{
		"User": "Fernando",
		"Review": "\r 1-Location 2-Location 3-Location"
	},
	{
		"User": "ALFREDDO",
		"Review": "\r Location"
	},
	{
		"User": "Glenn",
		"Review": "\r Breakfast is good, location is central to my meetings. The staff speaks english well. The rooms are a little old though."
	},
	{
		"User": "Graeme",
		"Review": "\r Very professional staff, high quality room and great restaurant"
	},
	{
		"User": "Randal",
		"Review": "\r room, comfort, staff"
	},
	{
		"User": "Rencel",
		"Review": "\r Room, View, Locaiton"
	},
	{
		"User": "Rencel",
		"Review": "\r Rooms, View, Location"
	},
	{
		"User": "Glenn",
		"Review": "\r Good location, has a nearby park and shopping complex"
	},
	{
		"User": "John",
		"Review": "\r breakfast buffet, location to local restaurants and nightlife, fast check out"
	},
	{
		"User": "jay",
		"Review": "\r Food casino and relaxiarion"
	},
	{
		"User": "Ma.",
		"Review": "\r Aside from having a casino,lace is quiet and clean "
	},
	{
		"User": "Mohammed",
		"Review": "\r breakfast , breakfast , breakfast"
	},
	{
		"User": "ANDRAE",
		"Review": "\r Location and Casino, not the best place to stay."
	},
	{
		"User": "Scott",
		"Review": "\r Pool, Price, Location."
	},
	{
		"User": "rey",
		"Review": "\r Very good location, cordial staff and clean rooms"
	},
	{
		"User": "EMERIC",
		"Review": "\r Close to shopping areas and nice restaurants, attentive staff, comfotrable rooms"
	},
	{
		"User": "Rosalie",
		"Review": "\r strategic location"
	},
	{
		"User": "Dennis",
		"Review": "\r Location, Staff, Eagles"
	},
	{
		"User": "rosa",
		"Review": "\r proximity to our conference area, best agoda price on last minute booking, clean room"
	},
	{
		"User": "Jerome",
		"Review": "\r good food, accessibility to main city and cost of buffet is quite high"
	},
	{
		"User": "Wei",
		"Review": "\r clean, convenient, nice hotel"
	},
	{
		"User": "EUGEN",
		"Review": "\r restaurant and casino"
	},
	{
		"User": "David",
		"Review": "\r Friendly staff who are always smiling, clean rooms"
	},
	{
		"User": "Jeafrey",
		"Review": "\r Good location, clean and the staff are friendly"
	},
	{
		"User": "Donnis",
		"Review": "\r Restaurant"
	},
	{
		"User": "Umida",
		"Review": "\r nice place to hangout "
	},
	{
		"User": "Neil",
		"Review": "\r Staff, Accomodations, Resteraunt"
	},
	{
		"User": "mark",
		"Review": "\r the buffets are superb"
	},
	{
		"User": "Oliver",
		"Review": "\r Located at the center of this big city, so access is good."
	},
	{
		"User": "SHIRLY",
		"Review": "\r walking distance to some spot in davao"
	},
	{
		"User": "John",
		"Review": "\r Good food, nice breakfast buffet"
	},
	{
		"User": "JASON",
		"Review": "\r Near everything"
	},
	{
		"User": "Josephine",
		"Review": "\r Location and service is great"
	},
	{
		"User": "Antonio",
		"Review": "\r Great service, warm and friendly !"
	},
	{
		"User": "Andrew",
		"Review": "\r Large rooms, big pool for swimming, good location"
	},
	{
		"User": "Romeo",
		"Review": "\r Good location (just beside People's Park and walking distance to Bangkerohan where you can buy fresh fruits at a very cheap price)"
	},
	{
		"User": "Francis",
		"Review": "\r feeling of unsecured"
	},
	{
		"User": "John",
		"Review": "\r many establishments near the hotel"
	},
	{
		"User": "John",
		"Review": "\r newly renovated and very reasonable price"
	},
	{
		"User": "Glenn",
		"Review": "\r proximity to other significant establishments"
	},
	{
		"User": "JOAN",
		"Review": "\r i love the food esp.our bfast and dinner buffet my clients said its f best buffet"
	},
	{
		"User": "Mark",
		"Review": "\r Service, quality of the room, friendliness & professionalism of the staff."
	},
	{
		"User": "Gilbert",
		"Review": "\r Good location; reasonably priced"
	},
	{
		"User": "Glenn",
		"Review": "\r Great location"
	},
	{
		"User": "andrew",
		"Review": "\r central area"
	},
	{
		"User": "Abiden",
		"Review": "\r Location is perfect"
	},
	{
		"User": "ivan",
		"Review": "\r location is dead city center."
	},
	{
		"User": "Eliseo",
		"Review": "\r within reach of bars shopping malls and restaurants"
	},
	{
		"User": "jean",
		"Review": "\r big clean rooms"
	},
	{
		"User": "Melecio",
		"Review": "\r the pool"
	},
	{
		"User": "jean",
		"Review": "\r Good location"
	},
	{
		"User": "Stephen",
		"Review": "\r room"
	},
	{
		"User": "Raymund",
		"Review": "\r fast room service, lousy internet"
	},
	{
		"User": "Sin",
		"Review": "\r Nice restaurants nearby"
	},
	{
		"User": "Sin",
		"Review": "\r Peaceful"
	},
	{
		"User": "Nilo",
		"Review": "\r very accessible and in the downtown area"
	},
	{
		"User": "Donald",
		"Review": "\r staff very freindly very good with evrything they had to work with"
	},
	{
		"User": "Jennifer",
		"Review": "\r Great rooms with free brakfast"
	},
	{
		"User": "Thomas",
		"Review": "\r Lots of pillows and towels"
	},
	{
		"User": "yoriyoshi",
		"Review": "\r Location is very good"
	},
	{
		"User": "Evelyn",
		"Review": "\r the food very nice,.."
	},
	{
		"User": "Arthur",
		"Review": "\r Good service and selection of food at the restaurant and the great taste of its brewed coffee"
	},
	{
		"User": "jonas",
		"Review": "\r well known classic in davao"
	},
	{
		"User": "dale",
		"Review": "\r Large rooms, great beds and a great buffet"
	},
	{
		"User": "Evelyn",
		"Review": "\r breakfast very nice"
	},
	{
		"User": "James",
		"Review": "\r Very nice resturant and great staff"
	},
	{
		"User": "Romulo",
		"Review": "\r Room size is generally big compared to the other hotels in the are. Newly refurbished but can still be improved"
	},
	{
		"User": "Steven",
		"Review": "\r good location, friendly staff, large rooms"
	},
	{
		"User": "Mishkath",
		"Review": "\r Walking distance to Restaurants and Shopping centers and 15 mins from Arirport"
	},
	{
		"User": "Jayson",
		"Review": "\r Excellent staff, good security"
	},
	{
		"User": "May",
		"Review": "\r location"
	},
	{
		"User": "analyn",
		"Review": "\r it is in the heart of the city"
	},
	{
		"User": "Adrian",
		"Review": "\r Good location. "
	},
	{
		"User": "Gloriecar",
		"Review": "\r Comfortable room, complete with amenities, good service by the staff"
	},
	{
		"User": "Neil",
		"Review": "\r Good Security"
	},
	{
		"User": "AGNES",
		"Review": "\r Good breakfast"
	},
	{
		"User": "Minviluz",
		"Review": "\r Llocated at the heart of the city! Very accessible anywhere you go in davao. "
	},
	{
		"User": "muthuswamy",
		"Review": "\r near to shopping "
	},
	{
		"User": "Marco",
		"Review": "\r Great location, clean rooms, excellent food"
	},
	{
		"User": "alma",
		"Review": "\r Very clean & safe, nice furnitures"
	},
	{
		"User": "Rogelio",
		"Review": "\r restaurant and front desk plus the blue room"
	},
	{
		"User": "dongkyun",
		"Review": "\r location/security"
	},
	{
		"User": "Joanne",
		"Review": "\r Central location"
	},
	{
		"User": "NIno",
		"Review": "\r Nice Location"
	},
	{
		"User": "Min",
		"Review": "\r good 2 stay "
	},
	{
		"User": "Tim",
		"Review": "\r Beautiful relaxing environment close to the airport, pleasant mini-resort type layout, excellent spa package"
	},
	{
		"User": "Jeremy",
		"Review": "\r I loved the outdoor garden part of the hotel "
	},
	{
		"User": "Des",
		"Review": "\r Excellent service att he Breakfast buffet"
	},
	{
		"User": "Russel",
		"Review": "\r huge rooms"
	},
	{
		"User": "Brent",
		"Review": "\r Close to the peoples park, nice beds and linnen."
	},
	{
		"User": "Wai",
		"Review": "\r Best Features are the Massage service 24 hrs"
	},
	{
		"User": "Sonia",
		"Review": "\r Hospitality is great, clean surroundings and location is near to tourist places, airport"
	},
	{
		"User": "Takashi",
		"Review": "it is easy to move mid-city. good location to go shopping."
	},
	{
		"User": "Ricky",
		"Review": "\r Location"
	},
	{
		"User": "Lorelei",
		"Review": "\r Location"
	},
	{
		"User": "Barry",
		"Review": "\r Location"
	},
	{
		"User": "Kenneth",
		"Review": "\r Spacious rooms "
	},
	{
		"User": "Eric",
		"Review": "\r Excellent location if you want to be in Central Davao"
	},
	{
		"User": "Leiv-Erik",
		"Review": "\r Location"
	},
	{
		"User": "Leopoldo",
		"Review": "\r Good Location"
	},
	{
		"User": "Bassam",
		"Review": "\r location in the center"
	},
	{
		"User": "Mark",
		"Review": "\r Great buffer dinner"
	},
	{
		"User": "Simon",
		"Review": "\r clean"
	},
	{
		"User": "Darren",
		"Review": "\r location"
	},
	{
		"User": "Yuki",
		"Review": "\r Location is very good."
	},
	{
		"User": "BLAIR",
		"Review": "\r friendly efficient staff, excellent rooms."
	},
	{
		"User": "karl",
		"Review": "\r big beds and right in city centre"
	},
	{
		"User": "BLAIR",
		"Review": "\r Location! "
	},
	{
		"User": "Sriphan",
		"Review": "\r Free wifi"
	},
	{
		"User": "Joseph",
		"Review": "\r Location"
	},
	{
		"User": "karl",
		"Review": "\r close to everything young people like"
	},
	{
		"User": "bandar",
		"Review": "\r The facilities"
	},
	{
		"User": "Sriphan",
		"Review": "\r location"
	},
	{
		"User": "Eduardo",
		"Review": "\r swimming pool"
	},
	{
		"User": "Judy",
		"Review": "\r Downtown and close to everything"
	},
	{
		"User": "Thomas",
		"Review": "\r good location, close to shopping and other businesses"
	},
	{
		"User": "Tetsuya",
		"Review": "\r There is the Casino in the hotel."
	},
	{
		"User": "Gary",
		"Review": "\r Outstanding dinner entertainment"
	},
	{
		"User": "phillip",
		"Review": "\r the service , and the bed"
	},
	{
		"User": "ROYCE",
		"Review": "\r Existing for more than 50 years"
	},
	{
		"User": "Martin",
		"Review": "\r Great Wi-Fi and it's free!! Good rooms and food."
	},
	{
		"User": "Ma.",
		"Review": "\r warmth of staff, room was just right, location"
	},
	{
		"User": "Marcelo",
		"Review": "\r Room Features are xcellent, Polite Hotel Staff with a smile"
	},
	{
		"User": "JOEL",
		"Review": "\r near peoples park and gaisano ilustre"
	},
	{
		"User": "Tom",
		"Review": "\r comfortable rooms and free wifi"
	},
	{
		"User": "Kevin",
		"Review": "\r Courteous workers"
	},
	{
		"User": "TIM",
		"Review": "\r The pool"
	},
	{
		"User": "TIM",
		"Review": "\r Pool great, food great , service no problems"
	},
	{
		"User": "ALI",
		"Review": "\r Hotel is quite busy as casino is within it premises. Staff are bit okay. Rooms not that much impressive but around passing score."
	},
	{
		"User": "Phoebe",
		"Review": "\r closed to the inside city park.inside city"
	},
	{
		"User": "Cherry",
		"Review": "\r hotel staff are accomodating and friendly"
	},
	{
		"User": "damir",
		"Review": "\r Cant found pros"
	},
	{
		"User": "ray",
		"Review": "\r none"
	},
	{
		"User": "Ruth",
		"Review": "\r The room was spaceous and clean. "
	},
	{
		"User": "Jeffrey",
		"Review": "\r Clean"
	},
	{
		"User": "johnny",
		"Review": "\r very strategically located downtown, you are near to where the action is"
	},
	{
		"User": "Espen",
		"Review": "\r ok"
	},
	{
		"User": "timothy",
		"Review": "\r the staff"
	},
	{
		"User": "Kenneth",
		"Review": "\r The hotel staff was nice and let my girl friend check in without me being there. "
	},
	{
		"User": "Russell",
		"Review": "\r Casino inside hotel. One of the best hotels in Davao."
	},
	{
		"User": "eddie",
		"Review": "\r Central City location,close to beaches,Good restraunt"
	},
	{
		"User": "Stephen",
		"Review": "\r centrally located, excellent food in in-house restaurant"
	},
	{
		"User": "Philippe",
		"Review": "La chambre est parfaite .Le personnel n est pas tres professionnel est aimable.La nourriture n est pas a la hauteur.Le pain etait rassis ."
	},
	{
		"User": "Sven",
		"Review": "Gutes Hotel um die Stadt zu erkunden. Casino im Hotel, Gaisano Mall und People's Park direkt daneben. Elektronische Türschlösser nicht mehr auf dem neusten Stand der Technik. Frühstück war befriedigend."
	},
	{
		"User": "Otto",
		"Review": "Im ersten Zimmer funktionierte das Warmwasser nicht. im zweiten Zimmer ließ sich die Klimaanlage nicht zurückschalten. Als meine Frau dann eine zusätzliche Decke verlangte, hieß es, die müsste zusätzlich bezahlt werden. Wir hatten diese Hotel in den vergangenen 35 Jahren schon öfter gebucht. Das Niveau wird immer schlechter. Wir werden dieses Hotel bei Besuchen in Davao nicht mehr buchen und können jedem Interessenten nur abraten!"
	},
	{
		"User": "Roland",
		"Review": "\r Lage. Personal. Sauberkeit "
	},
	{
		"User": "Bastian",
		"Review": "\r altes hotel"
	},
	{
		"User": "Stephan",
		"Review": "\r Babybett war kostenlos"
	},
	{
		"User": "Giovanni",
		"Review": "\r hotel lussuoso, tutti i servizi disponibili, casino"
	},
	{
		"User": "Demetrio",
		"Review": "\r Pulizia camera e veloce servizio in camera"
	},
	{
		"User": "geoffrey",
		"Review": "Looks better from the outside , the rooms can be cleaner , but still ok to stay"
	},
	{
		"User": "Gerarda",
		"Review": "Wel een luid volkje Pinoi."
	},
	{
		"User": "SHINYA",
		"Review": "古いホテルだが場所の利便性や価格からすると十分です"
	},
	{
		"User": "tadashi",
		"Review": "設備が古くで期待外れでした。 ホテル周辺には公園、日本食レストラン等はありしかしお勧めしない。"
	},
	{
		"User": "Takashi",
		"Review": "ロケーションはダバオの中心街で、治安は非常によく、両替、日本食レストラン、コンビニ、バーなど全てが徒歩圏内。タクシードライバーは皆知ってる歴史のあるホテルです。 問題は、ここはフィリピンなので、シャワーのお湯がぬるかったり、水回りが若干壊れていたりしているのが当たり前なこと。あと、日本語は無理なので、カタコトでも英語ができること。 しかしそれでもここは地元では有名ホテルの一つですので、大体はちゃんとしています。従業員がそれほど笑顔で挨拶してこないのもまぁ事実ですが、別に気にするほどのことはないです。 ダバオまで来る方はある程度フィリピンに慣れているでしょうから、格式から言っても十分なホテルです。 "
	},
	{
		"User": "marites",
		"Review": "今回は早期予約で3泊しました。最初の夜はシャワーのお湯が中々熱くならず、フロントに電話でお願いしたが、15分しても誰も来なかった。2日目のハウスキーピングでは、バスタオルの補充がひとつしかなく、3日目はバスマットがなかった。部屋自体は綺麗だが、サービス面はイマイチだと思います。なお、次回利用するか聞かれたら、多分利用しないと思う。"
	},
	{
		"User": "FUTOSHI",
		"Review": "シャワーの水が小雨程度で使えない。 改善要求するも対応無しです。 wifi はロビー以外まともに繋がりません。 空港までのシャトルバスは1人150ペソだと言われましたがタクシーなら180ペソですから2人以上ならタクシーを使うべきです。 建物や設備は古くてボロいです。 泊まる方は何も期待してはいけません。 "
	},
	{
		"User": "Atsuo",
		"Review": "カジノが併設されており、何年も使用しています。歩く距離にお気に入りのレストランが多数あるのも、早朝にリサール公園を散歩できるのも魅力。上層階がリニューアルされ素敵になっただけに、シャワーが熱くならないのが残念。"
	},
	{
		"User": "hirokazu",
		"Review": "朝食は素晴らしい！ でもネットは遅い ホテル全体がかなり古い 以前は素晴らしいホテルだったんだろうな"
	},
	{
		"User": "OGASAWARA",
		"Review": "ともかくスタッフの態度が悪いです。朝早く起きてスモーキングエリアに行く時にフロントの前を通るのですが、フロントの女性とベルボーイが雑談をしていて、挨拶も無し、お湯は出ない、鍵がカード式ですが壊れても持ってこない、チェックタイム時にベルボーイが来ないので、早くお願いしたが、他の部屋に行っていると、昔、宿泊した時は素晴らしかったが、次回は他ホテルにします。"
	},
	{
		"User": "Makoto",
		"Review": "5分はなれた　ロイヤルマンダヤホテルが満室だったので、後半はこちらに泊まった。思わず比較ししてしまったが、 笑顔がない、従業員全体が不機嫌そう　おそらく　給料が相対的に低いのかもしれない。　快適に過ごそうとおもうなら、同じ価格帯のマンダヤがいいだろう。空調がうるさい。"
	},
	{
		"User": "Seiji",
		"Review": "スタッフの対応はGood でしたが、設備が古く、シャワーのコックが破損していたり、タオルが用意されていなかったりして、今一の感じでした。"
	},
	{
		"User": "RYOHTA",
		"Review": "."
	},
	{
		"User": "masaaki",
		"Review": "今回は窓無しの部屋で残念だったが、近隣には飲食・両替・音楽パブ有り 公園もあり立地が良い。 お勧めはサウンドボックスのオカマショー出演日を確認していくべし。"
	},
	{
		"User": "MASAKI",
		"Review": "朝食がましなほうです"
	},
	{
		"User": "MASAKI",
		"Review": "朝食がましかな"
	},
	{
		"User": "MASAKI",
		"Review": "朝ごはんがまぁまぁです"
	},
	{
		"User": "AKIYASU",
		"Review": "部屋のドアがオートロックにもかかわらず、ロックされないことがしばしばで、部屋に貴重品を一切残さず外出せざるを得なかた"
	},
	{
		"User": "KIYOTAKA",
		"Review": "当たり前かもしれませんが、アゴダさんで安く予約しても部屋のサービス(ベッドメイキングやバスタオル有無,等)がチップの額でまったく違うことに驚かされました。現地サービスとはこのようなものでしょうか．．．。"
	},
	{
		"User": "Sato",
		"Review": "部屋によりwifi が使用出来ない。この件の対応が良くない。"
	},
	{
		"User": "toshimasa",
		"Review": "WIFIは、本当にエレベーターホール近くでしか使えない。部屋は古くて汚いけど、掃除は行き届いている。これは法律であるので仕方がないけど、館内でタバコがすえない。びっくりするのは、カジノでもタバコがすえない。当たり前のように　部屋のセキュリティーBOXが壊れていて使えなかったりしたけど、スタッフの対応が良いので　なんとか直してくれたり、WIFI環境のよい部屋が空いていたら、部屋を替わってくれたりする。"
	},
	{
		"User": "koji",
		"Review": "カジノがしょぼい"
	},
	{
		"User": "Sato",
		"Review": "お粥の有名店が近くにある。"
	},
	{
		"User": "MASAKI",
		"Review": "\r セキュリティが良い。カジノがある。タクシーがすぐある。街の中心"
	},
	{
		"User": "masaaki",
		"Review": "\r 食事・スタッフ・キングベット"
	},
	{
		"User": "Yuji",
		"Review": "\r きれいな部屋と優しいスタッフ立地も良いし満足でした。"
	},
	{
		"User": "Hiroyuki",
		"Review": "\r 環境がいい、設備の不満が無かった、Wifiなどの接続はよかった。"
	},
	{
		"User": "Hiroyuki",
		"Review": "\r 便利"
	},
	{
		"User": "yumi",
		"Review": "\r タクシーの運転手に名が知れている"
	},
	{
		"User": "Hiroyuki",
		"Review": "\r 買い物などは便利、空港からホテル名ですぐにいける、食事は美味い"
	},
	{
		"User": "Hiroyuki",
		"Review": "\r 部屋の手入れが行き届いていた。 レストランの食事が快適だった。 スタッフの対応が良かった。"
	},
	{
		"User": "Hiroshi",
		"Review": "\r 場所、スタッフの対応"
	},
	{
		"User": "Hiroyuki",
		"Review": "\r 部屋の手入れも行き届いていたし、レストランもバイキングスタイルで気楽に食事ができた、味の良く日本人には楽だと思う。"
	},
	{
		"User": "YOSHIO",
		"Review": "\r 俺と同じ年齢のホテルのため、少しはノスタルジ―を"
	},
	{
		"User": "Sato",
		"Review": "\r 部屋が改装されていて　すてきでしたが"
	},
	{
		"User": "KAZUKO",
		"Review": "\r 立地、コストパフォーマンス、スタッフ"
	},
	{
		"User": "Sachio",
		"Review": "\r 清潔、便利、名所"
	},
	{
		"User": "hiroshi",
		"Review": "\r 静かさ"
	},
	{
		"User": "Atsushi",
		"Review": "\r アクセス、豪華、快適"
	},
	{
		"User": "TAKAHIRO",
		"Review": "\r 立地条件　,　部屋の清潔さ　,　スタッフの対応の良い"
	},
	{
		"User": "Daisuke",
		"Review": "\r Wifi 選べる朝食　市内へのアクセス"
	},
	{
		"User": "Masahiro",
		"Review": "\r 部屋が広い。町の中心にあり全てが便利。横にピープルズパークがあり、祭りの準備、朝の体操の様子が見えて楽しかった。"
	},
	{
		"User": "hata",
		"Review": "\r バスタブ有り、静か、スタッフの対応"
	},
	{
		"User": "KAZUKO",
		"Review": "\r ロケーションは、抜群！！"
	},
	{
		"User": "takeo",
		"Review": "\r プールがあること"
	},
	{
		"User": "KAZUKO",
		"Review": "\r とにかくロケーションが最高。"
	},
	{
		"User": "Yasuhiro",
		"Review": "\r 部屋は快適に過ごせましたが、少し清掃に足りなさを感じました。"
	},
	{
		"User": "OSAMU",
		"Review": "\r スタッフが好意的でした"
	},
	{
		"User": "takeo",
		"Review": "\r 昔からの一流ホテル"
	},
	{
		"User": "yoshihisa",
		"Review": "\r 目の前に深夜まで営業の有名なレストランがあります"
	},
	{
		"User": "NORIIE",
		"Review": "\r 立地が良いところ。"
	},
	{
		"User": "toshiharu",
		"Review": "\r ダウンタウンに隣接して非常に便利な立地"
	},
	{
		"User": "TAKAKO",
		"Review": "\r 掃除の行き届いた気持ちの良い感じでした。"
	},
	{
		"User": "shu",
		"Review": "\r ネットに対してホーローも良し。フロント態様も文句なし。早朝のタクシー手配も正当な値段で有った。"
	},
	{
		"User": "KAZUKO",
		"Review": "\r 喫煙フロアがあること"
	},
	{
		"User": "JUNJI",
		"Review": "\r 場所がよい。周囲にレストラン、ファーストフード店が多数ある。"
	},
	{
		"User": "KAZUKO",
		"Review": "\r 古いホテルですが、最低限のリノベーションはされていて清潔でした。"
	},
	{
		"User": "ryuta",
		"Review": "\r 1階にあるレストランの朝食ブッフェがおいしい"
	},
	{
		"User": "toru",
		"Review": "\r ホテルのサービスの質、スタッフのサービス等"
	},
	{
		"User": "kazunori",
		"Review": "\r 部屋が申し分ないくらい綺麗だった。"
	},
	{
		"User": "KENICHI",
		"Review": "\r WIFI接続がまあまあ。"
	},
	{
		"User": "SUSUMU",
		"Review": "\r ロケーション最高。知名度も抜群。安心して泊まれるホテルです。"
	},
	{
		"User": "junichi",
		"Review": "\r ロケーションが良い、回りに大きなホテルも無く、ステータスを感じられる"
	},
	{
		"User": "SHINJI",
		"Review": "\r 繁華街のなかで買い物などが歩いて行け、とても便利"
	},
	{
		"User": "SHIGEHISA",
		"Review": "\r サラダが豊富"
	},
	{
		"User": "yuichi",
		"Review": "\r スタッフの気配りはよかった"
	},
	{
		"User": "yoshihito",
		"Review": "\r １階のレストランは綺麗に改装されていました。"
	},
	{
		"User": "tetsu",
		"Review": "\r 綺麗でした"
	},
	{
		"User": "MYUNG",
		"Review": "호텔은 크고 편의시설도 많습니다. 그런데 좀 오래되었네요! 좀 아쉽습니다."
	},
	{
		"User": "Willy",
		"Review": "God service and very polite people But the breakfast can be better not much to choose from "
	},
	{
		"User": "kwanhoo",
		"Review": "방이 넓고 깨끗함. 조식도 만족함. 시내에서 좀 떨어진 곳이나 전체적으로 금액 대비 훌륭함."
	},
	{
		"User": "Taehun",
		"Review": "가격대비 연식이 오래된 호텔 방크기 큰편이며 에어컨은 벽에내장되어있는 오래된 형식. 수영장은 고만고만. 다운타운 내에있어 접근성은 좋음. 가격이 좀 비싼것이 흠.... 조식 맛있음."
	},
	{
		"User": "YONG",
		"Review": "오래되었지만 시설관리가 잘 되어서 하루 지내기에 좋았습니다. 위치와 조식도 좋아서 내년 다바오 방문할 때 다시 책인할겁니다."
	},
	{
		"User": "Bent",
		"Review": "Slidt ældrehotel"
	},
	{
		"User": "Leif",
		"Review": "Boka via agoda och man får rummen ingen annan vill ha...vi bokade junior svit men först fick vi premium rum efter tillsägelse fick vi junior sviten men det var så mycket ljud i den från fläktar från utsidan att det var omöjlugt att vara inne där fick byta till ett tyst familje rum men med fönstren ut mot trafikerad gata."
	},
	{
		"User": "joon",
		"Review": "안락한 침대와 깨끗한 화장실, 에어컨 등 정돈된 실내 모든 것이 좋았습니다. 교통과 식당, 유흥 등 편리한 접근성과 주변에 슈퍼와 쇼핑센터, 맛사지 가게 등 만족한 환경입니다."
	},
	{
		"User": "han",
		"Review": "\r 교통,"
	},
	{
		"User": "joon",
		"Review": "\r 교통이 어느정도 편리하고, 대부분 조용한 주변과 조금은 안전환 환경입니다. "
	},
	{
		"User": "Roger",
		"Review": "\r Det bästa var läget. Lobby och frukost var hyfsat påkostat och helt ok."
	},
	{
		"User": "Mohammed",
		"Review": "\r المطعم والحديقة"
	},
	{
		"User": "Youngho",
		"Review": "\r 좋아요"
	},
	{
		"User": "andre",
		"Review": "\r Ligger bra til nærme shopping senter, mange bra restauranter i gå avstand"
	},
	{
		"User": "Tadas",
		"Review": "\r Vieta, personalas, baseinas"
	},
	{
		"User": "flemming",
		"Review": "\r Betjening i top"
	},
	{
		"User": "Youngho",
		"Review": "\r 없음 "
	},
	{
		"User": "gisun",
		"Review": "\r 호텔식도 우수하고 카지노가 있슴"
	},
	{
		"User": "Espen",
		"Review": "\r God service"
	},
	{
		"User": "james",
		"Review": "\r 교통이 편리해 좋았습니다.."
	}
]
