[
	{
		"User": "Gregory",
		"Review": "The central lobby is nice but the rooms are very basic. The beds and pillows are hard and the sheets are rough. There’s only one towel per guest. BYOB shampoo, no water or even cups provided. The cleanliness is okay. We had a ground floor room in the back so it was dark and quiet. We felt safe there but the window locks seem flimsy. You can walk to Abreza mall or take a trike for 10 peso. A cab will cost you about 50 peso. There is a good coffee shop out front (they sell food too, I recommend the ribs) and a convenient store on the next corner. Nothing fancy here, just a safe place to spend the night. Front staff was friendly and helpful. "
	},
	{
		"User": "Arvin",
		"Review": "The rooms are nice and clean. Location to Abreeza is relatively close but you may want to take a cab if your in a hurry. I wish the hotel had more facilities but I would highly recommend this to travelers on a budget."
	},
	{
		"User": "Mae",
		"Review": "At first you don't a any clue at all what to expect from this hotel except for its name Urban Zen. But one you got in especially in the lobby, you will feel the relaxing aura of the place. It has the vibe of modern zen with its architecture and the koi pond. I had no complain with the staff. They assist and answer any queries. Location is near to the malls and accessible to any place of interest in the city esp. in the uptown part. Bathroom amenities ok with hot and cold shower. I will definitely recommend this hotel."
	},
	{
		"User": "Anthony",
		"Review": "The parking lot is only available for a few slots. Should have made the inclination of the parking area \"car-friendly\". :) but the rest are great!"
	},
	{
		"User": "Karen",
		"Review": "The space was super clean, peaceful and serene. I loved the interior design and that the staff were really friendly and accommodating. It was close to the airport and the venue where we had our convention. Will recommend!"
	},
	{
		"User": "gregg",
		"Review": "Basic room, 2 hangers for 3 night stay? I even asked for those. Instant coffee only. No manager on duty to take care of the barking dogs. I lost a lot of sleep. Staff great "
	},
	{
		"User": "Arvin",
		"Review": "Good value for price. Don't expect too much. Accessible to Abreeza & Victoria Plaza."
	},
	{
		"User": "Melisa",
		"Review": "convenience is great theres a laundry and coffee shop next door. "
	},
	{
		"User": "JHOANNA",
		"Review": "please add a electric water heater in every room"
	},
	{
		"User": "Janice",
		"Review": "very affordable and the place is clean and cozy"
	},
	{
		"User": "Kent",
		"Review": "I and my partner stayed for a night only. We got the matrimonial bed since there was a good offer for the room. Matrimonial rooms are regularly priced at around Php 1500+ but we got to book it for only Php 1100. A very good deal. The staff were friendly during our stay. The bathroom was clean and hot and cold shower was available. The location is very strategic since it is located near shopping malls and city centers. We haven't experienced ordering their food since we ate at a local resto outside the hotel. If you are in the city for business purposes, you may need to bring your own wifi device since the wifi is only available at the lobby. Also, phone signals are somewhat low on our room. Having said that, I still recommend the place if you are on a budget and want a clean and peaceful place to stay. "
	},
	{
		"User": "NORBERTO",
		"Review": "It's a hotel with no food. Isn't that a requirement of any hotel? Even motel have food to offer. No restaurant, no cafes, no room service. Their staff though were very accommodating, courteus and efficient. I asked a favor for their room boy to find an eatery nearby and look food for my breakfast because I was so starving at 9am. And he willingly obliged, ashamed of their own establishment for such an absence of a basic requirement. There was none good for me. They connected me to Mcdonalds and and Jollibee but I am allergic to chicken and beef. And small eateries in the vicinity were closed gor the holidays. So before I'd die, i packed my luggages back and tranferred to a real hotel. I still had two days of reservation but I did not think I would last another day there. Nor did they offer to return it. Is it considered forfeited since the hotel was the one who did not fulfill the basic expectation? Agoda, please advise. It is a small amount but it is the principle of it. Thanks. "
	},
	{
		"User": "Jonas",
		"Review": "Not much to criticize, great place for what they charge for it. + Professional and accommodating staff Price Location (10-15 min walk to Abreeza mall) Clean - Location (No really good breakfast places nearby) Occasionally noisy Wifi I would recommend if you're looking for something cheap and simple. "
	},
	{
		"User": "Sheila",
		"Review": "no free shampoo.. no elevator which is not good for asthmatic guests"
	},
	{
		"User": "les",
		"Review": "Worst wifi in the history of mankind. They should invest in routers you know. This is the digital age. When wifi goes wrong so as your rating. And the rate is not cheap they dont serve breakfast"
	},
	{
		"User": "Edward",
		"Review": "+ They let us check in 2 hours earlier than the usual check in time. + They also promptly assisted us quickly with our request to unlock the bathroom door (S/O accidentally locked it). + PLDT Fibr WiFi is great but inaccessible from our room (205). + The room and bathroom were clean - main bed sheets were kind of \"really used\". - Public transportation is a bit inconvenient since it's not in the highway, need to ride a tricycle (taxi would be great as well) Hadn't try to use the hot and cold showers and TV though. Overall, we recommend it."
	},
	{
		"User": "Dane",
		"Review": "My girlfriend and I just had our 3rd stay @ Zen this past weekend and it was as comfortable as always.. Surely our top choice everytime I go home to Davao."
	},
	{
		"User": "John",
		"Review": "as a repeat customer I return cause it is located close to the central.part of town, sufficient on all accounts but scores high as it is a very good value for the money. basic place but that is what they do best"
	},
	{
		"User": "Miriam",
		"Review": "Wi-fi is not good all the time."
	},
	{
		"User": "Earl",
		"Review": "I strongly DO NOT recommend this hotel!!!! WIFI SUCKS! you have to go to the first floor so you can connect to their WIFI. its unbelievable and ridiculuous! "
	},
	{
		"User": "Argie",
		"Review": "Nice budget hotel. Very helpful and accommodating staff. 👌👌👍🏻👍🏻"
	},
	{
		"User": "Vilma",
		"Review": "Never again will stay in this place"
	},
	{
		"User": "ruth",
		"Review": "Room is very clean. All personnel are very warm and very accommodating. Highly recommended for those who are looking for a cheaper room."
	},
	{
		"User": "Rose",
		"Review": "POOR CUSTOMER SERVICE"
	},
	{
		"User": "Rose",
		"Review": "Customer representative are not being helpful"
	},
	{
		"User": "Dewey",
		"Review": "Very nice koi pond."
	},
	{
		"User": "Samantha",
		"Review": "The room and bathroom is clean. We're lucky we stayed at the ground floor because the wifi signal is quite strong in the room. Overall our stay is nice. The only thing i don't like is, there's no breakfast there. "
	},
	{
		"User": "Mary",
		"Review": "My room was okay for a solo traveller. I attended a seminar so I didn't stay much in the room. WiFi isn't accessible from inside the room so you need to go the lobby to get better access. Airconditioning was good, worked well. Bathroom is adequate but only provided towel and soap; there weren't much toiletries. I wasn't able to report that the drainage from the shower worked really really slow. And also when I opened the shower there were these little worms that came out. And there were ants that I didn't know where they came from and I didn't have any food with me in the room. There was no window in my room so I wasn't able to tell what was happening outside. Overall, I was okay with my stay despite the insects, I stayed just to sleep and bathe. The lobby was very spacious with a small pond to add to the \"zen\" vibe. I just hope they would do something about the insects. "
	},
	{
		"User": "Melissa",
		"Review": "Really nice budget hotel, everyone loved the koi pond and open space in the middle. Rooms just need more cleaning. It would be better if they use a vacuum to clean the rooms than a broomstick. All our requests were well taken cared of. Highly recommended! "
	},
	{
		"User": "Carm",
		"Review": "The place was accessible from the airport and it's near the mall too. The place was really clean and the food near the hotel was really cheap and yummy. "
	},
	{
		"User": "Rianette",
		"Review": "Clean bed and bath. Hot shower. Good AC and TV. WiFi was too slow, but when on-the-go, mobile data is good and fast enough. No free toiletries, but I always bring my own, no big deal. Only a handful of parking spots, empty during school/office hours. Super friendly staff. Abreeza nearby, too hot to walk though. Sikad, jeeps and taxis pass by. Overall, a simple and cozy stay."
	},
	{
		"User": "Patricia",
		"Review": "The Hotel has all the basic needs especially if you just intend to stay for the night."
	},
	{
		"User": "Johorupin",
		"Review": "Clean room. Wife slow inside room you have to go down to be able to used stronger wifi. Staff not so attentive. But walking distance near Abreeza Mall and Victoria Malls. One ride going GMall."
	},
	{
		"User": "Nicolle",
		"Review": "I love that the location is accessible to establishments, located near the Abreeza Mall & Victoria Plaza, you can just ride a jeepney to downtown, simple room that would give you your basic needs, we got the double single bed which we just move together..they have a koi pond in the center which is relaxing and welcoming to watch, the downside is we are already late in checking in,but the room is still not ready, we have to wait 10 minutes more. Also there is no complimentary water bottle inside the room, or even a refrigerator. Be ready to climb the stairs, as they also suggest it's more healthier. Which I agree, but if you have a old person with you or person with difficulty to walk, request room that is on the ground floor. Wifi is not accessible in rooms.some Staffs are a little snobby also they have no initiative in helping you with your luggage. "
	},
	{
		"User": "Jana",
		"Review": "Had an excellent stay. Place is new, AC working just fine. WiFi was fast but there were times that it would not work."
	},
	{
		"User": "Henning",
		"Review": "On my arrival they upgraded my room for free, they allowed me to cancel my last day without charging me when I booked online. I called the agoda, agoda called the hotel to confirm and my money was going to get refunded. If I ever come back to this area, there is no doubt this hotel is at the very top on my list. Thank you"
	},
	{
		"User": "David",
		"Review": "Cons: If you want no one to disturb you on your rest day (no calls, no chats, no social networking apps, no text messages) then book this hotel. Just be careful when you use the bathroom though. there's a glass window that serves as the exhaust...it might also serve as a peeping hole. toilet's not equipped with a bidet spray. Pillows smell strange No compli breakfast Pros: Koi Pond inside the hotel, bed was okay, AC was functioning well, H&C shower was good. "
	},
	{
		"User": "DEMVER",
		"Review": "Accessible to public transpo. "
	},
	{
		"User": "AL-GAMAR",
		"Review": "Hotel is good, clean, staffs are good. The building is new and clean, rooms are also good, not high end but you get what you pay for and it's actually good (For twin bed). They have very fast Wi-Fi connection, not available in all rooms, it depends where your room is located, our was room 302 and we need to stay near the door to connect but it is definitely available in the lobby which is also a nice place to lounge. Over-all this hotel is good, great atmosphere and very accomodating staff. Would booked again in this hotel."
	},
	{
		"User": "Gayzelle",
		"Review": "Convenient place to stay. Good Costumer Service. Will recommend to others. Will stay here again. "
	},
	{
		"User": "Christine",
		"Review": "The area is near Abreeza."
	},
	{
		"User": "Leri",
		"Review": "Nice small hotel, clean and friendly staff. The hotel is conveniently located next door to a cute, delicious food and good ambience restaurant and coin-up or drop off laundry service. I will definitely come back to this hotel again!"
	},
	{
		"User": "Jeane",
		"Review": "Clean and new hotel. Been here thrice. Always pick rooms away from the street. Internet connection's a bit crappy. Limited parking. "
	},
	{
		"User": "Jeane",
		"Review": "New hotel. Clean rooms. Limited parking if you got vehicle."
	},
	{
		"User": "Carminia",
		"Review": "Great value for money. Rooms are clean, area is quiet and very peaceful. Bare bones decor, so very little frills. Clean bathroom. Very near Abreeza, so malling isn't a problem. Liked it so I booked 2 nights here. "
	},
	{
		"User": "Maribeth",
		"Review": "it was a good stay. even better if you have a personal fridge in the room"
	},
	{
		"User": "Francis",
		"Review": "I booked 4 nights stay with Agoda and extended another 3 nights. The girls at the reception keep changing. Tina tried to charge me for water and towel which I did not take. I ask for a one hour late check out and she asked me to pay half day rent. Then I found out that they had different price for foreigner and local. Their price was higher than Agoda. Absolutely no wifi in rooms and house keeping did not clean rooms well. No refrigerator in rooms. "
	},
	{
		"User": "Patrizha",
		"Review": "Two thumbs up!"
	},
	{
		"User": "Clyde",
		"Review": "Hope they will have a smoking area "
	},
	{
		"User": "June",
		"Review": "As soon as I entered the room, I immediately noticed a bad smell coming from the bathroom. The bed sheets and pillow covers wasn't even changed, they were dirty and used. I didn't mind it being a thin linen but come on you could've changed it with a newly washed ones. As I sat in the bed I was thinking, no traveler deserved this. I then pulled up my phone and booked a room from another hotel. Left the key in the front desk without saying anything and hailed a cab to Red Planet hotel. I only tried this hotel because it was cheaper and it looks nice on the pictures. But trust me, go spend a little bit more and avoid this hotel."
	},
	{
		"User": "Timo",
		"Review": "I have been this hotel few times and it's really nice and clean. very near abreeza mall.."
	},
	{
		"User": "Ligaya",
		"Review": "No parking area"
	},
	{
		"User": "Christopher",
		"Review": "value for money... except that no shampoo and toothbrush. also no breakfast.. but there is a restau just few step outside... so still ok..."
	},
	{
		"User": "Abigail",
		"Review": "it's just near the Abreeza Mall but you need to ride a tricycle and walk for 5-7 minutes. staff are approachable. they put our luggages to our room since there's no elevator. they even help us order food in a fast food since ther'a no nearby restaurant or cafeteria around the area. they said they have a cafeteria but its closed during sunday. I highly recommend this hotel."
	},
	{
		"User": "Connie",
		"Review": "Dirty facilities "
	},
	{
		"User": "David",
		"Review": "Staff was not knowledgeable and too young to be either courteous or efficient. "
	},
	{
		"User": "jenvirli",
		"Review": "Good location.."
	},
	{
		"User": "Pia",
		"Review": "Pros - hotel is new, hence things are new. Near abreeza mall and croc. park. Cons - no elev. Get ready to carry out your luggage in the stairs. Staffs are quite NR and doesnt offer to help. Overall youll get what you paid for."
	},
	{
		"User": "Giovanni",
		"Review": "2 Things. Parking space is a problem. WIFI is very slow. Other than these, hotel is fine."
	},
	{
		"User": "John",
		"Review": "Will stay there again "
	},
	{
		"User": "Joel",
		"Review": "Near to abreeza mall. Near to convenience stores. No elevator. Value for money. Place to sleep. The towel is hard..."
	},
	{
		"User": "Baybay",
		"Review": "New and near ayala Davao "
	},
	{
		"User": "Jonalyn",
		"Review": "The locatiom was good. The room was clean. The only downside was the internet connection. "
	},
	{
		"User": "Alyanna",
		"Review": "Booked for only one night, just to give it a try. Seeing from the outside you wouldn't expect just how cool it is in the inside. Or is it just me who gets surprised with it's design? LOL. But anyway the room was spacious, clean and minimal decors which is good for the eyes. It's a good price for a very comfortable room."
	},
	{
		"User": "Sittie",
		"Review": "Value for money. It's a new hotel so facilities are in good condition. I like it's minimalist style."
	},
	{
		"User": "TESSANIL",
		"Review": "1. Price is cheap yet room is above average 2. Comfort room as well is above average 3. Very near Abreeza Mall 4. Cozy lobby 5. Snub receptionist"
	},
	{
		"User": "Jaereign",
		"Review": "place is super nice since it's barely new. had fun playing with their koi fish. Only problem was the sink in the toilet i think was clogged. No blower"
	},
	{
		"User": "Romano",
		"Review": "Very new hotel near seda abreeza. Clean rooms "
	}
]
